{
  "city": "sacramento",
  "fetch_timestamp": "2025-07-12T14:32:05.422350",
  "record_count": 214,
  "pages_fetched": 10,
  "api_calls": 11,
  "source": "ufo_aficionado_api",
  "records": [
    {
      "_id": "64d005f478aba2ec5a3b4189",
      "summary": "In September 1976, I had another UFO encounter.  This time I was out of the Army and living with my former girlfriend H. L. in an apart",
      "city": "sacramento",
      "shape": "oval",
      "date": "2006-05-15T00:00:00",
      "story": "In September 1976, I had another UFO encounter.  This time I was out of the Army and living with my former girlfriend H. L. in an apartment.   One night, she came running back inside the apartment screaming.  I asked her what was wrong.  She said that a UFO was hovering 200 feet above her head.  I didn’t see anything.  I noticed she was hysterically crying.   I drove her to the Sacramento Sheriff’s Department and they had her use their phone to call an 800 number to call Dr. Allen Hynek of the Chicago, Illinois Bureau of UFO Investigations.  Dr. Hynek sent us some forms to fill out, so she could describe what she saw.  Dr. Hynek later called me and asked what I was doing.  I told him I was watching \"Dick Van Dyke’s The Comic\" on TV.  He asked what happened when Helen was screaming outside, I said the TV went on the blink, it displayed static and I was trying to fix the TV, when I heard her screaming.  He told me that when UFOs hover nearby, that they cause disturbances on car engines, TVs and radios.  This was a normal occurrence.  Later I learned that 2 other people in Sacramento saw the same UFO in two different locations and it was reported in the Sacramento Bee. From 1979 to 1986 I was back in the U.S. Army.  This time I joined Military Intelligence and I was stationed at PIC-K (Photo Interpretation Center, Korea).  This time my code name was \"Hollywood or Joe Hollywood,\"  I wore a black suit now and I was clean-cut.  I kept the sunglasses though.    My job as a 97 Bravo (Intelligence Analyst) was to work with Image Interpreters in identifying targets in North Korea and Red China, such as T-72 tanks, etc.  I would create what is called a \"sitmap\" pinpointing targets discovered by Image Interpreters, that studied reconnaissance aerial photographs.  I would categorize certain photos.  We would go on what is called a ‘hot run’ from Seoul, Korea, (Yongsan Barracks) to Osan Air Force Base.  The vehicle would display a placard that indicated that the vehicle could not be stopped for any reason.  There was a combination lock on the trunk of the vehicle and a combination lock in the suitcase inside the trunk,  the driver and myself would have ½ of the combination to open the trunk and the suitcase.  We would place the hotrolls (film) into the suitcase and head back to Seoul.   During my time as an Intelligence Analyst I categorized 6 photos taken by reconnaissance satellites of what appeared to be UFOs.  The UFOs moved on their own accord, as if they were guided by some kind of intelligence.  Therefore the 6 photos were significant by Military Intelligence.   The photos moved up the intelligence chain from Military Intelligence to DIA (Defense Intelligence Agency) to CIA (Central Intelligence Agency).  From there, I don’t know where the photos went.  While at PIC-K, I worked with Air Force Intelligence, Navy Intelligence, DIA, CIA, Marine Recon, US Army (Green Beret) Special Forces, 101st Airborne, US Army Rangers, 82nd Airborne, Delta Force, Navy Seals.  It was necessary for us to work closely with certain elite military groups.    Another strange photo I once saw was given to me to categorize.  It was a photo of an American POW in Vietnam, taken in 1981.  The photo went into a metallic box with a combination lock and disappeared up the intelligence channel.  The spooks (intelligence personnel) I worked with, would never discuss UFOs.  Most spooks belonged to some sort of secret society, most were Freemasons and I was a Rosicrucian.   When I departed Korea, I signed up for the 82nd  \"Screaming Eagles\" Airborne and Special Forces training and they were ready to send me to Ft. Gordon, Georgia and Ft. Bragg, North Carolina and I was called to do a special assignment.  I received an H identifier and became an Army instructor and taught the Soviet Threat for OPFOR (Opposing Forces).  I wore a Russian uniform, ski mask, black gloves and talked with a fake Russian accent and called myself \"Corporal Dowbowski.\"  I would instruct the Soviet Threat, teaching the W.E.F.T. (Wings, Engine, Fuselage and Tail) on Soviet Aircraft, kill zones on Soviet aircraft and land roaming vehicles, the use of many Soviet weapons from the AK-47 to the SVD Sniper Rifle in which I was proficient.   During my time with OPFOR, I learned from Intelligence circles, that the Russian KGB also knew and were aware of what exactly UFOs were and where they came from. To this day, I don’t know the answers to the UFO mystery, but hopefully one day our Government will disclose what they know to the public.",
      "link": "http://www.nuforc.org/webreports/050/S50322.html",
      "state": "CA",
      "duration": "6 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b438c",
      "summary": "Strange Sounding Aircraft Over Sacramento CA",
      "city": "sacramento",
      "shape": "unknown",
      "date": "2006-05-15T00:00:00",
      "story": "Strange Sounding Aircraft Over Sacramento CA At approximately 1:00 AM a very strange sounding aircraft Past over my house, it sounded to me like a mix of amplified Chanting, to my girlfriend it sounded like a large machine Comprised of different sounds like rattling armor.",
      "link": "http://www.nuforc.org/webreports/049/S49713.html",
      "state": "CA",
      "duration": "60 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b43fc",
      "summary": "cloaked stingray shaped object lowflying only saw moisture build up around front end of object",
      "city": "sacramento",
      "shape": "formation",
      "date": "2006-05-15T00:00:00",
      "story": "cloaked stingray shaped object lowflying only saw moisture build up around front end of object my wife saw it first as we layed down to sleep, out the window about 800ft up, moving about the speed of the police choppers when they circle. the object itself was completely invisible but there was a lot of moisture in the air and we could see a build up of moisture around the front end and what appeared to be some sort of tail piece. the only way i can describe the form that the moisture was contouring to is like that of a sting ray. very flat and smooth edges, almost flowingthrough the air, the sides were like the sides of a sting ray in movement flowing from where they met a somewhat of a center area in a wavelike motion out to the tips of them. the area trailing the front arch of moisture seemed to flow in the same pattern but horizontally as opposed to vertical flowing of the front wing like area. I DID NOT SEE THE OBJECT JUST THE MOISTURE BUILDING UP IN THE AREAS IT WOULD OF ANY KNOWN FLYING OBJECT. i would not have believed my wife had i not seen it my self, it was very brief but unquestionably clear. no lights or sounds or abductions or cell phone static, it seemd to be a perfectly cloaked device using motion for propeltion as opposed to a fuel source. im still having trouble believing it but this was no known object to me and it was undoubtably clear.",
      "link": "http://www.nuforc.org/webreports/049/S49915.html",
      "state": "CA",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b448d",
      "summary": "Bright light at low altitude vanishes leaving a round cloud",
      "city": "sacramento",
      "shape": "light",
      "date": "2006-05-15T00:00:00",
      "story": "Bright light at low altitude vanishes leaving a round cloud I am 50 years old and left Reno, NV 5:30am to Sacramento, CA to take a test. Some where in the Sierra's on interstate 80 there was a bright light, about 2000ft AGL. Looked to large, bright and still to be an Aircraft(Aircraft lights this close usaully show some transmited vibration). The light projected a flat and fanned-out beam into a cloud. Unlike a head light beam. I thought the cloud was causing this affect. After studying it for about a minute trying to justify it in my mind it then moved to the right and stopped. It dimmed and brightened then disappeared. As it disappeared there was a faint round fog or cloud like that which is generated by a high altitude jet engine but very faint. It formed a ball around where the light  pushing out then rushed slightly into where the light was. The light going out and the cloud forming took about a second. I continued to watch the round cloud and noticed the other could was gone. As I watched the round cloud still trying to rationalize what I saw the round cloud disipated in about 5-7 seconds. It was a clear sky and only some of the brightest stars were still visible. Being a novice pilot and watching stars as a pass-time I can only say this is something I can't explain.",
      "link": "http://www.nuforc.org/webreports/050/S50028.html",
      "state": "CA",
      "duration": "minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b4696",
      "summary": "did anyone else see this? looked like a comet? dispersed after a 30 Sec.",
      "city": "sacramento",
      "shape": "",
      "date": "2006-05-15T00:00:00",
      "story": "did anyone else see this? looked like a comet? dispersed after a 30 Sec. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/050/S50494.html",
      "state": "CA",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3b4c2c",
      "summary": "Driving westbound on hiway 50 and friend and I both noticed a light in the sky over sacramento/sunrise area in the sky above us.  As so",
      "city": "sacramento",
      "shape": "light",
      "date": "2019-07-05T00:00:00",
      "story": "Driving westbound on hiway 50 and friend and I both noticed a light in the sky over sacramento/sunrise area in the sky above us.  As soon as we both looked at it the light darted/shot away.  We both said \"what was that?.\"  Seemed to disappear as soon as we both noticed it.  Made the hair on the back of my neck stand up. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/147/S147255.html",
      "state": "CA",
      "duration": "1-2 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b4d3a",
      "summary": "I saw some white flashing lights, but I noticed one of them looked like a circular shaped building. ((anonymous report))",
      "city": "sacramento",
      "shape": "flash",
      "date": "2019-06-20T00:00:00",
      "story": "I saw some white flashing lights, but I noticed one of them looked like a circular shaped building.  It had white, green, and red lights.  It kept moving around, but stayed in the area. We heard a sound at first, but the sound disappeared until we heard a sound that it bumped into something.  That's when both of my cats seemed startled. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/146/S146887.html",
      "state": "CA",
      "duration": "It has been flying around"
    },
    {
      "_id": "64d005f478aba2ec5a3b4e6d",
      "summary": "Glowing white cloud-like object sighted at night, dissipates into red haze and vanishes entirely.",
      "city": "sacramento",
      "shape": "changing",
      "date": "2019-04-08T00:00:00",
      "story": "Glowing white cloud-like object sighted at night, dissipates into red haze and vanishes entirely. We were flying down for landing when we noticed a strange object in the sky from the plane's window.  At first it was primarily circular, with a white glow in the center and a slight red tint/outline (similar to that of a flare, but it was far larger, stayed in the air for far longer, and did not flicker or flash.)  It seemed to last a while, and as time passed the object began to seemingly stretch and lose the white glow, obtaining a more oblong shape before dissipating and leaving a lingering red haze/glow.  It is also important to mention that it was off in the distance so the size of it could have been relatively large.  The number of witnesses is unknown but there could have been many, due to the fact that the event occurred in a city.",
      "link": "http://www.nuforc.org/webreports/145/S145517.html",
      "state": "CA",
      "duration": "~10-15 (or 20 seconds?)"
    },
    {
      "_id": "64d005f478aba2ec5a3b4fa9",
      "summary": "((HOAX??))  Spaceship that changes itself to camouflage to fit color of clouds and dark shadow spot.  ((anonymous report))",
      "city": "sacramento",
      "shape": "other",
      "date": "2019-03-29T00:00:00",
      "story": "Spaceship that changes itself to camouflage to fit color of clouds and dark shadow spot. I was playing cards with two my friend outside one of them house.  Outside the front porch where I happen to sit a little outside the porch, and they were sitting inside the porch.  So only I can see above the roof and sky but they can’t.  As we playing card I decided to look up the sky.  Suddenly a space ship flew fast and quietly down the sky and came to sit on top of the tree next to the roof.  First I thought it was strange and amazing at the same time. Amazing part was I the only one saw it and I didn’t want to scare my friend them and kept to myself.  So as I saw it coming down clearly it was amazing how fast it was and how it can change it space ship to camouflage that fit the shadow of the tree.  So if a person don’t pay attention you will never know it’s sitting up there.  I was thinking to myself that it might be watching me.  So I make it seem like i didn’t see it but my eye was on it the whole time.   Looking at the same spot it landed in the dark.  I cannot! see it after it landed but I waited and keeping my eyes rolling up on it.  When it’s ready to flew off it lights went around it space ship and it lift itself two three feet above the tree before it flew into the sky and disappeared within 5 sec.  This is true not a joke I wanted to share because I believed that I had really seen this ufo spaceship once in my life. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/145/S145340.html",
      "state": "CA",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b525e",
      "summary": "This does not need to be reported, nobody cares about my story anyways",
      "city": "sacramento",
      "shape": "unknown",
      "date": "2008-06-12T00:00:00",
      "story": "This does not need to be reported, nobody cares about my story anyways Please see description on this profile:  http://www.myspace.com/goldinfohq  also see my other profiles: http://www.myspace.com/camwealth http://worldunificationnetwork.ning.com/profile/Daniel  There was a second occurrence during daylight with a witness in 1996, I may re-publish that event on one of my profiles also. ((NUFORC Note:  Witness indicates that date of incident is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/063/S63266.html",
      "state": "CA",
      "duration": "30-45 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b5259",
      "summary": "Spectacular triangle's seem in the sky",
      "city": "sacramento",
      "shape": "triangle",
      "date": "2008-06-12T00:00:00",
      "story": "Spectacular triangle's seem in the sky It was 1993 when this event happened. I was living in down town Sacramento, California. I don’t remember what time of year it was, but I lived on the corner of 13th street and F street. I always took my dog out for a potty walk, roughly between 10 and 11p.m. Across from our place was a vacant lot, that I always walked him in. I took him out that night as I always did and walked across the street to the vacant lot. It was a cool evening and the fog was hovering above the roof tops, when I noticed above me, in the fog, lights. I looked up and was amazed at what I saw. There were three sets of triangular lights, each triangle was made up of three long strips of light, formed into each triangle. What ever it was, where ever they came from, was huge, I don’t even believe I could accurately describe the size. They were enter moving about each other, they were red and blue. I could only compare what I was looking at, to some type of computer graphic design you might see on the web. I was so amazed that I ran back into the house and asked my then 15 year old son to come out and look too. He did, and we both stood there in the middle of the street amazed, at what we were watching above our heads, the lights moving in and out of each other, and changing about, while what ever was making them, hid in the fog. I didn’t own a video camera at the time, or I would have tried to film the spectacular sight that was occurring. We stood there, my son and I, for a very long time. Two of our neighbors emerged from their apartment, and at first look, they laughed at us, like what the heck are they doing standing in the middle of the street. And then they too, glanced up to the sky above us, and muttered something to the matter of profanity when they too saw the lights. It was at that moment that the lights disappeared. I have never in my life before or since seem anything like it. ((NUFORC Note:  Witness indicates that date of incident is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/063/S63439.html",
      "state": "CA",
      "duration": "20minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b5355",
      "summary": "a sigar-shaped ,all shimmering object moving slowly over the street at noon",
      "city": "sacramento",
      "shape": "cigar",
      "date": "2008-06-12T00:00:00",
      "story": "a sigar-shaped ,all shimmering object moving slowly over the street at noon It was noon, I was driving in my car to work, I look up and saw a sigar-shaped object crossing over the street almost over me. I pulled over onto a parking lot to get a better view,took my cell phone to make a picture ,but the object disappeared right before my eyes.It looked like a sigar,all shimmering and had air waves around it,had no any lights. It looked like if you take an aluminium foil and rub it between your palms to make a sigar. The object is about 30 feet long. ((NUFORC Note:  Witness indicates that date of incident is approximate.  PD)) ((NUFORC Note:  Witness elects to remain totally anonymous;  provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/063/S63739.html",
      "state": "CA",
      "duration": "15sec"
    },
    {
      "_id": "64d005f478aba2ec5a3b53f3",
      "summary": "Metalic Cigar Object Disappears In Sky",
      "city": "sacramento",
      "shape": "cigar",
      "date": "2006-10-30T00:00:00",
      "story": "Metalic Cigar Object Disappears In Sky Object Description: Long, cilindar/cigar shape, metalic, no wings, no tail fin.  Eventn Description: While driving S/B Rio Linda Blvd. in North Sacramento, I noticed a long Cigar shaped metalic object in the S/E sky. At first I thought it was a long airliner, but noticed it had no wings, nor upright tail fin. Trying my best to keep my eye on it, I pulled over and searched (with my hands) for my cell phone/camera.. Just after pulling over the object vanished. I got out of the vehicle and seached the sky and never located the object again. The total duration of the sighting was 1-2 min.",
      "link": "http://www.nuforc.org/webreports/051/S51388.html",
      "state": "CA",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3b55d0",
      "summary": "Roaring noises in the skies.",
      "city": "sacramento",
      "shape": "unknown",
      "date": "2008-06-12T00:00:00",
      "story": "Roaring noises in the skies. Heard LOUD celestial roaring as if a low flying large rocket was going over the house. I waited for it to pass and when it didnt I ran outside to see it. However, due to trees I could not spot anything-but the roaring noise continued for another 5 minutes and then began to move across the sky quickly. Around 2AM I woke up and heard the roaring again off and on. It moves across the sky and is VERY low and loud. Also, shortly after I heard a string of police and emergency vehicles dispatched. During the roaring noise the dog would not leave the house.Had to post this b/c I know I cant be the only one who heard this.",
      "link": "http://www.nuforc.org/webreports/063/S63351.html",
      "state": "CA",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b57a0",
      "summary": "A silent anomalous array of 3 white lights some 15-20 feet across flew south along US 5 at no more than 50 feet elevation",
      "city": "sacramento",
      "shape": "unknown",
      "date": "2007-10-08T00:00:00",
      "story": "A silent anomalous array of 3 white lights some 15-20 feet across flew south along US 5 at no more than 50 feet elevation The second sighting was full of apparent ambiguity. An hour after the first sighting I was on Highway 5 driving north at 70 miles per hour through the San Joaquin Valley. This enormous expanse of agribusiness territory has few settlements along the freeway. It is a desolate area with dry unpopulated low lying hills la short distance to the west To the east as far as the eye can see stretches desert transformed by irrigation into large industrialized farms.  Moving perpendicular to the highway I saw a faint red light crossing from right to left over the Interstate. It was perhaps half a mile away and from its speed and elevation, about fifty feet above the road, I immediately assumed that the red light was the tail light of a car on a freeway overpass. This impression was reinforced when after crossing the freeway the red light became a faint white one, as if I were now viewing a vehicle that had turned left from the overpass and was heading down towards me on an onramp in order to merge with the southbound traffic.  I immediately noticed that there was something wrong with this \"car.\"  Instead of the usual headlight configuration of two, there were three discrete white lights. They initially appeared quite faint in the distance. They were moving down towards me on what I assumed was an onramp. Traveling at about 100 feet per second I was rapidly closing with the lights that were arrayed equidistant from one another in a straight line parallel to the ground. The distance between them was fixed. I quickly realized that they were attached to something much larger than an ordinary car or truck. The light array covered a distance of at least 15 to 20 feet. My mind raced for possible explanations. Perhaps the three white lights were attached to some kind of large construction or agricultural vehicle that was lumbering down the onramp to get on the freeway. Or maybe it was on a side road adjacent to the Interstate. Why such an oversized vehicle would be cruising about at nearly 3 AM when driver fatigue and poor visibility would make such driving particularly dangerous was beyond me.  As I moved steadily closer, the light array suddenly became much brighter. They did not look like headlights at all, but rather like  landing lights of a small plane. As if to confirm this notion, the three lights titled sideways, lifted off the road and then headed up into the sky at a sharp angle. This was crazy! What would a small aircraft be doing flying so close to the ground along a busy Interstate in the middle of the night? It didn’t make any sense at all.  As the object that I assumed was attached to the array headed into the sky, I suddenly could no longer see the three white lights. Instead where they had been last seen was now just a solitary motionless red light. It seemed to be hovering some 50 feet off the ground and was just sort of stuck there in the sky a few dozen yards to the west of the highway. I was able to see this strange unblinking red light for only a few seconds as I speed by headed north.  The thought occurred to me that perhaps I had just seen a crop duster. On rare occasion during the day crop dusters can be seen flying along US 5. They are quite noisy and I believe they move a speed of no less than 80 miles per hour. The object that I had just seen was totally silent. In addition I estimate its speed to have been no more than 30 miles per hour. Its slow approach was one of the reasons why I had assumed it was on some kind of highway onramp. The unknown objects sharp upward turn with its nose pointing practically straight up  is not consistent with the flight characteristics of a small plane.  The entire sighting lasted no more twenty or thirty seconds. As I drove off I carefully noted that there was no overpass above the highway. There was no ramp on which the triad of lights might have possibly descended. Whatever I had seen crossing over the freeway at the beginning of the sighting must have been airborne.",
      "link": "http://www.nuforc.org/webreports/058/S58370.html",
      "state": "CA",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b579f",
      "summary": "On July 28th 2007 my first sighting occurred at approximately 2:30 AM while standing in the parking lot of a highway rest area. I was g",
      "city": "sacramento",
      "shape": "light",
      "date": "2007-10-08T00:00:00",
      "story": "On July 28th 2007 my first sighting occurred at approximately 2:30 AM while standing in the parking lot of a highway rest area.  I was getting really tired and wondered how long I could keep driving before I would have to find a motel and get some sleep.  I was standing by my car looking back towards the freeway when I saw a brilliant intensely blue light falling from the sky.  It moved downward silently at a steady pace.  It was not pinpoint but rather large, perhaps even large enough to be described as a blue orb. I first caught sight of it at about 45 degrees above the horizon. It was so bright that I had no difficulty following it down as it moved behind some trees. It appeared to reach the ground just a few hundred feet away on the west side of the highway. The blue color was significant because it reminded me of the light I had seen over the Sepulveda Pass in September of 92, just a few weeks after Dr. Greer had trained the LA CE-5 Initiative team that I was to coordinate for the next 5 years.",
      "link": "http://www.nuforc.org/webreports/058/S58369.html",
      "state": "CA",
      "duration": "10 SECONDS"
    },
    {
      "_id": "64d005f478aba2ec5a3b587f",
      "summary": "Very white object capture by a digital camera",
      "city": "sacramento",
      "shape": "unknown",
      "date": "2007-11-28T00:00:00",
      "story": "Very white object capture by a digital camera I was in my back yard at 10:20 so so and was a beautiful moon that night, so I took a picture of it with out any zoom, in the picture are the moon and a street lamp. I did not see anything untill I put it in my computer.You can see a very white object you have to zoom it.I would like to know what do you think. Thank You",
      "link": "http://www.nuforc.org/webreports/059/S59923.html",
      "state": "CA",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3b5a4f",
      "summary": "Cigar shaped object, white and silver/metalic in appearance, hovering over Sacramento at noon today",
      "city": "sacramento",
      "shape": "cigar",
      "date": "2007-10-08T00:00:00",
      "story": "Cigar shaped object, white and silver/metalic in appearance, hovering over Sacramento at noon today I saw a strangely moving cigar/rectangular shaped object over Sacramento today at 12:15 PM today as I was traveling in my car south on Fair Oaks Boulevard near Madison Avenue. I was headed in the direction of Mather Air Field, so I assumed it was a large military plane. As I continued to look at it I noticed that it was not moving fast enough to be an airplane. It was so low in the sky that it should have been moving very fast. I could not make out any wings or tail, just a defined object, white in color, not glowing in any way, with a silver/metallic edge around the bottom and sides. It was shaped like a flattened (or squared) cigar, not completely tubular, and I could see the details of the shape in good detail. It was definitely a technological object—not cloudlike or organic in any way. It appeared to be hovering, possibly moving very slowly to the east. I was looking at the object through my front windshield for probably 30 seconds, as I was driving in slow traffic. I had to brake for traffic in front of me, and lost site of the object for a few moments, then found I saw it again through my driver side window.  I continued to look at the object hovering for another 20 seconds or so until traffic forced me to go forward, at which point I lost site of the object completely. It was as if it just disappeared—but I had to concentrate on the road so I can not say I saw it vanish—I just could not find it again. I thought it could have been a reflection in my window, but since I saw the same defined object from two different windows while craning my head around in the car, and since it was noon on a sunny day, it could not have been a reflection.  I can’t say how high it the sky it was, but I can say that I had the impression that it was the size of a school bus based on the detail that I could make out. No wings, no tail, no markings other than white on the top, silver/metallic on the bottom, with some contours and angular reflections on the bottom and sides.",
      "link": "http://www.nuforc.org/webreports/058/S58258.html",
      "state": "CA",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3b5b10",
      "summary": "I saw one craft, that I thought was thespace shuttle...then it floated fast... then dissapeared..",
      "city": "sacramento",
      "shape": "formation",
      "date": "2007-10-08T00:00:00",
      "story": "I saw one craft, that I thought was the space shuttle...then it floated fast... then dissapeared.. then 4 more formed circle... then dissapeared.... I have seen all types of crazy things but nothing like this.... it really freaked me... ((NUFORC Note:  Witness elects to remain totally anonymous;  provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/058/S58280.html",
      "state": "CA",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b5c0d",
      "summary": "Commercial Flight from Chicago to Sacramento, Ca",
      "city": "sacramento",
      "shape": "",
      "date": "2006-10-30T00:00:00",
      "story": "Commercial Flight from Chicago to Sacramento, Ca While flying on United Flt 601 from Chiago Il.,  to Sacramento, Ca. on August 11, 2006. This is the day after the discovery and break up of the alleged \"terrorist plot\" to blow up airliners bound form the UK to the U.S.A. Airport security was in the highest state of alert.  Times and altitude are to the best of my recollection. I didn't make note of the possible significance of this incident until later in the day.  We were flying in an Airbue A319 at 36,000 ft. about 2 hours before Sacramento. United has Air Traffic Control (ATC) piped over audio channel 9 so you can listen with head phones. ATC called out to another passenge plane who was flying at 33,000 feet that there was \"traffic\" at his 10:00 o'clock position and about 1000 feet above him at 2 miles. The pilot responded that he was looking.  ATC called again and said the \"traffic\" was about 1 mile and now almost at his altitude. That he should descend 200 or 300 feet., and to report the traffic when in sight. The pilot said he looking and then exclaimed that he saw and that he just passes to the left of him very close and that he really saw \"him\" and stumbled and hisitated like he wanted to say more but held his tounge.  Shortly after that, ATC calls out to \"ALL aircraft flying fetween 30,000 and 40,000 feet to report in and ID themselves, I assume that ment to set a specific IFF code on their transponders. About 10 aircraft called in  and then ther was silence for a short while before the normal ATC chatter started back up..  Local Sacramento time was about 09:00.  After thinking about this I think that was the case of an unknown flying object with no flight plan or nor IFF.  ar",
      "link": "http://www.nuforc.org/webreports/051/S51643.html",
      "state": "CA",
      "duration": "5 minutes?"
    },
    {
      "_id": "64d005f478aba2ec5a3b5c6d",
      "summary": "While flying on United Flt 601 from Chiago Il.,  to Sacramento, Ca. on August 11, 2006. This is the day after the discovery and break u",
      "city": "sacramento",
      "shape": "",
      "date": "2006-10-30T00:00:00",
      "story": "While flying on United Flt 601 from Chiago Il.,  to Sacramento, Ca. on August 11, 2006. This is the day after the discovery and break up of the alleged \"terrorist plot\" to blow up airliners bound from the UK to the U.S.A. Airport security was in the highest state of alert.  Times and altitude are to the best of my recollection. I didn't make note of the possible significance of this incident until later in that day.  We were flying in an Airbue A319 at 36,000 ft. about 2 hours before (east of) Sacramento, Calfornia.  United has Air Traffic Control (ATC) piped over audio channel 9 so you can listen with head phones. ATC called out to another passenge plane who was flying at 33,000 feet that there was \"traffic\" at his 10:00 o'clock position and about 1000 feet above him at 5(?) miles. The pilot responded that he was looking.  ATC called again and said the \"traffic\" was about 2 miles and now almost at his altitude. That he should descend 200 or 300 feet, and to report the traffic when in sight. The pilot said he was looking and then exclaimed that he saw him and that he just passes to the left of him very close and that he really saw \"him\" and stumbled and hisitated like he wanted to say more but held his tongue.  Shortly after that, ATC calls out to \"ALL aircraft flying between 30,000 and 40,000 feet to report in, state their altitude and ID themselves, I assume that ment to set a specific IFF code on their transponders. About 10 aircraft called in  and then there was silence for a short while before the normal ATC chatter started back up..  Local Sacramento time was about 09:00.  After thinking about this I thought this may have been the case of an unknown flying object, with no flight plan or nor IFF. Initial thought that a hijacked plane at 33,000 feet rather that a UFO.  I reported this previously but got no response from your agency.",
      "link": "http://www.nuforc.org/webreports/052/S52200.html",
      "state": "CA",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b5cd1",
      "summary": "We were flying North on Alaska Airlines to Seattle. A couple passenger jets had passed us a few miles away going South.  I was looking",
      "city": "sacramento",
      "shape": "cigar",
      "date": "2006-10-30T00:00:00",
      "story": "We were flying North on Alaska Airlines to Seattle. A couple passenger jets had passed us a few miles away going South.  I was looking at the cumulous clouds near the Sierra Nevada to the East of my window.  I saw what I thought was another jet airliner going South, and I squinted to see wings but I could see none.  I also thought it was strange that it headed for a cumulous cloud and went right into it instead of flying around it as all the other planes did.  I looked for a minute or so to see if it would emerge from the other side of the cloud, but it never emerged.  I have no explanation for what I saw.",
      "link": "http://www.nuforc.org/webreports/051/S51697.html",
      "state": "CA",
      "duration": "20 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b5f5c",
      "summary": "6 hyphen-shaped yellowish-white objects flying as group but shifting positions from NE to SW (Reno-SF) at approx. 35K alt. and 450mph.",
      "city": "sacramento",
      "shape": "other",
      "date": "2008-02-14T00:00:00",
      "story": "6 hyphen-shaped yellowish-white objects flying as group but shifting positions from NE to SW (Reno-SF) at approx. 35K alt. and 450mph. From the top of a building in downtown Sacramento I noticed 6 objects in the NE sky towards Reno. All 6 were identical, shaped like simple dashes or hyphens, and were oriented horizontally, (i.e. like the wings of an airplane, not the fuselage). They were the same bright, yellowish-white color as an ordinary light bulb filament. As they silently flew on a straight, SW path across the sky, they stayed in a tight group, while smoothly and continuously shifting positions in relation to each other. Their speed and altitude appeared to be very similar to that of an average commercial jet at cruising altitude. It took approximately 1-2 minutes from when I first saw them coming from the direction of Reno until they faded from sight in the direction of San Francisco. ((NUFORC Note:  Witness indicates that the date of the incident is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/061/S61477.html",
      "state": "CA",
      "duration": "1-2 min."
    },
    {
      "_id": "64d005f478aba2ec5a3b60ad",
      "summary": "A glowing, moving line, going from W to E, which when observed thru binoculars resolved into disks.",
      "city": "sacramento",
      "shape": "formation",
      "date": "2008-01-21T00:00:00",
      "story": "A glowing, moving line, going from W to E, which when observed thru binoculars resolved into disks. On or about Nov. 13, 1985, I was laying down on the front lawn, watching for the annual Leonids. The night was moderately clear, with enough light pollution to limit stars to the top two thirds of the sky.  Around 7 or 8 pm, about three quarters up the sky in the west (coming to view above the tree) my attention was drawn by what appeared to be a white, glowing line, shaped as follows...  _____     _____________ \\   / \\ / ` ...in reality, the line was a solid. My drawing is also pointing the wrong way - please rotate the figure one quarter turn counterclockwise.  The \"v\" portion pointed westwards.  It was moving soundlessly and in a smooth manner similar to that of a satellite, although slightly faster. It was about a half to a full degree in size from one end to the other, or a bit larger than the full moon when viewed normally.  I had reasonably powerful binoculars on hand (strong enough to view the major moons of Jupiter easily) and through these the line resolved into individual circles or disks, flying very closely together and never altering formation in the slightest.  There were about 15 of them all told - about 4 on the \"short\" end, three on each side of the \"v\" and about another 7 or 8 on the \"long\" end.  They were not attached to each other, but were closely spaced enough to appear a glowing line from the ground. They were white in the center, fading to a fuzzy, blue white on the edges. Focusing them sharply proved impossible.  The line continued eastward and passed from view.  It took about a minute to a minute and a half to cross my sky.  I do not pretend to know what it was, but I am now, in these first few days of 2008, 36 years old, and have been avidly looking up for at least 30 of those years.  I was young when I saw this, only 14 or so, but was a very experienced skywatcher even then. Night after night after night of gazing has shown me thousands of satellites, endless airplanes and helicopters, beautiful meteors and startled birds lit by the lights below them. I have never seen anything like this again, before or since. ((NUFORC Note:  Witness indicates that the date of the incident is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/060/S60800.html",
      "state": "CA",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b6208",
      "summary": "Skunk smell for over 10 miles while very large craft  flew across the sky.",
      "city": "sacramento",
      "shape": "cigar",
      "date": "2008-03-04T00:00:00",
      "story": "Skunk smell for over 10 miles while very large craft  flew across the sky. My son and I were driving home last week from Roseville into Sacramento. As we entered in the Sacramento area we witnessed a long cigar shaped craft with row of light on the bottom. This craft was very large and moving as fast as a low plane would appear to be flying. It was really dark and cloudy in the sky so we really could not see above the row of 10 or so lights but could see almost the out line of as it blended into the sky. Now something really struck me later and I do not know if this could be related or if this has happened before to anyone that has witnessed a something like this but the smell of skunk was very strong for 10 to 15 miles of our trip. (I am thinking that animals were freaking out from this this craft?)  I am reporting this because maybe someone got a better look at this craft then we did. I just wish I was not on the freeway and having to look at the road, so I am not sure what it was but have never seen so many lights and what appeared to be at leat 10 times the size of a lower flying jetliner. ((NUFORC Note:  Witness indicates that the date of the incident is approximate.  We do not understand why the date is approximate, given that the report was submitted only three days following the alleged event.  PD))",
      "link": "http://www.nuforc.org/webreports/060/S60418.html",
      "state": "CA",
      "duration": "20min"
    },
    {
      "_id": "64d005f478aba2ec5a3b6b02",
      "summary": "Small miniture light very high for 5 seconds. Then vanished upward",
      "city": "sacramento",
      "shape": "flash",
      "date": "2008-03-04T00:00:00",
      "story": "Small miniture light very high for 5 seconds. Then vanished upward Not a cloudy day. A small light appeared to come down for about 5 seconds then it went slowly upward, and dissappeared. Appeared to be like a small light. I know for shure it was not a aiprlane, beacuse it was to high and it eleveted upward then vanished. I just mentioned a word abot UFo to my brother, and it happened 5 minutes afterward.",
      "link": "http://www.nuforc.org/webreports/061/S61666.html",
      "state": "CA",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b6c46",
      "summary": "Alien probe/craft sighted above rolling hills in California",
      "city": "sacramento",
      "shape": "disk",
      "date": "2008-06-12T00:00:00",
      "story": "Alien probe/craft sighted above rolling hills in California This was my first sighting. I've always heard stories and seen video's but seeing it for myself was an entirely different experience. We were driving to San Francisco and we had just passed a power plant and looking over rolling hills.  The sky was a clear blue, no clouds on a bright afternoon. I was looking out the window and into the sky, I saw something shinny which I thought might be the sun reflecting on it, but it was far too bright and then I thought it was a plane because of the shape but it had no wings, so I was confused, before I could say anything, and in the blink of an eye it disappeared. Again I stared in shock and searched the sky, knowing a plane couldn't move that fast to get out of my line of sight in the blink of an eye. So then I realized what I had just seen. A friend of mine took my description and searched, finding this video for me to see and it's Exactly what I had seen. Whether it was the same craft? I don't know. http://www.youtube.com/watch?v=4pAoDcXBrmY&feature=related",
      "link": "http://www.nuforc.org/webreports/063/S63743.html",
      "state": "CA",
      "duration": "One Minute"
    },
    {
      "_id": "64d005f478aba2ec5a3b71a2",
      "summary": "blue streaks of light flashing all over the sky",
      "city": "sacramento",
      "shape": "cigar",
      "date": "2007-11-28T00:00:00",
      "story": "blue streaks of light flashing all over the sky apparently something like quasars or something from star wars and at times haze or fog appeared the around the millisecond streaks only 3 people officially saw the lights soon after search lights where turned on and chased the objects around.",
      "link": "http://www.nuforc.org/webreports/059/S59878.html",
      "state": "CA",
      "duration": "3 hours+"
    },
    {
      "_id": "64d005f478aba2ec5a3b7218",
      "summary": "Very fast moving, dark grey teardrop-shaped object flies over Sacramento CA.",
      "city": "sacramento",
      "shape": "teardrop",
      "date": "2007-02-01T00:00:00",
      "story": "Very fast moving, dark grey teardrop-shaped object flies over Sacramento CA. While I was on the front porch having a smoke, I saw a large (~2 adult male thumbnails held at arm's length) dark grey, teardrop-shaped object fly overhead VERY quickly from west to east. It wasn't jet black; it was a dark grey in color and it moved *VERY* rapidly - I only saw it for perhaps 200ms (0.2 second) from the time it emerged from the limb of the roof of a neighbouring structure, crossed what little sky I could see overhead, and disappeared past the roof of the structure I was on the porch of.  There was an aircraft in the area (I could hear the engines), but it was travelling in a south-to-north trajectory at the time.  Conditions were mostly clear skies, and a temperature of 55°F at the time.",
      "link": "http://www.nuforc.org/webreports/054/S54578.html",
      "state": "CA",
      "duration": "<1 second"
    },
    {
      "_id": "64d005f478aba2ec5a3b72aa",
      "summary": "Object in sky flashing yellow, red, and green lights in Sacramento, CA.  ((NUFORC Note:  Probable sighting of Sirius & Arcturus??  PD))",
      "city": "sacramento",
      "shape": "unknown",
      "date": "2008-03-31T00:00:00",
      "story": "Object in sky flashing yellow, red, and green lights in Sacramento, California Approximately 11:30 p.m. on the night of 03/27/08, we witnessed an object in the sky that remained in one spot for approximately 45 minutes.  The object flashed strobes of light ranging from yellow, red, and green.  The object soon disappeared and reappeared in a different location to once again show lights of yellow, red, and green.   Four witnesses saw the same object and light show; however, object was too far to identiy through binoculars. ((NUFORC Note:  Probable sighting of Sirius & Arcturus??  PD))",
      "link": "http://www.nuforc.org/webreports/062/S62402.html",
      "state": "CA",
      "duration": "45 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b73a2",
      "summary": "It was as fast as a shooting star, but shooting stars are not red, especially at dusk against a clear sky",
      "city": "sacramento",
      "shape": "fireball",
      "date": "2007-06-12T00:00:00",
      "story": "It was as fast as a shooting star, but shooting stars are not red, especially at dusk against a clear sky Red shooting star",
      "link": "http://www.nuforc.org/webreports/056/S56751.html",
      "state": "CA",
      "duration": "3-5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b743a",
      "summary": "I work late at night, on the way home I saw a Craft that seemed to be siting still. I got home and started looking at it closer...I'm l",
      "city": "sacramento",
      "shape": "triangle",
      "date": "2007-08-07T00:00:00",
      "story": "I work late at night, on the way home I saw a Craft that seemed to be siting still. I got home and started looking at it closer...I'm looking at it now....The bottom of it has green lights on it...It also has a red light that is moving all a round the bottom and a white light that is moving the same way...I am faceing north right now...It has not moved for ten min. now...It looks like it is realy high up there...The red light has now just chaged to Orange...I't just took off, almost start up out of veiw...",
      "link": "http://www.nuforc.org/webreports/057/S57786.html",
      "state": "CA",
      "duration": "19 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b7695",
      "summary": "flying object in sacramento",
      "city": "sacramento",
      "shape": "changing",
      "date": "2007-06-12T00:00:00",
      "story": "flying object in sacramento I saw a rectangular, relatively flat object less than three sq meters Hovering above me.  Initially I saw it about 1500 feet. It was constantly alternating between flat to a three dimenisional x shape. (the shape changing appeared to give it lift).  As it flew away from me it gained in altitude, never going over 2500 ft.  As it got further away, it was impossible to see when it was in the 3-d x configuration.  The object was grey/black. There was no sound to the object. I have worked in the aviation field for years, definitely not a kite, weather balloon, or any other mis. item.  This gave me an ingenious idea to create lift, I will try to reproduce.",
      "link": "http://www.nuforc.org/webreports/056/S56842.html",
      "state": "CA",
      "duration": "4min"
    },
    {
      "_id": "64d005f478aba2ec5a3b76a1",
      "summary": "10/04/06 22:00 Sacramento CA white light one minute object in a picture 02/04/07",
      "city": "sacramento",
      "shape": "light",
      "date": "2007-02-24T00:00:00",
      "story": "10/04/06 22:00 Sacramento CA white light one minute object in a picture 02/04/07 I was taking a picture to the moon and this object apear in the picture I did not see anything when I took the picture ((NUFORC Note:  Witness indicates that the date of the incident is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/055/S55128.html",
      "state": "CA",
      "duration": "one click"
    },
    {
      "_id": "64d005f478aba2ec5a3b7883",
      "summary": "8/12/07 Strange spheres over sacramento 1:00pm.",
      "city": "sacramento",
      "shape": "sphere",
      "date": "2007-08-14T00:00:00",
      "story": "8/12/07 Strange spheres over sacramento 1:00pm. Today on my way home on watt ave going north at the intersection of watt and fair   oaks blvd I noticed 2 metal spheres gracefully dancing around in the air flying together simular to the way birds rise and sink on heat up drafts but in circular circle eight patterns kind of playing off of each other.they were fairly high up maybe a couple thousand feet. I stopped to deposit a check at the golden1 on on the corner..and watched more they were moving to the west seemingly slow but got out of site within 3 or 4 minutes so Im assuming fairly fast at that height. I noticed that without my polarized sunglasses on they were fairly hard to see.but with them on they were bright like a electrically charged kind of steel looking glowing hot metal sphere.got a strange feeling in my gut while looking at them,I think some other people near by were wondering what I was looking at.I was too mesmerized to care.Im a fairly avid outdoorsman and bird watcher nature lover...This was none of those things.Very beautiful and Different...Looked technological not organic.I very surprised to see something like this at this time of day..Like I said without my polarized glasses I probably wouldnt of seen it,Strangest thing Ive ever seen lived here my whole life.",
      "link": "http://www.nuforc.org/webreports/058/S58118.html",
      "state": "CA",
      "duration": "10 min"
    },
    {
      "_id": "64d005f478aba2ec5a3b7a41",
      "summary": "Driving down the highway and saw a cigar shaped craft with a red light in the middle.",
      "city": "sacramento",
      "shape": "cigar",
      "date": "2007-03-08T00:00:00",
      "story": "Driving down the highway and saw a cigar shaped craft with a red light in the middle. I was driving down the highway on my way home from the mall, I had just picked up my sisters prom dress. As I was driving down the highway, I saw a red blinking light in the sky.  At first i didnt think too much of it, just another airplane.  But when I looked up again, I saw that the light was moving very very slow, too slow to be an airplane, and way to close to the ground.   As I got closer to it, I saw the outline of a craft, and saw that it was cigar shaped.  I pulled out my cell phone to try to get a picture of it, but i began to swerve and I didnt want to hit a car, so i put my phone away.  When i passed it, I looked back and it looked to just be hovering over the highway.   I was freaked out by the whole thing. I kept driving and eventually lost sight of it. ((NUFORC Note:  Witness elects to remain totally anonymous;  provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/055/S55446.html",
      "state": "CA",
      "duration": "20 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b7c01",
      "summary": "Bright turquoise light in Sacramento, CA",
      "city": "sacramento",
      "shape": "fireball",
      "date": "2007-02-24T00:00:00",
      "story": "Bright turquoise light in Sacramento, CA On the way home from performing a gig, I saw a bright turquoise object drop very fast from the top of my windshield to below the tree line.  I was on the east side of the Sacramento river, facing west, having just come off Sutterville road and about turn on Riverside. It appeared to be just on the west side of the river, not quite straight ahead, and it was just a little to the right. My first guess was that it was a meteor, and I looked all over the local news next day for stories of a meteor hitting the ground somewhere in west Sacramento, but there was no story. According to a map of the area, the most probable area of impact was in a place with very few streets, which probably means very few houses. It may have struck and not been noticed, or it may not have hit the ground at all. That is what makes it interesting. It should have struck the ground after it went below the top of the trees. It wound seem unlikely for a meteor to evaporate just a couple of hundred feet before it reaches the ground. They usually do so while still high in the atmosphere. I have seen a few of them do just that. It crossed the entire arc of visibility (to me) in less than a second, and did not fade or slow down as it went, as it would have if it was going straight across the sky from behind me. If it was farther away than west Sac, or moving horizontally at high altitude, it had to be huge, and going at an unimaginable speed. It appeared round, and I estimate its size to be about half the diameter of a dime held at arms length. It appeared a little bit fuzzy, so I can't be more exact than that. These flashes in the sky are interesting, but I have never seen anything I can positively identify as an alien vehicle of any sort. I will watch this site to see if anyone else saw this object.",
      "link": "http://www.nuforc.org/webreports/055/S55376.html",
      "state": "CA",
      "duration": "Short"
    },
    {
      "_id": "64d005f478aba2ec5a3b7d09",
      "summary": "SEEN FRONT OF THE PICTURES  HUTCHINSON KANSAS  OCT 27 06",
      "city": "sacramento",
      "shape": "triangle",
      "date": "2006-12-14T00:00:00",
      "story": "SEEN FRONT OF THE PICTURES  HUTCHINSON KANSAS  OCT 27 06 I WAS LET MY DOGS OUT  RESTROOMS   BACK YARD I WAS  FEEL COLD AT NIGHT AROUND 32 DEGREE. I WAS LOOK UP SKY BEAUFRUIL   CAUGHT MY EYE ON LEFT V SHAPES APPEARS NO REDS MIDDLE JUST ALIKE MORE CLOAKS TO APPEARS IT WHOLE WHITES LIGHTS WAS FAST ONE OR  2 MINS WITH MY SPEECHLESS.   I WAS HOPING  MY HUBBY SEE THIS  BECUASE IT WENT DIRECTION LOCATION OTHER SIDE.  MY HUBBY SAID NO HE DID NOT SEE IT I SUSPECT THIS CLOAKS APPEARS UNSEEN IT.  THIS IS MY SECOND SIGHTING   FIRST WAS ON OCT 2003 SO NOW THIS SECOND  AGAIN UNEXPECT SEE AGAIN.  IDONT KNOW IF ANYONE SEE THIS RESULT SEE SEE CLEAR CLOAK APPEARS.. IM DEAF PERSON.",
      "link": "http://www.nuforc.org/webreports/053/S53946.html",
      "state": "CA",
      "duration": "1  OR 2 MINS"
    },
    {
      "_id": "64d005f478aba2ec5a3b8176",
      "summary": "observed v shaped object with lights and no noise in the sky traveling slowly at night",
      "city": "sacramento",
      "shape": "triangle",
      "date": "2008-10-31T00:00:00",
      "story": "observed v shaped object with lights and no noise in the sky traveling slowly at night  500 Lights On Object0: Yes While driving home from working pm shift in the hospital I have worked for almost 30 years traveling East on Fair Oaks Blvd in Sacramento I noticed two bright lights in the sky that seemed to be traveling West but very slowly.  Proceeding East I again looked up and at first thought it was some kind of helicopter...but no sound...I then pulled over to a frontage road and stopped to look up...there was no sound, the craft was v shaped or triangular in shape and continued to move what appeared slowly West...I continued to watch and listen...as it continued it just seemed to vanish...there are no tall trees on Fair Oaks Blvd between Howe Avenue and Monroe/Fulton Avenue that would have obscured my view...",
      "link": "http://www.nuforc.org/webreports/066/S66276.html",
      "state": "CA",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b81a1",
      "summary": "Big Bouncing Light",
      "city": "sacramento",
      "shape": "circle",
      "date": "2008-10-31T00:00:00",
      "story": "Myself and my sister-in-law where heading back home after being out for the night, on Highway 99 heading towards Elk Grove.  I saw an enormous bounging (light) heading towards us. (It stayed on the freeway) bouncing up and down and shot straight into the sky and disappeared.  I then looked over to my sister-in-law and she was staring back at me and I asked her if she just saw what I had seen.  She said yes; a big bouncing light. (as big as the width of the freeway). A little bigger and huge. I dont really believe in UFO but this I can not explain and wanted to take it off my chest.  Thankx ((NUFORC Note:  Witness indicates that date of incident is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/066/S66000.html",
      "state": "CA",
      "duration": "10 SECONDS"
    },
    {
      "_id": "64d005f478aba2ec5a3b81fa",
      "summary": "pulsating light over my neighbors yard about 5 houses away and 30 to 40 feet in the air.",
      "city": "sacramento",
      "shape": "light",
      "date": "2009-01-10T00:00:00",
      "story": "pulsating light over my neighbors yard about 5 houses away and 30 to 40 feet in the air. I woke up to the sound of my dog barking, and by the sound of her bark i could tell I needed to see what was going on.  When I opened the door and told her to stop barking, i saw that she was up by our fence and looking up.  I walked towards my dog and looked up when I saw the object. What I saw was a bright, stationary light about 30 to 40 feet in the air, and over my neighbors yard, about 5 houses away.  This light would pulsate and flash brighter, almost like a strobe light, but much slower, about one pulse every 2 or 3 seconds.  It was completely silent, and just pulsed every few seconds. ((NUFORC Note:  Witness indicates that date of incident is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/067/S67204.html",
      "state": "CA",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b82b2",
      "summary": "Silver sphere in sky during news report about fire.",
      "city": "sacramento",
      "shape": "sphere",
      "date": "2008-10-31T00:00:00",
      "story": "There was a fire in downtown Sacramento, I was watching the channel 10 helocopter, and I focused WAAAAAAAAAY behind it, very high up, if I looked away it took me a few seconds to refocus on it.  It was a small silver sphere.  It stood still for about 8 or 9 minutes, then moved a bit, then just boom, took off towards the east.  The movements were not wind like, if that makes sense, more like a driven kind of object.  I saw you guys on the explorer channel, thought I would share this.  Weather balloon?  Who knows..  hahaha, I .....  hmmm, stood very still for at least 8-9 minutes, very still.  Was it a cloaking device?  Ha...:)  Love it!  Good luck, e-mail me back please if anyone has seen this object, I'm very interested... ((personal information deleted))   And no my e-mail is just a considence, I don't study ailiens or anything like this, but I am drawn to the stars, or they are drawn to us. Thanks... ((NUFORC Note:  Witness elects to remain totally anonymous;  provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/065/S65963.html",
      "state": "CA",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b86c8",
      "summary": "i saw ans still see an object in the sky it was directly over mcclellan afb in the western in sacramento i called a friend and he looke",
      "city": "sacramento",
      "shape": "other",
      "date": "2009-03-19T00:00:00",
      "story": "i saw ans still see an object in the sky it was directly over mcclellan afb in the western in sacramento i called a friend and he looked and said it was venus i went out again about 20 minutes later and the object had moved to the other side of the sky and is now parrallel south of the moon ((NUFORC Note:  Witness provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/067/S67975.html",
      "state": "CA",
      "duration": "ongoing"
    },
    {
      "_id": "64d005f478aba2ec5a3b88bc",
      "summary": "Steady moving narrow rectangle over Sacramento",
      "city": "sacramento",
      "shape": "rectangle",
      "date": "2009-01-10T00:00:00",
      "story": "Steady moving narrow rectangle over Sacramento While doing backyard astronomy, a very thin rectangle object with 10 faint lights, uniformly distributed, was flying over, South to North, high in the sky (it passed through Cassiopeia from my perspective looking to the West.).   With my arm outstretched the object was the length of my thumb (about 2.5\").  Using that as a measure, the depth of the rectangle object would have only been about .25\".   It flew cross-wise, meaning the wide part of the rectangle was the front/back of the object--perpendicular to its flight path.   The lights were quite faint, but white; and as the object approached the city's light pollution, I could no longer make out the object. It didn't disappear, it was just too faint to make out any longer as it flew into the light pollution.  I heard no sound coming from the object.",
      "link": "http://www.nuforc.org/webreports/066/S66773.html",
      "state": "CA",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b8946",
      "summary": "Flashing/colorful hovering light",
      "city": "sacramento",
      "shape": "flash",
      "date": "2009-03-19T00:00:00",
      "story": "Flashing/colorful hovering light Tonight, me and my boyfriend video taped what seemed to be an unexplainable object in the sky. There is a strange flashing light hovering and changing colors. It is in the sky still as we speak. Has moved slightly from where it was when me and my boyfriend first saw it. I thought there were two other, less bright blinking lights that created a triangle shape with the main light. These two did not show on my video, however the main light and its movement are pretty clear. I've uploaded them on youtube tonight and am trying to figure out what to do with this.  Here are the links to my videos: First take: http://www.youtube.com/watch?v=uXiATVZKyCI  Second take: http://www.youtube.com/watch?v=6_jYuqiXLeU  Thank you",
      "link": "http://www.nuforc.org/webreports/068/S68120.html",
      "state": "CA",
      "duration": "hour+ (still occuring)"
    },
    {
      "_id": "64d005f478aba2ec5a3b8d09",
      "summary": "3-4 lights fly low over I-5 in central California",
      "city": "sacramento",
      "shape": "unknown",
      "date": "2008-08-12T00:00:00",
      "story": "3-4 lights fly low over I-5 in central California Driving North on I-5 towards Sacramento about 2-3 hours south. I am not familiar with the area. It was night and there were dark fields to the left and right of the highway. I saw a group of lights (3-4 round solid) about 100 yards ahead of me go over the highway from left to right and then down disappearing into the field to the right of me. I guess they were moving 20-30 miles an hour because I saw them for about 4 to 5 seconds.  My initial impression was that these lights were car lights that went over the highway on a bridge. That was how low the lights were to the highway. That I was going to pass underneath a bridge very soon. At least this was my driving navigation thought process and I kept waiting and waiting for a bridge. Then I realized there was no bridge to go under. I starting looking to the right, into the field, searching for an airport or landing field of some sort, lights of any kind but there was nothing but dark, unlit area.  I do not remember the exact time and date. I know it was in the late spring or early summer of 2006",
      "link": "http://www.nuforc.org/webreports/064/S64867.html",
      "state": "CA",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b8d9e",
      "summary": "Small point of light moving at high speed and high altitude in a northerly direction across the sky.",
      "city": "sacramento",
      "shape": "light",
      "date": "2009-08-05T00:00:00",
      "story": "Small point of light moving at high speed and high altitude in a northerly direction across the sky. I was using binoculars to look at Antares in the southern sky.  Without the binoculars I started looking to the east when I spotted a very small white dot moving south to north.  I quickly found the point of light with my binoculars and noticed that is was steady white with no colored or blinking lights.  I watched the light, without the binoculars, until it went out of view behind a tree.   It seemed to be at a very high altitude, very far away and moving very fast across the sky.   I thought it might be a satellite, but I was unsure if satellites travel from south to north across the sky.  It was not a shooting star.",
      "link": "http://www.nuforc.org/webreports/070/S70834.html",
      "state": "CA",
      "duration": "10-15 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b8f69",
      "summary": "The object was traveling fast one direction and then back the way it came from only this time faster.",
      "city": "sacramento",
      "shape": "light",
      "date": "2009-08-05T00:00:00",
      "story": "The object was traveling fast one direction and then back the way it came from only this time faster. What I saw lasted some were around less than 40 seconds.It was a bright white light traveling at a high rate of speed at level flight.It was traveling north then it seem like as soon as it came it disapear but the stangest thing was that it went back the way it came from only this time traveling south east at a higher rate of speed climing fast.I was looking for a becon light like all air craft traveling in class A air space but there was no flashing becon lights it was the color of the stars white bright.This was seen on the 4th of July of 2009 at 21:15 the night was clear and a bit cloudy with light winds.What I saw was no air plane,helicopter,air ship,rocket,shooting star,weather ballon,jet fighter or meteor.And what ever it was it was flying at level flight and fast maybe faster than mach 2. This thing was covering ground maybe at a rate of 400 miles every 1 seconds it was fast there was no super sonic boom or nothing.Boy the object I saw its really really fast faster than a f-22 raptor never seen something fly that fast and I seen a SR-71 and they are fast but never will be as fast as what I saw.There were a total of 2 wittneses.",
      "link": "http://www.nuforc.org/webreports/070/S70876.html",
      "state": "CA",
      "duration": "40 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b9201",
      "summary": "Flashinng light in the sky not consistent with terrestial aircraft.",
      "city": "sacramento",
      "shape": "light",
      "date": "2008-10-31T00:00:00",
      "story": "Flashinng light in the sky not consistent with terrestial aircraft. While out on the back patio having a smoke, I noticed - in the eastern sky - a flashing light. At first, I thought that it was just an ordinary aircraft, but I soon took note that the flashes were *NOT* consistent with any strobe light I've ever seen on an aircraft. The light, colored predominantly white, blinked at a rate of ~1Hz (one blink per second). The light was illuminated for ~500ms and was off for another ~500ms. The flashes were evenly spaced; never erratic. It also hung stationary in the air for approximately 35 seconds, then suddenly began to slowly move off until it was obscured by nearby trees approximately ten seconds later. While in the process of moving off, it also appeared to dim somewhat as it (apparently) receded. There was no engine noise evident - at the apparent distance it was, I would have probably heard engine noise if it had (a) conventional engine(s). Because of its flashing and movement patterns, I can safely discount astronomical bodies like planets, stars, or meteors.",
      "link": "http://www.nuforc.org/webreports/065/S65871.html",
      "state": "CA",
      "duration": "45 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b9408",
      "summary": "Triangle shaped object spotted over Sacramento River.",
      "city": "sacramento",
      "shape": "triangle",
      "date": "2010-02-14T00:00:00",
      "story": "Triangle shaped object spotted over Sacramento River. On the evening of January 2, 2010, my friend and I were driving East over the Capital Mall bridge from West Sacramento across the Sacramento river into downtown Sacramento.  It was a beautifully clear night.  I noticed lights over the I-5 freeway that seemed to be too low in the sky to be a plane and they didn't appear to be a helicopter.  As we approached the object appeared to be hovering.  I pointed it out to my friend who was driving and said, \"What the hell is that!\"   At that time we were approaching a stop light on the corner of 3rd and Capital Mall and it was clear the object was moving but very slow.   At that point with all the lights from the freeway and building etc, all we could make out were the lights on the object which I think were red and white.  As we turned left heading South on 3rd Street, the object passed overhead slightly to the rear of the truck and we both clearly saw the triangle shape.  It headed West across the Sacramento River tow! ard the Port of Sacramento which is located in West Sacramento.  We both saw the triangle shape clearly as it passed overhead and we could see a white light in the center of the triangle.  Once it went over the river it tilted to the right and headed in a Northerly direction.  There were no news reports of any kind the next day.  It boggles the mind that something that big and that incredably close went unnoticed. BACKGROUND INFO:  My friend and I are both 54 year old females.  She retired from State Service and lives in Idaho but is currently working as a retired annuitant.  Prior to retiring, she was an investigator.  She's a ittle more closed lipped about it then I am but when I told other friends she substantiated what we saw.  I am an Equal Employment Opportunity(EEO) Officer,  My job entails investigations as well.",
      "link": "http://www.nuforc.org/webreports/073/S73975.html",
      "state": "CA",
      "duration": "4min"
    },
    {
      "_id": "64d005f478aba2ec5a3b973d",
      "summary": "Log cylinder flying thing extremely fast",
      "city": "sacramento",
      "shape": "cigar",
      "date": "2009-08-27T00:00:00",
      "story": "Log cylinder flying thing extremely fast Again we saw something in the sky traveling at a high rate of speed.  It was bright like the stars at first.  There were other aircraft in the air and you could keep track of them as for the light you could keep track only for a few seconds before it was gone.  But one of the witnesses pics up a flash light flashes it twice at the sky then a few minutes later the object reveals itself in a cigar shape thing with no wings or visible engines and flashes back 3 times in different colors first was bright then black in which we could tell the shape of it then bright like the color of the stars.  I my self and other witnesses have seen it sense the 4th of july around the same time and seen it up close later that night some of the witnesses are in the military and in there words that was very weird.  What ever the cigar thing was it was big and definitely not man made.  They seem to communicate because we have flash a flash light more than once and we get a response fr! om the cigar flying thing.  It might seem silly but we get a response.  The cool thing about this sighting is that the object camouflages it self with the night sky.  At times its really difficult to spot.",
      "link": "http://www.nuforc.org/webreports/071/S71573.html",
      "state": "CA",
      "duration": "days"
    },
    {
      "_id": "64d005f478aba2ec5a3b9b96",
      "summary": "Twin, non-blinking lights, one following the other, seen over Sacramento before turning red and fading out.",
      "city": "sacramento",
      "shape": "light",
      "date": "2009-12-12T00:00:00",
      "story": "Twin, non-blinking lights, one following the other, seen over Sacramento before turning red and fading out. Saw twin lights, one perfectly following the other (about a thumb's length on an outstretched arm), from the west (just north of due west), beginning about 35 degrees in elevation.  They proceeded eastward, curving slightly toward the south.  The moon (half moon in waxing gibbous phase) was about 5 degrees from its zenith.  The curvature of the objects' course brought them to appear to pass south of the moon.  As they neared the moon's position, first the lead light and then the following light turned red and faded quickly.  It was after I had first noticed that the objects were in motion and without blinking or nav/running lights that I sumoned my wife to see for herself.  My background: I was a Boatswain's Mate in the navy, worked as an archaeologist and environmental planner after college.  Presently a planner for the state.  My wife is a Registered Nurse.",
      "link": "http://www.nuforc.org/webreports/073/S73529.html",
      "state": "CA",
      "duration": "5 Minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b9bc1",
      "summary": "FIVE UFO SIGHTINGS IN THE SAME PLACE FOR 4 NIGHTS STRAIGHT!",
      "city": "sacramento",
      "shape": "sphere",
      "date": "2009-08-27T00:00:00",
      "story": "FIVE UFO SIGHTINGS IN THE SAME PLACE FOR 4 NIGHTS STRAIGHT! I have witnessed five bright multi colored objects in the sky over the last 4 days. On 8/15/09 at 04:00 hours. There was a bright object with blue, yellow, green and white beams of lights shooting from it and what looked like a halo around it and at times, I could see beams shooting from it. I grabbed my camera and took a  picture but it would not appear in the photo. I then taped a mini movie of the object and what I saw on camera was not what I saw with the naked eye. I witnessed what I feel is that same ufo on 8/16/09 at 04:00 hours, these objects stayed in the same place in the sky for over 2 hours on those two occasions. The next night 8/17/09 at 12:30 myself and a friend witnessed a similar bright multi colored  object in the sky but closer to us than the other 2 nights. This UFO appeared to be hovering over something and slightly swaying back and forth shooting very bright beams from it. At 01:30, we both saw two other objects in the sky that were fu! rther away. While the bright one gradually moved toward the other two they all appeared to be flashing beams of lights at each other simultaneously. This is all happening now while I am reporting this to you. It is now 03:00 hours and these objects are still in the night sky, but it looks like they are descending father away from us but they all are still visible and the multi colored beams of lights are still visible but are not as bright.",
      "link": "http://www.nuforc.org/webreports/071/S71721.html",
      "state": "CA",
      "duration": "2 hours"
    },
    {
      "_id": "64d005f478aba2ec5a3b9ef3",
      "summary": "A light that, at first, appeared to be a star, suddenly flashed several colors and  flew away from the Earth until it disappeared.",
      "city": "sacramento",
      "shape": "light",
      "date": "2010-06-10T00:00:00",
      "story": "A light that, at first, appeared to be a star, suddenly flashed several colors and  flew away from the Earth until it disappeared. In the West Southwest sky, southwest of Spica in the Virgo constellation, between Virgo and Hydra, I saw a light in the sky that appeared to be a star.  Moments later, the star began changing colors from yellowish-white to red to blue and flashing excitedly, briefly got brighter, then it appeared to began moving away from the Earth at what I can only assume was a surprising fast rate of speed.  The light grew smaller and smaller until finally is disappeared.  There appeared to be a faint haze around where the lights had been.  The movement away from the Earth was very fast and took only moments. This entire event took only 20-25 seconds. I am a 50 years old man, a college-educated music teacher and music director, and married to my husband for nearly five years.  I have five children and 10 grandchildren.  I have lived in Sacramento since 1976.  I have never before experienced anything like this.  I am a man of faith, but not religious.  I am fairly healthy physically and very healthy mentally.",
      "link": "http://www.nuforc.org/webreports/075/S75683.html",
      "state": "CA",
      "duration": "20 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b9f9c",
      "summary": "Three bright lights low in the night sky almost equidistant from each other over Sacramento, California.",
      "city": "sacramento",
      "shape": "light",
      "date": "2010-05-12T00:00:00",
      "story": "Three bright lights low in the night sky almost equidistant from each other over Sacramento, California. I was driving to my home in Sacramento from my work in Roseville, California on southbound Interstate 80. As I approached downtown Sacramento I noticed four very bright stars in the sky over the city. Within seconds I realized that one was a distant airplane (because of the red and green lights that I noticed it exhibited as I looked more closely). The \"stars\" were about seven full moons apart from each other. As I got closer to the city I could see that the lights were seemingly stationary because their orientation altered naturally with my approach and the turns in the freeway. I apparently was getting closer to them. As I got into town, near the area of Sutter General Hospital the three lights were to my side. The closest of the lights was about five times bigger than a very bright star or five times a magnitude 1 star. It seemed to be around three hundred feet in the air. I tried to notice how far the closest object was from me but I couldn't tell. At first it looked closer than my exit which was coming up (the 16th Street Exit) but as I approached the exit I could see it was farther away... perhaps twice as far. Still, I knew these were not stars nor some other regular natural celestial phenomena. As I approached them they were in front of me; when I got closer they were next to me and then as I went further they were behind me and they were low in the sky. I had seen them from the vantage of the freeway but as I took the exit which descended onto the surface streets the objects were lost amidst buildings and trees and I could not see them again. In all I saw the objects for about six minutes. Because I was driving on the freeway I could only view them intermittently but, perplexed by their strangeness, tried to make as good an observation as I could and remember as many details as possible.",
      "link": "http://www.nuforc.org/webreports/075/S75332.html",
      "state": "CA",
      "duration": "about 6 min"
    },
    {
      "_id": "64d005f478aba2ec5a3ba2e6",
      "summary": "A low elevation very bright circular blue/white light moved extremely fast across the sky for 5 or 6 seconds, made no noise.",
      "city": "sacramento",
      "shape": "circle",
      "date": "2008-08-12T00:00:00",
      "story": "A low elevation very bright circular blue/white light moved extremely fast across the sky for 5 or 6 seconds, made no noise. We live in Sacramento California.  My wife and I were walking our dog this morning at 5:35 am West Coast time when we saw a very bright white / blue light move very quickly across the sky from North to South.  It was large, 50’ in diameter.  It was visible for 5 or 6 seconds. It was too low to be a meteor and there were no reports of a meteor strike in the news. It was not a plane, or helicopter.  It was moving too quickly and made NO NOISE. It was no more than three or four hundred feet in the air. It was very unnerving.  Any else see this thing?",
      "link": "http://www.nuforc.org/webreports/064/S64852.html",
      "state": "CA",
      "duration": "5 or 6 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3ba3a3",
      "summary": "lit up oval floating close to a near by nieghbors tree.",
      "city": "sacramento",
      "shape": "changing",
      "date": "2009-04-14T00:00:00",
      "story": "Lit up oval floating close to a near by nieghbors tree. We were on my deck and we saw a large lit up ufo that changed shapes.  It flew right above us and hovered close to a near by nieghbors tree and floated off slowly. It was clear but darkish on the bottom of it.   My other friend was called up by me and i told him what I had seen. He went out side and saw it also and gave me a clear description of what I had seen also.",
      "link": "http://www.nuforc.org/webreports/069/S69417.html",
      "state": "CA",
      "duration": "1-2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3ba557",
      "summary": "While traveling west on I80 over the causeway from Sacramento Ca to Davis Ca there was a strange grouping of lights  changing color. I",
      "city": "sacramento",
      "shape": "light",
      "date": "2009-04-14T00:00:00",
      "story": "While traveling west on I80 over the causeway from Sacramento, Ca, to Davis, Ca, there was a strange grouping of lights  changing color.  I could not hear any air plane sound or engine sounds.  It seemed to be traveling east, it was hard to say how fast it was moving or how large it was.",
      "link": "http://www.nuforc.org/webreports/069/S69484.html",
      "state": "CA",
      "duration": "5-10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3ba5f5",
      "summary": "Two  stationary bright lights in southern sky  observed  30 secs then dimmed and disappeared",
      "city": "sacramento",
      "shape": "light",
      "date": "2008-10-31T00:00:00",
      "story": "Two  stationary bright lights in southern sky  observed  30 secs then dimmed and disappeared looking south from Sacramento I noticed two bright lights/spheres appearing approx two degrees apart, at about 27 degrees up from horizon. One was approx magnitude of Jupiter, the other slightly dimmer. I noticed these objects immediately, as they \"didn't belong\" in their location, and Jupiter was visible to the west at the time. They remained bright and steady, NOT moving as satellites or aircraft, and begin to quickly dim after approx 30 seconds. Color was shiny white...and the person observing with me asked,\"where did they go?!!!\" I have been a \"sky watcher\" for many years, and these objects \"didn't belong\". The really strange thing was the fact that they appeared absolutely stationary. A slight \"smudge\" of light remained for approx 15 secs after they dimmed and dissappeared.",
      "link": "http://www.nuforc.org/webreports/066/S66392.html",
      "state": "CA",
      "duration": "30 sec"
    },
    {
      "_id": "64d005f478aba2ec5a3ba645",
      "summary": "slow meandering observing ufo in sacramento",
      "city": "sacramento",
      "shape": "changing",
      "date": "2009-05-12T00:00:00",
      "story": "slow meandering observing ufo in sacramento from 4-6am noticed in the distance a bright slow moving zig zag path of the object.  hovered some 5 miles in the air and slowly moved nearer. as the sun came up i could see the light less but the object itself more. have this on film. also looked through telescope and noticed it was sphere to half sphere shaped and changed shape as it moved. i have had three total ufo sightings in my life...each time different.",
      "link": "http://www.nuforc.org/webreports/069/S69984.html",
      "state": "CA",
      "duration": "two ours to current"
    },
    {
      "_id": "64d005f478aba2ec5a3ba646",
      "summary": "clear night sky, bright object, changing shapes and moving quickly in every direction with no pattern.  ((NUFORC Note:  Star??  PD))",
      "city": "sacramento",
      "shape": "changing",
      "date": "2009-05-12T00:00:00",
      "story": "clear night sky, bright object, changing shapes and moving quickly in every direction with no pattern. From at least 4:30 AM thru 5:55 AM from the mid 5200 Block of the 60's Streets in Sacramento, near Fruitridge and 65th  - due East at what I believe was about 20 degrees above horizon was a bright light that stayed visible but moved quickly up and down, side to side and at diagonals. It stayed visible varying only slightly in any direction until approx 5:20 AM at which  time it quickly moved up and right and stayed there for at least ½ hour.  There were 2 witnesses.  We got some video footage but it's not great.  Used a telescope to try to get closer but all we could see was a bright light which seemed to morph in shape and move quickly in any given direction without notice.  Could not make out the shape of object except that it seemed to change shapes rather regularly.  If others saw this or know what it could have been, insight would be appreciated.  It was impossible to tell the distance but it was many miles away.",
      "link": "http://www.nuforc.org/webreports/069/S69981.html",
      "state": "CA",
      "duration": "over 1 hr"
    },
    {
      "_id": "64d005f478aba2ec5a3ba6a1",
      "summary": "Light in sky slowly fades after being hit with violet laser",
      "city": "sacramento",
      "shape": "light",
      "date": "2008-10-31T00:00:00",
      "story": "Light in sky slowly fades after being hit with violet laser At 6:03am PDT 10-24-08, I was on the front porch of our home having a smoke. In the northwest sky, I saw a light. It was yellowish-white and somewhat bright (est. magnitude -2), so I thought it was the planet Saturn.  I observed it for approximately 30 seconds; it exhibited no movement or change in intensity, and it \"twinkled\" slightly.  So I shot at it with a violet laser (power output 111.9mW and spectrographically measured wavelength of ~407.5nm).  After shooting at it intermittently for ~10 seconds, the light started to diminish, until ~5 seconds later it had totally extinguished. I discounted phosphenes pretty much at once because the light remained in a fixed position in the sky when my eyes were moved, and discounted a terrestrial aircraft for the same reason, and because no strobes were seen (I would have certainly *NOT* hosed it down with a laser if I had even the slightest suspicion that it was an aircraft!). Conditions at the time of this sighting were clear skies, calm winds, and a temperature of 47°F (8.33°C).",
      "link": "http://www.nuforc.org/webreports/066/S66405.html",
      "state": "CA",
      "duration": "45 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3ba6e3",
      "summary": "Cylinder shape over Sacramento",
      "city": "sacramento",
      "shape": "cylinder",
      "date": "2009-05-12T00:00:00",
      "story": "Cylinder shape over Sacramento Large (but high altitude) dark cylindrical object very high in the sky oriented North-South going toward south first then orienting south-east.  Disappeared after 5 mins.  Too large to be a plane at that altitude (there was a small semi-transparent cloud I used as reference for altitude), and didn't have any blinking light (a plane would have its lights).  No engine-trail behind the object (like a plane usually leaves) and completely disappeared after 5 mins.  The object was directly over Sacramento, a bit towards Roseville.  Should crosscheck with planes schedules anyhow. ((NUFORC Note:  Witness elects to remain totally anonymous; provides little contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/069/S69996.html",
      "state": "CA",
      "duration": "5 mins"
    },
    {
      "_id": "64d005f478aba2ec5a3ba8d1",
      "summary": "Circular object, slow moving, disappeared, silvery contrail appeared as if the object wanted to be seen",
      "city": "sacramento",
      "shape": "disk",
      "date": "",
      "story": "Circular object, slow moving, disappeared, silvery contrail appeared as if the object wanted to be seen While at a drive in theater, north of Sacramrnto, CA and within 2 miles of McClellan AFB, 3 members of my family and myself saw a very large disc shaped object flying from north to south over the large, outdoor, screen just as the film started, about dusk.   The size of the object was approximately 80 to 90 feet in diameter.  It was silvery in appearance, without any markings and did not display any join lines or riveting, as do conventional aircraft skins.  It appeared to have a fluted exhaust at the rear, with a long silvery contrail egressing from it. What appeared to be windows around the upper edge of the disc were all lighted.   It was moving far slower than any aircraft should have been and was not \"spinning.\" It also was not making any noise at all.  The attitude of the craft was such that it appeared that it wanted to be seen, and seen it was because every car in that drive in was emptied and the occupants were standing, staring at the sight of it.   As suddenly as it had appeared, the contrail blinked completely out and all the windows darkened. It was visible for only seconds after that and quicker than the mind can imagine, it was gone. It didn't appear to speed away, it just vanished.",
      "link": "http://www.nuforc.org/webreports/078/S78083.html",
      "state": "CA",
      "duration": "7 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3baa09",
      "summary": "Translucent shimmering white soft edges rectangle wide as a the side of an AMTRAC train car.",
      "city": "sacramento",
      "shape": "rectangle",
      "date": "2010-11-21T00:00:00",
      "story": "Translucent shimmering white soft edges rectangle wide as a the side of an AMTRAC train car. Vitals: Clear skys 68 F0  and low humidity  Approximately around 22:25 Pacific Standard time looking at the south sky (I do that every night walking my dog in the backyard) I noted this light traveling horizontal at a relative fast constant speed, guessing about 100- 300 MPH about 45 degrees from the ground traveling on a north east direction about less than 1000ft high.   Though I saw the UFO by Mather AFB (formerly an air force base) over extended right base heading west (by Capital Christian church) it cross over  the flight pattern heading east.  The shape of the object seem more like a comet's tail except it did not flare out like a comet, but more like long lengthy wavering shimmer of white.  Not like a comet where the pattern trail is consistent. This object had waves as it traveled from south to north east.  The closest shape would be a smooth long rectangular see through cloud that was traveling fast and keeping its shape too, Not a lenticular cloud.  As private pilot and air crew in the air force, I have neve! r seen this type of cloud move so fast with a white shimmer contrasting with the black background, the night sky. In fact I have never seen this at all.  It reminds me of a spirit like in the movies, but much longer than a C-5 Air craft. I had time to take good look, around for clouds, other air craft's that are usually noisy, but this one did not have a noise or any sound.  It did not leave a trail, but it did move relatively fast, faster than plane coming into Mather's flying pattern.  In fact I was able to run to the second floor and look out the east window of the house and continued to observe it.  I mention it to my wife who was also upstairs and we both quickly looked out the east window and saw it together.  Although my wife is near sighted, she still was able to see a faint cloud like shape moving horizontal.  The object disappeared with our neighborhood lights. I can tell you what it's not: •\tan airplane or a jet at near idle speed coming for a landing •\tNo navigational or landing lights •\tNot a helicopter •\tNot the Space Station in which we sometimes see it fly by •\tSmoke cloud. Smoke clouds do not move in that form •\tNot a lenticular cloud (see plenty of those at high altitude) I went back out and really looked at the sky and I thought I saw another faint object and it disappeared. That is it and here I'm writting this!",
      "link": "http://www.nuforc.org/webreports/077/S77556.html",
      "state": "CA",
      "duration": "2-3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3baebd",
      "summary": "grey alien was seen in Sacramento in july, 14th.",
      "city": "sacramento",
      "shape": "other",
      "date": "2011-01-31T00:00:00",
      "story": "grey alien was seen in Sacramento in july, 14th. this is a report about an experience with a grey aliwn. sorry, it is not a UFO-report, but i think the greys have something to do with UFOs. so i hope it is useful also. if you want i can send a painting out of my mind about what i have seen , then please contact me.  the report:  1987, in July, I visited my family in California, Sacramento. There I had a very exceptional situation.  Actually with something who is known under the grey aliens in cases in literature. Before this specially night I did not knewn anything about this theme!   The experience have been at July, 14 th at 1:30 a.m. in my guestroom.  Short time after I went to bed the situation has happend. I wasn´t sleep for sure, the lamp in the room was switched off and it felt a little bit moonlight into the room.  The situation continued between 30 to 60 seconds I guess. I laid on my back, was wake, my eyes were closed and I thought about the time I had been in CA. Suddenly, in that moment I noticed something is wrong in this room.  I had a feeling somebody or more than one person came into the room, but I locked the door before I went to bed.  So I tried opening my eyes and in that moment I heard a very quiet sound like from an engine or something like that. Exacty in that moment I noticed I was unable opening my eyes or moving my body arbitrarily.  So that unknown person or what ever have been now in my guestroom, was able to have an effect on my neural functions, I will say specially on the motor activities. I still tried opening my eyes with all power I got, and however then I was able to open them. I saw somebody standing next to my bed was looking on the middle of my body. Maybe the heigh of that what I saw was about 150 to 170 cm. The figure was analogical like human being. I will say it wasn´t looking usually human being like me and you, it was really very different. It was standing on two legs upright like a human. The head was a great one and I couldn´t see any hairs. I saw into a face resembling a human, but also very different from all what we know. It wasn´t a usual human, but for simpleness I will call it human from now on. So the human had two eyes, but much more greater than our eyes are being and they glow yellow. Where we have got a nose there I saw a longish elevation, who was located from brow area to chin. Downwards it became bigger. On it I saw horizontal subdevisions. The whole face was so much strangeness I only able explaining what I mean exactly in my paintings, specially the new one. The \"nose\" strictly was not a breathing mask or something like that. The head and the face seemed white-blue. I saw the body and head was encased by a transparently blue-white aura or something like that. I only can suppose what this human weared on body. It seemed like a metallic suit like an one-piece. I am not sure if I saw ears. So this human looked at my body with head down. I don´t know exactly how many seconds passed by, but I appreciate between 10 or 20. After that time I wasn´t able opening my eyes continuing although I wanted to and I was weak. So they closed and I was thinking to the housekeeper and also nurse (for the grandmother living next to my door). The housekeeper, Cora, laid in the hall on the floor on a mattress, directly before my guestroom-door. Actually the grandmother was ill and needed Coras´ help again and again in that night, so Cora decided sleeping in hall, because her own room had been on the contrary end of the house. I wanted to cry, but I could not use my voice. So I hoped maybe Cora will remark something, but she did not... In this moment I thought how strange this situation is and I felt so much terrified I can not explain. I really needed all my power to go through this situation at all. Otherwise I noticed the human wasn´t doing anything bad to me, \"only\" was looking on my body and I was still alive. I know this human was still in my guestroom and also I heard the quiet noise. So I tried opening my eyes again and I was able to do it again. In that moment I saw this human changed position about 90 degrees and was not looking anymore to my body, rather was looking to the guestroom-door. It seemed that he had knewn what I was thinking, in particular I thought to Cora, laid exactly before this door. After some seconds I had no power anymore for opening my eyes and had to close them again. After that suddenly I didn´t hear the noise anymore and also I was able to move myself and open my ! eyes again like nothing have been happend before. So as soon as possible I switched on the lamp, wrote on a paper what has been going on and opend the door. I waked up Cora for asking her if she noticed anything, but she did not she said. My condition was the same like before and I was still ok. So I stood up and went into the garden before the house for looking if there is anything. But I can´t see anything strange, went back in the house fast. I coudn´t sleep in that night anymore. At 3 o´clock a.m. my stepbrother Lucho came home from work and I told him what happened. He was listening to me and told me an experience about something he saw two years ago. Actually Lucho was standing before the house, was looking into the sky and saw an UFO. He went into the house to his mother and told that to her. So the both went out again for looking and there was no more to see. So the mother told him he should stopp telling things like that. This he told me in that night. Then we thought about the way this human was coming into the guestroom, but we/I still don´t know. I will repeat: before this night I never have knewn about greys or bedroom visitors or something like that. Till now I attest this is a true event. ((name deleted)) P.S. Sorry for my bad english..",
      "link": "http://www.nuforc.org/webreports/079/S79602.html",
      "state": "CA",
      "duration": "30-60 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3baecb",
      "summary": "Oval Pattern of Lights Observed Traveling Low Over Sacramento, CA",
      "city": "sacramento",
      "shape": "oval",
      "date": "2011-01-05T00:00:00",
      "story": "Oval Pattern of Lights Observed Traveling Low Over Sacramento, CA An aircraft was just observed over the City of Sacramento,California(in the dark)carrying at least eight steady lights of different colors configured in two equally spaced rows suggesting an oval shape elongated along the horizontal axis.  Other lights were seen to randomly blink within the pattern of the aforementioned  eight steady lights or to blink in an unobserved pattern.  The aircraft made no noise,unlike the helicopters and fixed wing aircraft often seen over this city.  It was traveling in a strait line at similar speeds to local conventional aircraft noted at this relatively low altitude (approximately 500 feet) and was passing due west over 51st Street between J and M Streets toward the state capitol.",
      "link": "http://www.nuforc.org/webreports/079/S79076.html",
      "state": "CA",
      "duration": "45 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3baf33",
      "summary": "Disk shape  clear day, no clouds in sky just hovering over  no sound, no lights  500 Lights On Object0: Yes",
      "city": "sacramento",
      "shape": "disk",
      "date": "2011-01-31T00:00:00",
      "story": "Disk shape  clear day, no clouds in sky just hovering over  no sound, no lights  500 Lights On Object0: Yes Hello this is my first time am putting this out on the internet.It was the day after 9/11 I was driving my kids to school about 7:30 in the morning clear day not a cloud in the sky when i notice a light in the sky,not a light,light but a light like something was reflecting off something in the sky.At the sametime i was telling my kids to always be aware of things around you when i notice this light.At first i did not know what it was because of the sun reflecting light off of it.So at the same time am talking to my kids am slowing down to see what this was. And at that time is when the object was moving slowly and moved and the sun light move off of it and thats when their it was a sauser disk spening and wobbling over my neiborhood.And i know i could not have been the only one to see this but never heard anyone else that day on TV or radio mention the incedent.  And it was not a plane because all planes were grounded for days,so i know it was not that.Also i! was not that far from it I mean it was right their clear as day showing it self to me and how ever else may have seen it.  So why do you think they showed their self the day after 9/11.  I think it was to say we did this, and were in charge and thers nothing us humans can do. P.S SACTOWN...",
      "link": "http://www.nuforc.org/webreports/079/S79632.html",
      "state": "CA",
      "duration": "60 sec"
    },
    {
      "_id": "64d005f478aba2ec5a3bb206",
      "summary": "Falling Object next to the Big Dipper.",
      "city": "sacramento",
      "shape": "oval",
      "date": "2010-08-24T00:00:00",
      "story": "Falling Object next to the Big Dipper. The Object was seen at 22:55 July 31st 2010,  A bright Oval Object directly to the right of the Big Dipper could be seen falling vertically from point of few It fell 6 Inches.  After falling It grew brighter ( Blue ) then flashed an orange white hue and shot directly east at a completely perfect horizontal flight path.  The Object did not appear to be a Aircraft or Shooting star I know the difference,  It was almost like an falling orb than turned into a rocket.  I didn't have time to take a picture of the object due to the fact I was on the cell phone looking up at the Big Dipper.  My friend told me to report It and so thats what I did, hopefully someone else saw what I seen. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/076/S76924.html",
      "state": "CA",
      "duration": "5-10 Seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bb29a",
      "summary": "Three red lights in the sky.",
      "city": "sacramento",
      "shape": "",
      "date": "2011-04-03T00:00:00",
      "story": "Three red lights in the sky. At about 8:30pm, I went out to the back patio to have a cigertte i was looking up into the sky, i focused in on what i first thought to be a star flashed a sort of l.e.d. color after it flashed it was red and now zig-zaging and then staying in one spot in the sky for a couple of seconds then it would move again and stop,  About ten minutes into this keeping my eyes on whatever i was seeing i noticed two more of them they were only moving slightly in circular motions, they were not as bright as the 1st one i saw but were definitely moving and also red.  Once i had all three of them in sight it formed an almost obtuse triangle.  I watched cursing to myself in awe until i could not see them anymore due to clouds coming in overhead, this happend tonight in sacramento,california.   I went inside to get on the computer to see if i could find anything similar to what i had just witnessed and saw that lots of people claiming they saw the same thing.   I called the NUFORC hotline as i began to speak my voice shook a little and the man that took my call said to me he suspected this was a hoax  im sure they to everybody he had me explain what i saw,  i did before getting off the phone with him he asked i write a report on what i just saw while it was still fresh in my head,so here it is. March, 28th, 20011 ((NUFORC Note:  We owe an apology to the source of the report.  Many prank calls are submitted from the telephone area code where the witness is located, and for several reasons, we initially suspected that the call might be yet another of the MANY prank calls placed to our Hotline.  We believe that our initial suspicion over this call was in error, and we apologize, again, to the witness, who was kind enough to place the call, and to follow up with a nice report of his sighting.  PD))",
      "link": "http://www.nuforc.org/webreports/080/S80663.html",
      "state": "CA",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bb4c6",
      "summary": "Quick flash of  white light near Erydan near Rigel  below  Orions Belt.",
      "city": "sacramento",
      "shape": "light",
      "date": "2011-02-23T00:00:00",
      "story": "Quick flash of  white light near Erydan near Rigel  below  Orions Belt a single brite lite/flash in close proximity to the Star Erydan near Rigel in Orions Belt",
      "link": "http://www.nuforc.org/webreports/080/S80162.html",
      "state": "CA",
      "duration": "1 second"
    },
    {
      "_id": "64d005f478aba2ec5a3bb5a1",
      "summary": "Three UFOS over 1-5 in Sacramento",
      "city": "sacramento",
      "shape": "unknown",
      "date": "2011-02-08T00:00:00",
      "story": "Three UFOS over 1-5 in Sacramento First and foremost I would like to appologize for my grammar as I do not have a word proessor program, so I will write my report as best as I can. As I was driving back home last night I saw a UFO at first I thought it was a helicopter but as I got closer to my exit I could see there were three others and they moved like no helicopter would for no apparent reason, they changed colors from anything to blue to red mostly staying in blue or red.  As I got to my exit they were to my right side about a mile far they would move in different directions and get to ground level and go back up over and over repeating this for varoius minutes. I could still see them when I got home as my house is right by the freeway.  They were above the freeway moving as a mentioned earlier up and down side to side.  I ran inside called my brother and he saw them too.",
      "link": "http://www.nuforc.org/webreports/079/S79899.html",
      "state": "CA",
      "duration": "20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bb69d",
      "summary": "Slowly rotating cylindrical object ~75' above intersection",
      "city": "sacramento",
      "shape": "cylinder",
      "date": "2010-07-19T00:00:00",
      "story": "Slowly rotating cylindrical object ~75' above intersection As a six year old child I still very clearly remember an incident in March of 1973 outside of my home in Sacramento, CA.   We had just returned home and my parents were inside watching television.  I was outside playing in the street when I felt I was being observed and looked up.  About 50-75 feet (?) above (I will send a Google Street View of the location) I saw a whitish cylindrical object with a few black lines silently hovering above and slowly rotating (I’ll also email a crude drawing).   I watched it for about 20 seconds, fascinated, when I remembered that I had recently been given a cheap pair of plastic toy binoculars.   Unsure of what I should do, I bolted into the house to get the binoculars so I could see more detail.  I yelled at my parents that there was something in the sky as I ran toward my bedroom.  One of them said that the TV news had reported that a meteor had been spotted.   By the time (2-3 minutes) I made it back outside, the object had d! isappeared.   Even at that age I felt I had seen something very important and decided to write down the date on a piece of paper which I would always keep (of course it only took a couple of months before I lost it!). ((NUFORC Note:  Witness elects to remain totally anonymous; provides little contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/076/S76447.html",
      "state": "CA",
      "duration": "20 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bbb73",
      "summary": "Triangel shaped object weeving through the high rise of sacramento california makeing accute angel turns abruptly...",
      "city": "sacramento",
      "shape": "triangle",
      "date": "2011-10-10T00:00:00",
      "story": "Triangel shaped object weeving through the high rise of sacramento california makeing accute angel turns abruptly... Im using a cell phone enternet and cant use spell check.  Forgive me for any spelling errors... My frend and I were walking accrost capitol bridg into down town sacramento, I looked up at the buildings (faceing nort east) and noticed a triangel shaped objeckt with a spearmint blue light on each corner, maybe as big as an suv, makeing strange patterns over the high rize of the city. It made 10-11 abrupt turns in accute angels. It would do barrel rolls and compleatly dissapear then pop back up within seconds. Eventualy it fell at an angel going south and we didnt see it for 30 seconds.  Then it flew straight up into the sky by the renisaunce tower still dancing through down towns high rise weeving through the buildings. I stoped a random pedestrian who said he never belived in alians till he saw this strange object. I know it was something not of this earth because it was on the north side of some buildings just as were we.",
      "link": "http://www.nuforc.org/webreports/083/S83810.html",
      "state": "CA",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bbbe9",
      "summary": "Single star-like object splitting into three star-like objects and moving uniformly across the sky.",
      "city": "sacramento",
      "shape": "light",
      "date": "",
      "story": "Single star-like object splitting into three star-like objects and moving uniformly across the sky. I was probably about 10 or 12 years old when the incident took place so that would place it around 1957. It was summertime, probably between 9:30 to 10:00 PM.  A couple of friends and I were in my front yard talking and looking at the stars.  At one point we noticed what looked like a normal star of average intensity (not particularly bright) almost directly overhead except that it was moving around, meandering around really, in no apparent pattern, over a small area of the sky that was equivalent to about the amount of sky that you could block out with a tennis ball held overhead at arm’s length.  At first we thought it might have been something like a weather balloon that was high enough to still be in sunlight even though it was dark at ground level since it wasn't that long after sunset, and was being moved around by high altitude winds.  This meandering pattern continued for maybe 30 – 45 seconds from when we first noticed it, at which point this single star-like object split into three star-like objects of the same size and intensity as the original single point of light.  Within several seconds, these three points of light aligned themselves side by side by side (like three cars in adjacent traffic lanes) and were uniformly apart from each other (the distances between each of the three lights was about the width of a pencil held overhead at arm’s length).  As soon as they were aligned, the three lights moved slowly off across the sky in a southerly or southwesterly direction at a constant speed, in perfectly straight lines, with the three lights staying perfectly abreast of each other and maintaining the equal spacing between each other.  At no time did we hear any sound.",
      "link": "http://www.nuforc.org/webreports/084/S84846.html",
      "state": "CA",
      "duration": "90 - 120 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bbdbd",
      "summary": "Circular object  scene off I-5 in Sacramento's night sky.",
      "city": "sacramento",
      "shape": "circle",
      "date": "2011-10-10T00:00:00",
      "story": "Circular object  scene off I-5 in Sacramento's night sky. My wife was driving with me and my two sons ages 5 & 11 on I-5 at about 8:50 on Sunday August 28th when we saw a circular object to our right flying about 200 feet in the sky moving and at a distance of about 4 street blocks from us.   The object moved back and forth at a fairly good speed, much faster than we drove which was about 70 miles an hour.  The object was multiple colors, at times all blue with a few white lights, sometimes mostly red.  We could also see the shadow of the body which was disk like.  As we continued to drive I watched through the back window with my 11 year old son.  We noticed it jet straight up in the air and then drop like a rock toward the ground before stoping and then moving in other directions.  We continued to watch for about 5 minutes until it was out of view.",
      "link": "http://www.nuforc.org/webreports/083/S83536.html",
      "state": "CA",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bbe93",
      "summary": "3 bright white lights streak across sky in triangular formation, leave bright trail.",
      "city": "sacramento",
      "shape": "unknown",
      "date": "2011-10-10T00:00:00",
      "story": "3 bright white lights streak across sky in triangular formation, leave bright trail. I just got back from a run on the track of North Del Rio School Park in Sacramento CA.  At 1:14am Pacific time on 09-02-2011 I was on the north side of the track facing east (approximately 38.621686,-121.452999 according to Google).  I had just finished my run, and was looking up to stretch my neck. I was looking at the sky and what I saw amazed me.  From out of nowhere appeared three white lights clustered closely together in the orientation of a triangle pointing upward from my perspective. In the span of about a second, perhaps a little bit less, the three lights, maintaining their position relative to each other, streaked across the sky from south to north. The lights left a very bright streak of light across the sky.  Actually they left three distinct streaks, one from each light.  The streaks were very close together, and so they blended a bit, but I could still distinguish three separate streaks of light. It's difficult to gauge distance, especially since I am not sure how high up the object was in the sky. But it was close to the Big Dipper in my field of view, so I can say that it traveled about 2.5 to 3 times the width of the Big Dipper's cup.  It started about two cup widths to the south of the Big Dipper, and streaked north crossing the Big Dipper's cup then disappeared instantaneously.  The streaks remained in the sky just a fraction of a second longer, then also disappeared.  The three lights, and the streaks that trailed from them, where extremely bright; brighter than any star in the sky.  I would have taken this for some sort of shooting star, except that I could distinctly make out three points of light giving me the impression of thrusters, like those on the back of the Space Shuttle.  I would like to make clear that I could not see the shape of the craft, and I do not think that the triangular formation of lights represents the shape of the craft itself.  Rather I suspect that the triangular light formation represented the craft's propulsion component only. The shape of the rest of the craft is unknown. There was no sound, and it lasted just a second at the most. I continued to walk around the track for about five more minutes, but I saw nothing further of note in the sky, so I headed home. Once again, it's very hard for me to gauge size or elevation of the object, but the three lights occupied a space that would have fit in the circumference of a dime, or nickel perhaps, from my perspective. And if I had to guess, I'd say it would have had to be up around 18,000ft a least. If I'm right about the altitude, and I may not be, then the size of the object would have to be rather large to occupy the circumference of a dime. While the probability seems remote, since the phenomenon was so brief, I'd be very curious to know if anyone else has had a similar sighting. Relevant background: Student Pilot",
      "link": "http://www.nuforc.org/webreports/083/S83643.html",
      "state": "CA",
      "duration": "1 second"
    },
    {
      "_id": "64d005f478aba2ec5a3bc01e",
      "summary": "Slow moving bright yellow-orange light in plus-sign shape moves west to east to  southwest in 20 minutes towards Jupiter.",
      "city": "sacramento",
      "shape": "cross",
      "date": "2012-01-12T00:00:00",
      "story": "Slow moving bright yellow-orange light in plus-sign shape moves west to east to  southwest in 20 minutes towards Jupiter. Around 11:30 p.m. Sunday, 12/18/11 I went to lock the garage door and noticed a bright yellow light due west. I watched it for a couple minutes and it didn't look like it was moving. There is an alley behind our house [which in on an exact east/west alignment] and I moved to place telephone wires between me and the light so I could gauge any movement. It was moving, but very slowly. I ran into the house to get binoculars and tell my husband about the light. The binoculars I grabbed SUCK! And I also wear glasses. But he came out with the larger 10xm binoculars and our little Panasonic camera and a monopod. By the time he came out the light had moved from where I initially spotted it in the west. [It would have  been slightly north west from my standing location.] It was moving in a due east direction when I realized it was moving and when I came out from alerting my hubby, it had moved a good hand-span eastward. My husband was taking a 'movie' as well as look! ing through the better binoculars and then the light took a southward turn for a half hand-span and turned southwest at that point. There were spotty clouds in the south and southwest and Jupiter was visible in a large break in those clouds and the yellow light appeared to be maybe going higher, because it seemed to be getting smaller but it was heading for that clearing and Jupiter. My husband said it was appearing smaller because it was entering the cloud cover. He also said it looked like the light was in a plus-sign configuration and that it was more orange than yellow and had panels on it. It was NOT blinking. He thought it might be an 'air-ship'. I said, \"what the heck is an air-ship?\" and he indicated like a blimp or dirigible, but it was so high and then the plus-sign configuration would sort of cancel that out. Eventually Jupiter was swallowed by the clouds and so was the light. We came back inside and looked up NASA and the local news and nothing was indicated as ! anyone else seeing this light [as of today at 7:30 p.m. there ! has stil l been no posts or news of anyone else seeing this that we can find!] The \"movie\" he took is sort of  like one of those hand-held movies...sort of jerky and blurry at times, but you can clearly see the plus-sign shape and that the lights or panels or whatever are not blinking like an airplane. during the seemingly endlessly slow movement of this whatever it was, there were other airplanes in the sky, both heard and seen. We are within several miles of a small airfield and live near a hospital trauma center with a Lifeflight copter that frequently flies overhead. This light was not like anything I've ever seen before and it was so SLOW. And the odd movement where it was heading in an apparently West to East line and then changed directions to move diagonaly from it's overhead spot towards the southwest was especially confusing.",
      "link": "http://www.nuforc.org/webreports/085/S85960.html",
      "state": "CA",
      "duration": "20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bc201",
      "summary": "((HOAX??  Date is flawed.))  Green ufo and red and white ufo over shopping center.",
      "city": "sacramento",
      "shape": "light",
      "date": "2011-12-12T00:00:00",
      "story": "Green ufo and red and white ufo over shopping center Green ufo returns again, with another.  Not as acrobatic.  Around same time of night as well, over the same area.  It would float up and over the shopping center, come back down again.  The second was more cautious, moving only small amounts of time.   Second was with a white light with red on occasion but moved in patterns not characteristic to a plane or helicopter. ((NUFORC Note:  We do not know whether this was intended as a serious report.  The date indicates that the sighting occurred in the year 2016.  PD)) ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/085/S85416.html",
      "state": "CA",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bc677",
      "summary": "Red glowing light climbs above Sacramento, CA on 1-08-12",
      "city": "sacramento",
      "shape": "fireball",
      "date": "2012-01-12T00:00:00",
      "story": "Red glowing light climbs above Sacramento, CA on 1-08-12 At 9:40 pm on 1-08-12 I was at home watching TV and my peripheral vision caught a red glowing ball approximately 30 degrees above the horizon in the north / northeastern sky through a window on the east side of my house. The object was visible for about 4 minuets as it climbed at a steady rate to approx 50deg above the horizon directly east of my home. At that point,  the ball began to grow fainter and appeared to change direction and go vertical or turn 90 deg away from my position until the light faded to nil 5 seconds later. Halfway through the observation I went outside to see if there way any sound, and heard nothing.  I can see and hear airplanes nightly through the same window and am familiar with the flight paths that are used in the skies above Sacramento. This was unlike anything I seen in the 10 years I’ve lived in the home.  I only possibility I’ve been able to come up with is that 40 NE of Sacramento is Beale AFB, home to the 9th Recon Wing of t! he Air Force. Anybody know what a U2 Dragonlady spyplane looks like in full afterburner max climb at night?",
      "link": "http://www.nuforc.org/webreports/086/S86461.html",
      "state": "CA",
      "duration": "4 min"
    },
    {
      "_id": "64d005f478aba2ec5a3bc71f",
      "summary": "Ufo seen over Sacramento Ca, at 6:30 pm on 1-10-12",
      "city": "sacramento",
      "shape": "changing",
      "date": "2012-01-12T00:00:00",
      "story": "Ufo seen over Sacramento Ca, at 6:30 pm on 1-10-12 The object seemed blueish purple, it hovered making small position changes, as it changed shape and color. At times it seemed to have a red glow. It was seen in the southwestern sky viewed from my location, it then slowly moved away towards the southwest. The event ended at 6:35 pm pacific time from my viewing position.",
      "link": "http://www.nuforc.org/webreports/086/S86492.html",
      "state": "CA",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bc6f5",
      "summary": "The orange cross over sacramento",
      "city": "sacramento",
      "shape": "cross",
      "date": "2011-12-12T00:00:00",
      "story": "the orange cross over sacramento On my way home from picking up my wife from work ,as we pulled into our street we saw a orange cross in the sky, it was about 15hundered feet i guess , it was as lowe as a chp choper would normaly be. The cross had no sound to it ,so i  opend our moon roof in our car,pulled over and we were able see this thing very well, my wife said to me can it be a blimp?  I dont know?  I dont think so? because  blimps moves some.  At this point we just looked at it not knowing what it is.  Then  it moved ,to our left , and when it did no sound and very fast,  So i drove to the next street over to try to get a pictuer of it , it thein moved back to the place that i first saw it,  My wife and i dident know what two think? so i drove a coupel of blocks over to our home, it was still thier. we get out of the car it still thier , my wife makes her way in the house, shaking her head telling me to come inside, well I dont, i go to the back yard and look for it ,, it still thier ! just thier! then it dropt something ..like a flair from underneth it .. the flair fell and was burning up and when the flair was gone so was the cross. like it was never thier, just gone..we saw something that we had never seen befor",
      "link": "http://www.nuforc.org/webreports/085/S85779.html",
      "state": "CA",
      "duration": "12 min"
    },
    {
      "_id": "64d005f478aba2ec5a3bc7c9",
      "summary": "Sacramento ufo arden mall sighting 01/11/12",
      "city": "sacramento",
      "shape": "disk",
      "date": "2012-01-12T00:00:00",
      "story": "Sacramento ufo arden mall sighting 01/11/12 Bright purple and led pink lights flying 200ft over a busy mall area was moveing in the air like a bat lights would fade in and out .",
      "link": "http://www.nuforc.org/webreports/086/S86526.html",
      "state": "CA",
      "duration": "5 mins"
    },
    {
      "_id": "64d005f478aba2ec5a3bcac7",
      "summary": "Northern California Night Orb.  ((NUFORC Note:  Possibly a landing light on an approaching airliner?  PD))",
      "city": "sacramento",
      "shape": "light",
      "date": "2011-07-17T00:00:00",
      "story": "Northern California Night Orb. Noticed a bright orb in the sky at 2:20 am and watched it for about 4-5 minutes before it disappeared.  It was west of Sacramento. ((NUFORC Note:  Possibly a landing light on an approaching airliner?  PD))",
      "link": "http://www.nuforc.org/webreports/082/S82326.html",
      "state": "CA",
      "duration": "5 minutes (approx.)"
    },
    {
      "_id": "64d005f478aba2ec5a3bcd9b",
      "summary": "No sound and invisible",
      "city": "sacramento",
      "shape": "sphere",
      "date": "2011-05-29T00:00:00",
      "story": "No sound and invisible I was in my back yard when I heard a large coast guard plane, they go over our area frequently and I always look to the sky to locate them.  They are very large and fly low either coming to are leaving the local air base here.  I was looking to see where it was this was broad daylight around 11 a.m.. While looking for the plane I saw four silver balls one on top of the other.  I saw them for a few seconds only.   I observed them change direction and then vanished the shine of the balls seemed to make them invisible.  On a clock dial 11 am to 1 pm was all I could see them they just vanished in the light.  I couldn’t tell how far away  they were nor could I tell the size of the balls they moved fast and changed direction",
      "link": "http://www.nuforc.org/webreports/081/S81320.html",
      "state": "CA",
      "duration": "10 sec"
    },
    {
      "_id": "64d005f478aba2ec5a3bcefb",
      "summary": "High slow moving ufo over Sacramento heading North.",
      "city": "sacramento",
      "shape": "other",
      "date": "2011-05-12T00:00:00",
      "story": "High slow moving ufo over Sacramento heading North. It was bright like it was lit up by the sun from the west.  It was very high in altitude and moving slowly at a steady speed & heading from south to north.  It was moving too slow to be an airplane.",
      "link": "http://www.nuforc.org/webreports/081/S81166.html",
      "state": "CA",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bcf0e",
      "summary": "Fast white light in Sacramento sky off of Interstate-5",
      "city": "sacramento",
      "shape": "disk",
      "date": "2011-05-12T00:00:00",
      "story": "Fast white light in Sacramento sky off of Interstate-5 I was driving on Interstate-5 South, when on the left hand-side of the free way, on the southern horizon, I noticed  a bright light speeding diagonally downward across the horizon reaching very low to the ground.  (At first I thought the object to be a shooting star, or crashing plane) It then shot back in the direction it came from (now upwards and to the left diagonal), however this time in a big spiral motion.   The object then changed direction completely, flying towards me and past me on the left-hand side, at very fast speeds.  It appeared to be flying at a distance of 200 yards away, and varying from 100-300 ft high.  It seemed to change speeds from very slow to very fast, and once it past me, it had blinking lights on the back (red blue and white).   The object changed direction again, tracing its path to in front of me, and then flying along the horizon, where it split into two white lights.  The (seemingly) original light came back my way, while the ! new second light trailed off to the right and disappeared.   Once the light was so far behind me, I could no longer track its flight pattern. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/081/S81196.html",
      "state": "CA",
      "duration": "1-2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bd04b",
      "summary": "ORANGISH RED ORBS HOVERING  OVER NATOMAS AND HWY 99 NORTH",
      "city": "sacramento",
      "shape": "circle",
      "date": "2012-08-05T00:00:00",
      "story": "ORANG ISH RED ORBS HOVERING  OVER NATOMAS AND HWY 99 NORTH WALKING AROUND THE BLOCK THINKING OR MY GRAND CHILDREN AND AS I WENT HALF WAY AROUND I LOOKED IN THE SKY TO SEE HOW BRIGHT THE LITTLE DIPPER WAS AND AS I LOOKED CLOSER I SEEN AND COUNTED 27 BRIGHT ORANGE'ISH RED ROUND OBJECTS THINKING THEY WERE PLAINS COMING FROM THE NE HEADED SOUTH WEST TOWARDS SACRAMENTO, I WAITED A MIN OR TWO AND RAN HOME TO GET THE CAMERA WHICH WAS DEAD CHANGED THE BATTERIES WHILE MY STEP SON AND WIFE WATCHED THEM. I TRIED TO GET WITH FLASH THAN WITH OUT FLASH AND CAPTURED 6 ON CAMERA AND AS I WAS SHOOTING THEY WERE STILL FOR ABOUT 10 TO 15  MIN AND THEN SHOT STRAIGHT NORTH OUT OF SIGHT. I KNOW NOTHING WE HAD COULD MOVE THAT FAST WITH OUT MAKING NOISE AND NO FLASHING LIGHTS AND NO TRAIL OF SMOKE , NO AFTER BURNERS OR ICE CRYSTALS FROM THE ALTITUDE. I WOULD PUT THEM OVER THE REST STOP ON 99 TO NATOMAS OUT SIDE SACRAMENTO. IT WAS ALMOST AS THEY WERE TURNING IN A CIRCULAR MOTION WITH EACH OTHER UNTIL HALF OR 10 SHOT OFF FASTER THAN LIGHTNING WOULD STRIKE THE EARTH LEAVING A BLUR BEHIND. I STILL HAVE THE PIC. ON MY CAMERA. MY GRAND FATHER AND UNCLE ARE RETIRED FROM ARROW JET GENERAL AS ENGINEERS OFF HWY50 AND I HAVE BEEN TO AIR SHOWS AND WATCHED NASA ALL MY LIFE AND NOTHING COULD CATCH THESE. FROM HOVERING STILL TO GONE IN A FLASH.   NOT A SMOKER, NOT DOING DRUGS OF ANY KIND, DO NOT DRINK AND LIVED IN SACRAMENTO ALL  MY LIFE AND NEVER BEEN ARRESTED OR BEEN COMMITTED. SOUND MIND AND BODY WHEN I SAY THEY DEFY ALL OUR ADVANCED KNOWLEDGE ON EARTH. WIFE AND STEP SON WERE DUMBFOUNDED BY WHAT THEY SEEN IN SOUND MIND THIS WORM CLEAR NIGHT.   AIRPORT TRAFFIC TO SACRAMENTO INTERNATIONAL YOU CAN DEFINE AS AIR CRAFT AND THESE WERE NOT WHAT I HAVE EVER SEEN BEFORE.",
      "link": "http://www.nuforc.org/webreports/091/S91032.html",
      "state": "CA",
      "duration": "25 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bd200",
      "summary": "Video footage of a disk like object in the Sacramento night sky.",
      "city": "sacramento",
      "shape": "disk",
      "date": "2012-09-24T00:00:00",
      "story": "Video footage of a disk like object in the Sacramento night sky. The event happened about 9pm on Friday August 24th. I saw a glowing orb in the sky from the corner of my eye, that at first glance, thought was a shooting star. When I turned and looked I noticed it was moving way too slow to be a shooting star, yet too fast to be a plane. The object, to the naked eye looked like an orb. I ran and got my neighbor to get his video camera out. Upon zooming in on the object you can clearly see a disk like object. It moved in a straight line across the sky, then disappeared. Then about 30 minutes later I saw the same object take off out into the sky in the same place that I had originally saw it appear. I live near an airport and I have seen many aircraft in the night sky, this was definitely not an airplane.",
      "link": "http://www.nuforc.org/webreports/092/S92135.html",
      "state": "CA",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bd334",
      "summary": "Bright blue fire balls in night sky over south sacramento",
      "city": "sacramento",
      "shape": "fireball",
      "date": "2012-10-30T00:00:00",
      "story": "Bright blue fire balls in night sky over south sacramento over the last month and a half my daughter and my self have witnissed extreamly bright blue fire balls desending mid ski straight down ad disapering behind the tree lines and roof tops as if they landed a few blocks away.  This event has been happing on a nightly bases and we sat and counted atleast seven of them in one night. at first i thought they where medors but with the amount of them and the consistody im not shure now.  Any one know what im looking at? and why because ive seen many shooting stars but they have never been this bright almost neon blue.",
      "link": "http://www.nuforc.org/webreports/093/S93205.html",
      "state": "CA",
      "duration": "3 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bd3ea",
      "summary": "Bright blue light in sky above Airbase Rd. near Watt Ave.",
      "city": "sacramento",
      "shape": "changing",
      "date": "2012-08-05T00:00:00",
      "story": "Bright blue light in sky above Airbase Rd. near Watt Ave.",
      "link": "http://www.nuforc.org/webreports/090/S90592.html",
      "state": "CA",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bd3fd",
      "summary": "A huge stealthy triangle-shaped craft travels from north to south at a fantastic speed.",
      "city": "sacramento",
      "shape": "triangle",
      "date": "2012-09-24T00:00:00",
      "story": "A huge stealthy triangle-shaped craft travels from north to south at a fantastic speed. When outside of my home looking north into the night sky I noticed a triangular-shaped craft heading south toward my location. The object appeared to be immense in size although distant.It was very faint and stealthy as it moved at extraordinary speed. Once it got closer I noticed white lights at each corner of an extended triangle-shaped craft.It emitted no sound,even once above my home. I observed it go from the northern horizon to the southern horizon in about 30 seconds.  Even though the object could be noticed only by the three triangle-corner edge lights, It had an awesome,intimidating presence.It was moving too fast to go get a camera so I just watched the smooth-floating object as it faded into the night sky.",
      "link": "http://www.nuforc.org/webreports/092/S92329.html",
      "state": "CA",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bd54a",
      "summary": "Feb 8th I saw 4 orange orbs low on the horizon looking northwest from the levy of the Sacramento river around 9 pm the orbs were not mo",
      "city": "sacramento",
      "shape": "fireball",
      "date": "2012-05-13T00:00:00",
      "story": "Feb 8th I saw 4 orange orbs low on the horizon looking northwest from the levy of the Sacramento river around 9 pm the orbs were not moving then vanished 1 at a time the event lasted about 4 minutes maybe a UFO   ",
      "link": "http://www.nuforc.org/webreports/087/S87811.html",
      "state": "CA",
      "duration": "4 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bd5b1",
      "summary": "3 bright colorful lights, flying wild off each other. Playfully? Clear night, very visable, great view",
      "city": "sacramento",
      "shape": "light",
      "date": "2012-05-13T00:00:00",
      "story": "3 bright colorful lights, flying wild off each other. Playfully? Clear night, very visable, great view From Hwy 5, driving north, Sac’s old train station to Arco arena, 3 maneuvering lights, very bright, one white, one blue/pink, one very unusual purple.  Flying in a bobbing pattern off each other, speedy and low, very clear and very visible.  How could nobody else have seen these? It was a clear and cold night.  The lights were very bright and attractive I thought at first it was light show but no clouds.  These lights were controlled, very fast, very close and low in the sky.  Just above the buildings of the city and brighter than any city lights.",
      "link": "http://www.nuforc.org/webreports/088/S88331.html",
      "state": "CA",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bd784",
      "summary": "Blue spiral with white orb floating into it.",
      "city": "sacramento",
      "shape": "other",
      "date": "2012-07-04T00:00:00",
      "story": "Blue spiral with white orb floating into it. I was parked at a fast food location in the city of Antelope, California.  At around 7:00-7:15 p.m. I got out of my car and looked to the West of my location.  I was shocked to see a bluish spiral in the sky which appeared to look like a coil with one side being a very tight circle and slowly expanding to a very large circle. This spiral appeared to be rotating and was only a few hundred feet above the tree line.  I then noticed that a small white orb was floating into the large circle side of this spiral and as soon as the orb entered the spiral, the entire thing seemed to close in on itself like an accordion and then it all vanished.  I found this amazing due to the fact that this location was less than a mile north of an old military base called McClennan Air Force base.  I had no idea what I saw but in the time after I feel my entire life shifted. The entire thing only lasted two minutes and nobody around me seemed to notice.  I wanted to get a picture, but I was frozen and could not take my eyes off of this event.  It was oddly mesmerizing.",
      "link": "http://www.nuforc.org/webreports/089/S89853.html",
      "state": "CA",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bd9b5",
      "summary": "I could her no soud or see them move but they were there and changed positions in formaion .",
      "city": "sacramento",
      "shape": "formation",
      "date": "2012-07-04T00:00:00",
      "story": "I could her no soud or see them move but they were there and changed positions in formaion . I have 25 pictues of the Lunar Moon UFO formation taking in 15 minute intervals of differet formations aligning the Luunar moon. It as very cloudy that night and I went to capture history due to the Solar Eclipse being ten days before. When I looked through my camera phone I could see these lights in a formation by the moon.",
      "link": "http://www.nuforc.org/webreports/089/S89967.html",
      "state": "CA",
      "duration": "1 hour"
    },
    {
      "_id": "64d005f478aba2ec5a3bd9b7",
      "summary": "Bluish pulsing light moving East to West over Sacramento, CA",
      "city": "sacramento",
      "shape": "light",
      "date": "2012-07-04T00:00:00",
      "story": "Bluish pulsing light moving East to West over Sacramento, CA I was outside with my girlfriend smoking cigarettes at the Red Lion Inn in front of our room in Sacramento and looking up at the night sky. We observed and noted the Big Dipper constellation. I then noticed a bluish light a bit larger in size than the stars making up the Big Dipper. I asked my girlfriend if she saw it and confirmed she did as well. We both observed this light move from East to West over Sacramento. It blinked on and off about every 5 seconds.  There were no visible clouds at all. This ruled out the blinking of the object to be from passing behind clouds. We heard no sounds at all overhead. The object moved from just under the handle of the Big Dipper to above the star Arcturus in about 20 seconds. We were able to figure out that it was Arcturus using the Google Sky Map app on my girlfriends phone. It then continued across the sky another 10 seconds and then changed direction in a right angle turn that appeared to head downwards as if coming to an abrupt stop and then descending. The object appeared to descend for about 5 seconds and then disappeared entirely.  The time durations are based on the blinking interval that seemed to again be every 5 seconds. The object was nearly invisible to the naked eye and would only be seen every 5 seconds when it emitted a bright blink or flash that was bluish in color. It was like tracking a firefly flying across your backyard. I noted the time of the event after first seeing the object by checking my watch.  It was a full 11 minutes before the ISS was supposed to transit the sky at 3:46am for that Lat and Long as confirmed by spaceweather.com. I do not believe it was the space station. There were no meteor showers anticipated for the evening either.  I have seen &quot;shooting stars&quot; and this did not match what I have seen during meteor showers. There were no other colored lights such as red to indicate this was a commercial or military aircraft. I may be tempted to believe this was a satellite except for the sharp stop and direction changed we observed in addition to the bright flash it made every 5 seconds as it transited the sky.",
      "link": "http://www.nuforc.org/webreports/089/S89795.html",
      "state": "CA",
      "duration": "45 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bd9b4",
      "summary": "I could not hear sound or see them move but I saw the formations by the Lunar Moon.",
      "city": "sacramento",
      "shape": "formation",
      "date": "2012-07-04T00:00:00",
      "story": "I could not hear sound or see them move but I saw the formations by the Lunar Moon. I went to capture the Lunar Moon on camera. i wanted to capture history as the Solar Eclipse had been ten days before and the Venus transit due the next day. It was cloudy that morning and all I could see was the Lunar Moon without stars,  As I began to take photos I saw these other lights in formation beside the moon. I took the camera down to see f I could see them with the naked eye and could not. I have 25 pictures from that night taken in fifteen minute untervals.",
      "link": "http://www.nuforc.org/webreports/089/S89968.html",
      "state": "CA",
      "duration": "1 hour"
    },
    {
      "_id": "64d005f478aba2ec5a3bdfaf",
      "summary": "Three white dots each in a triangle formation and then faded away.",
      "city": "sacramento",
      "shape": "triangle",
      "date": "2012-05-13T00:00:00",
      "story": "Three white dots each in a triangle formation and then faded away. I just finished cutting my back lawn and was out of breath a little and turned off the mower and laid on the sidewalk between the garage and my plum tree.  As I looked up I saw 6 to 9 triangle lights kind of in formation right between the tree and the garage.  As I watched them they moved forward and the back a little and then forward and back again.  I raised my glasses because they can foul me up and when I did I saw just white dots.  But they were still there.  I put my glasses back on and there were three white dots for each one as the move up and back.  This went on for about 35-45 seconds and then the just disappeared.  The sky was blue or as blue as it gets in downtown Sacramento. I have seen pictures of ufo’s that look like what I saw.  Three large round white lights on the bottom in a triangle shape.  There were more than six and maybe as many as nine sets of three lights in a triangle formation but not fixed to each other.  Never seen anything like it, ever.  The way they just faded out was interesting too.",
      "link": "http://www.nuforc.org/webreports/088/S88546.html",
      "state": "CA",
      "duration": "45 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3be117",
      "summary": "Soundless gray sphere near Sacramento International airport",
      "city": "sacramento",
      "shape": "sphere",
      "date": "2012-11-04T00:00:00",
      "story": "Soundless gray sphere near Sacramento International airport I live 7 miles southeast of Sacramento Intl airport and see and hear aircraft constantly. On Wed 10-31-12 at 10:25pm while standing just outside my garage door I noticed a soundless low flying sphere shaped object heading north approx 150 ft up and estimated 500 yds away to the NW of my position on Del Paso Road.  There were no lights on it or coming from within, but it appeared gray in color at night.  It was moving way faster than a bird could fly. It flew in a straight line north but seemed to bob up and down irregularly. Then suddenly, just before it left my line of sight right above the distant tree line, it vanished for a split second then I saw a brilliant white/yellow flash.  What baffled me most was the shape and size of this flash.  Its shape looked like a pie slice with hard edges and about 5 times the original size of the sphere. The duration of the event was no longer than 10 seconds.   There was a light rain falling and calm winds.  Gray.",
      "link": "http://www.nuforc.org/webreports/094/S94046.html",
      "state": "CA",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3be15e",
      "summary": "Planes flew by and as I was watching them pass I saw a saucer with another smaller saucer on top. At first I thought it was clouds and",
      "city": "sacramento",
      "shape": "disk",
      "date": "2012-10-30T00:00:00",
      "story": "Planes flew by and as I was watching them pass I saw a saucer with another smaller saucer on top. At first I thought it was clouds and I kept looking.  Then it appeared again.  Both sighting happened in the same space in the sky and lasted only seconds.  Unbelievable!! 4-5 planes very high in the sky flew about 3 min apart in the same area afterwards. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/093/S93879.html",
      "state": "CA",
      "duration": "2 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3be380",
      "summary": "Blue and white light moving and flashing lights downward",
      "city": "sacramento",
      "shape": "light",
      "date": "2012-08-05T00:00:00",
      "story": "Blue and white light moving and flashing lights downward A Bright blue light was moving vertically up and down, occasionally switching to white with no pattern at all.  It moved up and down repeatedly at a very quick speed again with no particular pattern or timing.  It began to flash blue and white lights down while still being lit up and moving up and down.  Then it turned blue once more and went all the way down until it was no longer visible and did not come back up again. The whole thing lasted about 4 minutes.",
      "link": "http://www.nuforc.org/webreports/091/S91386.html",
      "state": "CA",
      "duration": "4 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3be59c",
      "summary": "The flying object caught my attention because it was so beautifu, it flew so fast the I only saw it for about 3 seconds.",
      "city": "sacramento",
      "shape": "disk",
      "date": "2012-03-13T00:00:00",
      "story": "The flying object caught my attention because it was so beautifu, it flew so fast the I only saw it for about 3 seconds. I look toward my picture window in my living room at approximately 10:38 pm and saw a flying object about the size of a dime (held at arms length) flying through the sky.  It caught my attention because it was so beautiful, the colors were white, red, blue and yellow, but it was spinning clockwise and it flew so fast the I only saw it for about 3 seconds and it was out of sight, then I heard a noise like the sound of a jet--but it was not jet. My window faces North, but the object came across from a easterly direction.  I felt compelled to run to the window to see it as it went by, but it was gone before I could move.  I am on the 5th floor of a 9-story apartment building and my window is even with the tops of most trees.",
      "link": "http://www.nuforc.org/webreports/087/S87216.html",
      "state": "CA",
      "duration": "3 seconds or less"
    },
    {
      "_id": "64d005f478aba2ec5a3be961",
      "summary": "Moving blue light in night sky in Sacramento, CA. Unusual color. March 3, 2012",
      "city": "sacramento",
      "shape": "light",
      "date": "2012-03-13T00:00:00",
      "story": "Moving blue light in night sky in Sacramento, CA. Unusual color. March 3, 2012 Seen in Western Sky or WNW sky over Sacramento, California on March 3d, 2012 at approximately 8:42 PM for about 10 minutes by two people (Husband age 63 and wife, slightly younger)  Appeared as a blue light in the sky that seemed more purple/blue to the husband, more blue to wife.  Have pics. Some red was see by husband and wife but only a little and a little white light seen by wife who has better eyesight.  No lights were flashing. Appeared to be moving fairly low in sky, not flashing and fading in and almost out.  There MAY have been another fainter, light color light in sky with blue light. hard to say.  Cam shows a light but it is possible it was a low in the sky planet or star (shown in one pic)   Viewed from Dealynn St. address just South of Hurley in general direction of Sacramento Metro Airport. No air traffic appeared from this direction although it is a common a busy route for large, commercial aircraft coming from Metro Airport.  Photos were taken with a Sanyo E1090 digital camera on a night setting using full telephoto (which is both optical and electronic with a 3X optical zoom. Camera set at 12 megapixels. The pic don't seem to capture the almost UV (filtered I guess, purple quality of the light which just seem only blue to wife) Husband wears glasses for nearsightedness. 14 photos taken, a few showed nothing, some showed bright blue wavy lines (as if camera was unsteady and \"took it's time to record image) Partial moon nearly directly over head approx. 10 min after observation.  There was one or more helicopters in sky shortly after seeing light, seemingly unrelated and most likely police helicopter () One was using bright lamp to illuminate ground. Helicopter lights were traffic light green, white, and red with flashing with noise. Copter was orbiting to south of residence and later one or same north, possibly going to another site or back to base.  Male observer sees a lot of air traffic from location, mostly large airliners coming toward residence from Metro Airport and somewhat to North. The other common air traffic sources are police and possible traffic helicopters which are very common in area. Small airplanes not common in this area. Facing East at this location (front of building, there is some air traffic from a different airport to the North. Often large Coast Guard aircraft and some corporate aircraft. (Large former airbase is to North)  The blue color of the light is what stood out mostly as well as fact that it seemed to linger.",
      "link": "http://www.nuforc.org/webreports/087/S87474.html",
      "state": "CA",
      "duration": "10 min. ?"
    },
    {
      "_id": "64d005f478aba2ec5a3bea12",
      "summary": "Dark, noiseless, floating V shaped object, moving from south to north, morphing shape",
      "city": "sacramento",
      "shape": "changing",
      "date": "2012-03-13T00:00:00",
      "story": "Dark, noiseless, floating V shaped object, moving from south to north, morphing shape Sitting in backyard, stargazing, the sky is clear overhead and to the south, cloud bank to the north.  Moon not yet risen. I am looking in the direction of Orion (to the south) and happen to notice a dark, V shaped object, appearing very much like formation of geese.  It was nearly the same color as the sky, un-iluminated except by light pollution of Sacramento.  It moved at a constant speed from south-north and passed directly overhead.  It appeared to be ~1000-2000 ft in altitude, though that is pure speculation--it was about 3-4in in length from where I was sitting. As it approached I noticed that it was a continuous shape with no discreet elements.  The point of the V was forward and the tails were moving in somewhat of a ribbon-fashion.  At one point the tails angled sharply inward to form an almost complete outline of a triangle.  As it passed into the north the whole length began curling around and overlapping, somewhat like a treble clef.  It was noiseless and was not accelerating.",
      "link": "http://www.nuforc.org/webreports/087/S87614.html",
      "state": "CA",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3beb93",
      "summary": "Bright white pulsating light, changing in shape and color (white, red, and blue).",
      "city": "sacramento",
      "shape": "changing",
      "date": "2013-09-09T00:00:00",
      "story": "Bright white pulsating light, changing in shape and color (white, red, and blue) It was dark out side with a hint of light still on the horizon.  I was out on my back porch when I stood up to look at the sky and saw a very bright light, low in the sky towards the horizon.  I quickly looked around at the other dim stars and realized this was too big and too bright to be a star.  I was staring at the light for a couple minutes and noticed it changing in shape from what looked a traditional star (shape), circle, and to a triangle. It was not moving but was pulsating, and would pulse hints of red and blue.  I knew it was not a plane; as one was passing over me, closer then the light but was still smaller and dimmer then the light. I got the light on video for about 2 ½ minutes. I am not so sure how to work the zoom on my phone so it does not do it much justice, but you can clearly see it and even a plane passing by, which looks completely different.  The stars where not visible on my video because they were so faint. I am sure it was not a star or plane.  I had to go inside to but my baby to sleep as he started fussing.  I did not want to leave the light, as I felt it was going to do something. It was just something I have never witnessed before. It was almost mesmerizing.  I came back outside immediately after I put my son back to sleep and it was gone.  There were no stars even remotely close to the size and brightness of it.  It had been about 10-15 minutes between when I left it and came back. I can send the video if you are interested.  It is not very good video but you can see the light. Observer: 26 year old female, nursing student and mother of an 8 month old son. I am wondering if anybody else in Sacramento saw this?",
      "link": "http://www.nuforc.org/webreports/101/S101978.html",
      "state": "CA",
      "duration": "~10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bed2d",
      "summary": "Stationary in sky for 15 minutes, then shot away into sky faster than sound, maybe as fast as light.",
      "city": "sacramento",
      "shape": "unknown",
      "date": "2013-05-15T00:00:00",
      "story": "Stationary in sky for 15 minutes, then shot away into sky faster than sound, maybe as fast as light. I simply saw an aircraft stay in one place for about fifteen minutes, then shoot off into the sky as fast as a beam of light lights a room.  (There was a fellow there witnessing it with me at the time).  It was far away, so the best description is that it did have what seemed to be saucer shaped lighting around the bottom of the craft. As one light to my left would come on, one on the right would go off.  They were white light.  I've no idea how something stationary could instantly propel away with such a great speed.  From where we were, there was no contrail.  I was too far away to hear or not hear any noise.  There is high probability this craft was near Beale Air Force Base. The best part of this story is what happened three days later. I saw another set of lights in the sky, moving slow over the city.  This was however very very different then what I had seen before, so I decided to try to get under it.  I entered the freeway and headed in the direction of the plane until I was able to get underneath it while exiting on 34th street.  I slowed and stuck my head out to look up.  It was a crop duster with white lights in rows along the entire surface area of the bottom of the wings.  I feel this was to cover up the sighting three days earlier. This happened in Sacramento, Ca, in summer of 1999. ((NUFORC Note:  Witness indicates that the date is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/097/S97710.html",
      "state": "CA",
      "duration": "15-20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bed7b",
      "summary": "Boomerang shaped wing, flying silent and low over the I-5 outside of Sacramento.",
      "city": "sacramento",
      "shape": "other",
      "date": "2013-05-15T00:00:00",
      "story": "Boomerang shaped wing, flying silent and low over the I-5 outside of Sacramento. In August of 2010, I was staying in Los Angeles for about two months while teaching some Gracie Jiu-Jitsu seminars there. I headed back home (Southern Utah) in October, but decided to go through Northern California, see some friends in Sacramento, then head to Salt Lake City and stay with family for a few days before returning. I took the PCH to somewhere around San Luis Obispo or Paso Robles, then I believe I cut east to the I-5. It was very late (or early)... maybe 3 or 4am... I was about an hour and a half from Sacramento in some rural area with a lot of farm land from what I could tell. From maybe 1 mile away, I started seeing some lights that were really bright and aiming straight down. I slowed down to about 45 miles per hour and was watching them flying from east to west, VERY low (maybe 30' from the ground) over a field, then they would lift to maybe 80' as they flew over the Interstate, then dropped down again on the west side of it. As I got closer, I noticed that a semi was parked almost directly under the line of flight on the east shoulder of the I-5 North I drove up a little further and parked as well. There was almost no traffic at all, so I got out and watched. Being that close, it looked like a large, boomerang shaped wing with 4 or 5 lights (it's been a while and I don't recall exactly how many) aimed straight down. It was completely silent and I estimate it was around 40'-50' from tip to tip. Again, it would fly over the Interstate heading east (toward a little ranch house approximately .5 miles east of the shoulder I was parked on), 20'-30' above the field, then it would raise in elevation right before the ranch house, continue out maybe another mile, make a smooth turn south, and fly directly back to the west again. Always descending in elevation over the field, then raising up over the Interstate, then dropping again. I watched it for around 30 minutes and then decided to continue on. I have been searching for anyone else who may have seen something like that near Sacramento. I simply want to know if it was a civilian or military craft, or something else. If it was civilian or military, why would they be flying over someone's house with spotlights on, over and over and over? And what kind of craft makes absolutely no noise except for the sound of moving through the air? I know it seems strange to write now, but I have wanted some kind of answer since I saw it. ((NUFORC Note:  Witness indicates that the date is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/096/S96989.html",
      "state": "CA",
      "duration": "30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bedae",
      "summary": "3 Circular Lights Seen in Sacramento.",
      "city": "sacramento",
      "shape": "circle",
      "date": "2013-05-15T00:00:00",
      "story": "3 Circular Lights Seen in Sacramento We were driving on Folsom Blvd. stopped at traffic light.   I noticed the lights and it was odd but I ignored it until we forwarded and saw them in a better view.  Three circle lights were hovering.   Two smaller than one.  Then two dissolved. 30 secs later the bigger one disappeared.  Positive - it was an odd looking circular light and hovering.",
      "link": "http://www.nuforc.org/webreports/097/S97132.html",
      "state": "CA",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bee5e",
      "summary": "Orange/amber sphere sacramento",
      "city": "sacramento",
      "shape": "fireball",
      "date": "2013-08-30T00:00:00",
      "story": "Orange/amber sphere sacramento Slow moving orange amber round object, slow moving but traveled a sizable distance quickly and the just faded out.   Made no sound even though it should have been audible as close as it was to my proximity when I first spotted it.",
      "link": "http://www.nuforc.org/webreports/100/S100798.html",
      "state": "CA",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bf0a3",
      "summary": "Orange red glowing orbs chaging patterns and directions then zapping out",
      "city": "sacramento",
      "shape": "fireball",
      "date": "2013-07-03T00:00:00",
      "story": "Orange red glowing orbs chaging patterns and directions then zapping out Changing patterns less then 300 feet high over crowd with cameras.  Very clear and I have pictures",
      "link": "http://www.nuforc.org/webreports/098/S98565.html",
      "state": "CA",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bf0e7",
      "summary": "20-30 orange/red lights flying over freeway",
      "city": "sacramento",
      "shape": "unknown",
      "date": "2013-07-03T00:00:00",
      "story": "20-30 orange/red lights flying over freeway On Saturday evening June 1, 2013 at about 9:45pm my two sons and I witnessed a cluster of orange/red lights Flying over interstate 5 about 10 miles south of downtown Sacramento, Ca… What struck me as odd?  Was that there were 20 to 30 lights flying at low altitude, perhaps 1000 to 2000 feet above the ground.  The lights seemed to be attached to some kind of craft because they were all moving together in Unisom But we could not see a craft. We were driving northbound on I-5 as we approached the lights moving very slowly across the freeway.  They took up a large area across the freeway but as I mentioned we could not see a craft.  My one son thought they may be helicopters flying together but they were moving silently and at a very slow speed. When I caught up to lights and passed underneath them I immediately looked in my rearview mirror  to see where they were going. I saw nothing ,either whatever it was left without me seeing it or the craft or lights could only be seen from one side. Again I could not see a craft nor could my sons just the lights. I asked my 13 twin boys if they too were seeing the lights to make sure I wasn’t imagining things they confirmed seeing the same thing I was seeing. I work as a photojournalist for a local TV station. I called the station to see if anyone else had reported seeing the lights. The person working the assignment desk told  me they had gotten reports about  orange/red lights in the sky the night before, Friday May 31, 2013… In my career I have seen and flown in many Military aircraft and have also flown in helicopters covering news events. But this was really different there were no white or red blinking lights usually seen on airplanes and I would expect an aircraft flying that low would be very loud and we did not hear a sound.",
      "link": "http://www.nuforc.org/webreports/098/S98928.html",
      "state": "CA",
      "duration": "2-3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bf20f",
      "summary": "Silver round shaped object with a smokey haze around it",
      "city": "sacramento",
      "shape": "oval",
      "date": "2013-08-30T00:00:00",
      "story": "silver round shaped object with a smokey haze around it Saw a object hovering in a spot over central Sacramento it hovered for a minute then zoomed off a mile or so then hovered again I was able to capture a picture of it on my cell phone quickly then went inside to get my Camera for a better view and by the time I was able to focus on it, it had literally disappeared.",
      "link": "http://www.nuforc.org/webreports/101/S101026.html",
      "state": "CA",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bf37e",
      "summary": "I saw a huge Triangle by Sacramento CA",
      "city": "sacramento",
      "shape": "triangle",
      "date": "2013-02-04T00:00:00",
      "story": "I saw a huge Triangle by Sacramento, CA. We were headed north from sacramento to yuba city and were over a bridge and my brother and I saw a huge Triangle with two side's and two big white light's and some red light's.   It went slowly over the bridge and just keep going south east.   And down the road there was a full Triangle with a werd ractangle box on the back of it that was lite up red.",
      "link": "http://www.nuforc.org/webreports/095/S95451.html",
      "state": "CA",
      "duration": "south east"
    },
    {
      "_id": "64d005f478aba2ec5a3bf3b3",
      "summary": "It was dark above the sky and there was three circle with white lights moving very slowly. We pulled over and park at the parking lot.",
      "city": "sacramento",
      "shape": "circle",
      "date": "2013-05-15T00:00:00",
      "story": "It was dark above the sky and there was three circle with white lights moving very slowly.  We pulled over and park at the parking lot.  We watched the three UFOs above the sky moved very slowly.  The first object moved slowly and then disappeared so fast. The 2nd and the third objects moved very slowly and then disappeared so quickly.  We do not see any objects above the sky.  It was quiet night tonight.",
      "link": "http://www.nuforc.org/webreports/097/S97131.html",
      "state": "CA",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bf736",
      "summary": "20 orange orbs hovering over Sacramento for at least 30 minutes.",
      "city": "sacramento",
      "shape": "sphere",
      "date": "2013-09-30T00:00:00",
      "story": "20 orange orbs hovering over Sacramento for at least 30 minutes. My daughter called me at 8:20 PM on her way to work.  Her words: \" I  saw the strangest sight in the sky as I drove to work tonight. In the western sky looking from the Auburn Blvd/Watt Avenue area, there were about 20 orange dots.  I keep thinking about it, where they Chinese lanterns, flares, planes or some sort of Soltice celebration?  Or, were they UFOs? They hovered in the sky, one falling to earth and turning white in color. I know that flares can be caught in an updraft and \"hover\".  I saw a helicopter head that way as I drove and by the time I got to work at 8:55, poof, nothing in the sky.  Stars don't change color, and are not that bright that low. Planes at least move.\"   She called me at 8:30 PM and I witnessed the following:  \"I was able to see approx 10 orbs from the Foothill Farms area of Sacramento looking to the west toward Sacramento: 1 orange/white one with white orbs on either side and lower, and one above another - all very low in the sky - approx 30 degrees.  Then a string of 7 more above them.  I watched them for approx 15 minutes; I could only detect slight movement during those 15 minutes.  I called a friend in the Greenhaven area of Sacramento (south and west of Sacramento proper) but they didn't see anything. I called a friend in the Cal Expo area - she ran outside and spotted three  orange orbs hovering over Cal Expo, but when a plane approached the orbs, the orbs disappeared.  By 8:40, the lower string of orbs had moved closer to the ground and I lost sight of them by 8:49, although I could still see the higher string of 7 and the one orange/white one lower in the sky.",
      "link": "http://www.nuforc.org/webreports/102/S102573.html",
      "state": "CA",
      "duration": "30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bf735",
      "summary": "Orange lights in the sky over Sacramento, CA.",
      "city": "sacramento",
      "shape": "formation",
      "date": "2013-09-30T00:00:00",
      "story": "Orange lights in the sky over Sacramento, CA. While driving to work on the above  date, I saw  approximately 20 orange dots in the sky. I was driving westbound on Auburn Blvd near Norris.  The  orange dots were low in the sky and not in any uniform formation.  I immediately called my mother and she in turn called a friend. All 3 of us saw the same same thing from 3 different locations within Sacramento , CA. I have been going over all of the possibilities in my head as to what t this could have been. h Te sun had already set and there was no sunset after glow.  We do have an airport, but even if it was planes lining up to land, they would be moving and not that close together. Maybe it was Chinese lanterns for a soltice celebration?  Did our local military drop flares from an aircraft?? One of the orange dots actually started to \"fall to the ground.  It turned white in color and stopped falling and hovered in place. All of the other orange dots stayed in place.  One of the dots had 2 smaller dots that moved erratically around it in very close proximity.  When I finally got work I could no longer see the dots in the sky.  On my way to work, I had to make a turn onto another street going southbound and that is when I lost sight of the dots.  My mother and her friend both kept watching them. I saw a helicopter, possibly local law enforcement or the news, travel at a high rate of speed towards the dots.  My mothers friend said she saw a plane approach the dots and they just went away. I don't know if they flew off or just vanished.  I will try to get clarification. Here are some final thoughts: I drive a sports car, which means it sits very low and the windshield has a limited view.  These dots were not that high up, but not ground level either.  My mothers friend lives near the Capital City Freeway (business 80] and Cal Expo. This means there is a lot of light pollution, and these things were very visible in the sky to her.  I have looked online at the local news sites, nothing is mentioned.  I even looked at the airport website, no mention of any major events that would require 20 planes to be in the area.  There were about 6 planes that landed in the time frame this took place.  I don't know where else to look for answers. I am trying to be logical, but this just baffles me.  If it was actual alien UFOs, awesome, if not, then ok, but what was it?  Curiosity is killing this cat. Thank you for your time and energy. Credit to Coast To Coast AM for turning me on to you.",
      "link": "http://www.nuforc.org/webreports/102/S102547.html",
      "state": "CA",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bf802",
      "summary": "Orange ball of flame crosses North Sacramento - no news reports.",
      "city": "sacramento",
      "shape": "fireball",
      "date": "2012-12-20T00:00:00",
      "story": "Orange ball of flame crosses North Sacramento - no news reports 11/11/2012 approx. 1757 hrs. Driving north on Morse Ave. from El Camino in North Sacramento, observed large bright yellow orange light traveling from NNW.  I stopped my vehicle to get better view through tree branches. The object moved at a deliberate pace along a flight path nearly due south.  As it passed overhead, it appeared to be a slowly roiling ball of orange flame, however showed no disturbance from surrounding air, no streaking, no trail, and no discernible noise. I tried to observe signs of craft disintegration due to inflight emergency, but no debris or disturbance of flight path was visible.  Duration of the observation was no more than 3 minutes from the appearance at 40 degrees above the N horizon to 30 degrees above S horizon when the object flashed off and on 2-3 times before disappearing from view.  As remarkable as this sight was, the relatively undramatic speed and straight path made the appearance seem relatively mundane. I was raised in the approach path of a civil airport and have lived for 18 yrs. within ½ mile of the local airbase , and am quite familiar with the appearance of all manner of civilian, commercial and military craft in nearly all conditions; this one, despite the lackadaisical pace, was unique in my experience.",
      "link": "http://www.nuforc.org/webreports/094/S94683.html",
      "state": "CA",
      "duration": "3+ minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bf84b",
      "summary": "Orange fireball heading down to ground",
      "city": "sacramento",
      "shape": "fireball",
      "date": "2012-12-20T00:00:00",
      "story": "Orange fireball heading down to ground I decided to report this after reading about the fireballs seen three days later.  What others reported is the same as I saw; a orange red fireball very low and seemingly heading towards earth.   I saw it for only a moment and lost sight of it as it was so low it went behind some 2 story buildings & trees. Moved quickly but was very large and had a firey tail. No sounds.  My wife and I saw it 5 seconds after stepping outside for a cigarette._",
      "link": "http://www.nuforc.org/webreports/094/S94758.html",
      "state": "CA",
      "duration": "3 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bfb41",
      "summary": "Triangle shaped craft 200 feet up flying slowly overhead, slight noise from engine after passing over.",
      "city": "sacramento",
      "shape": "triangle",
      "date": "2012-12-20T00:00:00",
      "story": "triangle shaped craft 200 feet up flying slowly overhead, slight noise from engine after passing over November 22, 3:30am I was outside in the backyard after arriving home from work (without a camera) looking up at the sky to the east, a line of 5-6 blinking lights caught my eye, it wasn’t a plane.  Looked like green,yellow and red blinking back and forth on one craft.   Stationary at one low level in the sky.  Looked at it for maybe two minutes, (craft @ 2miles away) went over to my porch for less than a minute, went back into the yard and saw the craft about 6 houses away not with blinking lights but now with 5 - bright headlights (like on a car but spaced) seemed to be coming straight for me, no noise from craft, I became afraid and stepped under my porch, walked to the other side of my porch and saw a triangle shaped craft (somewhat like a stealth bomber), flat black, no lights anywhere under the craft, no moon in the sky so it blended into the sky very well.  Looked to be @ 200 ft in the sky, now all lights off, maybe the size of my two story home, I could barely hear the noise from the eng! ine,sounded more like rushing air than a gas powered engine.   I was able to see that is was real because it seemed to be flying at a very slow speed, @ 20 mph. I lost sight of it as it went west through the neighborhood.",
      "link": "http://www.nuforc.org/webreports/095/S95183.html",
      "state": "CA",
      "duration": "6-7 mins"
    },
    {
      "_id": "64d005f478aba2ec5a3bfc5e",
      "summary": "At 5:39 pm I was in my backyard and saw lights out of the corner of my eye and looked up in the sky to see a triangular craft with 8 ye",
      "city": "sacramento",
      "shape": "triangle",
      "date": "2013-06-02T00:00:00",
      "story": "At 5:39 pm I was in my backyard and saw lights out of the corner of my eye and looked up in the sky to see a triangular craft with 8 ye ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/098/S98079.html",
      "state": "CA",
      "duration": "30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bfda9",
      "summary": "Strange lights (10-12) in stringlike formation that suddenly drifted apart appeared round in shape with copper like glow illumination.",
      "city": "sacramento",
      "shape": "other",
      "date": "2012-12-20T00:00:00",
      "story": "Strange lights(10-12)  in stringlike formation that suddenly drifted aparted appeared  round in shape with copper like glow illuminating the  sky wen it appeared to be moving across sky with a slight blurr  the lites  began to fade as if leaving the line of sight.   My adult son, his dad and myself still unsure of what we had seen?",
      "link": "http://www.nuforc.org/webreports/094/S94780.html",
      "state": "CA",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3bfdfc",
      "summary": "A large, circular, bright, white light appeared in the night sky traveling at a high rate of speed and disappeared in thin air.",
      "city": "sacramento",
      "shape": "circle",
      "date": "2013-07-14T00:00:00",
      "story": "A large, circular, bright, white light appeared in the night sky traveling at a high rate of speed and disappeared in thin air. I was driving on I-80 East approaching West Sacramento at approximately 10:30 p.m. A  large, circular, bright, white light appeared in the sky in front of my car. It was traveling at a very high rate of speed and disappeared into thin air. I saw it through very top of my windshield. The sky was clear and there were no other objects in sight. It was much too low to be a plane. It was not a shooting star. It was visable for maybe 2 seconds. I had the window down in my car, the object emitted no sounds that I could hear. My friend was following me in his car. We were returning from Santa Rosa and had been in transit for about two hours. My friend was at a distance of approximately a half mile behind me, so he viewed the object from further away than I saw it. The object passed just within my vision. If it had been a second later, it would have been directly above my car or behind me and I would not have seen it. When we arrived home in Applegate about 45 minutes later, I told my friend that I had seen something in the sky. He said he had also witnessed the object and described it exactly as I had seen it, except he had viewed it from further away. We are both in awe and have never seen anything like it before.",
      "link": "http://www.nuforc.org/webreports/099/S99971.html",
      "state": "CA",
      "duration": "2 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bfe4f",
      "summary": "On the right side of the moon,two red objects(lights) appeared. They climbed in altitude then faded away into the night sky. They then",
      "city": "sacramento",
      "shape": "light",
      "date": "2013-02-04T00:00:00",
      "story": "On the right side of the moon, two red objects (lights) appeared.   They climbed in altitude then faded away into the night sky.  They then reapeared and followed one another, for about 15 minutes, then faded away slowly again.   We stood staring at the sky for another 20 minutes.   The ufos (lights) were not seen afterward.",
      "link": "http://www.nuforc.org/webreports/095/S95680.html",
      "state": "CA",
      "duration": "20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bfef4",
      "summary": "UFO in first frame then cloaked from video, iPad video five minutes.",
      "city": "sacramento",
      "shape": "circle",
      "date": "2013-06-02T00:00:00",
      "story": "UFO in first frame then cloaked from video,  iPad video five minutes. At first it Looked like a star, then a sphere, then a star..it was close at first...moved to the left slow, and fainter one emerged for a few seconds then disappeared...then it moved to the right, slowly....the sky had puffy white clouds, it was behind it I could see it like a star...then  in the center of a cloud I was able to see it, it was still… I took a five minute video of the sky, my daughter and I watched it and talked about what it was doing as we watched it in the sky video recording it....when I watched the iPad video, it is only visible in the first frame then disappears and is cloaked through out the video. We watched it..but it is only in the first frame.",
      "link": "http://www.nuforc.org/webreports/098/S98134.html",
      "state": "CA",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c006f",
      "summary": "Never seen this before in my life.  I was a little terrified.",
      "city": "sacramento",
      "shape": "light",
      "date": "2013-05-15T00:00:00",
      "story": "Never seen this before in my life.  I was a little terrified. Hello I live in North Highlands, CA. which is on the north side of Sacramento.   Last night I was going for my nightly walk when I looked up into the sky towards the south side of Sacramento and I noticed 5 orange lights in the sky.  They were aligned in a triangular shape or like a pyramid. just sitting and slowly moving in position.  The lights stood there for a minute as the one at the very top began to drop and disappear slowly.   Then after the top one was gone the others began to disappear from the sky as well.",
      "link": "http://www.nuforc.org/webreports/097/S97575.html",
      "state": "CA",
      "duration": "5-10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c0182",
      "summary": "Flashes in the sky are intermittent every 5 minutes",
      "city": "sacramento",
      "shape": "",
      "date": "2013-05-15T00:00:00",
      "story": "Saturday night and it's so quite, duck out in the backyard and looking up w/ my wife's camera i realize the the camera i have in hand hasn't been charge since my wife came back from santa fe ie.  But it doesn't matter, since the flashes in the sky are intermittent every 5 minutes or so in the north east. Lightning no clouds no thunder?",
      "link": "http://www.nuforc.org/webreports/097/S97565.html",
      "state": "CA",
      "duration": "5:00 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c027d",
      "summary": "6-7 Orange/red fireballs seen over Sacramento.",
      "city": "sacramento",
      "shape": "fireball",
      "date": "2013-06-02T00:00:00",
      "story": "6-7 Orange/red fireballs seen over Sacramento. Was driving home on highway 80 in Sacramento and saw bright orange/red fireballs floating in the sky.  They moved slowly around and faded in and out until eventually all but one disappeared in the sky.  The one left flew around for a minute and seemed like it was brighter than the rest.  That one faded and was gone as well eventually.   Many people saw it, we could see people on the side of the road filming it.",
      "link": "http://www.nuforc.org/webreports/098/S98289.html",
      "state": "CA",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c0353",
      "summary": "Orange lights near downtown.",
      "city": "sacramento",
      "shape": "light",
      "date": "2013-02-04T00:00:00",
      "story": "Orange lights near downtown I was driving northbound on highway 99 towards downtown Sacramento at about 5:55 pm on Saturday January 12th.  There was some cloud cover and could not see any stars. I noticed the lights directly in front of my car there were 2 at about 20-25 degrees above the horizon and a third a little farther away at between 15 degrees above horizon. The lights seemed odd to me as there were no  FAA lights. They alternated red and orange. The lights seemed to be moving southbound in my direction.  Two of them went directly over my car, the other was to my right (east) of my car.  The one to the right was the brightest of the three. I did not know if there was any noise as I was in my car with the windows up.  There was also some cloud cover, and the lights were below the clouds. I would be willing to speak to an investigator, if needed.",
      "link": "http://www.nuforc.org/webreports/095/S95975.html",
      "state": "CA",
      "duration": "1-2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c05d9",
      "summary": "7 red lights floating upward over Sacramento 1/25/13.",
      "city": "sacramento",
      "shape": "light",
      "date": "2013-02-04T00:00:00",
      "story": "7 red lights floating upward over Sacramento 1/25/13. On Jan. 25, 2013 approximately 7 pm, my brother and I pulled up in front of my parents house near the intersection of Gerber and Power Inn in Sacramento, CA.  He pointed out some lights in the sky to the southeast.  I observed 7-8 red/orange bright balls of light floating upward at a slightly slower pace than an average airplane travels.  The balls of light were almost twice the size of a star and flickered a little bit like floating balls of fire.   At first the balls of light formed a serpentine pattern and were low in the sky, as they floated upward they came together to form a slightly curved line with a good amount of space between each one.  My brother went inside the house and then came back out with our mom and my boyfriend.  The four of us watched the balls of light disappear into the clouds, the whole indecent lasted about ten minutes.",
      "link": "http://www.nuforc.org/webreports/096/S96099.html",
      "state": "CA",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c0634",
      "summary": "Car dealership confused on what they all saw floating in the sky for 2 hours.",
      "city": "sacramento",
      "shape": "changing",
      "date": "2012-12-20T00:00:00",
      "story": "Car dealership confused on what they all saw floating in the sky for 2 hours. While I was working this afternoon, I noticed a black spot in the sky just beneath the clouds.  At first I didn't pay much attention to it, thinking it may have been a balloon, or a helicopter hovering over the downtown area.   About 15 minutes go by and I realized this object suspended in the sky wasn't moving, or flashing lights, and was to high up for the police and news helicopters I see on a daily basis.   I went to my car and grabbed my cheap pair of binoculars to get a better view.  It looked like a long bus, black in color.  I observed the object for about another half an hour when 15 if not more of my co-workers begin to take notice what was in the sky.   My co-worker went to his car and pulled out his binoculars and the view was better than the my pair.  I couldn't make out any lights, although one co-worker said she saw a blue light on the right side of the object, no one else stated that.   When I was watching the object through my co-workers binocul! ars, I noticed the object looked more saucer shaped, but then it would change to a long bus shape, it was hard to tell what was going on because the object was really high up.   Several people said it was a weather balloon, but this object looked nothing like a weather balloon, and at the altitude it was hovering at, the balloon would have been blown around in the jet stream.   I watched the object until I could no longer see it because the sun went down, and as the sun disappeared, the object remained.  I know it wasn't a bird, or a plane, or a helicopter, or a balloon, what I saw was something I've never seen before, and unexplained in my opinion.",
      "link": "http://www.nuforc.org/webreports/095/S95175.html",
      "state": "CA",
      "duration": "2 hours+"
    },
    {
      "_id": "64d005f478aba2ec5a3c086f",
      "summary": "Red/Orange Fireballs in the Sky.",
      "city": "sacramento",
      "shape": "fireball",
      "date": "2014-01-10T00:00:00",
      "story": "Red/Orange Fireballs in the Sky. Son called us quickly out front to see red/orange \"fireballs\" in the sky.  They were moving quickly across the sky and disappeared one to several at a time.",
      "link": "http://www.nuforc.org/webreports/105/S105663.html",
      "state": "CA",
      "duration": "Few minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c0899",
      "summary": "3 red lights over Sacramento.",
      "city": "sacramento",
      "shape": "triangle",
      "date": "2014-01-10T00:00:00",
      "story": "3 red lights over Sacramento I was outside taking my dogs out to go to the bathroom at about 11:30 p.m.  Out of the corner of my eye I saw a red light in the SW sky.  Upon paying further attention I noticed 2 other red lights.  They were in a large triangular shape formation.  The red lights were very bright and I had never seen them before in the sky.  As I watched them I was covered in goosebumps.  After maybe 2 minutes the 3 lights began to change their color to \"starlight color\"  If there was only one of them doing this I could have passed it off as the red shift of a star. but not all three at once.  The final  thing that happened was the all began to dim and disappear at the same time.  The light that was to the right then cam back \"on\" for about 10 seconds then was gone.  Needless to say.....I will be looking for it again tonight.",
      "link": "http://www.nuforc.org/webreports/105/S105646.html",
      "state": "CA",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c090a",
      "summary": "As I was driving west bound on Fruitridge rd approaching Freeport blvd I noticed 4 orange orbs in the sky. 3 made a triangle while the",
      "city": "sacramento",
      "shape": "circle",
      "date": "2014-03-18T00:00:00",
      "story": "As I was driving west bound on Fruitridge rd approaching Freeport blvd I noticed 4 orange orbs in the sky.  3 made a triangle while the other one was a little distant from the 3.  Then they came together in a group and hovered.  I noticed other people pulling over and getting out there car to see what was going on in the sky. ((NUFORC Note:  We assume an evening sighting, and have changed the time above.  The source of the report elects to remain totally anonymous, and provides not contact information, so we are unable to confirm the time.  PD))",
      "link": "http://www.nuforc.org/webreports/107/S107579.html",
      "state": "CA",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c0c5e",
      "summary": "Bright orange light to the east.",
      "city": "sacramento",
      "shape": "unknown",
      "date": "2014-01-10T00:00:00",
      "story": "I was on my front porch, which faces east, to film the neighbor hood at midnight, because of New Years.  I looked up after filming to watch the fireworks, and saw a bright orange light to the east. I thought it might be a star but was much brighter than Jupiter is right now.  There were several aircraft in the area.  My tree was somewhat in the way, so I moved to a better vantage point on my driveway check to see if it had FAA lights on it. It did not.  I watched it for about a minute.  It seemed to hover, then sped off to the east, the light slowly getting dimmer then disappeared completely. It was originally about 30 degrees above the horizon, and when it sped off seemed to go slightly higher. I am not sure if there were any other witnesses, but I was the only one out on my street at the time.",
      "link": "http://www.nuforc.org/webreports/105/S105857.html",
      "state": "CA",
      "duration": "1-2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c0cd1",
      "summary": "Eight lights in the sky flashing moving and disappearing within twenty minutes.",
      "city": "sacramento",
      "shape": "light",
      "date": "2014-02-27T00:00:00",
      "story": "Eight lights in the sky flashing moving and disappearing within twenty minutes. standing in my front yard, always looking up...i noticed what looked like a star, pointed it out to my daughter and family friend. then noticed there were three in a row up.  the middle one would move slightly to the left then stop then move back...i noticed several others up and to the right.  it reminded me of a constellation. our friend could see three, my daughter six, i counted eight.   within a few minutes the group of six disappeared, the middle one then the others.  we looked with the binoculars it looked like a star but flashing on and off or staying solid.  no solid shape just shiny like a star.",
      "link": "http://www.nuforc.org/webreports/107/S107399.html",
      "state": "CA",
      "duration": "12 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c0d36",
      "summary": "3 red/orange lights over Sacramento.",
      "city": "sacramento",
      "shape": "light",
      "date": "2013-11-11T00:00:00",
      "story": "3 red/orange lights over Sacramento At 7:15 PM on the 29th of October, 2013 I witnessed 3 bright red/orange lights of the same brightness, to the East of Sacramento, California.   Viewing from Fulton Ave. near Cottage Way, they were approximately 30-40 degrees high traveling from NE to SW (225° heading), slow and steady.  They were all moving along the same path, on the same line, the 2 in front were approximately 5 degrees apart with the 3rd partially obscured by clouds, another 15 degrees behind, no navigation lights could be seen.   I looked down at my iPhone to text a friend, when I looked back up with the intent of trying for a video, they were gone.  It could have been a meteor breaking up but they were moving very, very slowly.  The speed was about the same as an airliner at altitude but the lights were much brighter, and they disappeared in a clear area of the sky.   Total duration of sighting was 20-30 seconds.",
      "link": "http://www.nuforc.org/webreports/103/S103717.html",
      "state": "CA",
      "duration": "20-30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c0de8",
      "summary": "At roughly 3:30 a.m. pacific standard time I witnessed three lights moving in a westward direction at longitude -121.342 latitude 38.70",
      "city": "sacramento",
      "shape": "cigar",
      "date": "2014-02-21T00:00:00",
      "story": "At roughly 3:30 a.m. pacific standard time I witnessed three lights moving in a westward direction at longitude -121.342 latitude 38.705.  The object was cigar shaped with three dull but large yellow lights.  One light located in the center and one at both ends.  It appeared to be translucent but still connected between the lights.  It was flying below 30,000 feet. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/107/S107202.html",
      "state": "CA",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c0e98",
      "summary": "Fleet of silver UFO trio fly north at high speed.",
      "city": "sacramento",
      "shape": "formation",
      "date": "2014-02-07T00:00:00",
      "story": "Fleet of silver UFO trio fly north at high speed. I am filing a report for my wife since she is a new United States Citizen, so is unfamiliar to this organization to report a sighting herself.  She stated that on February 1, of 2014, there was a faintly visible fleet of 3 silvery objects traveling in triangular-shaped formation heading north at high speed.   She stated that there was clearly 3 separate object rather than 1 since they all had a random drift pattern in flight.  No lights or sound were noticed while she watched, these objects move in a direct path in the daylight sky.  She was only able to see these after noticing a plane flying close to the area of the sighting.  After viewing the trio of UFOs she said there appeared to be a military-type plane that followed (after the objects left) the same direction the craft went, only moving slower.  Perhaps classified Air Force surveillance?",
      "link": "http://www.nuforc.org/webreports/106/S106882.html",
      "state": "CA",
      "duration": "45 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c0f26",
      "summary": "Very high in a perfectly clear blue sky appeared to be round lights 2, round or disc shaped moving in and out of view then vanishing.",
      "city": "sacramento",
      "shape": "circle",
      "date": "2014-02-27T00:00:00",
      "story": "Very high in a perfectly clear blue sky appeared to be round lights 2, round or disc shaped moving in and out of view then vanishing.",
      "link": "http://www.nuforc.org/webreports/107/S107441.html",
      "state": "CA",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c0ff9",
      "summary": "Brother sees ship and occupants...maybe more.......",
      "city": "sacramento",
      "shape": "cigar",
      "date": "",
      "story": "Brother sees ship and occupants...maybe more....... When I was 5 years old I was at home with my mother sitting on the kitchen floor watching her clean up and talking to her about whatever it is 5 yr olds talk about.  I remember my mom asking me about my twin brother and if I had seen him and I told her no.  It was the beginning of the summer vacation in June, the weather was warm and there wasn't a cloud in the sky.  All of a sudden my twin comes busting through the door with a look of terror on his face and screaming so loud and incoherently that we couldn't understand anything he was saying.  My mom grabbed ahold of him and held him close to try to calm him down and when he did he told her something that to this day, I will never forget. He told her that he was playing at the school.  Winterstein school in Sacramento, California. He said he was playing in the playground and had looked up to the sky because it got \"cloudy\" all of a sudden.  When he looked up he saw a large silver object that looked like a \"school bus\" with lights all around the middle part and could see \"people\" looking out the \"windows\" at him.  But when he looked closer at them, he said they weren't like any \"people\" but had very large black eyes and were all silver.  My mom got him calmed down and he went into his bedroom and slept for the rest of that day into the next day. My brother finished high school and went into the Air Force as a Radar spec./technician.  He served his tour of duty and I hadn't heard from him for nearly the whole 6 years he had served.  When he got out, he came home and got in contact with the family and I invited him over.  I had a chandelier that needed some work and asked if he would look at it for me.  He was happy to do it.  He got on the ladder and I started to ask him questions about when we were in kindergarten and when he saw the \"school bus\" in the sky.  He affirmed everything that he had told us at the time and said he didn't know what it was and that he had in fact seen the same exact thing four times.  Once again right after he had joined the Air Force while on a training ship, and another time while he was out at sea on his ship coming home from Okinawa and another time after he had bought some property in Bodega Bay, California. I had, at the time, been reading one of Bud Hopkins books that had drawings and depictions of the \"greys\".  I was being very careful about what I was saying as he was looking and sounding a little nervous about talking about it and I didn't want to make him too uncomfortable, yet my curiosity got the best of me and I picked up my book and showed him one of the drawings in the book of an alien with large black eyes and \"dressed\" in \"silver\".  When I showed this to him, he climbed down off the ladder and bluntly told me that he didn't want to talk about it anymore and he would never talk to me about it again.  He was very angry with me for bringing it up and to this day I regret showing it to him at that time.  We have had very little contact since then and I don't know how I can repair the rift that has come between us. ((NUFORC Note:  Witness indicates that the date is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/105/S105120.html",
      "state": "CA",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c11a4",
      "summary": "Observed 3 orange pulsating objects flying in strait formation then dropping suddenly then fading out of view.",
      "city": "sacramento",
      "shape": "unknown",
      "date": "2013-12-23T00:00:00",
      "story": "observed 3 orange pulsating objects flying in strait formation then dropping suddenly then fading out of view. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/105/S105373.html",
      "state": "CA",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c121c",
      "summary": "Sacramento red and white lights in sky.",
      "city": "sacramento",
      "shape": "triangle",
      "date": "2014-01-24T00:00:00",
      "story": "Sacramento red and white lights in sky On 2 consecutive nights saw a red and white lit triangle rise slowly in the southern sky, then slowly fall behind the tree line.  Moments later it would reappear in the opposite side of the tree line and accelerate rapidly across the southern sky and disappear.  I also witnessed the same object on approximately 1/13/14, repeated rising and dropping, only to disappear.  On each occasion went outside, no engine noise to be heard.",
      "link": "http://www.nuforc.org/webreports/106/S106533.html",
      "state": "CA",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c1227",
      "summary": "Glowing red light crosses night sky, stops, and then disappears into the moon.",
      "city": "sacramento",
      "shape": "changing",
      "date": "2013-12-23T00:00:00",
      "story": "Glowing red light crosses night sky, stops, and then disappears into the moon. 12/15/2013 at 10:30pm I saw what looked like a fireball streaking across the sky. Then the object stopped in mid-air and appeared to turn, all the while glowing a bright red light.  Then it went black for a few seconds.  Then it started glowing red again and proceeded towards the moon, stopped again then went straight into the moon and disappeared at a high rate of speed.  Please note I tried to photograph this object, however, my camera did not register the object being there even though I was looking right at it with my eyes.  It didn't register on my friend's camera either.",
      "link": "http://www.nuforc.org/webreports/105/S105376.html",
      "state": "CA",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c1384",
      "summary": "Very bright white light with 2 orange lights.",
      "city": "sacramento",
      "shape": "light",
      "date": "2013-11-20T00:00:00",
      "story": "Very bright white light with 2 orange lights. Tonight (11-13-13) the moon was eastward but in the southwest there was a VERY bright white light, below it to the right was an smaller orange light and below that was another orange light.   The 3rd lowest one I lost sight of but the 2nd orange light was sitting there then slowly started moving towards the bright white light.   As the orange light got close to it, it disappeared!!!  This would be my first ever sighting like this.",
      "link": "http://www.nuforc.org/webreports/104/S104417.html",
      "state": "CA",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c1643",
      "summary": "Orange orb drops flashing orbs over sky in Sacramento then disappears.",
      "city": "sacramento",
      "shape": "light",
      "date": "2013-10-23T00:00:00",
      "story": "Orange orb drops flashing orbs over sky in Sacramento then disappears. I was outside of my house with 2 friends and we saw a very bright orange orb of light flying around high up in the sky in a weird pattern.  It then dropped 1 orange and red flashing orb straight down then flew a little more and dropped 2 more of them straight down then and then faded into the sky as if it was flying away very fast. ((ADDENDUM FROM WITNESS)) Correct date of sighting was October 15, 2013.   ((END ADDENDUM))",
      "link": "http://www.nuforc.org/webreports/103/S103295.html",
      "state": "CA",
      "duration": "4 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c164e",
      "summary": "2 orb-like craft witnessed over Carmichael area of Sacramento.",
      "city": "sacramento",
      "shape": "circle",
      "date": "2013-10-23T00:00:00",
      "story": "2 orb-like craft witnessed over Carmichael area of Sacramento 10.16.13  At approximately 10:23 observed two orbs of light above the Foothill Farms/Carmichael area of Sacramento (near Madison and Hackberry).   Initially, they were close together and hovering completely silent.  One was orange-red and the other yellow-white.   These lights did not pulse like aircraft anti-collision lights.   After my initial shock, I was able to take some poor quality video with my phone starting 10:25:59 and running 45 seconds.   The orbs separated and flew away – south for the orange-red orb and southwest for the yellow-white orb – at a moderate speed.   After a few seconds, the lights “winked” out.   I cannot tell if there are clouds to the south of Carmichael, so I do not know if that was a factor.",
      "link": "http://www.nuforc.org/webreports/103/S103309.html",
      "state": "CA",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c17f8",
      "summary": "Very bright large light falling.",
      "city": "sacramento",
      "shape": "unknown",
      "date": "2014-06-04T00:00:00",
      "story": "Very bright large light falling. While sitting in Bethel Henshel park in east Sacramento at approximately 11:20 pm, we observed an extremely large, super bright, white light appear above the neighborhood tree line in the northeast sky.  It rapidly descended in a straight vertical line until out of sight.  It looked like it was falling as there was no horizontal movement at all.  The whole thing lasted 2 seconds max.  It did not appear to be a falling star as it was too large, too low and falling too vertically.  Seconds later, a helicopter which had previously flown over the park, circled back and began flying over the area where the object had descended out of sight.",
      "link": "http://www.nuforc.org/webreports/109/S109572.html",
      "state": "CA",
      "duration": "2 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c1ec1",
      "summary": "Saw two lights moving together and upward in the sky then disappearing, followed by one that disappeared, followed by another two.",
      "city": "sacramento",
      "shape": "light",
      "date": "2014-06-27T00:00:00",
      "story": "Saw two lights moving together and upward in the sky then disappearing, followed by one that disappeared, followed by another two. Was on the phone outside when I saw two lights off in the distance in the sky, not blinking like a plane's lights do.  They were flying next to each other so immediately I thought they were military aircraft in a training exercise.  They seemed to be coming toward me, but after second thought I think they were going up.  They started moving away from each other, and then one disappeared, followed by the other disappearing about twenty seconds later. Then, from the horizon, a similar light went up and disappeared, this time by itself. Next, two more lights came from the horizon, just like in the first description, and disappeared after parting ways. The sky was a bit cloudy but not enough to block out stars, etc.  I'm sure it wasn't a commercial aircraft because I saw commercial aircraft flying when I saw the lights.  Very interesting sighting; never seen anything like it before.  I was thinking maybe it was a missile but I've seen those too and they were moving too slowly to be missiles.  Still scratching my head.  Couldn't get a video because my phone ran out of battery as soon as I turned on my video camera, but this link depicts what I saw almost exactly:   http://www.youtube.com/watch?v=Pb9NJlijVb0 ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/110/S110653.html",
      "state": "CA",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c1f9a",
      "summary": "Triangle lights in the sky put on a laser light show, hovering over city.",
      "city": "sacramento",
      "shape": "triangle",
      "date": "2014-04-24T00:00:00",
      "story": "triangle lights in the sky put on a laser light show, hovering over city. I've been wanting to tell this event for a long time, we lived on the corner of 13th and F streets in downtown. across the street from our apartment was a vacant lot where I would walk my dog and let him re-leave himself.   I had walked him over to the lot and he went, my two son's where in the apartment, my youngest was 2 years old and my oldest was 15 years old.   As I was headed back across the street to go home, I don't know what made me look up? maybe it was something my dog did, but I did, I looked up.  It was one of those nights where the fog was sitting just above the tops of the buildings, not on the ground.   There in the fog I saw lights in the shape of a triangle, hovering just above me in the fog.  The triangle was large maybe about 10 ft per side.  I ran back in the house with the dog and told my oldest son to come out with me fast so he could see it, we left the dog in the house and went back down to the street.   The triangle light was still there, we stood there n the middle of the crosswalk staring up at the sky.  For the next several minutes we watched what is somewhat difficult to describe, other than it reminded me of something you might see when dealing with special effects on television, (computers now), but that's not how I would have described it then.   The triangle divided itself in half smoothly without a break in the light, into two triangles, always touching at some point, as they seemed to roll along the others side, before dividing again turning into three then four, almost dancing off of each other.  The lights where bright blues and reds, always changing. It was like watching nothing I have ever seen from anything that I know could be in the sky.   Standing there fixated on these lights, we heard some neighbors come out of the apartment just a few doors down on F street, seeing us standing there staring up into the sky, we heard them laugh and say something to the matter of, \"what the hell are they doing?\" I turned my head and looked at them, there were two people there, and at that point they had looked up, the next thing I heard was, \" Holly ((word deleted)),\" as they too saw the lights in the sky, and then out of no where the lights vanished and it stopped.   The strangest thing about this event, was years later my youngest son when he was somewhere between 8 to 11 years old, told me he remembered as an infant being visited by what he would later know as aliens.    Having very vivid memory's myself as early as 2 years of age about just life, normal stuff, I am inclined to believe him. ((NUFORC Note:  Witness indicates that the date of the event is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/108/S108751.html",
      "state": "CA",
      "duration": "5-10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c25ba",
      "summary": "Strong red and green pulses with softer white pulse and gone from open sky in instant.",
      "city": "sacramento",
      "shape": "circle",
      "date": "2014-11-06T00:00:00",
      "story": "strong red and green pulses with softer white pulse and gone from open sky in instant. Me and my fiancé ages 21 and 27 were chatting up late when my wife askef me what these lights are.  At 1st glance i thought plane but as i watched the pulsating red green and white light i noticed it seemed stationary.  Hovering around Orion's belt.  As i went out onto the porch i noticed another pulsing red green and white light about 40° to the east but further away.  When i got downstairs to the street, a T intersection in which i can see down the vertical section of the T, i noticed a third green and red pulsing light that appeared much closer and more vibrant. It was low in the sky about even with roof tops about a block away.i felt almost like on the red pulse that a Laser pointer was hitting me but i could see no discernable light in my vicinity. I turned to yell to my wife asking if she could see or feel the same sensation as me. She had gone inside to find a camera when i turned back after no more than three seconds had elapsed the light direct in fron! t of me had vanished. The other two i saw remained in place for over 10 minutes. But have disappeared sometime in the 10 to 15 minutes i have been writing this on my celll. My wife says she saw as 5 lights in circular shape stretched across the sky. But can lffer little detail because it was her first encounter with a UFO and she became frightened. In all 20 -30 minutes from when we noticed the lights until their apparent departure.",
      "link": "http://www.nuforc.org/webreports/114/S114902.html",
      "state": "CA",
      "duration": "10+ minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c27d4",
      "summary": "About 12 noon I saw a bright orb from my front yard about 5 thousand feet above the south end of executive airport in Sacramento/",
      "city": "sacramento",
      "shape": "sphere",
      "date": "2014-11-06T00:00:00",
      "story": "About 12 noon I saw a bright orb from my front yard about 5 thousand feet above the south end of executive Air port in Sacramento, I had my wife bring my binoculars to me and when I got the orb focused in I saw a large brushed aluminum ord just sitting there in the sky,after watching it for about 10 minutes there was a Large bright red flash/explosion what appeared to be about 50-100 feet below it then a trail of smoke directly Below the orb, The orb appeared to have a protective field around it because the flash occurred below it,The orb just sat there stationary, an all white no marking large Lear jet flew underneath It & continued going east, I thought to myself someone just tried to shoot this orb down or the orb was starting some sort of propulsion system up hense the red flash & smoke, there was no sound the whole time I watched it even the red flash made no sound when it happened, the orb sat there for about another 10 minutes then moved steadily and silently off to the north east until it went out of site, My wife & son watched this event with me,they were amazed at what we saw..",
      "link": "http://www.nuforc.org/webreports/115/S115016.html",
      "state": "CA",
      "duration": "20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c2bfb",
      "summary": "Large bright light disappears into the sky.",
      "city": "sacramento",
      "shape": "light",
      "date": "2014-09-05T00:00:00",
      "story": "Large bright light disappears into the sky. I was looking North.  It was still light outside.   All of a sudden a large bright light entered my view.  It was very bright.  It started to move upwards and then like a flash disappeared into the sky.   Using a tree near the location of where I thought it would be I estimated that he size of the light was about 25 feet across.   I have never seen a UFO before and this experience left me shaken.   I wonder what else I didn't believe in that is really true.",
      "link": "http://www.nuforc.org/webreports/113/S113204.html",
      "state": "CA",
      "duration": "3 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c2d2e",
      "summary": "Two college students spotted triangular and spherical UFOs on campus.",
      "city": "sacramento",
      "shape": "other",
      "date": "2014-10-03T00:00:00",
      "story": "Two college students spotted triangular and spherical UFOs on campus. My friend and I, two community college students from Sacramento, had just gotten out of our classes and were hanging out together on campus.  We were sitting in a spot of grass near the library, which is a fairly open space with a clear view of the sky. Both having had a long day, we were reclined in the grass staring up at the sky when at about 4:40PM, we both noticed something white making its way across the vast stretch of blue. At first glance, it appeared to be a feather being pushed by the wind, but we soon realized it was at much too high of an altitude and was moving far too fast. Upon further inspection, we could see that it resembled a scalene triangle, and spun about and tilted at odd angles while it flew across the sky.  We brushed this off somewhat nonchalantly at first, laughing at the absurdity of the sight. After all, it had been a long day, and we assumed that it was, indeed, just a feather or some other spec of debris, and our eyes were playing tricks on us making the object in question look stranger. That is, until the next object came in. It had only been 10 seconds after the first, if even that, when another white object hovered across the sky in the same manner. This object was perfectly spherical and was not moving about in the same sporadic way as the first. That is, if it was, it wasn’t noticeable because of its shape. It was at the same altitude and was within our view for the same amount of time as the other, a mere 20 seconds or so of a quick and soundless hovering as it made its way across the plain of our vision.  \tWe reported the sighting via hotline right when the incident was over. My friend tried to capture photos and videos of the 2nd object in question, but it was so high up and thus appeared so small that it wasn’t picked up by their iPhone camera. Being that these two objects were so small and were silent, we’re unsure of whether or not there were any other witnesses.",
      "link": "http://www.nuforc.org/webreports/114/S114149.html",
      "state": "CA",
      "duration": "20 seconds (per object)"
    },
    {
      "_id": "64d005f478aba2ec5a3c2d2d",
      "summary": "Two strange all white objects seen by two witnesses at Sacramento City College",
      "city": "sacramento",
      "shape": "other",
      "date": "2014-10-03T00:00:00",
      "story": "Two strange all white objects seen by two witnesses at Sacramento City College My friend pointed out the first craft to me when it was almost overhead. It appeared at first to be an all-white airplane moving very, very fast. As it flew, we could see it turn over and around a few times, like a plastic bag would when blown about by the wind. It seemed to be in the shape of a scalene triangle with it’s tip bent back on itself.  We watched it until it appeared to fly down and disappear over the horizon.  I pulled out the camera on my cellphone but the object wouldn’t show up against the sky. The second object appeared about 5-10 seconds after the first one disappeared. Again, my friend pointed it out to me. This one was a sphere, the same color and size at the first one. It only reflected a small amount of light.  It followed the same trajectory and again disappeared over the horizon.  Event took place at Sacramento City College, and the objects were viewed while lying down in the grass in the courtyard. Both objects were smaller than the sun.",
      "link": "http://www.nuforc.org/webreports/114/S114150.html",
      "state": "CA",
      "duration": "20 seconds each object"
    },
    {
      "_id": "64d005f478aba2ec5a3c2d97",
      "summary": "Star-like lights moving at the speed of jets ft 5-6 bright red lights descending into space.",
      "city": "sacramento",
      "shape": "formation",
      "date": "2014-08-29T00:00:00",
      "story": "Star-like lights moving at the speed of jets ft 5-6 bright red lights descending into space. It was red, very big lights at first but it looked as if they were descending into space.  There was 4-5 or 5-6 of them, all in formation.  One by one they were fading into black.   As soon as one of them were pitch black, you can start seeing star-like lights moving really fast.  Not the speed of light but the speed of a jet & remember the look on the moving lights were star-like so they were really really small, meaning they were really really far.  Jets, or private jets any type of planes have flashing LIGHTS.  These were just bright.  No flash at all.   I hope the news tells us whats going on.",
      "link": "http://www.nuforc.org/webreports/112/S112860.html",
      "state": "CA",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c30c8",
      "summary": "Bright unknown light.",
      "city": "sacramento",
      "shape": "other",
      "date": "2014-08-15T00:00:00",
      "story": "bright unknow light Third Party report.  I’m reporting a sighting for a co-worker.  On 8/13/14, at approximately 9:40 PM, a bright amber colored object passed over Sacramento, CA, moving from south to north.  From Watt Ave  towards Fair Oaks Blvd.   No sound , the light illuminated from all sides, the object appeared front & back to pointed with a thicker middle section like two funnels put together (not really sure because of the object’s brightness)  End of Report",
      "link": "http://www.nuforc.org/webreports/112/S112489.html",
      "state": "CA",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c3158",
      "summary": "I was getting out of bed in the second story room of our home and I looked out my window and saw 3 bright white lights in the sky in a",
      "city": "sacramento",
      "shape": "circle",
      "date": "2014-08-01T00:00:00",
      "story": "I was getting out of bed in the second story room of our home and I looked out my window and saw 3 bright white lights in the sky in a triangle formation.   I thought it was a plane but it stopped in the sky for a few seconds and continued to move again.   It moved rather quickly and disappeared eventually. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/111/S111883.html",
      "state": "CA",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c3189",
      "summary": "5 glowing fireball objects heading NE over Sacramento skies.  Pairings then disbursed.",
      "city": "sacramento",
      "shape": "fireball",
      "date": "2014-08-01T00:00:00",
      "story": "5 glowing fireball objects heading NE over Sacramento skies.  Pairings then disbursed. First group came in a pair, glowing orange fireball shaped objects, flying in a pair then split off.   The orange light seemed to pulse from the objects but not any engine sound at all.   The second fireball was by itself and proceeded in the same direction heading NE towards McClellan airbase.  Hard to judge altitude and speed.   The 3rd group was another pair of the same objects. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/111/S111954.html",
      "state": "CA",
      "duration": "3-7 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c320d",
      "summary": "2 square soundless  objects with dim glowing lights in each corner.",
      "city": "sacramento",
      "shape": "other",
      "date": "2015-04-03T00:00:00",
      "story": "2 square soundless  objects with dim glowing lights in each corner. Wife and I sitting in our hot tub at 22:00 on 3/21/15 when we saw what appeared to be a square soundless object with dim glowing lights in each corner. 15 seconds later following the 1st object appeared an identical object traveling the same northwest direction, same speed. Last night 3/31/15 my wife and I again were sitting in the hot tub approx. 21:50, when we saw the same exact objects traveling a slightly different direction (west), this time they were side by side.",
      "link": "http://www.nuforc.org/webreports/118/S118156.html",
      "state": "CA",
      "duration": "00:45"
    },
    {
      "_id": "64d005f478aba2ec5a3c3268",
      "summary": "While standing on my 10th floor patio facing ~ NE I saw very far in the distance and moving at an extremely constant speed and one dire",
      "city": "sacramento",
      "shape": "circle",
      "date": "2015-03-13T00:00:00",
      "story": "While standing on my 10th floor patio facing ~ NE, I saw very far in the distance, and moving at an extremely constant speed, and one direction from E to N, an orb, white in color with no contrails.  It was moving with purpose and destination.   The orb was moving at great speed and was a good distance off.  It never varied from it straight line path until no longer visible.  Fascinating. ((NUFORC Note:  Witness indicates that the date is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/117/S117638.html",
      "state": "CA",
      "duration": "45-60 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c342c",
      "summary": "My husband saw 4 red glowing orbs in the northern sky.  By the time I got outside I saw only 1 glowing red orb that had moved to the we",
      "city": "sacramento",
      "shape": "sphere",
      "date": "2015-04-03T00:00:00",
      "story": "My husband saw 4 red glowing orbs in the northern sky.  By the time I got outside I saw only 1 glowing red orb that had moved to the west.  It stayed in one position for a few minutes then moved farther away towards the west.  Then it stopped and it changed its color to green.  It then slowly descended until we couldn’t see it anymore. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/118/S118203.html",
      "state": "CA",
      "duration": "8-10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c35a2",
      "summary": "I saw an orange ball of light traveling south in western sky. After observing it briefly I knew it wasn't normal. I ran and called my s",
      "city": "sacramento",
      "shape": "light",
      "date": "2015-02-12T00:00:00",
      "story": "I saw an orange ball of light traveling south in western sky.   After observing it briefly I knew it wasn't normal.   I ran and called my son.  We both watched as it slowly dimmed.   It finally disappeared.",
      "link": "http://www.nuforc.org/webreports/117/S117267.html",
      "state": "CA",
      "duration": ".60"
    },
    {
      "_id": "64d005f478aba2ec5a3c3898",
      "summary": "Red/Blue/Green flashing spherical object over Natomas, Sacramento.",
      "city": "sacramento",
      "shape": "sphere",
      "date": "2015-01-16T00:00:00",
      "story": "Red/Blue/Green flashing spherical object over Natomas, Sacramento. This looked like a spherical object, standing still, flashing green and red, and then occasionally just red.  We saw it for 5 minutes total, including the time it was hovering out of sight.  When it started to hover away, the flashing lights turned pure blood red.",
      "link": "http://www.nuforc.org/webreports/116/S116734.html",
      "state": "CA",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c3d6c",
      "summary": "Driving north on Bruceville Rd. from Elk Grove to Sacramento and saw a very long laser like red line, streaking across the sky from the",
      "city": "sacramento",
      "shape": "fireball",
      "date": "2015-07-17T00:00:00",
      "story": "Driving North on Bruceville Rd. from Elk Grove to Sacramento and saw a very long laser like red line, streaking across the sky from the direction of SF into Sacramento.   It was in a very controlled floating direction moving downward, like aircraft landing position, but at the same time leaving a laser like red trail that could be seen as the sun was going down across the horizon.  I have never seen this before.  Very interesting event to be seen. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/120/S120431.html",
      "state": "CA",
      "duration": "5-6 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c4098",
      "summary": "Unknown small white light.",
      "city": "sacramento",
      "shape": "egg",
      "date": "2015-05-08T00:00:00",
      "story": "unknown small white light On April 27 2015 approximately 6:30 pm, I was in my front yard seeing my stepdaughter off to  school (college).  I looked down the street (south) and observed  what I thought was a butterfly, white in color about a foot off the ground over the gutter heading toward my stepdaughter’s car, (moving north) as it approached rapidly I noticed that it was a very bright white ball of light (defused) about the size of a cotton ball no light scatter.  It then hit the rear right tire and disappeared .. End of report.",
      "link": "http://www.nuforc.org/webreports/118/S118829.html",
      "state": "CA",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c4335",
      "summary": "While crawdad fishing on the American River, I looked into the sky and noticed an orange glowing orb.",
      "city": "sacramento",
      "shape": "sphere",
      "date": "2015-11-19T00:00:00",
      "story": "At midnight, my friend and I were on the American River, crawdad hunting in the river, when I looked into the sky and noticed an orange glowing orb.  I asked my friend if he thought it was a planet but it we both thought it to be too big for than.  We then thought possibly an aircraft but no blinking lights.  It just appeared to hover in the same location in the sky with no movement or change in size so it didn't appear to be moving the way an aircraft would.    As we stared at it we were deliberating about what it could be.  It was too big to be a planet but didn't appear to be aircraft.  We were perplexed.   After about 1 minute we looked down into the water as we moved toward the shoreline.   We looked away for about 30 seconds and then my friend said to me that the orb was gone.  I looked up into the clear sky and sure enough it wasn't there.   We spent 30 minutes discussing it and particularly its size (like a planet but bigger too big for that), color (orange glow like ! an ember) and how it disappeared or vanished (disappeared without trace).  It didn't seem logical.   The size and color of the object makes it hard to believe it just vanished.   It was in the high point of the sky and there's no way it sped off.",
      "link": "http://www.nuforc.org/webreports/123/S123881.html",
      "state": "CA",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c43d2",
      "summary": "Object went from S to N, bright light with contrail, obj. seem have several stages.  ((NUFORC Note:  U. S. Navy missile launch.  PD))",
      "city": "sacramento",
      "shape": "triangle",
      "date": "2015-11-19T00:00:00",
      "story": "Object went from south to north, bright light with contrail, object seem have several stages.  Contrail was triangle shaped, out of both sides, crossed entire sky in 15 min, green smoke cloud in southern sky , white cloud in northern sky.  No sound.  Moving fast but saw it long distance, many reports to kcra news sac, ca. ((NUFORC Note:  U. S. Navy missile launch.  PD)) ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/123/S123587.html",
      "state": "CA",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c449c",
      "summary": "3 light flashes.",
      "city": "sacramento",
      "shape": "oval",
      "date": "2015-10-29T00:00:00",
      "story": "3 light flash Could not identify shape.  Craft flying low.  3 flashes of white light every few seconds.  Craft would remain hover then seemed to suspend in one spot.",
      "link": "http://www.nuforc.org/webreports/122/S122918.html",
      "state": "CA",
      "duration": "30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c4536",
      "summary": "I, for the first time, witnessed a huge v-shaped bright lights formation gliding the sky so fast and gone within 5 to 7 seconds. it loo",
      "city": "sacramento",
      "shape": "chevron",
      "date": "2015-11-26T00:00:00",
      "story": "I, for the first time, witnessed a huge v-shaped bright lights formation gliding the sky so fast and gone within 5 to 7 seconds.  It looks like a string of star-like lights.  I don't know what it was, but I did know one thing for sure when it was happening, honestly I was thanking God for a beautiful sky with full of stars.  I am still wondering about it. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/124/S124249.html",
      "state": "CA",
      "duration": "5-7 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c46f1",
      "summary": "Large ball of light with long trail lights up the sky and disappears over Sacramento, California.",
      "city": "sacramento",
      "shape": "flash",
      "date": "2015-10-29T00:00:00",
      "story": "Large ball of light with long trail lights up the sky and disappears over Sacramento, California. Around 8:00 PM, I was sitting in my backyard on my swinging couch having a cigarette and looking in the at the stars in the sky in the east direction. I noticed a large ball of light with a long trail moving laterally in the south direction at high speed.  Then all of a sudden everything disappeared within a few seconds.  I heard people on the radio early this morning here in the California central valley describe on-air exactly what I had seen. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/123/S123059.html",
      "state": "CA",
      "duration": "08:00 PM"
    },
    {
      "_id": "64d005f478aba2ec5a3c479a",
      "summary": "Split sec flash of light to a light glow, then it would move.",
      "city": "sacramento",
      "shape": "light",
      "date": "2015-10-09T00:00:00",
      "story": "split sec flash of light to a light glow ,then it would move., I Was watching night sky about 20:15 hrs over North Sacramento (some clouds in the sky).I was observing planes leave Sac Intl when I thought I saw a flash of light.  As I was watching other planes in lower air space, I thought I saw a flash of light again, so I just wached the area where I thought I seen the flashing and to my surprise it flashed for split second then to a light glow.it did this for about 30sec moving just a bit untill a 747 from SF came by.  Then it followed behind aircraft flashing only for split second.  I followed it NE until I could not see it any longer.  This was not normal aircraft lightning, just supper white light. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD)) ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/122/S122593.html",
      "state": "CA",
      "duration": "30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c4c83",
      "summary": "Aircraft circles near.  2 white glowing dots.",
      "city": "sacramento",
      "shape": "circle",
      "date": "2015-09-17T00:00:00",
      "story": "Aircraft circles near. 2 white glowing dots. THURSDAY 9-17-15 14HRS TO 15HRS NOTED WHITE TURBO-PROP AIRCRAFT CIRCLING ORBIT AT HIGH ALT COUNTER CLOCK WISE FLIGHT.  THEN NOTED 2 WHITE DOTS IN ORBIT TO RIGHT OF AIR RAFT.  DOTS DID NOT MOVE FROM LOCATION.  DOTS ALMOST LOOKED LIKE STARS IF LOOKING AT THEM DURING THE NIGHT.   AIR CRAFT DID ENTER THE AIR SPACE AND DOTS DISAPPEARED.  AND REAPERD AFTER PLANE PAST BY.",
      "link": "http://www.nuforc.org/webreports/122/S122042.html",
      "state": "CA",
      "duration": "1 hour"
    },
    {
      "_id": "64d005f478aba2ec5a3c5236",
      "summary": "Fireball streaked across the sky, fast at high altitude.  ((NUFORC Note:  Reported as probable space debris?  PD))",
      "city": "sacramento",
      "shape": "fireball",
      "date": "2016-01-05T00:00:00",
      "story": "Fireball streaked across the sky, fast at high altitude We saw a very rapidly moving fireball with long tail streaking across the sky above Sacramento at very high altitude moving west-northwest to east-southeast.    Event lasted perhaps 90 seconds.   We had three witnesses. ((NUFORC Note:  Reported as probable space debris?  PD))",
      "link": "http://www.nuforc.org/webreports/124/S124951.html",
      "state": "CA",
      "duration": "60 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c52f2",
      "summary": "Flying object with red flames shooting from top",
      "city": "sacramento",
      "shape": "circle",
      "date": "2016-01-20T00:00:00",
      "story": "Flying object with red flames shooting from top Stepped outside at about 7:30 pm and saw what looked like a low flying airplane with red flames shooting out of the top with the bottom half glowing a yellowish white.  There was no sound at all.  The object was flying across the sky at a good clip heading east/north east.   We kept watching it then it suddenly disappeared.  We've never seen anything like it.",
      "link": "http://www.nuforc.org/webreports/125/S125297.html",
      "state": "CA",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c5375",
      "summary": "Etheric-like spaceshap?  Thingy?  Smokey-ish maybe?",
      "city": "sacramento",
      "shape": "other",
      "date": "2016-01-05T00:00:00",
      "story": "Etheric-like spaceshap? thingy? smokey-ish maybe? A buddy and i just got home while walking southward to our shed, i stopped and took notice of a craft towards the SW side heading NE.  we have seen plenty so it was brushed off as a today's normal oddity.   A min later.... an etheric-like object came from the south about 500 ft above us and \"floating\" very closely in opposite directions to the craft i spoke of earlier.   As i called for my friend he shouted that there were 2 more in his view.  The object, if i must give it a shape, would be conducive with a helicopter.  Thought it was Etheric looking, it did not physically bend in a fluid motion.  However, it did float about in a fluid motion.",
      "link": "http://www.nuforc.org/webreports/124/S124803.html",
      "state": "CA",
      "duration": "3-5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c53be",
      "summary": "Diamond shaped object dropping flares.",
      "city": "sacramento",
      "shape": "diamond",
      "date": "2016-01-05T00:00:00",
      "story": "Diamond shaped object dropping flares It stayed in the air for most of the time.  Periodically it would drop what looked like flares.   It appeared as though it was very low, but once we got home I saw it elevate quickly and it's light dimmed.   Then it looked like it swung around and brightened up, then once more swung out and I lost it.  Kind of like in a squiggle line pattern, or sound wave pattern. Also, it had green and red/orange lights.",
      "link": "http://www.nuforc.org/webreports/125/S125008.html",
      "state": "CA",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c53ed",
      "summary": "Missiles or flares seen on New Year.",
      "city": "sacramento",
      "shape": "fireball",
      "date": "2016-01-05T00:00:00",
      "story": "Missiles or flares seen on New Year. I stepped outside to celebrate midnight on new years.  About 12:00:30, a bright red light came from the northeast horizon heading south.  It moved fast like a jet or plane.  It was very high like a plane.  My first thought was \"wow what a strange plane.\"  Then the second one came across the horizon as if it was chasing the first.   Few seconds later the second light fizzled out with a pulsing fade out.  Then the other also started to pulse and fade out.",
      "link": "http://www.nuforc.org/webreports/125/S125013.html",
      "state": "CA",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c53f8",
      "summary": "I seen along with my fiance an orange fireball covering at about hundred feet and proceeded to get home.",
      "city": "sacramento",
      "shape": "fireball",
      "date": "2016-01-05T00:00:00",
      "story": "was driving down 50 on New Years Eve in Sacramento, California, just after the fireworks show downtown.  As we passed up 47th Avenue 465th Avenue, I seen along with my fiance an orange fireball covering at about hundred feet, and proceeded to get home.   When getting out the car we've seen 3 more in a single file traveling at the same speed",
      "link": "http://www.nuforc.org/webreports/125/S125004.html",
      "state": "CA",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c5498",
      "summary": "It was 6:45pm i looked up and saw a round fireball bright orange seemed to have sparks fall from it periodacly hoverd awhile then swift",
      "city": "sacramento",
      "shape": "circle",
      "date": "2015-12-17T00:00:00",
      "story": "It was 6:45pm i looked up and saw a round fireball bright orange seemed to have sparks fall from it periodacly hoverd awhile then swiftly was gone",
      "link": "http://www.nuforc.org/webreports/124/S124667.html",
      "state": "CA",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c587d",
      "summary": "((NUFORC Note:  No information provided by witness.  PD))",
      "city": "sacramento",
      "shape": "oval",
      "date": "2016-06-01T00:00:00",
      "story": "((NUFORC Note:  No information provided by witness.  PD)) ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/127/S127523.html",
      "state": "CA",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3c58b3",
      "summary": "((HOAX??))  Pink floating orb?  ((anonymous report))",
      "city": "sacramento",
      "shape": "light",
      "date": "2016-06-01T00:00:00",
      "story": "Pink floating orb? Pink, changing to red.  Flying, then stops in its tracks.  Completely silent.  Too high to be a helicopter, too fast to be a plane, and stood still. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/127/S127545.html",
      "state": "CA",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3c5a8b",
      "summary": "Shape shifting sighting hovering over my daughters house.",
      "city": "sacramento",
      "shape": "changing",
      "date": "2016-04-29T00:00:00",
      "story": "shape shifting sighting hovering over my daughters house. Driving four blocks to my daughters house i see the craft at helicopter heighth.  Lit up 3 in a row like the top of a stadium light.  Hovering then moves over four houses..hoveres, by then i had gotten closer almost to my daughters house who lives with her father.  The thred lights separated or moved over slightly shifting the dark shape changed.  It tilted to the right i could see the round dark shape of its bottom.  It was silent.  I dont know if it was a sound it made just then i guess i would say a short intensifying hum then it flew fast and i couldnt see where. It stayed low to the houses. It hovered over my daughters dads house. We asked him if he heard anything neither him nor my nine yr old son heard anything. It was some xfiles shit was my daughters opinion on what we saw. Best one i ever seen and so close i raced through stop signs to get near it.  Attaching only cell phone photo i could get while driving.",
      "link": "http://www.nuforc.org/webreports/127/S127028.html",
      "state": "CA",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c5ade",
      "summary": "Luminescent Egg Shaped Object in Sky on SW Flight",
      "city": "sacramento",
      "shape": "egg",
      "date": "2016-04-15T00:00:00",
      "story": "Luminescent Egg Shaped Object in Sky on SW Flight On March 26, 2016, my husband and I were flying on Southwest Flight 4124 departing from Sacramento, California to San Diego.  We left Sacramento at 1:50 pm to our final destination, Tucson, Arizona. I sat next to the window near the wing.  I was looking out the window to view the snow covered mountains below.  The pilot announced that we were approximately 8 miles up and flying at 39,000 feet.  It was approximately 2:25 pm, I noticed in the distance, a very long, thin, black plume of what appeared to be smoke in the relatively clear blue sky.  At first glance, I thought I was looking at black birds flying in formation.  I asked my husband to take a look and asked him what he thought it was.  He said he didn’t know.  I looked again and saw a brilliant, mirror-like chrome, egg shaped object with, seamless, smooth round edges.  It appeared close, possibly within 2500 feet of the plane but due to perspective differences it could have been much further away.  In comparison to the left wing of the plane, the object took up almost three fourths of the wing.  As it moved, the top of the egg shaped object became visible.  The top was a bright white with a luminosity similar to a ! welding arc.  The top area had an extremely bright white luminescence with what appeared to be white flames in the center portion. My husband looked at this and said he did not know what it was, but believed it was not a plane nor a rocket.  He further stated that it was way too close to the plane to be a launched rocket out of a military air base. After approximately 2 to 2.5 minutes, it then disappeared from view. No one else in the plane appeared to observe it, as many were preoccupied—with shades drawn, sleeping, reading, etc.  My husband later looked on the FAA (Federal Aviation Administration) site in the incident/accident report section and found no report of such an object or a rocket launch in the vicinity of our flight path.  A drawing of the object will be mailed to the PO Box listed on your internet site. My background is Nursing and Public Health.  My husband is a retired public school superintendent who teaches School Law and various graduate education courses.",
      "link": "http://www.nuforc.org/webreports/126/S126765.html",
      "state": "CA",
      "duration": "2.5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c5ae2",
      "summary": "Object hovering and changing shapes.",
      "city": "sacramento",
      "shape": "sphere",
      "date": "2016-04-15T00:00:00",
      "story": "Object hovering and changing shapes. While sitting at a light facing westbound Arden Avenue, I looked up at the white clouds and noticed a small object that was hovering and then slowly moving towards the southeast.  As I watch this object move I got my video recorder on my cell phone out and recorded this object moving after a while it would stay hovering and looked like it was changing shapes and then it would travel westbound again and then it went a vertical a little bit because I was in traffic I couldn't sit for very long in the driveways that I was blocking as I was filming this.  After I got home and reviewing the video frame by frame I noticed that there were several objects one a triangle and another is sphere.  Several objects went whizzing by that I did not see with my own eyes but on video you could see them going by much closer than the object that was in the sky.  These were not Birds because I did Capture One bird and it looked completely different which was much larger.",
      "link": "http://www.nuforc.org/webreports/126/S126704.html",
      "state": "CA",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c5b24",
      "summary": "10 round red (like fire) lights flying in line traveling up then fading out of view.",
      "city": "sacramento",
      "shape": "circle",
      "date": "2016-04-22T00:00:00",
      "story": "10 round red (like fire) lights flying in line traveling up then fading out of view. Around 8:34 pm we sighted a total of 10 round red UFOs flying in a straight line, one after another.  Except for a short break between the 3rd and 4th, and the 5th and 6th. They came from the east and travelled northwest. As they flew higher they faded out of view.  They all seemed to travel at the same speed except for the 5th one which came out later then the others and travelled faster. They were all a flaming red color like they were on fire, only brighter then fire. I took video but it just looks like white lights doesn't show red.",
      "link": "http://www.nuforc.org/webreports/126/S126919.html",
      "state": "CA",
      "duration": "30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c5c75",
      "summary": "Long-tail aircraft that curved up.",
      "city": "sacramento",
      "shape": "other",
      "date": "2016-03-24T00:00:00",
      "story": "Long-tail aircraft that curved up. I was going into Walmart on Marconi in Sacramento at about 1330 to get groceries and i looked up above the building and i saw an aircraft i have never seen before.  The head looked like a triangular and then it had a long tail that curved up at the end.  The long tail reminded me of a scorpion tail and there was no way it could carry passengers so i ruled out a new craft associated with the airport.  The tail was extremely thin and white.  The triangular shaped part where there could have been a pilot was darker in color.  I saw it in plain daylight no clouds in sight.  It was on the lower side in the sky.  I stared at it, trying to remember the details and no one seemed bothered by it at all.",
      "link": "http://www.nuforc.org/webreports/126/S126461.html",
      "state": "CA",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c5e3b",
      "summary": "two high speed, high altitude lights Sacramento California 9:15pm + 8-19-07.  ((NUFORC Note:  Space Shuttle and ISS?  PD))",
      "city": "sacramento",
      "shape": "light",
      "date": "2016-10-11T00:00:00",
      "story": "two high speed, high altitude lights Sacramento California 9:15pm + 8-19-07 2 solid unblinking bright white lights, high altitude, high speed, traveling in a straight line one behind the other (1/4 mile + apart) heading approx SSW.  Lasting approx 1 1/2 minutes then fading away in unison at a point that I should easily have been able to see them still but was no longer able to.....the sky was totally clear, so nothing was blocking my view of where they should have been still...... Did anyone else see this????? ((NUFORC Note:  Witness elects to remain totally anonymous;  provides no contact information.  PD)) ((NUFORC Note:  Probably the ISS and Space Shuttle, which had undocked.  PD))",
      "link": "http://www.nuforc.org/webreports/058/S58281.html",
      "state": "CA",
      "duration": "1.5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c6173",
      "summary": "Bright violet light covered in mist, when it stopped moving, the mist formed a perfect sphere around the light. ((anonymous report))",
      "city": "sacramento",
      "shape": "light",
      "date": "2016-09-09T00:00:00",
      "story": "Bright Violet light covered in mist, when it stopped moving, the mist formed a perfect sphere around the light. I am going to be completely honest.  I was out at night collecting wood pallets, that's the reason I was up so early in the morning.  We ended up in front of a friends house to store the pallets away for the night.  As we were sitting around talking, I noticed a light through the trees.  So I stepped aside to get a better view. When I did get a clear view, I immediately knew exactly what I was looking at.  What I saw was a bright violet light with mist trailing behind it.  It was about the size of a semi truck and it was moving slowly.  So I had called my friend to come and look at it, and around the same time he had eyes on, it had stopped. When the UFO came to a halt, the mist that was trailing it suddenly surrounded the light like a sphere as if it were (For lack of a better term) a force field.  The light maybe 10 seconds after stopping shot away into the night sky like a meteor. I am very knowledgeable in aircraft, this wasn't man made in anyway.  I have actually seen other types of UFOs as well.  This one I am absolutely sure to be extraterrestrial, at the least!  One day I will catch one on camera.  Hopefully my drawings will help others somewhat visualize what I saw, or maybe prove me wrong. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD)) ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/129/S129816.html",
      "state": "CA",
      "duration": "30-40 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c6193",
      "summary": "I was sitting out side and looked to the west and saw a massive light in the sky it was red,blue and white it stayed in one place for 2",
      "city": "sacramento",
      "shape": "light",
      "date": "2016-09-30T00:00:00",
      "story": "I was sitting out side and looked to the west and saw a massive light in the sky it was red, blue, and white it stayed in one place for 2 mins and dropped to the left and down just above the horizon and then lifted up again and stayed there for almost ten mins the went out of view ((ADDENDUM FROM SOURCE OF REPORT)) hello mr Davenport it was tonight.at 9:30 pm...sorry I was a bit shaken we I first saw it...thank you again  ((END ADDENDUM)) ((NUFORC Note:  We have corrected the time indicated above.  PD))",
      "link": "http://www.nuforc.org/webreports/130/S130210.html",
      "state": "CA",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c61c3",
      "summary": "Star-like object trailing plane, followed by silver-whitish gray pill object",
      "city": "sacramento",
      "shape": "oval",
      "date": "2016-09-30T00:00:00",
      "story": "Star-like object trailing plane, followed by silver-whitish gray pill object Around 11:35 AM, I went outside to get fresh air,  I looked up toward the west to look at the moon (which was barely visible) and I saw the first object gradually appear.  I started dim like a star then became brighter up to a 4.4, like Venus.  A few seconds after it came into view it started to swing from north to south then started to travel south, very slowly.  I called my mother to view what I was viewing, just to confirm what I was seeing and she saw the same thing too.  I told her to keep an eye on the object while I grab binoculars.   By the time I got back, my mother said it had faded away, I'm assuming it went back up into the atmosphere?  Then a commercial aircraft passed by and then we saw another star trailing the commercial craft - that one was blinking.  I brought up my binoculars to look at the plane and the blinking thing that was trailing it but it and the plane left my view because my house was obstructing my view.  However, in the area where we first ! spotted the blinking thing that was following craft I saw through the binoculars a silver-whitish gray pill.  It looked like it was tumbling to the east then froze, then glided west and then it tumbled up into the atmosphere where it faded away.",
      "link": "http://www.nuforc.org/webreports/130/S130230.html",
      "state": "CA",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c65dd",
      "summary": "Circular, bright,orange,neon,light. It looked as though it had a vapor trail behind it. It was going east bound then changed flight to",
      "city": "sacramento",
      "shape": "light",
      "date": "2016-08-02T00:00:00",
      "story": "Circular, bright,orange,neon,light. It looked as though it had a vapor trail behind it.  It was going east bound then changed flight to go north bound.",
      "link": "http://www.nuforc.org/webreports/128/S128804.html",
      "state": "CA",
      "duration": "8 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c65f1",
      "summary": "Fireball with trail similar to a comet seen navigating over roof tops of suburb of city.  ((NUFORC Note:  Space debris.  PD))",
      "city": "sacramento",
      "shape": "fireball",
      "date": "2016-08-02T00:00:00",
      "story": "Fireball with trail similar to a comet seen navigating over roof tops of suburb of city While walking my dog I saw what looked liked an orange ball shaped light with a trail following of what looked like sparks.  The ball shaped object looked to be similar to a burning sparkler like the type kids light on the 4th of July.  The object was flying approximately 50-100 feet above ground and navigating between larger objects in the area.  At first glance it looked like a meteorite with the trail of sparks but it was too low and seemed to navigate around large standing trees, power lines, and two story homes.  I've seen other strange things around this area, but nothing quite like this.  I went to take a closer look to see if maybe it were a crashing plane or meteorite but there was nothing where it should have landed.  I first observed it through trees and assumed the trail of what I'm going to call sparks were just glare, but when it came into the clearing I saw that it was not.  There also seemed to be a dark residue in the sky in the objects flight path, but not smoke. No sound was heard from the object, just a visual observation.  I'm curious if anyone else has seen this object.  I've seen other lights that would hover and make figure 8 patterns in the air, which I tracked for miles while driving home where it settled over an old building and put on a show for 20-30 minutes before disappearing into thin air. This light looked like a police siren that would flash green for a while, then red, then blue, then purple and repeat in no discernible order.  I took a video of this but it somehow got deleted off my phone. When I had looked at this video I saw other strange lights that I didn't see when filming with my phone. This was approximately one year ago. I've seen other very similar lights but just dismiss them now because they are so common. I'm not sure what to make of what I've seen but it keeps getting stranger and stranger as time goes on. ((NUFORC Note:  Space debris.  PD))",
      "link": "http://www.nuforc.org/webreports/128/S128840.html",
      "state": "CA",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c67d4",
      "summary": "Three red orb-shaped objects, and parachute, over Sacramento.  ((anonymous report))",
      "city": "sacramento",
      "shape": "fireball",
      "date": "2017-04-13T00:00:00",
      "story": "Three Red Orb Shaped Objects and Parachute over Sacramento We were on our back porch and in the sky were three red orbs, with no streaks or tails, traveling slowly from East to West.  They did not blink, nor was there any sound.  They each slowly faded out and once they were gone there was what appeared to be a parachute that drifted in the westerly direction, until it was out of sight. ((NUFORC Note:  Source of the report elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/133/S133488.html",
      "state": "CA",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c68a7",
      "summary": "Small very bright light seen lowering down the sky.",
      "city": "sacramento",
      "shape": "other",
      "date": "2017-03-10T00:00:00",
      "story": "Small very bright light seen lowering down the sky. First seen from living room window, older sibling brought attention to it as \"super bright light\".  It was brighter than any other star in the sky so we thought it was an electrical light.  We grabbed binoculars and noticed it looked like a dome or half circle.  We saw it at 8:00 pm and watched it until 8:45 pm, when it finally got too low to see beyond the buildings.  It was to the west of Sacramento CA.",
      "link": "http://www.nuforc.org/webreports/132/S132842.html",
      "state": "CA",
      "duration": "45 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c6e78",
      "summary": "About 20 white circular lights that periodically turned red.  Caught some on camera doing a zig zag, then they ended up vanishing.",
      "city": "sacramento",
      "shape": "circle",
      "date": "2017-07-07T00:00:00",
      "story": "About 20 white circular lights that periodically turned red.  Caught some on camera doing a zig zag, then they ended up vanishing. Went outside on a clear night to see a bunch of moving white lights that were blinking red.   Was going to pass it off as a bunch of jets, or something, before they vanished while we were looking at them, my husband got a picture of some of them, in the picture two were in the middle of zigzaging and you can clearly see the red zigzag.   Also got video of them.   My father in law said one came close to an airplane then zagged around it, two other people saw this one.",
      "link": "http://www.nuforc.org/webreports/134/S134730.html",
      "state": "CA",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c7336",
      "summary": "i witnessed a rectangle, very bright LED type light looking S/W and est. the distance of 8 miles.  It was huge.  The lights shut off.",
      "city": "sacramento",
      "shape": "rectangle",
      "date": "2017-06-02T00:00:00",
      "story": "i witnessed a rectangle, very bright LED type light looking S/W and est. the distance of 8 miles.  It was huge.  The lights shut off.  GONE I looked outside my bedroom window in the Arden-Arcade area of Sacramento County at 21:41, looking South West and observed a Red/Orange RECTANGLE, very, very bright LED type light or combination of many lights. I estimate the distance of six to eight miles away and the size of approximately 200 yards wide and 100 yards high.  It was huge!  It appeared to be about 1000 feet in elevation.  It hovered or floated around not moving too much, just up and down a little.  The lights went to bright blueish and shut off, then reappeared back into the bright Red, Orange light, very intense light projection. It drifted South across my sight, same distance and elevation, then shut off.  I videoed it with my tablet, but my tablet only recorded a bluish speck, but I was able to take a screenshot from the video at its most intelligible position.  I blew up the speck so you can almost make out the rectangle shape.  I could see it through my tablet as I was recording it and knew it wasn't recording the same brightness and color, but at least I was able to record its presence. This exact same event took place last year starting on May 13th, 2016, and continued most every night for a week and I also took phone video and pictures with my phone of that event(s). I will attempt to get a better video with my cellphone, although it is not a smart phone, it does record better than my tablet.  I used my tablet because it has way better screenshot and enhancement features.  I will send more reports as I witness them.",
      "link": "http://www.nuforc.org/webreports/134/S134233.html",
      "state": "CA",
      "duration": "4 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c7431",
      "summary": "I and friend see bright white greenish light to W, caught my attention towards W, observed it linger, then begin to head E.",
      "city": "sacramento",
      "shape": "light",
      "date": "2017-06-02T00:00:00",
      "story": "Myself and friend see bright white greenish light to West caught my attention towards west, observed it linger, then begin to head east, seemed from this angle to be airplane as it seemed to mimic a absolute silent one, after a moment changed course headed north.  Many more appeared through out night seemingly lost.  Upon observation of u.f.o, I noticed what APPEARED TO BE A STAR, was moving at what appeared to be a \"first time\" driver getting used to the gas/brake then faded in and out and disappeared, standing there staring at the area where it \"disappeared\"   We immediately noticed ANOTHER STAR headed in another direction where it mimicked it's....duplicates actions, and another one would catch our attention, at times we would observe two u.f.o's displaying similar actions at a time, throughout the night until daylight faded away the last visible star.  Periodically one of the \"airplane\" objects would appear usually headed west/east, of approxamentally THIRTY to FORTY U.F.O's.   Throughout the night we observed, only one set of lights (accompanied with the sound) were familiar to us as a jet.... Our necks hurt.   NOTE: SEEMED AS THOUGH THE CONSTILATION URSA MAJOR A.K.A \"BIG DIPPER\" MAINTAINED A STEADY POSISTION LOOKING NORTH.",
      "link": "http://www.nuforc.org/webreports/134/S134376.html",
      "state": "CA",
      "duration": "Till dusk"
    },
    {
      "_id": "64d005f478aba2ec5a3c74e9",
      "summary": "Driving on 99 south through Sacramento around 9:30 pm, seen 2 orange round objects dancing/flying together.  Other cars slowed down.",
      "city": "sacramento",
      "shape": "circle",
      "date": "2017-05-06T00:00:00",
      "story": "Driving on 99 south through Sacramento around 9:30 pm seen 2 orange round objects dancing/flying together.  Other cars slowed down to look, too.",
      "link": "http://www.nuforc.org/webreports/133/S133883.html",
      "state": "CA",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c7615",
      "summary": "Noticed 3 flying objects in the sky.  It was quite a distance between the 3 objects.  ((NUFORC Note:  Missile launch at 5:26 hrs. PD))",
      "city": "sacramento",
      "shape": "other",
      "date": "2018-01-12T00:00:00",
      "story": "I got home at 8:05p.m.  After I proceeded to go inside the house, I noticed 3 Flying objects in the sky.  It was quite a distance between the 3 flying objects.  There wasn’t much sound emitting from them.  I tried to take pictures from my phone, but it wasn’t that clear at night.  It last for about 8 minutes. ((NUFORC Note:  Missile launch at 5:26 hrs. PD))",
      "link": "http://www.nuforc.org/webreports/138/S138000.html",
      "state": "CA",
      "duration": "8 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c7853",
      "summary": "There was an orange light flying in the sky that was changing direction very rapidly.",
      "city": "sacramento",
      "shape": "light",
      "date": "2017-12-21T00:00:00",
      "story": "There was an orange light flying in the sky that was changing direction very rapidly. A friend of mine sent me a short video on Snapchat of an orange light that was flying around in the southern sky.  Looked at the video and walked outside to see if he was just trying to play a practical joke.  When I looked to the south I saw exactly the same thing he sent me, a bright orange light quickly changing directions and leaving streaks in the sky. The streaks last about four or five seconds.  One of my cats was outside at the time and was frantically trying to get inside as well as hissing at the object in the sky.  The object was flying and changing direction too quickly to be a plane, a helicopter, or a drone.  There was looked like a commercial airliner in the sky at the same time.",
      "link": "http://www.nuforc.org/webreports/137/S137918.html",
      "state": "CA",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c78e5",
      "summary": "Two very high altitude craft flying toward each other on collision course, then both stopped, hovered.",
      "city": "sacramento",
      "shape": "circle",
      "date": "2017-11-03T00:00:00",
      "story": "Two very high altitude craft flying toward each other on collision course, then both stopped, hovered. I saw two very high-altitude objects moving toward each other almost on a collision course.  The two objects stopped moving when they got close to each other.  Both objects hovered for several minutes.  One would flicker its lights, then the other would flicker.",
      "link": "http://www.nuforc.org/webreports/136/S136958.html",
      "state": "CA",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c793c",
      "summary": "There were 3 very dim lights in a triangular pattern, with a dark silhouette of a triangle surrounding it, flying near the power lines.",
      "city": "sacramento",
      "shape": "triangle",
      "date": "2017-12-04T00:00:00",
      "story": "Stepped outside for a cigarette.  Out of the corner of my eye,  I thought birds were flying.  I lit my cigarette and looked up.   There were 3 very dim lights in a triangular pattern, with a dark silhouette of a triangle surrounding it, flying near the power lines.   I followed it for about 20 ft, but it went too far.  No sound at all.  Not mistaken for birds, or drone, or anything that I can think of besides a craft.  It was about the size of a car.",
      "link": "http://www.nuforc.org/webreports/137/S137484.html",
      "state": "CA",
      "duration": "20 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c7ab5",
      "summary": "Dozens of bright orange circular lights.",
      "city": "sacramento",
      "shape": "circle",
      "date": "2017-11-17T00:00:00",
      "story": "Dozens of bright orange circular lights Just after 8:00pm Pacific time, I was walking to my car, when I noticed a bright stationary orange ball of light.  It stayed in one spot for approximately 30 seconds.   I ran inside to get my wife and kids.  They came out and were able to see the light briefly before it seemed to just disappear out of existence.  I just thought it was a little weird but nothing more.  I got into my car, went to grab some groceries about a mile from the house.   About 10 minutes after the original sighting, I was able to see an estimated 20-30 bright orange lights in the exact same area!  Almost in the shape of a flower petal, stretching maybe across 2 miles of sky.  I flew into the driveway honking.  My family ran out. Unfortunately, my wife and kids only saw the last 2 bright orange balls “blink”out of existence for about 10 seconds and then they were gone.   Within a minute there were 2 airplanes circling the area where we had seen the odd lights. We hopped in the car to get out of the suburb lights and chase what we saw.  They did not appear in any capacity again.  For the record I’m a huge skeptic when it comes to any type of UFO talk.  That being said I have no way to explain what we saw in the sky tonight.",
      "link": "http://www.nuforc.org/webreports/137/S137253.html",
      "state": "CA",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c7c74",
      "summary": "Unknown object in N. California sky.  ((NUFORC Note:  We suspect that the object was a \"twinkling\" star.  PD))((anonymous report))",
      "city": "sacramento",
      "shape": "unknown",
      "date": "2017-10-05T00:00:00",
      "story": "Unknown object in Northern California sky It seemed to be a bright star in the distance but it was blinking what seemed to be at least three different colors.  It was stationary for st least 10 minutes before writing this, and is currently still in the sky while I type this. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/136/S136519.html",
      "state": "CA",
      "duration": ">10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c7d6f",
      "summary": "Almost a yr. ago today, I was in my backyard stargazing at about 10 o'clock pm  when I noticed three circular bright orange   Round obj",
      "city": "sacramento",
      "shape": "circle",
      "date": "2017-09-08T00:00:00",
      "story": "Almost a year ago today I was in my backyard stargazing at about 10 o'clock pm, when I noticed three circular bright orange, round objects, traveling separately in the same direction that I estimate travel 300 miles in  less than one minute.   The three objects came to a dead stop, then shot out to the stars  about five times faster than what they were originally traveling and disappeared.   About two weeks later, I was laying on the back deck at about 1 o'clock am, when I was awoken to a extremely bright light, to the point where I had to shade my eyes from being burned.  The bright light lasted for about  30 seconds, then completely shut off.   The following day it felt as though I had severe sunburn  to my skin and my eyes were painful from what I had experienced.   There was nothing remotely  possible of duplicating this light on either my house or my neighbor's house.  To this very day I have told only a few people, and I still am baffled from what I have seen and experienced in both occasions. ((NUFORC Note:  Witness indicates that the date above is approximate.  PD)",
      "link": "http://www.nuforc.org/webreports/136/S136062.html",
      "state": "CA",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c7fbe",
      "summary": "They flew over Sacramento City College before I viewed them and traveled north.",
      "city": "sacramento",
      "shape": "disk",
      "date": "2018-04-13T00:00:00",
      "story": "They flew over Sacramento City College before I viewed them and traveled north. I was outside a popular coffee shop next to Sacramento City College on Freeport Blvd.  I was enjoying a cigarette and admiring the stucco design above the shop.  All of a sudden, a large silver disc flew over my head directly above me at slow speed!  I was startled at the appearance so close to me.  Just as I had a complete view of the craft another appeared! Then another and a fourth!  They were in a diagonal formation from right to left, the first to the right and the rest to the left.  They were scorched on the surface from heat of entry to our atmosphere.  This gave them a light and dark silver appearance!  There was no sound, no lights, no spinning!  They were about 50 feet in diameter and about 12 feet apart!  I thought of jumping in my car to follow them, but I was worried about having an accident!  I was shaking all over and the streets have cars parked on both sides making it difficult to look up and drive.  I watched for several minutes until they were out of s!ight.  They moved at about running speed on the ground say 6 mph.  Called MUFON about six months later and made this same report.  No one in the coffee shop seemed to believe me.",
      "link": "http://www.nuforc.org/webreports/139/S139411.html",
      "state": "CA",
      "duration": "3-4 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c839c",
      "summary": "Bright, square white light, flared, then dissolved.  ((NUFORC Note:  Rocket launch???  PD))",
      "city": "sacramento",
      "shape": "light",
      "date": "2018-10-12T00:00:00",
      "story": "Bright, square white light, flared, then dissolved. On this Sunday evening, I returned home about 8:20 p.m.  Above my house, looking south-to-southeast, I saw a bright white light, that appeared to be flaring upward.  This light sat stationary just above the roof of my house and appeared to change shape, as it slowly descended until the main portion of the light dissolved and flared out.  This bright light measured approximately one-half inch between thumb and index finger with arms extended.  The light sat between two planetary objects, which were also captured in my iPhone still image and video (attached in an email). The principal light source did not appear to be a craft of any sort.  But the high luminosity suggests it was something very unusual, especially as it flared and then dissolved in night sky, below my roof line.  Several minutes later, I walked around the corner, but could not spot it anywhere in the southern sky. (Thanks for all your work in this area over the years, Peter!)",
      "link": "http://www.nuforc.org/webreports/143/S143396.html",
      "state": "CA",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c8410",
      "summary": "Hovering silent craft with diamond pattern lights",
      "city": "sacramento",
      "shape": "",
      "date": "2018-08-10T00:00:00",
      "story": "Hovering silent craft with diamond pattern lights It was around 10 P.M. @ night when my brother & I were sitting on top of the roof of the shed by the chicken coop.  House location close to I-80 & Madison Ave..  We were up on roof waiting for the raccoon that had been stealing the chicken eggs, when we saw this flying object appear above us & it stayed above us for aprrox. 10 min.  It was about 500 ft. above us just hovering.  It had four lights in a diamond pattern & made absolutely no sound.  That is what was so most memorable about it.  I thought at the time, maybe McClellan Air force was flying one of there aircraft.  It hovered over us for close to 10 minutes, then flew up & away.",
      "link": "http://www.nuforc.org/webreports/142/S142426.html",
      "state": "CA",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c89c4",
      "summary": "I saw what could be a blue green weather baloon which dispeered then about 15 white dots in the sky which come and go.",
      "city": "sacramento",
      "shape": "sphere",
      "date": "2019-09-06T00:00:00",
      "story": "i was smoking a cigarette and saw what could be a blue green weather baloon which dispeered then about 15 white dots in the sky which would come and go. never have seen anything like it",
      "link": "http://www.nuforc.org/webreports/148/S148475.html",
      "state": "CA",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c8d70",
      "summary": "Green lightning.  ((anonymous report))",
      "city": "sacramento",
      "shape": "sphere",
      "date": "2019-01-17T00:00:00",
      "story": "Green lightning Bright green orb of lightning first flashed above storm clouds then descended just below, and then shot northbound at same elevation, then flashed and went up.  No sounds other than storm. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/144/S144476.html",
      "state": "CA",
      "duration": "3 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c8f93",
      "summary": "My husband went out front to smoke a cigarette at a little after 6am this  morning. When he came back inside he was saying something ab",
      "city": "sacramento",
      "shape": "sphere",
      "date": "2018-11-24T00:00:00",
      "story": "My husband went out front to smoke a cigarette at a little after 6am this morning.  When he came back inside he was saying something about he doesn't know what this is that he had never seen it before then proceeded to show me a video.   I watched the video the.  Went out front to see if i could see it.  When I looked up i was surprised to see it.  It was just sitting there in the sky over Watt Ave.  It has the brightest white lights and they were in a line but horizontal.  It is super cold, so i went inside but checked on it at 6:28 and it was still there.",
      "link": "http://www.nuforc.org/webreports/143/S143759.html",
      "state": "CA",
      "duration": "6:28"
    },
    {
      "_id": "64d005f478aba2ec5a3c926f",
      "summary": "Star not a star.",
      "city": "sacramento",
      "shape": "light",
      "date": "2019-12-01T00:00:00",
      "story": "Star not a star. Watching tv when I heard a noise in the backyard. When I went to check it out I didn’t see anything. It was a cold night and the sky was lit with stars had no choice to admire the bright clear sky. Standing there for a couple of seconds I noticed what appeared to be a star, but it was moving slow and then it stopped. 10 seconds later a flashing red light was moving all around the object, going up,down,left,and right at a incredible speed. I got kinda spooked and couldn’t really figure out what I was looking at. Went inside to tell my gf who was sleeping, by the time she went to take a look it was gone.",
      "link": "http://www.nuforc.org/webreports/149/S149956.html",
      "state": "CA",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c98e2",
      "summary": "I got up a little after 5am to check my emails and check some things on my pc, went into the main room and let the dogs go out do thing",
      "city": "sacramento",
      "shape": "triangle",
      "date": "2019-10-04T00:00:00",
      "story": "I got up a little after 5am to check my emails and check some things on my pc, went into the main room and let the dogs go out do thing outside.  After i did my pc work i went outside myself at or around 6am to relax, sitting in table and chair at my cover patio i looked to the southwest up to the sky and saw a ufo triangle shape with lights all along all sides and three lights on the bottom this was at a 55 degree angle for the time i was watching this ufo up 3 to 4 mins it NEVER moved  No sound and i told myself get your camera now and i did when i came back out it was gone dam i told myself.  The size compared to the moon where it is, this ufo was almost half the size of the moon.",
      "link": "http://www.nuforc.org/webreports/149/S149235.html",
      "state": "CA",
      "duration": "3 minutes"
    }
  ]
}