{
  "city": "salem",
  "fetch_timestamp": "2025-07-12T14:37:06.234994",
  "record_count": 179,
  "pages_fetched": 8,
  "api_calls": 9,
  "source": "ufo_aficionado_api",
  "records": [
    {
      "_id": "64d005f478aba2ec5a3b45d3",
      "summary": "saw lazer light shaft 2 to 3 miles long.",
      "city": "salem",
      "shape": "other",
      "date": "2006-05-15T00:00:00",
      "story": "saw lazer light shaft 2 to 3 miles long. i was headed south bound on mission street. there werent many cars on the road. i was waiting at a traffic light. i looked up out my opened window and saw what appeared to be a blue lazer light going across the sky. it didnt seem to have a begining or and end. if you took a giant blue neon light roughly 2 or 3 miles long, hung it in the sky. it was gone as fast as it appeared. it looked like someone just turned a switch off.",
      "link": "http://www.nuforc.org/webreports/050/S50401.html",
      "state": "OR",
      "duration": "20 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b4cd4",
      "summary": "Extremely bright circular light shooting horizontally in sky and disappeared as if flying behind something in clear night sky.",
      "city": "salem",
      "shape": "light",
      "date": "2019-06-20T00:00:00",
      "story": "Extremely bright circular light shooting horizontally in sky and disappeared as if flying behind something in clear night sky. As I was listening to a friend talk to a group of four of us, I saw a light as bright as the full moon but smaller in size, which was about 1/8 the size of the moon, travel in a perfectly straight line horizontally across the sky and disappeared into absolutely nothing.  There were no clouds and the moon was full and bright.  The light traveled faster than any airplane and was not a shooting star.  There was no tail or lagging light behind the object.  The size of the object was so large it could never be misinterpreted as an aircraft.  The manner at which it disappeared into thin air was a complete mystery.  I have never seen anything similar to this, and matter of fact have never seen anything other than aircraft and an occasional shooting star a handful of times.  As I yelled “Did you guys see that?” I actually startled everyone because they actually did not see what I had because it was behind them.  This is definitely a little scary, mysterious, and totally unexplainable.",
      "link": "http://www.nuforc.org/webreports/146/S146837.html",
      "state": "VA",
      "duration": "1-2 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b4e06",
      "summary": "Orange sphere hovers for a minute, and then steadily moves North.  ((anonymous report))",
      "city": "salem",
      "shape": "fireball",
      "date": "2019-05-09T00:00:00",
      "story": "Orange sphere hovers for a minute, and then steadily moves North. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD)) ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/145/S145958.html",
      "state": "OR",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b54b2",
      "summary": "Object with string of red lights hovers over strip mall then moves over interstate highway before shooting into the sky.",
      "city": "salem",
      "shape": "circle",
      "date": "2007-11-28T00:00:00",
      "story": "Object with string of red lights hovers over strip mall then moves over interstate highway before shooting into the sky. My self and two of my cousins were walking along the street heading west. We were going to have pizza. Ahead of us the houses thin out and there was a section of about two city blocks where there were no houses, just grass lots. Beyond that was a small unused strip mall,some fast food and other types of stores. Beyond that was Interstate 57. As we talked we noticed a string of red lights appear above the dark strip mall. We could make out a form that was darker than the night sky.  To me seemed round with the lights ringing the middle. I would say it was about 30-40 feet across.The object started to move very slowly to the north west. I remember we talked about what it could be, One of my cousins said it must be a helicopter to move so slowly and hover like that. About that time the lights went out. a few moments later a small private airplane crossed the sky to the south east. We could plainly hear its motor. That ruled out a helicopter. The object could still be made out as a dark spot in the sky. It moved west until it reached the interstate highway at which it moved lower and went north along the highway. We could plainly see the traffic moving under it. It went north along roadway until just about the exit/overpass at which time it tilted skyward and in a blur was gone. We were shocked and at this point we knew it was nothing we could point a finger at and say \"that was it\" We talked excitedly and ran to the pizza place. We had been there maybe three minutes. Standing in line to place our order when a man in his early 20's came running in. He was hysterical. He asked where the phone was, he had just chased a UFO on the interstate. People in line snickered and we stopped talking about it until we were seated. Obviously he had seen the same thing we had. ((NUFORC Note:  Witness indicates that the date of the incident is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/059/S59617.html",
      "state": "IL",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b593a",
      "summary": "Two separate rapidly brightening and dimming objects",
      "city": "salem",
      "shape": "light",
      "date": "2006-10-30T00:00:00",
      "story": "Two separate rapidly brightening and dimming objects Was pointing out what I thought was the ISS travelling to the northeast, to two co-workers, but it got dim fast.  Then about 15 seconds later they noticed something else get really bright to the southeast and I caught it out of the corner of my eye, and then it went dim really fast. The first moved in a straight line, the second one seemed to \"wiggle\" for a second. The ISS wasn't scheduled to pass over this area at this time, but I've never seen anything this bright from town. Neither object behaved like a meteor nor did they have flashing lights like a commercial airliner would. ((NUFORC Note:  Witness elects to remain totally anonymous;  provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/051/S51845.html",
      "state": "OR",
      "duration": "3 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b59d2",
      "summary": "A large, bright orange rectangle appeared in front of the mountains, changed shape and produced orbs.",
      "city": "salem",
      "shape": "rectangle",
      "date": "2007-11-28T00:00:00",
      "story": "A large, bright orange rectangle appeared in front of the mountains, changed shape and produced orbs. Just after midnight of the morning of September 5, 2007 I saw a bright orange rectangular object in the northeastern sky. At first I thought it was the moon seen through clouds, but the shape was too close to the horizon and in front of the Cascade range to have been the moon. And the shape was so unusual and so ‘unnatural’ that I was totally puzzled. As I watched for about the first 10 minutes, the object moved away back toward the northeast and disappeared.  I left my window for about five minutes but returned out of curiosity to see if the object had returned. As I looked, the object did begin to reappear but this time the shape changed to an actual triangle but retained its bright orange appearance. I decided to go quickly and get my binoculars that were in the car in the garage. I was not sure if the object would be there when I returned.  When I returned, perhaps within 30 seconds, with my binoculars, I was able to focus more clearly on the object. It was definitely a triangle and had moved closer moving toward the southwest. It stopped and stayed in one place and as I watched through the binoculars, three orb or globe-shaped spheres, all smaller in size than the object itself and seemingly ‘colorless’, emerged and moved around the object. Two of the orbs floated at the base of this triangle of light. The third remained somewhat stationary.  The now four objects remained in place for about 15 minutes and then seemed to drift back toward the northeast and finally disappeared altogether. I called our local police to see if anyone else had seen or reported what I had seen, but the police said that no other calls had been reported.  I do not know if I even believe in UFOs, but I have to say, I saw something I could not identify, it was flying and it was an object.",
      "link": "http://www.nuforc.org/webreports/059/S59503.html",
      "state": "OR",
      "duration": "30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b5aee",
      "summary": "I saw a flying craft that was unlike anything I've ever seen.",
      "city": "salem",
      "shape": "other",
      "date": "2007-11-28T00:00:00",
      "story": "I saw a flying craft that was unlike anything I've ever seen. Approximately three weeks ago, my mother, my 3-year-old son, and I were returning home from shopping at about 8:30 at night. We were on our back porch and we saw a red and orange, roundish mystery objest flying up above about a half mile away. We were all instantly enthralled with the object beacuse it had virtually no form, it was glowing, it was silent, it would stop in mid flight (float would be more like it), and then it would change direction and go in reverse. After about twenty seconds of watching it, the thing started dropping a few burning embers that would burn out before hitting the ground or trees. That was when it started getting really weirs. We thought whatever it was was going to crash but it keep hovering over head, moving very slowly. It continued to do so fo almost another minute and a half and then it started to drop quite a lot of burning embers to the ground (the object itself did not look like it was on fire at all) nad then it just disappeared. It was the strangest thing I've ever seen in my life and I am writing this because I saw an article in the local paper a couple weeks ago about different people witnessing the same thing. ((NUFORC Note:  Witness indicates that the date of the incident is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/059/S59647.html",
      "state": "OR",
      "duration": "2 to 3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b5d5f",
      "summary": "Triangular Shaped Object Seen on U.S. Rt. 50",
      "city": "salem",
      "shape": "triangle",
      "date": "2007-02-01T00:00:00",
      "story": "Triangular Shaped Object Seen on U.S. Rt. 50 This happened quite a few years ago, but I remember the details perfectly.  My girlfriend and I were traveling on US Rt. 50 heading east from Parkersburg to Clarksburg.  We were passing through (around) Salem when I noticed a large triangular-shaped object in the sky just above the horizon.  At first I thought it was an oil-rig on top of the ridge (a common sighting in WV), or a cell phone tower, but I had made that particular drive hundreds of times and felt as if something was unusual, so I dismissed both of those notions.  I woke my girlfriend and asked her if she recognized the object in front of us; she didn't.  The object was vertical, at first, with bright red lights in each corner.  Immediately after waking my girlfriend an extremely bright white light came on in the middle of the object, seemed to make a sweeping motion, and eventually \"highlighted\" us for a brief period of time.  This made both of us nervous, but not particularly scared.  I had to look down at the road and when I looked back up it was floating horizontally above us.  When I looked down at the road again and back up it had disappeared.  The object never seemed to move while I was looking at it, nor did it make any sounds.  I originally thought it was a helicopter but dimissed the notion when I realized it had to have been within 100ft. of us and not making any sound whatsoever.  Both my girlfriend and I were fascinated with the unusual sighting and had thought about calling the regional airport in Clarksburg to see if there were any aircraft in the area at the time.  We never did and never really talked about it the remainder of the time we dated.  I probably wouldn't have really thought about it much more until I watched a UFO special on TV sometime in 2001.  They were discussing a case and had an artist's rendering and animation of the exact same object that I had seen.  Since then I've told the story to some people, always siting what I saw on the television special. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/054/S54447.html",
      "state": "WV",
      "duration": "3 Minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b5ea1",
      "summary": "Two Parallel Lights Moving At Very High Speed Along An Unusual Path",
      "city": "salem",
      "shape": "light",
      "date": "2008-03-04T00:00:00",
      "story": "Two Parallel Lights Moving At Very High Speed Along An Unusual Path It was a clear, cold evening in Salem, OR.  The temperature was about 36 degrees, perhaps two degrees above the dew point.  My wife and I were in our spa.  It is situated where two legs of our house (an “L” shape) join such that we have a clear view towards the north and east.  Some trees block a horizon view to the east, and the house blocks the view to the southwest.  There is considerable ambient light.  At 2112 (PST) I noticed two lights moving from the northeast to the southwest.  They were moving parallel to each other, being apart about the same distance as two of the stars in the Big Dipper handle, and half as bright as Mars.  [I think it was Mars I was seeing in the northeast sky.]  I said to my wife, “Look at that!”  They passed right over the top of us, just after which my wife located them.  When they disappeared two seconds later, she said, “What was that?”  They moved fast and in straight lines.  About seven seconds elapsed between the times I first saw them above the trees until they disappeared behind my roof.  All I could see were lights, and the lights never varied until they were almost gone.  No noise was heard, although the damned low-speed spa pump was on at the time.  It was too late to see satellites.  Had they been aircraft they would most certainly have been heard (a sonic boom, no doubt).  Since the light was either generated by the objects or reflected, in my mind the only “reasonable” explanation is they were birds.  However…  These two “birds” had to be low (considering their speed) and expert fliers (to perfectly maintain their wide spacing).  They must have had bright underbodies to reflect the light.  City light varies, hence reflection varies, but their brightness didn’t vary.  I sense they weren’t that low, hence the perception of significant speed.",
      "link": "http://www.nuforc.org/webreports/060/S60253.html",
      "state": "OR",
      "duration": "7 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b6271",
      "summary": "Multi colored sphere like in",
      "city": "salem",
      "shape": "sphere",
      "date": "2006-07-16T00:00:00",
      "story": "Multi colored sphere like in I was on my way to work. I was traveling south on I - 95 headed to Salem N.H. it was a multicolored sphere traveling directly over the top of my vehicle about hundred feet up. was traveling at a high rate of speed. went by me and headed south for a few seconds then it went straight up in the sky and was gone. when I got to work I called the local police station in Salem N.H. they told me the phone lines were jamming up because hundreds of people saw the same thing I did and they were working on it. I said ok & hung up. that was 21 years ago so the day and month maybe wrong but it was in 1985. ((NUFORC Note:  Witness indicates that the date of the event is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/051/S51075.html",
      "state": "NH",
      "duration": "seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b64e7",
      "summary": "Green sphere visible over I-81 North in Roanoke County, Virginia at about 18:30 on December 23rd.",
      "city": "salem",
      "shape": "sphere",
      "date": "2008-03-04T00:00:00",
      "story": "Green sphere visible over I-81 North in Roanoke County, Virginia at about 18:30 on December 23rd. I was driving down interstate 81 north and was admiring the moon.  The sky was clear.   Suddenly, a bright green orb with a short white tail flashed across the sky right under the moon.  It was much larger than surrounding stars and visible planets and was much larger than comets I have seen.  It was visible for only a second and then vanished without even leaving a trail.   I have witnessed airplanes and meteor showers, but this object was very large, it appeared to be about a tenth of the size of the moon, and did not continue in a straight path for as long as a falling star or airplane would.  My sister, who was sitting in the passenger seat at the time, also saw the object.   There were no nearby cars whose headlights could have been mistaken for reflecting the appearance of such an apparition.",
      "link": "http://www.nuforc.org/webreports/060/S60478.html",
      "state": "VA",
      "duration": "3 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b6508",
      "summary": "I filed a report last night.  It is an embarrassment to file one this evening, but I feel an obligation to do so.",
      "city": "salem",
      "shape": "light",
      "date": "2007-04-27T00:00:00",
      "story": "I filed a report last night.  It is an embarrassment to file one this evening, but I feel an obligation to do so.  Arriving at the H.S. parking lot around 19:15 I rolled down the windows and opened the sunroof.  Many stars in the sky, just like last night.   Two small planes flew by.  Around 19:45 I saw and heard two jets fly over the H.S., I was amused. The jets flew over the H.S. this evening around the same time the lights were seen last night.  The jets came from the north and flew towards the south.  I could see two red lights overhead.  I felt good, was ready to home, enough of this stuff.  As soon as the jet noise dissipated, I saw a light.  Didn’t believe it would ever happen again.  They were further away, just above the treetops.  Two of the lights were southeast and one was southwest of the H.S.  The lights went on and immediately off.   Two to three seconds duration each time.    They had a yellowish tint, the same as last night.   This went on for several minutes.  Each light went on twice that I noticed.    No trailing lights of any kind.  The lights were bright, almost firework like in color temperature.    Each light illuminated in the same way, they seemed identical. It was weird!  Maybe military exercises were being performed.   I hope this is the case.  The jets \"play\" in the airspace around Salem quite often, but the lights were much lower than the jets. There is probably a simple explanation.  I wished that someone could provide me with one.",
      "link": "http://www.nuforc.org/webreports/055/S55597.html",
      "state": "MO",
      "duration": "5-10 min."
    },
    {
      "_id": "64d005f478aba2ec5a3b67bb",
      "summary": "Multiple crafts sited",
      "city": "salem",
      "shape": "light",
      "date": "2007-08-07T00:00:00",
      "story": "Multiple crafts sited I was sitting outside after watching fireworks with my family, I was alone. I looked up at the sky and I focused on one \"star\". After a while I noticed the \"star\" started moving. I thought my eyes were playing tricks wth me, so I focused on another star. To prove my point the second star didn't move. I turned toward the first star. It was still there but in a different location. I kept looking at it think it might have been a plane, but I don't know of any plane that emits a white light and hovers. So then I thought it was a helicopter. But I know helicopters can't fly that high. Then it moved in a straight line, but it wasn't no usual line. As it was moving it would shuttered. It would dip down and then back up, while keeping it's forward momentum. Then it stopped. During this time I was rushing around to find my video camera, but when I found it I couldn't focus enough on it to get a good picture. I couldn't see anything through the camera, so I put it down. And in the corner of my eye I saw more movement. I turn towards the movement and I noticed two lights moving in a cirrcular motion. They stopped and then one took off going away from me and as it was leaving it would pulse a white light. It would light up and then slowly die out. It repeated this until I lost sight of it. Then I looked at the other one. It did the same thing maybe a minute later. Then I looked back at the first \"star\". It was in the same area but once again it moved in location. Then I saw another light leave from the star I was looking at and I followed that with my eyes. Then I would look at other lights noticing that most of them moved in the way the first one did. I kept watching them, not noticing the almost 2 hours have past. I hated to leave it but I had to go to sleep. But all day today I have been thinking about what I had seen last night. I still don't know what to make of it.",
      "link": "http://www.nuforc.org/webreports/057/S57473.html",
      "state": "OR",
      "duration": "30+ min."
    },
    {
      "_id": "64d005f478aba2ec5a3b6a0d",
      "summary": "Vertical cylinder w/red round objects varying in number from 2 to 4 in center mixed with intense bright lights",
      "city": "salem",
      "shape": "cylinder",
      "date": "2007-11-28T00:00:00",
      "story": "Vertical cylinder w/red round objects varying in number from 2 to 4 in center mixed with intense bright lights Object appeared high in the N.E. sky at approximately 16 hundred hours.  Moved due south direction until it was due east of my position. It seemed to stop breifly, then changed direction and moved due east away from me until it dropped out of view.  Object was in view for about 7 minutes. Object was totally silent and moved very slowly. Clear conditions, no clouds, calm. Object appeared to me to be a verticle cylinder, very faint. I was viewing with binoculars. My wife also saw the object but didn't notice the cylinder, just the intense red center with bright lights. In its center there were bright red balls which seemed to pulsate and change in number from two to four. Around these were intense bright lights. Their appearance was like a cars bright headlights. Their color was more like a car's headlights then like what you would expect when viewing a Mylar balloon reflecting in the sun. The object was first noticed by me as I looked up to watch a V tailed Bonanza aircraft fly overhead. My father and I have restored vintage aircraft and I am very familiar with many types of aircraft. This was like nothing I have ever seen. A definite UFO to me. I'm not saying this object was an alien craft but I couldn't identify it and it was odd in nature. When it changed direction it seemed unlikely to me to be a balloon. I thought I should report it to your center.",
      "link": "http://www.nuforc.org/webreports/059/S59625.html",
      "state": "OR",
      "duration": "7 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b6ace",
      "summary": "Black triangular shaped aircraft sweeping the ground with a spot light over I-57 near Salem, Illinois.",
      "city": "salem",
      "shape": "triangle",
      "date": "2006-10-30T00:00:00",
      "story": "Black triangular shaped aircraft sweeping the ground with a spot light over I-57 near Salem, Illinois. I was on my way home from my fiance’s house on the night of 09/06/06. As I merged into the southbound lane of Interstate 57 from the Salem, IL. on ramp, I noticed that the traffic flow was unusually heavy. This caused me to note the time, which was 20:04 central time. As I checked my speed to set the cruise control I scanned the traffic in the roadway ahead of me. I noticed that both passenger vehicles and tractor-trailers were all moving at the posted limit or in many cases well below it. This in itself is unusual for this stretch of I-57. My first thought was that a State Trooper must have been laying in wait up ahead but as I maneuvered into the left lane to overtake a line of tractor-trailers, I saw 2 green lights probably a couple of hundred feet above the northbound lane and I guess about one quarter mile away. The lights were very bright, they sat side by side and as I watched I noticed that they appeared to be moving in a southerly direction. As I watched I noted that the lights were indeed moving to the south at a slow speed and I was rapidly gaining on them. My next thought was, that it was a police agency employing an aircraft with speed detection equipment. I could by this time see that the lights were part of the same object with one being on each side. This object appeared to me to be moving too slowly to be regular fixed wing and appeared too large to be an ultralite type aircraft so I assumed it to be a helicopter. At that point I decided that I had better be watching the road or “that chopper” would be life-flighting me to a hospital in St Louis. Just before I came along side the object I got a very intense feeling of dread. It was an almost sick feeling like when you unexpectedly get incredibly terrible news. As I approached, the object was still over the northbound lane, it was slowly moving south, as I could now definitely see it moving past the trees. The traffic in both lanes was still moving but at what appeared to be below the posted limit. I could now see the lig! hts clea rly and they appeared to be running lights on some type of aircraft but I could not determine just what type of aircraft it was.  The sky had been darkening for a while but there was still some natural lighting available as was illumination coming from a rest area that we were approaching. I could make out a dark shape but it was hazy. By this time my view was of course still from behind and the object was at about my 10 o’clock position and I’m guessing about 200 feet above ground. As it came into about my 9 o’clock position, a bright red light appeared to form an equilateral triangle pointing south. At nearly that same instant two other things happened. The sick dreadful feeling in my gut worsened and the aircraft/object stopped in mid air. Immediately the 2 green “running lights” as I call them, both turned bright red and the object rotated one half turn to the left. It spun itself about, completely 180 degrees in place. It reversed its direction of travel and began moving north very slowly. I slowed my vehicle to a near crawl in the passing lane and watched as the red light that formed the lead corner of the triangle turned a brilliant white. A beam of blindingly white light was projected toward the ground and swept about like a searchlight as the triangle moved northward at a crawl. The beam of light swept back and forth behind a thick copse of trees that line the interstate. I could not see the beam sweeping the ground as whatever it was apparently “searching” for was on the opposite side of the tree line.The entire time I watched the object I looked very closely between the lights to determine just what I was looking at. I could see a triangular outline with length, width and height but could not make out any structural details. It appeared as if it was not completely solid. It was a misty blackish, dark color, darker than the night sky. I could not see through it although again I say it did not look entirely solid. I put my driver’s side window down and stuck my head out as I passed the aircraft,! thinkin g maybe the light factory applied tinting on my vehicle’s glass was interfering with my seeing properly. I heard no sound nor could I see any means of propulsion like props or what might be intake or exhaust ports for a jet. When the object was about 100 feet away to my left and about 200 feet above me I quickly held up my hand to gauge size. The distance between the lights along all 3 sides was a little longer than the length of my left hand. I realized that I was still in the passing lane and I was either going to run over someone or get ran over myself. I felt that I should not stop, the thought of stopping made me nauseous so I changed to the right lane and I watched in my mirrors as the object continued northward, shining its spotlight into the woods with cars passing below it like nothing was wrong. I took my eyes off the mirror and glanced at the road ahead and when I looked back the object was gone. I did not see the object change direction left or right; I did not see it go up or down. I just looked back and it was gone. I turned around in my seat and looked rearward but still did not see anything. By the time I reached Dix, IL. my usual exit, I did not feel like driving the country roads home. I continued on to Mt Vernon at exit 95 and went home on more traveled roadways. I did not sleep well that night thinking about seeing whatever this was. I can’t help but wonder who else saw this. Of all the vehicles on the interstate that night surely I am not the only one that was intrigued enough to look.",
      "link": "http://www.nuforc.org/webreports/052/S52397.html",
      "state": "IL",
      "duration": "approx. 5 mins"
    },
    {
      "_id": "64d005f478aba2ec5a3b6c40",
      "summary": "Lights moving from south to north, low to ground and slow without any sound.",
      "city": "salem",
      "shape": "unknown",
      "date": "2007-02-01T00:00:00",
      "story": "Lights moving from south to north, low to ground and slow without any sound. The event happened on January 1st, 2007.  It was an exceptionally dark night; usually there is some minimal light pollution out in all directions from my house, but it seemed much lesser that night in retrospect.  I was doing work as I generally do at that time of night with my window blinds up, as I like to see the sky.  It happened to be a very nice, clear night out without any clouds.  While working away, I noticed out of the corner of my right eye, to the south, something with lights in the sky.  I glanced at it and realized that it wasn't either an airplane or helicopter.  As it was so dark that night, I was unable to make out any shape of the object.  It was emitting absolutely no sound, which is the first thing that struck me as strange.  The object was very low to the ground, far too low for a fixed-wing or rotary-wing aircraft; by my best estimation, somewhere between 100-150 feet from the ground.  The object had four lights that I could see; two in the front and the other two swept out to the sides and back a bit.  All four of the lights seemed to be emitting a light that looked color-wise to a warm flourescent light, but emitted light as strong and as clear as an industrial bulb would.  I would also like to note that these lights did not seem to shine any light down onto the ground, even from the low altitude.  The object was moving at a quite slow, steady pace, estimated at about 20-30 MPH.  It moved from south to north without stopping, changing course or speed as far as I watched.  Had I been in my senses, I would have jumped up and ran to the front door; I was, however, stunned at what I had just witnessed, wondering if it could have been something ordinary.  I believe it was not, however, due to the facts that a) I saw no landing lights or blinking lights on the craft, and b) There is no landing strip and/or airport north of my house; the nearest one is about three miles south-east.",
      "link": "http://www.nuforc.org/webreports/054/S54379.html",
      "state": "OR",
      "duration": "15-20 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b6e00",
      "summary": "Object was a bright light that stood out brighter than any star seen in sky from that location.",
      "city": "salem",
      "shape": "diamond",
      "date": "2007-10-08T00:00:00",
      "story": "Object was a bright light that stood out brighter than any star seen in sky from that location. I stepped out onto my deck at about 6:30 am and immediately noticed a very bright light in the sky.  At first, I thought it was probably an airplane, but it did not appear to be moving. The object appeared MUCH bigger (at least 5 times) than any of the stars in the sky and VERY bright. I thought I could see a 2 blinking red lights on the bottom, but not sure.  I went back inside to get my binoculars but was unable to get better resolution through them.  I walked downstairs to the back yard and watched the object for another couple minutes.  The light seemed to fade slightly, as if a haze passed over and brightened again.  In about 30 seconds it was completely gone.",
      "link": "http://www.nuforc.org/webreports/058/S58912.html",
      "state": "NH",
      "duration": "5 min"
    },
    {
      "_id": "64d005f478aba2ec5a3b714b",
      "summary": "No aircraft could have hovered so high, nor ascended vertically so quickly.",
      "city": "salem",
      "shape": "light",
      "date": "2007-10-08T00:00:00",
      "story": "No aircraft could have hovered so high, nor ascended vertically so quickly. On Monday, September 24th at about 10:30 PM, I was standing on my back porch looking at the stars.  I saw a very bright star, high in the Southwest.  Then, I realized that it was moving.  I see many airplanes in the night sky, but this had no running lights.  It was just pure white light.  Suddenly, it just stopped in place and quit moving.  Then, it got dimmer and dimmer while continuing to remain stationary.  It seemed to be ascending at a very rapid rate up into the stratosphere.  This whole incident occurred in about fifteen seconds.  I doubt that any conventional aircraft could have hovered so high in the atmosphere, nor ascended vertically so quickly out of view.",
      "link": "http://www.nuforc.org/webreports/058/S58944.html",
      "state": "OR",
      "duration": "15 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b735b",
      "summary": "Light in the ski far south of Salem Virginia on a clear late afternoon.",
      "city": "salem",
      "shape": "light",
      "date": "2008-03-04T00:00:00",
      "story": "Light in the ski far south of Salem Virginia on a clear late afternoon. It was around 5:30pm and the sky was clear and bright. As me and my son(13)was coming out of the Wal-Mart in Salem Virginia i looked up in the ski to the far south.  And I then told my son to look at that bright \"light\" in the sky.  We didn't see a shape but it look like one \"headlight\" in the sky traveling backwards.   At first this \"light\" wasn't moving fast.  It actually look like it was just sitting still. Then we looked up a little higher and we saw three jets at first they look like they was just going across but then they starting racing towards the \"light\".  At first I thought they were regular plane but they were too high and moving fast. Then the light\" starting moving south.   As the jets got closer to the \"light\" it stated to move faster.  So I told my son to get in the car because it's going in the direction we are going.  I could barely keep my eyes on the road because i was too busy looking up \"accident waiting to happen\".   As we travel south on 460 to the Elliston area the light started to slight disapear (it look like it was now some where past blacksburg area) then from the southeast we saw another jet or miltary plane moving fast in the same direction as the other 3 jets and the \"Light\".  After that i couldn't see any more because of the mountains.   Whatever it was the i know the military was going after.   If i saw that \"Light' i know others had to see it as well.   I am Christain and i believe in GOD and i don't believe in UFO or anything like that.  But after seeing what me and my son saw today make me think other wise.   I sometimes hear the miliatary planes fly over our area for training purposes but this time they were no-where to heard but only to be seen racing across the sky.",
      "link": "http://www.nuforc.org/webreports/061/S61987.html",
      "state": "VA",
      "duration": "30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b7950",
      "summary": "stationary -bright- sparkling/twinkling object in mid northwestern sky. 9:05 - 9:25pm est",
      "city": "salem",
      "shape": "light",
      "date": "2006-10-30T00:00:00",
      "story": "stationary -bright- sparkling/twinkling object in mid northwestern sky. 9:05 - 9:25pm est Flashing/sparkling/twinkling light in shades of reds, whites and blues. A little larger than what Venus used to look like with the naked eye. In the middle of the northwestern sky. It looked like what a close airplane might look like if it were hovering and flashing the lights rapidly. It wasn't necessarily low or close...but very noticeable in the middle of a clear sky.  It flashed/twinkled/sparkled for about 10 mins before I got my daughter. She saw the same thing. We watched it for another 10-15 minutes before some low clouds of a nearing front covered up the view. I spend a lot of time outside at this time of the evening, am very knowledgable about astronomy and weather and I've never seen anything like this before. I don't really believe in UFOs persay...but this was weird....weird enough for me to document it, and research it for a logical answer.",
      "link": "http://www.nuforc.org/webreports/052/S52784.html",
      "state": "IN",
      "duration": "20 mins"
    },
    {
      "_id": "64d005f478aba2ec5a3b7aad",
      "summary": "A triangle shape of 3 rapidly flashing blue-white lights moving slowly over downtown Salem, OR",
      "city": "salem",
      "shape": "triangle",
      "date": "2007-02-01T00:00:00",
      "story": "A triangle shape of 3 rapidly flashing blue-white lights moving slowly over downtown Salem, OR I was driving on Mission Street heading west in downtown Salem with my 2 ½ year old son.  I heard a low humming sound and looked up to see a triangle of bright white-blue rapidly flashing lights.   The craft didn’t appear to be much bigger than a prop plane. The craft was flying slowly (25 mph) due west at a low elevation.  The lights were moving in a clockwise rotation.   I called my husband at home (we live 1 mile south of downtown).  He went outside saw it as well, moving towards the West Salem hills.   I drove home and we watched it until it made a turn north and moved slowly out of sight.   I called the Salem Municipal Airport and the woman there said there were no aircraft over Salem at that time.",
      "link": "http://www.nuforc.org/webreports/054/S54983.html",
      "state": "OR",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b7bb9",
      "summary": "Daytime white triangle shaped object in the sky.",
      "city": "salem",
      "shape": "triangle",
      "date": "2007-02-24T00:00:00",
      "story": "Daytime white triangle shaped object in the sky. Arriving home, 5:05 pm, my wife (passenger) drew my attention to an object to our northeast.  Object was stationary.  Appeared the size of a commercial airliner at 25 to 30 thousand feet. I entered home, retrieved binoculars, stepped back outside; object had begun to move north. Through binoculars, object appeared to be triangle shape and white in color.  Object took about one minute to fade from view. Object did not have wings, lights, vapor trail, or sound.  Temperature was about 15 degrees.  Clear sky with setting western sun shining on the object. ((NUFORC Note:  We spoke with the witnesses via telephone, and both sounded to be quite serious-minded people.  The fact that the object was stationary, when first observed, is interesting, and the fact that it disappeared over the horizon so rapidly is equally curious, we believe.  PD))",
      "link": "http://www.nuforc.org/webreports/055/S55293.html",
      "state": "MO",
      "duration": "2 min"
    },
    {
      "_id": "64d005f478aba2ec5a3b7bcc",
      "summary": "Around 7:30 this evening I was waiting in the Salem H.S. parking lot waiting for the moon to rise.  I was planning on photographing the",
      "city": "salem",
      "shape": "light",
      "date": "2007-03-08T00:00:00",
      "story": "Around 7:30 this evening I was waiting in the Salem H.S. parking lot waiting for the moon to rise.  I was planning on photographing the moon this evening.  The moon was spectacular Monday night. While waiting for the moon to rise I caught a glimpse of light out of my right eye.  Initially I thought another street light had come on and didn’t give it a second thought.  However, a few seconds later a second light appeared relatively close to the first light.  The first light disappeared.  A third light appeared close to the second light. When the third light appeared the second light went off.  After the  third light went off they all came on at the same time.  Then itstarted over again.  The lights were on about 15-30 seconds each time. By this time my adrenaline was at it’s all time high.  I became anxious and scared.  I left the parking lot to go get my husband,  by the time we got back, no more lights.  If there is ever a next time, I will stay. The lights came on and off very deliberately.  There was no movement that I could see.  I got outside my car to listen for noise.  There was none.  The lights were very low in the sky and seemed to be very close.  The lights appeared to be over the High School. The  lights  were on the same plane, close together,  but were  not the same distance apart.  The color of the first light is what initially caught my eye.  The lights were very bright, had a yellowish tint and were uniform in shape.  The lights came on quickly and they seemed slow to turn off.  The lights were not the same color as the stars. Fort Leonard Wood is very close to Salem.  There is fighter jet activity over Salem all the time.   I tried to rationalize the lights coming from some sort of aircraft  from Fort Leonard Wood.  This could be the case, but I don’t think so. Never, have I seen anything like this before.  I wish my husband had seen the lights too.  He thinks I am nuts, but I am not. ((NUFORC Note:  Witness elects to remain totally anonymous;  provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/055/S55584.html",
      "state": "MO",
      "duration": "a few minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b7cb9",
      "summary": "Bright planet type light that went nova and shrunk to nothing. Hurt my skin and eyes.",
      "city": "salem",
      "shape": "light",
      "date": "2006-12-07T00:00:00",
      "story": "Bright planet type light that went nova and shrunk to nothing. Hurt my skin and eyes. Went outside to have a smoke. Was sitting looking due south. Somewhat clear night. I immediately was what I thought was Jupiter, but very bright and larger than ususal. Then I though, wait a minute, Jupiter should be in the east. The moon was out 2/3 full to the left/east of this light. A jetliner was passing to the left of the moon and the object.  Light/large star continued to just be there for a minute or so. Then all of a sudden it started to grow large, very large, about 1/3 the size of the moon. Very,very bright. The brightest white light I have ever seen.  My mind was racing looking for any other lights around it-like landing lights-or sound, no sound, it was dead silent. As this light reached its maximum.  It shrunk down to nothing very rapidly and --nothing.  Later that night my eyes were very uncomfortable and my face cream burned when I put it on.  The next morning, fog had come in, and the oncoming headlights of traffic hurt my eyes badly.  I had to wear sunglasses half the entire day. Felt weird. My nextdoor neighbors porch lights went out. Did anyone else see this? I don't wear glasses, I have excellent vision, I worked in aviation for 5 years.",
      "link": "http://www.nuforc.org/webreports/053/S53764.html",
      "state": "OR",
      "duration": "3-4 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b7eb1",
      "summary": "i saw two shiny discs move trough the sky from north to south in the sunny afternoon, very slowly.",
      "city": "salem",
      "shape": "disk",
      "date": "2009-12-12T00:00:00",
      "story": "i saw two shiny discs move trough the sky from north to south in the sunny afternoon, very slowly. i saw two shiny discs move from north to south at about two thirty in the afternoon. i was able to watch them for about twenty minutes. they were both moving very slowly without any sound. the one behind the first shiny disc seemed to be trying to catch up with the lead disc. the sun is what was the reason i was able to see these discs as i believe they were at, or above where the jets would be. maybe 80 degrees from the horizon. i believe that the disc behind the first disc was lost from the first disc, and that the shiny discs may had to expose themselves in order to see or know where each other were at. kinda like a cloaking devise on the t.v. shows from the sixties. Or that the only reason i saw these ships is that the suns brightness exposed them to the surface.",
      "link": "http://www.nuforc.org/webreports/071/S71924.html",
      "state": "OR",
      "duration": "20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b7ec4",
      "summary": "MISSOURI INVESTIGATORS GROUP Report:  As we were walking, I looked towards my house.and I pointed at a bright orange light…",
      "city": "salem",
      "shape": "light",
      "date": "2009-12-12T00:00:00",
      "story": "As we were walking, I looked towards my house.and I pointed at a bright orange light... Location of Sighting: We live 4 miles north of Salem, Missouri...the lights were ESE and SSE from our house...towards Salem.  I live across the road from my parents. My 8-year-old son and I walked my niece back to their house. We were walking back home and talking about going to the back yard to lay down on the trampoline to watch the stars since it was over 61 degrees F...and the sky was clear. As we were walking, I looked towards my house, which is south of my parents house...and I pointed at a bright orange light and said, \"what is that?\". I thought it was a really bright planet or something, but I didn't remember hearing anything about  that...as soon as I had thought that, it disappeared. My son witnessed that as well. As soon as that one had disappeared, another one appeared in the east. Very bright orange-white light. I turned around and told my other niece to run in and tell my parents to come outside and look. I saw it happen in 3 different places about 5 times before I ran inside to grab my camera and drive my car to my parents house. As I got onto their front deck, I saw another one...an! d my brother, Luke, was able to see it just before it faded. He saw another one with me that was a lot dimmer and moved up. My dad, James, came outside and together we saw over 8 occurances in different locations. There were 3-4 times that we saw two lights grouped together. I tried to get a video of the lights, but all it captured was our voices...I will try to find a video editor and see if I can brighten the video. It was very interesting. I'd like to know if there are any other reports of this please. Thank you!  Report received by MISSOURI INVESTIGATORS GROUP - http://ufomig.bravehost.com ((NUFORC Note:  We express our sincere gratitude to the MISSOURI INVESTIGATORS GROUP, and to its Director, BARBARA BECKER, for their having shared this report with our Center.  If you have had a sighting in Missouri, please consider contacting that organization, at the website above, to share your sighting with their investigators, in addition to submitting a report to NUFORC.  Thank you!!  PD))",
      "link": "http://www.nuforc.org/webreports/073/S73251.html",
      "state": "MO",
      "duration": "25 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b7ed1",
      "summary": "MISSOURI INVESTIGATORS GROUP Report:  I saw a saucer shaped object just down and to the right of the Moon.",
      "city": "salem",
      "shape": "disk",
      "date": "2009-12-12T00:00:00",
      "story": "My wife, myself and my nephew were driving home (Salem MO) from Rolla MO on highway 72 friday night at about 9:45 at night.  We were about halfway to Salem and My wife very calmly said hey look its a UFO.  At first I thought she was kidding because she does not belive in UFO's, but I looked to the left where she was motioning to and I saw a saucer shaped object just down and to the right of the Moon.  It was a big full moon that night, and at first I thought that maybe it was just a cloud that was being illuminated by the moon.  After my eyes focused clearly on it and I got a good look I could tell it was a perfect saucer shape.  It had no lights or anything it seemed to just be sitting there.  There wasn't any detail, just sort of a dark saucer shape with part of it being illuminated by the moon.  As we drove on the moon and the object became obscured from view by the treeline for a few seconds, and when it came back into view it was gone. Report received by MISSOURI INVESTIGATORS GROUP - http://ufomig.bravehost.com ((NUFORC Note:  We express our sincere gratitude to the MISSOURI INVESTIGATORS GROUP, and to its Director, BARBARA BECKER, for their having shared this report with our Center.  If you have had a sighting in Missouri, please consider contacting that organization, at the website above, to share your sighting with their investigators, in addition to submitting a report to NUFORC.  Thank you!!  PD))",
      "link": "http://www.nuforc.org/webreports/073/S73298.html",
      "state": "MO",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b7ed0",
      "summary": "MISSOURI INVESTIGATORS GROUP Report:  I saw a saucer shaped object just down and to the right of the Moon.",
      "city": "salem",
      "shape": "disk",
      "date": "2009-12-12T00:00:00",
      "story": "My wife, myself and my nephew were driving home to Salem MO from Rolla MO on highway 72 Friday night at about 9:45 at night.  We were about halfway to Salem (around Lake Spring) and my wife very calmly said hey look its a UFO.  At first I thought she was kidding because she does not belive in UFO's, but I looked to the left where she was motioning to and I saw a saucer shaped object just down and to the right of the Moon.  It was a big full moon that night, and at first I thought that maybe it was just a cloud that was being illuminated by the moon.   After my eyes focused clearly on it and I got a good look I could tell it was a perfect saucer shape.  It had no lights or anything it seemed to just be sitting there.  There wasn't any detail, just sort of a dark saucer shape with part of it being illuminated by the moon.  As we drove on the moon and the object became obscured from view by the treeline for a few seconds, and when it came back into view it was g! one. Witness did not contact police nor any other UFO organization. No photos were taken. Report received by MISSOURI INVESTIGATORS GROUP - http://ufomig.bravehost.com ((NUFORC Note:  We express our sincere gratitude to the MISSOURI INVESTIGATORS GROUP, and to its Director, BARBARA BECKER, for their having shared this report with our Center.  If you have had a sighting in Missouri, please consider contacting that organization, at the website above, to share your sighting with their investigators, in addition to submitting a report to NUFORC.  Thank you!!  PD))",
      "link": "http://www.nuforc.org/webreports/073/S73248.html",
      "state": "MO",
      "duration": "5 to 10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b8125",
      "summary": "Four large orange spherical objects with a diamond shape \"halo\"in long arc overhead.",
      "city": "salem",
      "shape": "sphere",
      "date": "2009-12-12T00:00:00",
      "story": "Four large orange spherical objects with a diamond shape \"halo\" in long arc overhead. Four objects were spotted overhead in sequence.  They faded as they moved from NW to SE and SW.  The objects were large and orange, larger than the space station appears.  They looked like large meteors, but did not follow typical trajectory.  One was followed by a small object that did look like a meteor.  The last object was particularly strange as we saw it through the tree line near the horizon and it then traveled overhead.  We have video of the fourth one, but it is shaky due to the zoom.  The entire event took about 5 minutes. The event occurred during a back yard gathering.  The witnesses (about a dozen) were mostly college professors and school teachers.  The object appeared to be a sphere surrounded by diamond.  Oddly, the sphere is clearly brighter on the back edge of its directions, contrary to what one would expect from atmospheric entry.  This was also the north side of the sphere two hours after sunset and was clear even at the western horizon, ruling out solar reflection. I am not suggesting that this is extraterrestrial, we simply cannot determine what it is.",
      "link": "http://www.nuforc.org/webreports/072/S72245.html",
      "state": "OR",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b821a",
      "summary": "Cigar Craft, Body Marks and Missing Time",
      "city": "salem",
      "shape": "cigar",
      "date": "",
      "story": "Cigar Craft, Body Marks and Missing Time   I am not exactly sure when this took place, but I was told it was clear and warm so I suspect it was Spring or Summer and it was in 1949.  This sighting included my parents, my older brother Bob and myself, I was only 2 ½ and I do not recall anything.   My dad and mom have different stories, so I will tell this like it was told to me. It was about 9 PM and we had just left my grandmother’s about 5 miles from our home. It is about a 20 minute drive.  Dad had the habit of driving up to S Commercial Street about 2 miles from grandmothers and he and mom  go by and would watch the Color TV in the TV shop before coming home, which they did occasionally and stayed about 15 minutes and then drive home.  This was a very sparsely populated, undeveloped area of town. Dad said, \"The UFO  showed up out of no where and it was cigar shaped, it was silver colored and had red lighted round windows and he could see figures moving around inside but did not see any people.\"  Then, he said if he slowed down, it would slow down and if he sped up, it would also speed up.  It did not make a sound.  He said it paced him on his drive home. That’s where dad’s memory ends. Then mom said, \"No, it was on Market Street NE, this would be between 10-12 miles distance from dad’s sighting, we were heading down Market near Swegle Grade School and Birchwood Drive about 6 blocks from home and all the sudden the UFO appeared and it was near the \"goose house.\"  This was a house where they raised geese and had a very distinctive odor.  I said, \"Did you get out of the car?\"  And she said, \"Yes,\" and dad said, \"No,\" in an almost terrorized voice,  mom said “ yes we did and we watched it go over and it almost hit the roof on the goose house. Then mom said she did not recall anything more till they were turning in the driveway at home.  Dad went in and called the local airport and was told that “ we are closed “ but he talked to the man anyway telling him what happened, and  the agent said they had also seen it and it went over so fast and without a sound and there was nothing around that could track it or follow it. Note: the airport closed at 11 PM, 2 hours after they left grandma's house. It was shortly after that time that I begin to react to low sound and vibration.  My family tells me that I would hear a train go by or vacuum running or even water going down a drain and I would cover my ears and scream. My aunt recalls that I would be playing and then all the sudden become stock still and then slowly turn my head as if I were tracking a sound that only I could hear.  I am not sure what happened that night, but I do know that when I was old enough to recall things, between 6-11 years of age, we would pass a building on the way to my grandmothers and I would sit on the floor of the car,put my back firmly against the locked car door and bite my arm to keep from screaming from pure terror. In later years I went back and looked at the building, still there and it was/is a car parts store with radiator hoses etc… looking in the windows at night it was dimly lit with curved archways over long dark hallways with lots of dangling tubes hanging down  could this have triggered a memory from that night?  As I said, I do not have any conscious memories of the event Mom has two deep red marks about the size of a small pea about ½” above and below her naval and she has deep dimples from scoop marks on front of both upper thighs and  she has 6 small brown smooth on the skin dots about the size of match heads on her back, forming two separate triangles which one over the other form one diamond and they have been there since that night.  She said the craft almost hit one of the houses as it was so low, it was cigar shaped and had portals and no visible form of engine, fire, etc, but the portals had light behind them. It paced their car, speeding up when he did and slowing down when he did.  We pieced together there was about a 2 hour missing time for this event.  Dad said it was in one area of Salem, and mom saw it in another, about 10+ miles different in location.  Mom said they stopped the car and got out and looked at it, dad said, noticeably scared, NO WE DID NOT and he would not talk about it any more, he died shortly after that. Mom always wondered about this one and still brings it up from time to time. She is now 83  None of her body marks were there before that night. My brother has no recall of that evening at all, he was about 5 years old. He still lives in Oregon as well. Since he has no memory of the incident it did not make much of an impact in his life, as far as we can tell. Dad was about 24 years old. Worked in a cannery as well as sold real estate. dad was always open minded, but I have to say he did not like talking about this event.  Mom was 25 and was home during the day, with my brother and myself to take care of she has always wondered what happened that night and even at her current age of 83 she still has questions and wonders about the marks ((NUFORC Note:  Source of report indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/070/S70810.html",
      "state": "OR",
      "duration": "2300"
    },
    {
      "_id": "64d005f478aba2ec5a3b8357",
      "summary": "Missing Time July 31, 1997",
      "city": "salem",
      "shape": "unknown",
      "date": "2009-08-05T00:00:00",
      "story": "Missing Time July 31, 1997  It happened on July 31, 1997  I had seen something a few days earlier when I was in the backyard and called mom and told her about it, sometime the next morning several others saw the same UFO I did but they made a official report and were talking about it on Art Bell and it made the papers.. I had seen the UFO heading south toward California and it was seen by the others over Medford near the California border, later that same morning. After this sighting when I heard others talking about it on the radio and read about it in the paper, I decided to call Peter Davenport,at the National UFO Reporting Center in Seattle, Peter had been up most all night taking reports with all the sightings in Medford and was very tired and did not have time to take the report, or at least this is what I believe that he said.  I took it personally and thought I would never call Peter again (not Peters’ fault, just my own judgment of the situation. I was helping out a friend in a small store here and told her about it and was still smarting at how Peter had treated me, or I thought he had treated me, and told her about that too. Anyway I was home watching TV, my husband was about to go to bed, he is needs lots of sleep.. he reminded me to lock the back door and put the stick in it.. that way if the cats get ancy we can open the patio door, put a stick in it and let them go in and out at will... anyway I said I would, and did, and he went to bed and I lay down on the couch and was out like a light, fully dressed/shoes too The next thing I remember was waking up and seeing it was time to feed the cats, it was about 7AM.. my husband was in his computer room and the back door was open, the stick had been removed, I got up, fed cats and my husband and was relaxing watching TV news with my second cup of coffee, when the phone rang and it was <former boss>, she was calling me to see if I was alright, and to ask me about the lights, I said you mean the ones I saw the other night? She said NO the ones you saw this morning.. I said I did not see any lights this morning and she said Yes you did, she again said are you OK?   I said YES I was fine, why wouldn't I be.. she said after your call this morning about the lights, I said what call, she said the one you made to me early this morning, she said you left me a message.. I wanted to hear it but she had erased it not thinking about it, but had listened to the message numerous times and had written it down verbatim' and signed the paper.. this is what she said the message said... (my remarks)  <name>, this is CK, I'm really sorry to call you at this time, it is 2:40 AM, in the morning, I am out by North Salem High School ( this is about 3 miles from my home) and I have been watching a bright light in the sky for about 45 minutes. If you know Peter Davenports number or one who does that sort of thing down here (In Salem) they need to be called. I am looking south and a little east and the large light is very bright, too big to be a star. There are 3 smaller lights in a line down one side and I can see two in a line down the other side, but there may be a third one, I can't see from here. It hasn't moved. If you know who investigates these please call them and tell them the information because there is no way this is stars.. End of recording/message.. I told <name> that she was kidding, right? she said \"No I swear its true\"  I asked her where I called from, she said she did not know, but that when I was done I did not say goodbye or anything, the line just went totally blank/dead, and it had a empty tinny sound. I called my husband into the living room and asked him when he took the stick out of the patio door? He said I thought you did, the door was open when I got up about 6:00 AM.. I ran to the front door, and it was closed but unlocked, it had been locked and a separate latch used, that was also open.. then I went into the driveway, scared of what I would find, and there was my car, parked on the opposite side of the driveway than I usually park.. I was terrified.. Where had I been, what had I done?  I asked my husband did you get up to go to the bathroom last night? He is usually up 2-3 times a night, NO he said for some reason he had not awakened till just before he got up.. I grabbed my purse and drove over to the high school, I got out of the car near the football field and walked over to the fence surrounding the field, trying to remember what I might have seen, did anything trigger a memory, and all that happened was that I got very dizzy, but walked around looking for some clue as to what had happened.. I remember looking for a tan shingled roof I had been standing near and wanted to check that out on the letter from <name>and was very surprised to see she/I had not mentioned any such roof or color of shingles in the message so it must have been a memory of the event..the only one I have had of that night. I am fortunate to know a lot of UFO researchers and I immediately called my old friend Dr Leo Sprinkle who works with abductees, some researchers or psychologists make the event scary, but if Dr Sprinkle does the same interview the abduction becomes a positive experience not a negative one, a learning experience. I was terrified about what could have happened... what if I would have had a car accident? a flat tire? How would I explain being out driving alone at 2:40 AM?   Dr Sprinkle pointed out that I was likely totally alert and in control till I got home and that is when they took remove any  memory of what happened.. This still haunts me and I still check the doors several times during the evening hours to be sure they are locked. For over a year I had slept fully dressed in a sweat suit complete with shoes etc. Note: Peter is always open and willing to listen to urgent reports. I just took his being tired personally and that was my problem, not Peters’ short coming.  CK 7/31/97",
      "link": "http://www.nuforc.org/webreports/070/S70824.html",
      "state": "OR",
      "duration": "unknown"
    },
    {
      "_id": "64d005f478aba2ec5a3b8356",
      "summary": "IT IS DIFFICULT TO DESCRIBE THIS AS IT IS SECOND HAND INFORMATION. I HAVE TO GO BACK AND TELL YOU WHAT HAPPENED LAST NIGHT..I WAS LISTE",
      "city": "salem",
      "shape": "",
      "date": "2009-08-05T00:00:00",
      "story": "IT IS DIFFICULT TO DESCRIBE THIS AS IT IS SECOND HAND INFORMATION. I HAVE TO GO BACK AND TELL YOU WHAT HAPPENED LAST NIGHT..I WAS LISTEN ING TO ART BELL WITH RGW HIS GUEST.  MY HUSBAND WENT TO BED ABOUT 11:00 PM.. I THEN WENT BACK INTO THE LIVING ROOM AND WENT OUT ON THE PATIO AND BROUGHT IN ONE OF OUR CATS WHO HAS BEEN HURT AND IT WAS COOL AND I WANTED HER IN THE HOUSE.  I BROUGHT HER IN AND SHUT THE GLASS PATIO DOOR AND LOCKED IT AND PUT THE STICK IN THE TRACK AND CAME INTO THE COMPUTER ROOM AND CONTINUED LISTENING TO ARTS SHOW.. I APPARENTLY DOZED OFF AND MY HUSBAND GOT UP TO GO TO THE BATHROOM AND WOKE ME AND TOLD ME T TO GO TO BED IT WAS 12:15 AM AND I SAID I AM AWAKE NOW AND SENT A EMAIL TO A FRIEND IN AZ AND WAS WAITING FOR A REPLY, FINALLY FIGURED THAT HE WAS NOT GOING TO WRITE AND I TURNED THE COMPUTER OFF AND WENT TO LAY DOWN ON THE COUCH.. I LAYED DOWN WITH MY SHOES ON AND I AND I WAS FULLY DRESSED AND COVERED UP AND WENT TO SLEEP.. I WOKE AT 7:15 AM FROM A CAT WANTING SOMETHING TO EAT. I GOT UP AND WENT TO OPEN THE PATIO DOOR AND FOUND IT WAS UNLOCKED, OPEN AND THE STICK WAS OUT AND ON THE RUG.. I FIGURED THAT MY HUSBAND GOT UP AND LET THEM OUT AND WENT BACK TO BED. HAD NO PROBLEM WITH THAT.. THEN ABOUT 11:00 AM I CALL FROM A FRIEND ((name deleted)) AND SHE WANTED TO KNOW WHERE IT WAS I HAD SEEN THE LIGHTS AS SHE WAS GOING TO GO OUT AND LOOK FOR MORE CROP CIRCLES AND HAD RESERVATIONS ON A PRIVATE PLANE TO GO UP THIS AFTERNOON.  I THOUGHT SHE WAS REFERRING TO THE ONES THAT OF JULY 14 THAT I ATTEMPTED TO FILE A REPORT WITH YOU..  ANYWAY SHE SAID NO THE CALL THIS MORNING.  I SAID WHAT CALL AND SHE SAID I HAD CALLED HER AT 2:40 AM THIS MORNING.I WILL TYPE HERE VERBATIM WHAT SHE SAID WAS ON THE MESSAGE, SINCE SHE HAD NO IDEA ANYTHING WAS AMISS, SHE DELETED THE MESSAGE.  SHE SAID THAT SHE LISTENED TO IT 2-3 TIMES AND THIS THIS IS WHAT SHE SAID I SAID.( I WILL TELL YOU WHAT SHE SAID WAS ON THE MESSAGE, THEN TELL YOU WHAT I KNOW TO BE TRUE) HELLO ((name deleted)) THIS IS ((name #2 deleted)), I APOLOGIZE FOR CALLING SO LATE ITS 2:40 AM AND I AN OVER BY NORTH SALEM HIGH SCHOOL, AND I HAVE BEEN WATCHING A UFO IT FOR 45 MINUTES. IT IS A BIG WHITE LIGHT AND IT HAS 3 LIGHTS TRAILING ON ONE SIDE AND 2 LIGHTS ON THE OTHER AND IT IS NOT A STAR.  WHO CAN I CALL WHO IS LIKE PETER DAVENPORT IN SEATTLE, I DO NOT WANT TO CALL HIM, WHO LIVES IN SALEM THAT I CAN CALL?  I THINK THIS SHOULD BE INVESTIGATE THEN SHE SAID THE PHONE WENT DEAD.. END I ASKED HER IF SHE WAS SURE THAT THE CALLER WAS ME??  SHE SAID YES I ONLY KNOW ONE ((name deleted)) AND IT WAS YOUR VOICE AND NO ONE ELSE WOULD KNOW ABOUT THE LAST CALL TO THE UFO CENTER INS SEATTLE AND REFER TO PETER DAVENPORT. SHE SAID SHE LISTENED TO THE MESSAGE 2-3 TIMES' BEFORE SHE DELETED IT.. I ASKED HER IF SHE STILL HAD THE MESSAGE AND MAYBE SOMEONE COULD GET THE ERASED MESSAGE OFF THE TAPE, SHE SAID THIS WAS NOT A TAPE IT WAS A US WEST ANSWERING SVC L LIKE YOU GET THROUGH THE PHONE COMPANY..SHE SAID THAT I WAS THE ONLY ONE WHO CALLED HER LATE AT NIGHT AND SHE HARDLY GETS ANY CALLS AT HER HOME, PEOPLE CALL HER AT HER BUSINESS. THIS IS WHAT I KNOW TO BE TRUE........ ONE I TOLD ((name deleted)) ABOUT BEING UPSET ABOUT THE LAST CALL I MADE TO THE CENTER AND SHE HAD NOT TOLD ANYONE ABOUT THAT INFORMATION. TWO...WHEN I GOT UP THE STICK WAS OUT OF THE PATIO DOOR AND THE DOOR WAS ABOUT 1/3 OPEN. I HAD JUST THOUGHT THAT MY HUSBAND HAD GOTTEN UP EARLIER AND OPENED THE DOOR TO LET THE CATS IN AND OUT.. I FOUND OUT HE HAD NOT BEEN UP AT ALL SINCE HE TOLD ME TO GO TO BED AT 12:15 AM. I WENT OUT AND CHECKED AND MY GAS GAGE WAS OFF. I HAD NOTICED I NEEDED GAS WHEN I CAME HOME WEDNESDAY NIGHT FROM THE STORE. I HAD JUST UNDER 1/4 TANK OF GAS... THIS MORNING THE TANK WAS SITTING AT ABOUT 1/8 TANK... DID NOT NOTICE THE CAR KEYS OUT OF PLACE OR ANYTHING. I KNOW I DID NOT HAVE ANY CHANGE FROM THE STORE AND SO IF I CALLED MY FRIEND FROM OVER NEAR NORTH SALEM HIGH SCHOOL, THEN I MUST HACE CALLED FROM MY MOTHERS FORMER HOUSE THAT WE ARE WORKING IN GETTING IT READY TO SELL.. IT IS ABOUT 1/2 BLOCK FROM NORTH SALEM HIGH SCHOOL. SO THAT IS IT... I DO NOT KNOW WHAT HAPPENED, WHERE I WAS, WHAT I DID... WHEN I ASKED MY FRIEND HOW SURE SHE WAS IT WAS ME ON THE PHONE SHE SAID 99% ONE THE BIBLE SURE... SO I HAVE NO DOUBTS I DID CALL HER. WITHOUT TELLING THEM WHY I CALLED A GIRL FRIEND WHO HAS CONNECTIONS TO SOMEONE AT MUFON.. I ASKED IF THERE HAD BEEN A SIGHTING LAST NIGHT AROUND HERE... SHE HESITATED A MINUTE AND SAID YES, SOME LADY HAD CALLED AT 9:30 PM ( THEY HAD JUST GONE TO BED) AND SAID THAT SHE WAS WATCHING SOME LIGHTS AND THAT THERE WAS ONE BRIGHT ONE AND 3 SMALLER ONES ON THE SIDE ALMOST LIKE A \"V\" AND SHE COULD NOT SEE THE OTHER SIDE IF THERE WAS ONE. SHE SAID SHE COULD NOT TELL ALOT ABOUT IT AS IT WAS A LONG DISTANCE AWAY. THIS IS VERY SIMILAR TO WHAT I SUPPOSEDLY SAW AND CALLED MY FRIEND ABOUT. IT IS ALSO NOT TOO FAR OFF FROM THE SIGHTING OF JULY 14 THE ONE IN MEDFORD THAT FOLLOWED BY 20 MINUTES THE ONE I CALLED YOU ABOUT AND ALL THE REPORTS, MINE, MEDFORD, THE ONE LAST NIGHT AND THE ONE I SAW THIS MORNING. THANK YOU FOR TAKING THE TIME TO READ THIS POST AND IF YOU KNOW ANYONE WHO CAN HELP SHED SOME LIGHT ON THIS PLEASE I BEG YOU GIVE THEM MY PHONE NUMBER. I PUT IN A CALL TO R. LEO SPRINKLE TO SEE IF HE COULD SHED SOME LIGHT ON WHAT HAPPENED. ((name deleted)) EARTHQUAKE FORECASTING CONSULTANT. SALEM OREGON 503 ((number deleted)).. SORRY I CAN'T TAKE COLLECT CALLS BUT IF ANYONE WANTS ANY MORE INFO EMAIL ME AT THE FOLLOWING ADDRESS..((e-address deleted))",
      "link": "http://www.nuforc.org/webreports/002/S02616.html",
      "state": "OR",
      "duration": "45 MIN +"
    },
    {
      "_id": "64d005f478aba2ec5a3b835a",
      "summary": "EXPLOSION OF CRAFT 1998",
      "city": "salem",
      "shape": "oval",
      "date": "2009-08-05T00:00:00",
      "story": "EXPLOSION OF CRAFT 1998 It was May 30th, 1998,  9 PM Sunday night.  Had just finished watching  “Touched By An Angel “ It was warm and a soft breeze had been blowing.  It was twilight, not light, but not dark, the stores had just closed and people were still out, most likely heading home. One of my cats, \"Patches,\" now deceased,  was acting strangely and wanted out, so I went to the door and followed her out and glanced at the sky in front of the house. Then I saw it.. a large craft kind of oval in shape, about the size of a car, could not make out the shape, it was diffused light, off in the distance, moving very slowly and seemingly very low altitude towards me.  My husband came out to see what I was looking at and I pulled him down the sidewalk, away from the artificial lights of the house, we were standing by the edge of the house, near the garage. We both noticed that the light in the craft was golden in color, and was flickering like a candle.  All the sudden, the entire craft, ship, blew up, I screamed. Pieces of it blew up, down, and sideways, we could watch the metal burning, and dripping, as I watched the pieces fall, still burning to below the tree line and out of sight. There was no sound.. I ran for the phone and called 911 and reported a “ plane “ might have blown up.  Then I heard sirens and said ‘ Oh someone already had reported this to you? The 911 operator said  “ No, it was an accident on the bridge, “ I said, they probably saw what we did and ran into the wall of the bridge.  So I did report the explosion. Then I called our local airport tower, and no planes were reported in trouble.  I called the military in Portland Oregon because they have a helicopter wing NG in Salem , again no planes or choppers missing or in trouble.  I called PDX and reported it to the tower in Portland , and  then I called SeaTac in Seattle area and again reported the incident. Nothing, but they did take my name in case something or someone ended up not arriving at their destination. I even called Evergreen Helicopters which is located about 28 miles from Salem and again, nothing was reported out of the ordinary. Early the 2nd day / morning sometime after midnight, I was so frustrated that I decided to take a chance and called for the number of Cheyenne Mountain in CO.NORAD might be able to tell me something I called and was very fortunate to have a Air Force man take the call, and explained my reason for the call and he promised to look into it and call me back, I thought I would not hear from him again.  I said, \"it could be a asteroid or something\", but I really needed to know what it was I saw.  So as promised, he called back several hours later. He said “ according to their reports/records, nothing man made entered the Earth's  atmosphere at that time.” I said “ You mean it was a asteroid or something ? “ He said “ You are not listening to me,  NOTHING MAN MADE and he accented the words MAN MADE,  ENTERED THE EARTHS ATMOSPHERE AT THE TIME OF YOUR SIGHTING.” Then it dawned on me he was telling me what I needed to know.  He asked if there was anything further he could do, I said no and thanked him and we hung up.  What was this sighting.. Was it a small craft? Did it blow up or was it shot down?  We watched the molten metal falling, where was it from?   Why didn’t we hear anything?  It seemed a few mere miles away.. how far away was it?  Why didn’t someone else report this?  5/30/1998",
      "link": "http://www.nuforc.org/webreports/070/S70825.html",
      "state": "OR",
      "duration": "2105"
    },
    {
      "_id": "64d005f478aba2ec5a3b838d",
      "summary": "Subject: RE: Missing Time Mid August 1991    Don't have the date of this event, but suppose I could find it if I were to look for it in",
      "city": "salem",
      "shape": "other",
      "date": "2009-08-05T00:00:00",
      "story": "Subject: RE: Missing Time Mid August 1991     Don't have the date of this event, but suppose I could find it if I were to look for it in notes etc., at this time I was in the habit of going outside every evening about 11-11:30 and check out the skies, sometimes I would stay out till midnight if it was really warm.  I would lay down on the picnic table on the patio with a tube pillow under my head,(to keep from getting a kink in my neck) and binoculars on my chest.. I was watching the local ABC 11 o'clock news, my husband was already asleep, having gone to bed several hours before, (his illness forces him to get a-lot of sleep) anyway I know I looked at the clock at 11:15 PM when I opened the patio glass sliding doors and went outside... I laid on the table for what seemed like about 10 minutes, checking out the stars and planets etc, and then I got up and walked around the patio to get a different perspective of the sky.. all the sudden I looked down the back side of the house (NE SIDE) back of house was facing North, and said out-loud but to myself, \"I need to go make sure my bedroom window is closed it might rain\", keep in mind this was August our hottest month of the year, and there was not a chance in Hell of getting any rain.. I came into the house and walked down the hall to my bedroom, to go in and check the windows, the door to the room was almost closed so I reached for the door handle to push it open and the door SLAMMED in my face with a loud noise, I thought \" it was a draft from the open window\" I put my hand on the door to open it and could not turn the knob, I pushed against it, and pulled on it, yelled at it and kicked it, the door was locked, then I remembered that we do not have any room locks on the bedroom doors.... I remember yelling for my husband who is a light sleeper to come and help me, nothing... then I called him again, again nothing so finally I walked away from the door across the hall and went in and bodily shook him awake and he seemed that he was drugged I explained to him what was happening and finally got up and he too tried to open the bedroom door, pulling and pushing.. finally it opened..and one of the cats slipped into the room and came running out growling with a full bottlebrush tail, I went into the room and I felt a bit of vertigo but that’s all... I looked at my bedroom clock and it was 2:15 AM, it had been over 3 hours since I went outside, but it seemed like only about 20-30 minutes. I checked the window and it was closed (no surprise) and then I noticed there was a box on the floor, it had been sitting under the window on the window-seat and it was about 1-2 feet away from the window-seat upside down on the floor, but the contents were not on the floor, nothing was spilled, I am not sure how that was done.. (all that was in the box was ET reports and information)  Finally I got the cats calmed down, husband went back to bed and I shut and locked the patio doors and laid down on the couch, I was barely dozing when my husband yelled from the bedroom... I ran in to see what was the problem and he said \"Something is touching me\", I asked him what it was, cats were not in the room, he said \"I don't know but I could hear a buzzing sound and when I closed my eyes I could see blue and red lights moving around the room through the crack in my eyes. He said they were not totally closed. He also said \"I could not move\" I said \"Why didn't you open your eyes?\" and I think he thought I had lost my mind, he said he did not want to see them,he lay back down and about 10 minutes later he was in the living room standing by the couch.. I said \" what do you want?\" he said \" I do not want to sleep in there tonight, they keep coming back and touching me\"  The next morning except for the episode with the door he didn't seem to remember any of the happenings.. he had multiple small scoop ( bb size) marks on his arms. On several occasions my husband as I said who is a light sleeper did not respond to my calls for help or assistance, and he did not get up in the night and find me missing when I was not there..  I personally believe that is the intention of the Et's to keep him sleeping when they are busy with me. CK 8/1999 © ((NUFORC Note:  Source of report indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/070/S70821.html",
      "state": "OR",
      "duration": "0215"
    },
    {
      "_id": "64d005f478aba2ec5a3b87bd",
      "summary": "Vague chevron object with strange colored lights and erratic movement seen, with smaller lights/objects emitted from it as it traveled.",
      "city": "salem",
      "shape": "chevron",
      "date": "2009-08-05T00:00:00",
      "story": "Vague chevron object with strange colored lights and erratic movement seen, with smaller lights/objects emitted from it as it traveled. I was looking up at the stars, which I could see clearly (this tends to be unusual with our normally cloudy skies), and I suddenly saw a bright starlike light (white with reddish around edges)which faded quickly as it moved slow about 2 inches toward the north. I thought this was a shooting star or something. Then another bright starlike light shone to just the east of it, but this one started shooting around wildly like a binball machine, erratic and quickly with no discernable pattern and at extreme angles, but completely unlike a plane possibly could, within about a 5 in radius (from my perspective). Then this light headed southward at a more steady pace, and as it went I could see several lights blinking quickly in different colors - red, white, blue, green - but these lights blinked randomly and all around a two inch-long object that I could just vaguely see (It seemed very high up). At one point they almost seemed to light up rapidly in a 'band' across the width of the object. It looked slightly grey against the deep blue sky, and it appeared to have an elongated point at it's head and possibly two shorter points at its end with a concave bottom - possibly chevron shaped (it may have had more points to it, but it was very unclear). All the blinking lights were no bigger than most of the stars around the sky. As it headed south overhead it traveled about the speed of a plane way high up, but it kept blinking these colored lights in a random effect all over the face of it. Then smaller white lights began shooting away from it one & two at a time in all directions, going away up to about 5-6 inches. It still had a main white light, brighter than the rest, which continued to blink at erratic but consistent intervals. We watched it do this until it was very far south, to the distant tree line. Small lights continually came off from it, although they were very hard to see once it had reached that far away. About 10 minutes later, the lights of what looked to be a regular airplane, with one white light & one red flashing at regular & consistent intervals, crossed the sky in the same path and disappeared at the same point beyond the trees.",
      "link": "http://www.nuforc.org/webreports/070/S70548.html",
      "state": "OR",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b8ab9",
      "summary": "star like light  that changes colors",
      "city": "salem",
      "shape": "light",
      "date": "2008-10-31T00:00:00",
      "story": "star like light  that changes colors It was around 11:00 pm on Sept. 1, 2008, when what seemed to be a large bright star, shone in the sky.  I was inside sitting on the sofa talking to a family member.  My attention was drawn to the window and the \"star.\"  I asked my cousin to look at the \"star\" because it seemed to be changing colors.  We both agreed that it was changing color from white to red and then to blue.  We then grabbed two other family members and a couple pairs of binoculars and went out onto the front porch.  Through the binoculars we could see the light changing colors in an almost fibre optic style.  The light hovered slightly above the tree line for about 35 minutes. At times it seemed to fade and then become stronger.  After about 35 minutes it began to dip down into the tree line.  After that, it just disappeared. Very unusual. ((NUFORC Note:  Witness elects to remain totally anonymous;  provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/065/S65518.html",
      "state": "WV",
      "duration": "35 mins"
    },
    {
      "_id": "64d005f478aba2ec5a3b8ac6",
      "summary": "2 oval orange objects parallel then converging then disappearing after 45-60 seconds",
      "city": "salem",
      "shape": "oval",
      "date": "2009-08-05T00:00:00",
      "story": "2 oval orange objects parallel then converging then disappearing after 45-60 seconds ((ADDENDUM FROM ORIGINAL SOURCE OF REPORT)) Mr. Davenport  I do not know what happened to my e-mail to you but I am forwarding information to you in this format.  This sighting is one of the most unnerving experiences my wife and I have ever had.  I was a private pilot fo 14 years and never saw any image such as we saw that evening when I did night flying.  The dual objects appeared to be at 35 degrees off horizon.  At first I thought it was one object, probably a plane but if that were the case it why did it have orange balls on its wing tips instead of the traditional green and red wing lighting?   The object was approaching us heading southbound and we were facing true north. Intially it appeared to be traveling at a high rate of speed, 4-5 miles from us.  I cannot estimate the altitude but I'm guessing 3000-5000 feet.After 30 seconds of from first spotting, what I thought was one object turned out to be two.  One orange ball on our right started to lose altitude and converge toward the other orange glowing ball.  It  the turned sharply to our right away from the other ball and disappeared. Just prior to doing this it appeared to us that both orange objects appeared to stop in mid air.  About 10-15 seconds after the first disappearance, the remaining orange ball vanished.  I would say our entire viewing was 1-1/2 minutes. Upon returning to our home in about 5 minutes I called our local Salem Ohio police department and recounted this experience to them. ((END ADDENDUM)) ((NUFORC Note:  We spoke via telephone with this witness, and he sounded to us to be quite serious-minded and sincere.  PD))",
      "link": "http://www.nuforc.org/webreports/070/S70716.html",
      "state": "OH",
      "duration": "45 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b9111",
      "summary": "Triangular craft hovered over Wallace Road then took off towards other side of Salem",
      "city": "salem",
      "shape": "triangle",
      "date": "2009-12-12T00:00:00",
      "story": "Triangular craft hovered over Wallace Road then took off towards other side of Salem While driving in West Salem around 6:30 at night we spotted some bright lights that were less than a mile in front of us.  As we got closer we noticed it looked like it was flying pretty low, sort of hovering over a section of trees for a few seconds.  We drove past it with it on the passenger side of the car and it started to fly away towards the downtown area, almost like it noticed that we saw it.  It looked like a solid triangle with three steady white lights on the bottom, one on each corner positioned to shine down. It also had red and white lights on the top that were blinking at different times and creating a glow around the top.  It didn’t seem like it was very big, maybe twenty feet wide at the most.  We tried to turn around and follow it but it was gone pretty quickly.",
      "link": "http://www.nuforc.org/webreports/073/S73161.html",
      "state": "OR",
      "duration": "2 Min."
    },
    {
      "_id": "64d005f478aba2ec5a3b9567",
      "summary": "it seem to sway back and forth slightly as it moved across the sky, brightly lit",
      "city": "salem",
      "shape": "light",
      "date": "2010-06-03T00:00:00",
      "story": "it seem to sway back and forth slightly as it moved across the sky, brightly lit Saw the light orb, not sure how high it was, there was no sound, it seem to sway slightly back and forth as it moved about the speed of a sesna across the sky, the light was moving away from sight and still lit brightly, no other colors than that of a regular light as far as i could tell, as it passed the tree line and I went to get my brother, came out and it was gone I went to a better position to see if i could see it...nothing.",
      "link": "http://www.nuforc.org/webreports/075/S75398.html",
      "state": "OR",
      "duration": "15 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b97ab",
      "summary": "various objects in the sky near Salem, OR",
      "city": "salem",
      "shape": "sphere",
      "date": "2010-06-03T00:00:00",
      "story": "various objects in the sky near Salem, OR I saw at least 5 objects in the sky near Salem, OR between 9:45PM and 10:15PM. I saw 3 white spheres and 1 red sphere, all glowing. I also saw another object that had three lights on it, 1 green and 2 red.  All of the objects were either stationary or moving very slowly. 1 white sphere, the red sphere, and the 3-lighted object were all directly above the freeway a few miles apart.  The other 2 white spheres were to the west.",
      "link": "http://www.nuforc.org/webreports/075/S75424.html",
      "state": "OR",
      "duration": "30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b9798",
      "summary": "Me and another person have witnessed a pinball-like object gliding through the sky on multiple occasions.",
      "city": "salem",
      "shape": "sphere",
      "date": "2009-05-12T00:00:00",
      "story": "Me and another person have witnessed a pinball-like object gliding through the sky on multiple occasions. I was walking down the train tracks near my house during the middle of the day and when I looked up I saw what looked exactly like a giant pinball gliding across the sky at a really low altitude without making a sound.  I was only able to see it for a few seconds before it went behind a tree line.  The sun reflecting off of it burnt the retina of my eyes from being so reflective.  Someone else I know has seen it on two separate occasions, where when they saw it during the night time it flew past some trees and the next day when they went back to the same location the trees were burnt around where it was at.  Attempts that she made to take pictures of it resulted in all the film in her camera being totally ruined as if it'd been burnt.  She reported that during the night time it has red and blue lights which I think at another time years before the time I witnessed it in this account, I saw it as well but at night judging by the way she described it.  I would submit an image but like I said, all the film in the camera that the pictures were taken with was ruined. ((NUFORC Note:  Source of report indicates that the date of the incident is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/069/S69916.html",
      "state": "IL",
      "duration": "A few moments"
    },
    {
      "_id": "64d005f478aba2ec5a3b99b9",
      "summary": "Thought it was a Satellite until witnessing a very bright flash of light come from the object.",
      "city": "salem",
      "shape": "circle",
      "date": "2009-08-27T00:00:00",
      "story": "Thought it was a Satellite until witnessing a very bright flash of light come from the object. While looking at the western sky noticed a small dot in the sky traveling from north to south. Thought it was a satellite at first as it was very small and seemed to be traveling at the speed I am use to seeing from a satellite. The odd thing was as we were watching the small dot it suddenly started to glow with a very high intensity light so much so that I thought it was a helicopter spotlight. The light only lasted for a few seconds then went back to normal and the craft continued on a southerly course at the same speed before fading out. I have an aviation background and do not think it was an aircraft given the small size, the speed of the object and the brightness of the flash.",
      "link": "http://www.nuforc.org/webreports/071/S71595.html",
      "state": "OR",
      "duration": "20 sec"
    },
    {
      "_id": "64d005f478aba2ec5a3b9ece",
      "summary": "Orange fireball thrusting across rural missouri inbetween cook station and Salem.",
      "city": "salem",
      "shape": "fireball",
      "date": "2009-12-12T00:00:00",
      "story": "Orange fireball thrusting across rural missouri inbetween Cook Station and Salem. My family and I were traveling through cook station when I sighted a huge object with a blue and orange light.   As we traveled down YY hwy towards hwy 68, I caught sight of the object it quickly disappeared.    Oddly enough when I saw it I thought it was a huge helicopeter landing at the animal adventure ranch.  I made a note of the time which was 6:40 cst.   We traveled on and made it to FF hwy and went westerly.  It was in the western sky when i saw it again, but this time it was a huge fireball.  I kept losing sight of it as it was traveling and I was traveling around curves and trees were blocking me.   The last time I saw the object it was 7:03 I saw it a total of four different times.  Two times it looked to be on fire and thrusting towards salem.   When I saw them for the third time, it was like a big object in the sky on fire.   At one point the fire ball seemed to be half the size of the moon.  It was huge.   I lost sight of the object when we turned right on Hwy 72 towards Rolla, and the Fireball was presumed to go the other direction.   It appeared to be flying at the altitude of  low flying helicopters.  In fact this looked almost exactly like something I saw in 2002 that was reported here, except that object was lime green, and this fireball was orange.",
      "link": "http://www.nuforc.org/webreports/073/S73551.html",
      "state": "MO",
      "duration": "15 secs"
    },
    {
      "_id": "64d005f478aba2ec5a3b9ed0",
      "summary": "three orange fireballs",
      "city": "salem",
      "shape": "fireball",
      "date": "2009-12-12T00:00:00",
      "story": "three orange fireballs My wife has already submitted a report, but I saw three fireballs.   On FF Hwy near Salem.  They were in the western sky under cloud cover.",
      "link": "http://www.nuforc.org/webreports/073/S73607.html",
      "state": "MO",
      "duration": "2 sec"
    },
    {
      "_id": "64d005f478aba2ec5a3ba2d8",
      "summary": "Fast moving formation that looked much like the London sighting.",
      "city": "salem",
      "shape": "formation",
      "date": "2009-04-14T00:00:00",
      "story": "Fast moving formation that looked much like the London sighting. It was on a clear day last week, around the 25th of March. I was standing next to my house, looking up at the sky, observing the chemtrails which I do often. It wasn't a heavy chemtrail day, just a couple of Xes and lines that were spreading out. Suddenly I noticed something moving quickly past the trails. My eyes focused on what I first thought was a flock of birds in the far distance. It looked like bunch of dots in a formation. I'm wasn't sure how many, maybe ten or twelve, because this formation of dots was moving very fast. When I noticed them, they were directly in front of me, but within 2 to 3 seconds they had traveled across the sky to my left until they vanished in the distance. I stood there a few minutes thinking about what I just saw, wondering what it could have been. If it wasn't for the speed, it could have been a flock of birds so far away that they looked like dots. Then I thought it could have been a group of insects that were quite close to me streaking by and staying in a perfect formation. Maybe a squadron of jet fighters? But there was no noise made by this UFO. I thought it couldn't have been any of these things because it was just moving to fast. I didn't think much more about my sighting until last night when I saw the photo of the London sighting. It appears to be the same kind of formation only closer to the viewer. Could it be that there's a UFO squadron speeding around globe? I think it's a possibility.  I have a degree in Nursing and have worked in the manufacturing field. ((NUFORC Note:  Source of report indicates that the date of the incident is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/069/S69501.html",
      "state": "VA",
      "duration": "2-3 sec"
    },
    {
      "_id": "64d005f478aba2ec5a3baa81",
      "summary": "Bright object changing colors of green, orange, white that \"bounced\" around.  ((NUFORC Note:  Star or planet??  PD))",
      "city": "salem",
      "shape": "unknown",
      "date": "2010-11-21T00:00:00",
      "story": "Bright object changing colors of green, orange, white that \"bounced\" around For several nights, starting a week ago I noticed something in the sky. I knew it wasn’t a star because of the way it “bounced” around. We used my husbands rifle scope to try to get a closer look, and low and behold it definitely wasn’t something normal. It lighted up green, white and orange and would grow dim, then light up brightly. My husband described it as “electrifying”. I first noticed it in the west of the big dipper towards Elliston. Then noticed it in the northeast part towards Troutville . Last night we saw it towards Elliston and then saw two jets in formation flying in its direction. About 10 mins later it was gone. About an hour later I went outside and sure enough, it was in the northeast part of the sky towards Troutville. I have tried taking video of it, but will need to get the tripod out to get a stable shot of it. ((NUFORC Note:  Star or planet??  PD))",
      "link": "http://www.nuforc.org/webreports/077/S77725.html",
      "state": "VA",
      "duration": "3 hours"
    },
    {
      "_id": "64d005f478aba2ec5a3bab7a",
      "summary": "Sept. 28th 2010 13-15 or more bright objects seen in NE Salem Oregon, at 2:27 PM PDT",
      "city": "salem",
      "shape": "light",
      "date": "2010-11-21T00:00:00",
      "story": "Sept. 28th 2010 13-15 or more bright objects seen in NE Salem Oregon, at 2:27 PM PDT I was sitting in my car watching Eagles fly the thermals, as it was clear and hot with high humidity in Salem.  All the sudden I saw what looked like a bright light about 1000-2000 feet above me. I had not seen where it came from.  After a minute it was joined by 2 more bright objects. I tried to look at them to see if they were gulls, or something else.  They did not move in the pattern a gull would.  I also thought about balloons, but again they do not move the way these did, no floating etc, these moved in deliberate movement. First 1 light, then being joined by another and just sitting still, no movement. After a couple of minutes of watching the 3 bright lights, all the sudden there were at least 13-15 or more of the objects. Then they began to form triangles some were standard all the same length triangles an then some were much longer and the end lights were closer together forming an elongated triangle.  I watched them come together, move apart, form patterns of triangles and then just move back and sit there. There was one light, and then it was being joined by another and just sitting still, no movement. Then they began moving to form triangles and groups of 3-7 objects in a circle pattern. I was getting ready to go back to work and one of the managers of the place I work came by, I asked him if he could see anything, he said “ no “ and I said come over to where I am standing, and he did and then he said “ Yes I can see something “ I said “ What is it?” and he said “ its not planes, and it’s not birds and I don’t know what they are, but if I had a gun, I would shoot at them”  Just what I needed a trigger happy witness.  So that was when they disappeared. I have a Canon 12x SX 200 IS camera and I did take a couple of pictures but the sun was so bright and it was hard to see anything through the lens.  I have been trying to see if I can find some photo enhancing software to look at the pictures. There is obviously something there in the pictures. So when the objects disappeared, I made a note of the time and went back to work. I did not hear of anyone else seeing them and I did not see them later when I went outside. Note: when I say bright objects, it was like looking at stars in the full daylight type of brightness.",
      "link": "http://www.nuforc.org/webreports/078/S78054.html",
      "state": "OR",
      "duration": "12 Minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bacc1",
      "summary": "Single round black sphere hovering with white clouds in the background.",
      "city": "salem",
      "shape": "sphere",
      "date": "2010-11-21T00:00:00",
      "story": "Single round black sphere hovering with white clouds in the background. Sometime near 6:00pm.  A dark round circle shape in the south western part of the sky.  In view for about 6-8 minutes.  Appx. 4500 feet up hovering slowly.",
      "link": "http://www.nuforc.org/webreports/078/S78418.html",
      "state": "OR",
      "duration": "6-8 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bb7fc",
      "summary": "Pulsing, shape-shifting UFO in Southern Indiana.  ((NUFORC Note:  Sirius is to the left of, and below, Orion.  PD))",
      "city": "salem",
      "shape": "changing",
      "date": "2010-08-30T00:00:00",
      "story": "Pulsing, shape-shifting UFO in Southern Indiana I live in Southern Indiana, near Louisville, Kentucky.  On Saturday, August 28, 2010, at approximately 6:00 a.m., I observed a very bright, odd-looking  “light” in the eastern sky near Orion’s belt.  It was brighter and larger than anything else in the sky. The light would glow bright and produce a huge halo around itself, then it would dim, in a very slow pulse. The light, when glowing bright, formed elongated spikes of light above and below the main part of the light. I got my binoculars to observe the light closer. With the binoculars, I could see in the center of the light three colored orbs: red, blue, green, positioned in a triangle to each other. In succession, each orb would glow bright, then dim (not flashing). I observed the light until the dawn made it impossible. During the entire time I watched the light it did not move its location in the sky; neither vertical nor horizontal. I attempted to observe the light the next morning at the exact same time and place but it was no longer there. ((NUFORC Note:  Sirius is to the left of, and below, Orion.  PD))",
      "link": "http://www.nuforc.org/webreports/077/S77500.html",
      "state": "IN",
      "duration": "45 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bbcd6",
      "summary": "a orange fire ball moved acrossed the night sky in N.E. Ohio",
      "city": "salem",
      "shape": "fireball",
      "date": "2011-10-10T00:00:00",
      "story": "a orange fire ball moved acrossed the night sky in N.E. Ohio Object was a orange in color moving slowly to the south southeast and between 500 and 1000 feet . Size was small and looked to be like a large beach ball . It had a pulsing to it.  I had time to have the wife come out and see it then go back in for the camera and got three shots on it before it went out of my sight.  Estimated speed was maybe around 20 MPH or less.  IT made no sound as it passed over .",
      "link": "http://www.nuforc.org/webreports/083/S83370.html",
      "state": "OH",
      "duration": "three to five min."
    },
    {
      "_id": "64d005f478aba2ec5a3bbedc",
      "summary": "Large slow moving objects high in the sky above salem oregon",
      "city": "salem",
      "shape": "triangle",
      "date": "2012-01-12T00:00:00",
      "story": "large slow moving objects high in the sky above salem oregon As i came out of my garage at 7:00pm tonight i looked up to see a faint large object slowly moving in sky the distance above me so i grabbed my binoculars and saw a very large outline of a boomerang shape craft slowly moving thru the sky then i noticed another craft ahead of it but it wasnt the same shape it had a very different shape to it one that i cannot describe but it was some kind of craft with the same kind of dim lights that gave the crafts their outline shapes. Ive been watching the sky at night for 2yrs now and whats up there is a whole bunch of different objects 1 that mask its self like a star but it moves from time to time and isn't high enough to be a star and ive seen other objects come out of it the others objects are hard to explain but some have bright multi colored lights that twinkle all the time red green white and they are positioned across from each other in various formations and patterns.Dont have any answers because the ones that d! o know aint telling us pawns.",
      "link": "http://www.nuforc.org/webreports/086/S86495.html",
      "state": "OR",
      "duration": "still in sky"
    },
    {
      "_id": "64d005f478aba2ec5a3bc182",
      "summary": "Three round orange lights flying very close together",
      "city": "salem",
      "shape": "fireball",
      "date": "2011-10-10T00:00:00",
      "story": "Three round orange lights flying very close together Just before 8:30pm on September 17, 2011 in Northeast Ohio my husband and my husband and I saw three round, orange bright lights in the sky.  It was nighttime.  There was no sound.  They were moving about the speed of a small plane.  One was leading and the other two were following and they were side by side.  The two in the back seemed to be very close to each other.  One of the orange bright lights in the back turned and went in the opposite direction.  The bright light started pulsating and then faded out.  The other one in the back started doing the same thing within a minute two (pulsating until the bright orange light faded out).  The one in the lead was very bright for a few more minutes and then it started pulsating and then faded out and we could no longer see any lights.",
      "link": "http://www.nuforc.org/webreports/083/S83981.html",
      "state": "OH",
      "duration": "3-4 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bc246",
      "summary": "Was driving at about 8 pm, suddenly in front of me in the sky a bright green egg shape appeared slowly crossed sky then accelerated and",
      "city": "salem",
      "shape": "egg",
      "date": "2011-10-10T00:00:00",
      "story": "Was driving at about 8 pm, suddenly in front of me in the sky a bright green egg shape appeared slowly crossed sky then accelerated and was gone. ((NUFORC Note:  Other reports were submitted to the Center Point, OR, Highway Patrol facility.  We would welcome reports from any other witnesses to this event.  PD))",
      "link": "http://www.nuforc.org/webreports/084/S84074.html",
      "state": "OR",
      "duration": "2 mins"
    },
    {
      "_id": "64d005f478aba2ec5a3bc44d",
      "summary": "Brillant object over baseball game for 2 hours",
      "city": "salem",
      "shape": "circle",
      "date": "2011-08-07T00:00:00",
      "story": "Brillant object over baseball game for 2 hours I was had my son's baseball game, and it was quite late.  All other games at the park were over and all the lights were off but his game in progress.  I was sitting in my car in the parking lot when I happened to look up and to the left.  There was a huge bright glowing light just about 1,000 feet about the trees.  I was shocked, there was no sound at all and the light was so bright you could not look straight had it. After watching it for about thirty minutes I could see red lights around it.  It would float across the sky. It stayed there the whole 3 hours I was in the parking lot.    When the game was over, I thought great somebody will see the object but as soon as the game ended,the object floated off west of me.  I watched the object for 2 and half to 3 hours. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/082/S82919.html",
      "state": "AR",
      "duration": "3 hours"
    },
    {
      "_id": "64d005f478aba2ec5a3bc764",
      "summary": "Bright star-like object/ light fades into sky rapidly.",
      "city": "salem",
      "shape": "unknown",
      "date": "2011-10-19T00:00:00",
      "story": "Bright star-like object/ light fades into sky rapidly I was looking up at the sky noticing the bright moon in daylight when I saw what appeared to be a bright star right before dusk, larger than normal.  I kept looking at it for a good 5 seconds and then it just faded into the sky, like someone turned the dial to a light from bright to off very fast.  There was no movement or reappearance.  I kept looking to see if I somehow lost it from my view, but nothing.  As I waited to see, there were a few aircraft passing by with their blinking lights, but there was one plane as high as you can imagine a plane could be with the trail you can see that planes make, right over the area I saw the \"UFO\" almost as if it was flying over there in case people called in a UFO sighting and it could be a cover for that time frame, within 10 minutes of what I saw.",
      "link": "http://www.nuforc.org/webreports/084/S84478.html",
      "state": "NH",
      "duration": "20 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bcbea",
      "summary": "Orange ball-shaped object, no flashing lights or sound, appeared rather large as opposed to airplane in size.",
      "city": "salem",
      "shape": "other",
      "date": "2011-07-17T00:00:00",
      "story": "Orange ball-shaped object, no flashing lights or sound, appeared rather large as opposed to airplane in size. We saw an orange circle shaped object that appeared somewhat large if compared to an airplane in the sky.  It was quite bright, or illuminated.   There was no flashing lights, or sound we could hear associated with it.   It came from the east, and then turned to the north and continued until out of sight.   We attempted to photograph with the camera, but due to a bouncing type movement in the camera, a cellphone picture was taken.",
      "link": "http://www.nuforc.org/webreports/082/S82522.html",
      "state": "WI",
      "duration": "approx. 3/12 min."
    },
    {
      "_id": "64d005f478aba2ec5a3bcc28",
      "summary": "MY SON AND GRANDSON WHO LIVE 4 BLOCKS SOUTH OF ME WERE OUTSIDE ON THEIR POOL DECK.",
      "city": "salem",
      "shape": "egg",
      "date": "2011-07-04T00:00:00",
      "story": "MY SON AND GRANDSON WHO LIVE 4 BLOCKS SOUTH OF ME WERE OUTSIDE ON THEIR POOL DECK. THE CALLED ME AT 9:48 PM AND REPORTED SEEING A LARGE BRIGHT WHITE LIGHT DIRECTLY OVERHEAD MOVING SLOWLY NORTH TO SOUTH, DIRECTLY OVERHEAD.  NO NOISE OR NAVIGATION LIGHTS.   I WENT OUT SIDE WHILE REMAINING IN PHONE CONVERSATION WITH SON.  I, TOO, OBSERVED THE OBJECT.   NEITHER OF US COULD HEAR ENGINE NOISE OR SEE A STROBE OR NAVIGATION LIGHTS.    AS THE LIGHT CONTINUED MOVING, WE BOTH SAW A MUCH SMALLER SPHERE OF WHITE LIGHT APPROACH THE OBJECT FROM THE SOUTH WEST.   AS IT DREW NEARER THE LARGER OBJECT AT THE POINT WHERE THEY POSSIBLY MERGED, THE SMALLER LIGHT DIMMED AND DISAPPEARED.   THE LARGE OBJECT THEN BEGAN TO MOVE A LITTLE FASTER DIMMING AND FINALLY GOING OUT.    AS THE LARGER OBJECT DIMMED THERE AGAIN WAS NO ENGINE NOISE HEARD, STROBE LIGHTS OR NAVIGATION LIGHTS SEEN.   CONTINUED TO WATCH THE AREA OF SKY WHERE LAST SAW LARGER OBJECT AS IT DIMMED TO NOTHINGNESS AND SEEN OR HEARD NOTHING.   THERE WERE NO CLOUDS IN THE SKY AND THE STARS AND PLANETS WERE CLEARLY VISIBLE.",
      "link": "http://www.nuforc.org/webreports/082/S82016.html",
      "state": "IL",
      "duration": "2mins"
    },
    {
      "_id": "64d005f478aba2ec5a3bcdfb",
      "summary": "On May 29,2011 about 9:00 pm, I look up and saw 2 Glowing lights  like dull oblong candles  moving side by side.",
      "city": "salem",
      "shape": "light",
      "date": "2011-06-03T00:00:00",
      "story": "On May 29, 2011, about 9:00 pm,  I Ran out side to get something and I look up and saw 2 Glowing lights like dull oblong candles moving side by side going east slowly like they were floating with no noise and threw the trees   I could see a 3rd  moving in the same direction tailing long at more of a slight angle.   Watch till I could not see anymore.  In the town of Salem Ct. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/081/S81581.html",
      "state": "CT",
      "duration": "30 sec."
    },
    {
      "_id": "64d005f478aba2ec5a3bcfd1",
      "summary": "Triangular-shaped object hovers 30 to40 feet above car for five minutes.",
      "city": "salem",
      "shape": "triangle",
      "date": "2012-08-05T00:00:00",
      "story": "Triangular-shaped object hovers 30 to40 feet above car for five minutes. To the investigators of UFO’s On November 10, 1991 my cousin and I were subject to an object that not only crossed our paths that night, but would affect both of our way of thinking for some years to come. It was 10:15 P.M.  Central Standard Time as we were traveling east on highway H and was coming back into the town of Salem, Missouri. We had just crossed the one- lane bridge that resides approximately 5 miles out of town on H highway, and made our way up and over the hill just ¼ of a mile past DD intersection. Upon topping over the hill, my cousin notices what he believes is an airplane to our far left in the cattle ranchers’ field and this object is traveling south. Upon further notice, we both realized that not only was this airplane descending, but it made absolutely NO SOUND as it made its way across the field and toward H highway in which we were traveling on. Believing that it was an airplane, we accelerated to approximately 90 miles per hour so as to pass under the plane as it crossed the highw! ay.  The object reached H highway before our car had the chance to pass under it or even get close to it, and much to our dismay the object came to a complete stop above H highway. As our car came to a screeching halt, it slid up under the object and stalled out. Sitting in the middle of the highway, my cousin and I stared up at the object, still believing that it was some sort of a helicopter, when we both noticed that the object was making no sound, it was not moving, and the unknown object hovered silently not 30 to 40 feet above us. In fear, my cousin rolled up his window and we sat silently staring up at the craft. Jerry turned to me and asked “what do you think it is?” To which by this time I realized that neither of us knew the answer to his question. The object had three lights on its underside that were extremely bright. These lights formed a triangular shape and the light source did not waver in energy, in fact, the lights were so bright that the whole highway was ! illuminated as though it was daytime. After sitting motionless! above t he highway for what I believe was approximately two minutes, the craft began to slowly move diagonal from its original route and hovered to a clearing in the open field that lay to the right of my car. The object hovered just above the tree tops, almost brushing them as it passed over them, until it had reached an opening in the field. The object stops again and then, much to our dismay, starts to turn onto its side and then slowly lower itself to the ground. So close to the ground in fact, that I could see the silhouette of the field grass as the light from the two back lights shined through them. After sitting at ground level for no longer than one minute, the object slowly left our side and made its way down the forest that rested to its immediate right. The object then leveled back out flat to the ground as it traveled and after flying about 300 yards, it ascended at a 30 degree angle. It flew up into the night sky, never to be seen again by my cousin or myself. After mu! ch deliberation, my cousin and I agreed that we had not experienced any lost time nor have we ever found any explanation for what we witnessed.",
      "link": "http://www.nuforc.org/webreports/091/S91231.html",
      "state": "MO",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bd117",
      "summary": "Red, orange glowing orb.  15 mph,accelerates when flashlight is shined on it",
      "city": "salem",
      "shape": "fireball",
      "date": "2012-08-05T00:00:00",
      "story": "red ,orange glowing orb .15 mph,accelerates when flashlight is shined on it watering garden,9 pm,facing west.observed orb 1/4 mile to the west southwest.orb traveling east northeast towards me, approx. 200 foot agl at 15 mph.full moon rising in the southeast. sw wind 8mph.vis 10 miles.80 degrees.orb continued to within 300 feet,made left turn ,heading due north.appeared as a red ,orange ,burning ember ,round,approx 15 foot in diameter,possible very small flames around the total perimeter.i phoned wife to turn off the back porchlight,run outside, look up and to her right,which she did.she observed the orb as well. her descripion is the same as mine.no sound at all. orb traveled approx 400 foot after it made its turn,then turned to the northwest.at this time i shined a very powerfull flashlight at it,blinking it 4 or 5 times.orb instantly sped up ,traveling northwest,fading in 3 or 4 seconds. rural area, very quite.i remained outside with binos and camera for 1 hr. ,it did not return.very familar with planes,choppers ,meteors,lantens,! etc. ex naval air. this was a controled flight at low ground level,not some way out there fuzzy light.",
      "link": "http://www.nuforc.org/webreports/091/S91393.html",
      "state": "MO",
      "duration": "1 -3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bd115",
      "summary": "Red, orange glowing orb. 15 mph, accelerates when flashlight is shined on it",
      "city": "salem",
      "shape": "fireball",
      "date": "2012-08-05T00:00:00",
      "story": "Red, orange glowing orb .15 mph,accelerates when flashlight is shined on it watering garden, 9 pm,facing west.observed orb 1/4 mile to the west southwest.orb traveling east northeast towards me ,approx. 200 foot agl at 15 mph.full moon rising in the southeast. sw wind 8mph.vis 10 miles.80 degrees.orb continued to within 300 feet,made left turn ,heading due north.appeared as a red ,orange ,burning ember ,round,approx 15 foot in diameter,possible very small flames around the total perimeter.i phoned wife to turn off the back porchlight,run outside, look up and to her right,which she did.she observed the orb as well. her descripion is the same as mine.no sound at all. orb traveled approx 400 foot after it made its turn,then turned to the northwest.at this time i shined a very powerfull flashlight at it,blinking it 4 or 5 times.orb instantly sped up,traveling northwest,fading in 3 or 4 seconds. rural area, very quite. i remained outside with binos and camera for 1 hr. ,it did not return.very familar with planes,choppers ,meteors,lantens,! etc. ex naval air. this was a controled flight at low ground level,not some way out there fuzzy light.",
      "link": "http://www.nuforc.org/webreports/090/S90623.html",
      "state": "MO",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3bd408",
      "summary": "We walked out side during supper, woke up standing in the back yard, then I saw 5 of them  watching me.",
      "city": "salem",
      "shape": "disk",
      "date": "",
      "story": "We walked out side during supper, woke up standing in the back yard, then I saw 5 of them  watching me. My UFO encounter happened in South Jersey (&quot;1956&quot;) when I was in second grade. It was dark outside, I was about 8 years old, we just started a late supper when dad said; &quot;What's that funny noise?&quot; Mom was standing next to the kitchen table dishing out food, we cut a look at each other in disbelief (cause dad's hearing was never good) how did he hear something we didn't?   Dad enthusiastically said; &quot;Come on, let's go outside. Let's see what it is. Not me, I was hungry & kept eating.  Dad rushed back in the to get me, saying; &quot;come on, come on, come on, you don't want to miss this!&quot;  Reluctantly, I got up (& for some unknown reason) turned directly around to note the exact time ... 8:32 PM on a school house clock. (Dad continued to coax me outside.)   When I got outside dad was pointing to this dark spot in the night sky, it was terribly overcast with just a few stars here & there. Dad had put the yard light on (making it difficult to see) I couldn't make out a shape, just a darker spot in the sky.  He pointed saying; &quot;Look at the funny lights! See-em? See-em, right there.&quot; I was looking but I didn't see any funny lights, just a very dark spot. I decided to walk further away from the yard light. Mom & dad walked a few steps away too. I was about 25' to 30' further down the yard than them when I decided I was going to concentrate (with all my might) to make out a shape. Boom, that was it, the next thing I knew, I was waking up. Mom & dad were asleep standing the yard with their mouths open, & that's when I realized my legs were aching like I ran a marathon. I looked in the direction they were looking but it wasn't were, it seemed to be further away, slightly higher, and left. (All three of us were in slightly different positions than we were.)   I cleared my throat out loud and sheepishly said; &quot;Ah, dad ... dad?&quot; he woke up as my mom did a second later, they both put their heads down & walked directly in the house. I said; &quot;There it is right there! Look!&quot; they paid no attention. The next thing I knew, that thing was much lower, easier to see, I walked under a tree, & closer to get a better view. More than anything, I was extremely angry, I could now see the UFO with 5 of them staring at me. (About 150' away, it was no more that 25' off the ground at this point.) (They had rounder bald heads than the grays, the best I can tell, there was like a hazy fog around their ship.)  I remember thinking ... you lousy bastards, you mess with us, then sit there watching what we do? Thinking about that P.O.ed me even more!  I found a rock and threw it at them, I looked for another but only found a dirt clod so I threw that feeling I showed them how I felt about them. (Although they didn't physically react, I did get a minor feeling they were somewhat surprised I did that.) I turned then stomped in the house. I heard dad walking up the stairs, while mom keep repeating; &quot;Would you look at the time? What happened to the time? Where'd the time go?&quot; (About 3 times over.) Don't know if I would have noticed if she hadn't pointed it out. Shocked, it was now 9:40 (an hour & eight minutes later in time). Mom suddenly declared; &quot;I'm going to bed right now!&quot; With me still staring at the clock, & with a burst of determination she quickly went around behind me and shot upstairs. (???)  My mom, as long as I knew her Never Ever went to bed before 12. I was dumbfounded knowing that ... I had lots of questions, I tried processing the events but could not figure out how this happened, it made no sense. (With no answers, I remember thinking, I'll have to figure it out later, and went to bed.)  The next morning food & dishes were still on the kitchen table, mom was having a fit, shoving a dish right in my face saying; &quot;Nobody finished supper, we left the food on the table all night, I cooked supper for nothing ... &quot; & etc. I went to school that day, waiting until supper (to kind of re-create the moment) when I questioned them both. They completely ignored me at first, I mean I had one heck of a time getting their attention. I asked dad again & again; &quot;Dad, remember you said you heard those funny sounds last night?&quot; after 3 times he finally turned with the most blurry, blood shot, dead eyes, and said; &quot;Uh-huh.&quot; I said; &quot;Dad, dad remember you saw those funny lights?&quot; I repeated it over & over until he turned to me again & said; &quot;Uh-huh.&quot;  That's it?  I turned to my mom saying; Remember when you said; &quot;Look at the time? What happened to the time? Where'd the time go?&quot; I repeated it several times until she finally turned to me with bleary, welled up, blood shot eyes, and said; &quot;Uh-huh.&quot;  Nothing! Ahhhhh!!!  Mom & dad started talking about something else, and me, I put my head down realizing they didn't remember anything, they were no help at all. I thought, here's my father one of the most brilliant & talented people I know he was a pilot, an inventor, RCA copied the long range TV antenna after his model, he was smarter than any of my teachers. He had an amazing memory, quoted Shakespeare, could add a full shopping cart of groceries before the checker could finish punching in the prices, he had ESP & could read minds, telling me (word for word) what someone was going to say before they said a thing, he told me my future (things that were 40 years out) & yet, he didn't have chance against them, he can't remember anything, they're more powerful than he is. I felt very alone & with no one to protect me from those rotten bastards.  I felt hopeless thinking ... what chance do I have?  In third grade, I was home (by myself) when I saw a UFO account on broadcast TV (it involved story after story about crashed military aircraft, including a passenger airliner that had supposedly been downed by UFO craft in the &quot;1950's&quot;. (I was amazed) it showed UFO's darting a crossed a clear blue sky, & told how the military had made a decision to not attempt to shoot at them because of too many lost lives & equipment losses. After watching that film I was excited & asked just about everybody. I told my parents, believing I'd soon have answers & find the real truth ... sorry to say, that was it, no one I knew saw it, & nothing ever became of it. (I've looked on line to find that same broadcast ... but nothing except for a tiny segment you can see on a Disney broadcast.) &quot;Disney UFO Documentary: 'Alien Encounters'&quot;  In sixth grade my class had the most wonderful teacher, Mrs. Mixner (we all loved her) one day she asked if anyone had seen a UFO. Feeling brave I raised my hand & told her & the class the whole story, it was the first time I opened up about what happened. Classmate, Mary Anne Catalano volunteered that she & her parents had seen a strange light in the sky (I was hoping for more) Mrs. Mixner asked her several questions, but she didn't remember anything else, that was it? (Ahhh ... !!!)  As teen, and as an adult, I would sometimes bring the subject up to dad ... he would just freeze up. I do remember a few times when he'd say; &quot;You know there are UFO's and E.T.s out there, anybody who believes we're the only species in this universe is stupid!&quot; I would always say, yes dad, I KNOW we're not the only ones. Through the years I read whatever I could find on the subject, told my friends, coworkers, two wives, & my kids, but I never had anyone tell me of any experiences. It always ends the same way, no one ever makes a comment after I tell my story. One of the last times I talked to my dad (he called from Florida) he was especially up beat & cheerful telling me all the stuff he was doing, fishing, the green house he made, & so I decided to slip in our UFO incident. Oh man ... I've felt horrible for doing that ever since. I waited. He didn't say Uh-huh that day ... it was just this very long pause (dad was always worried about the phone bill & with him not saying anything it was highly unusual) finally I asked if he was still there, he said; &quot;Yes.&quot; I only talked to him one more time after that, I killed his spirit of joy, and that call ended abruptly. Dad died in &quot;1991&quot;  I decided to move to Florida staying with my mom for a little while.  I told her the whole UFO story, carefully detailing every part, what everybody said, & what my thoughts were, just hoping she'd remember or say something helpful. Mom didn't say a word during the story, she just listened. (I seriously doubted she would even respond after all those years of nothing.) Big surprise (as soon as I finished) mom immediately shocked me by going into a story about the time she was pregnant when I was little. She said; &quot;You probably don't remember this ... &quot;  I said; &quot;Oh yes do (I recounted) I remember the day dad asked if I wanted a little brother or a sister. I was standing by the grape arbor eating grapes when he came out and asked me, he had this bounce in his step, filled with joy, and as happy as I'd ever see him.&quot; Then Mom said; &quot;You know, your dad could never figure it out what happened ... it just went away.&quot;  Ohhhhh ... noooo, alarm bells went off with my knowing about that hybrid program the E.T. were doing, ahhhhh!  Could I have a 1/2 alien brother or sister out there ... ??? ... oh no!  Okay, occasionally a fetus can be absorbed back into the mother's body, but under the circumstances, considering the time line being so close to that same time (I have NO proof) but I do have some serious concerns as to what could have happened. Mom died in 2005 and I must say I'm grateful for having had the opportunity to relate that story to her, and more than a little spooked to learn what she had to say in return. I'm still searching for answers …",
      "link": "http://www.nuforc.org/webreports/090/S90391.html",
      "state": "NJ",
      "duration": "1:08"
    },
    {
      "_id": "64d005f478aba2ec5a3bd6a2",
      "summary": "Driving on 93 No. towards Manchester. A bright circular light came down from the horizon getting brighter by the second, hovered motion",
      "city": "salem",
      "shape": "circle",
      "date": "2012-10-30T00:00:00",
      "story": "Driving on 93 No. towards Manchester.  A bright circular light came down from the horizon getting brighter by the second, hovered motionless for about 3 seconds and took off like a shooting star.",
      "link": "http://www.nuforc.org/webreports/093/S93367.html",
      "state": "NH",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bd98b",
      "summary": "Red pulsating sphere in OR- UFO?",
      "city": "salem",
      "shape": "sphere",
      "date": "2012-08-05T00:00:00",
      "story": "Red pulsating sphere in OR- UFO? As I was driving North-bound on I-5 from Salem to Portland, Oregon, I saw one red sphere object in the NWW sky around 12:20a 7/17/12.  It was pulsating red in moderate frequency.  It was too close to be a satelite but too far to be a telephone signal pole device- it was silimar to a plane but slightly larger and did not move. It did not have white or green lights on it. It was fairly high in the sky for most of the sighting (about 30 mins duration).  Towards the end of the sighting, it seemed to have lowered in altitude and gone slightly more westward.  The night was clear and the object appeared below the big dipper constellation.  It did not have noise to it nor did it have a trail.",
      "link": "http://www.nuforc.org/webreports/090/S90953.html",
      "state": "OR",
      "duration": "30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bdcec",
      "summary": "Bright flying object spotted near downtown Salem, OR",
      "city": "salem",
      "shape": "cylinder",
      "date": "2012-11-19T00:00:00",
      "story": "Bright flying object spotted near downtown Salem, OR A friend and me were heading to downtown on 12th street.  At first when I saw it, I thought it must be a street light at a distance, just a trick of positioning.   But what I saw was in the sky, and my friend saw it too. It was absolutely not a plane, helicopter, or any other sort of aircraft either of us had ever seen.  It was a very bright goldish light, fairly big in size.  I thought it was more circular but my friend said it looked like a cylinder.   Either way, we both saw it fly quickly towards the right and then out of sight.  Very unusual. ((NUFORC Note:  Witness does not indicate the time of the sighting.  PD))",
      "link": "http://www.nuforc.org/webreports/094/S94410.html",
      "state": "OR",
      "duration": "5 minutes +-"
    },
    {
      "_id": "64d005f478aba2ec5a3bdd45",
      "summary": "I noticed the Light Craft in the sky at 3:30 am and has been recording since . It's swaying green light but staying in one area of sky.",
      "city": "salem",
      "shape": "light",
      "date": "2012-08-19T00:00:00",
      "story": "I noticed the Light Craft in the sky at 3:30 am and has been recording since . It's swaying green light but staying in one area of sky. This UFO/Alien had one depart from it then took off fast. Light craft is swaying green, red, white and purple lights. it is in the sky perfectly seen from Downtown Salem Area.  My Boyfriend and i noticed a bright white light moving in the sky so we went to our parking lot to see it better and we had caught it on tape and it started to flash lights.",
      "link": "http://www.nuforc.org/webreports/091/S91661.html",
      "state": "OR",
      "duration": "still going"
    },
    {
      "_id": "64d005f478aba2ec5a3be07e",
      "summary": "5 orange glowing objects cruise by swimming pool in densely populated neighborhood of NE Salem.",
      "city": "salem",
      "shape": "sphere",
      "date": "2012-08-19T00:00:00",
      "story": "5 orange glowing objects cruise by swimming pool in densely populated neighborhood of NE Salem. At 10:30 PM Sunday evening the 12th of August my wife ((name deleted)) (48 yrs old) and myself (49)were in the 16 foot illuminated (underwater light) pool surrounded by darkness and stars in the back yard for a half hour or so when I noticed a glowing round orange object flying north to south just west of our property, less than quarter mile away at about 500 feet up (fairly low altitude in the densely populated neighborhood we live in North East Salem).   5 minutes later, from the north, 5 orange balls of silent traveling light could be seen traversing over the neighborhood between my street (Siesta) and the street to the west of ours (Bonanza) at about 20 to 30 miles per hour, traveling against a 5 to 10 mile per hour wind and rapidly approaching the airspace directly across from our pool.  During the approach my wife suddenly came to the realization this was not conventional aircraft, got spooked and insisted I get my glasses as she quickly got out of the pool.  I d! ashed to the kitchen door and retrieved by glasses and ran back to the edge of the pool, propping my arms up on the wood pile that lined the property line.  My wife was now standing behind me watching as the objects now slowly cruised by together, reminiscent Japanese lanterns but at a close enough vantage point to eliminate that possibility.  They also were clearly traveling together and independent of the wind so I quickly dismissed the possibility of such a man-made object.  The glowing balls of orange light, less than a quarter mile away and at about 500 feet briefly continued away from the pool to the left and each orange ball, one by one, imploded on itself disappearing one by one till all has disappeared from the sky. A couple of observations. I have been a student of the UFO phenomenon for over 25 years, spending the late 80’s and 90’s as a field investigator and assistant state director for MUFON and eventually helping establish Oregon UFO Research in 2000.  At the time of this event, the wife and I HAD JUST been discussing the subject of unidentified flying objects, and in particular I was in the middle of telling her about an incident in 1988 when I saw a low flying orange ball of light in my back yard in West Salem.  Almost immediately on the heels of telling her that story these balls of light appeared coming in over the homes along our street and heading our way and looking exactly like the object I had seen 23 years before.   I caught myself saying, \"You gotta be kidding me,\"  to my wife in light of just recalling to her the incident 23 years before. My gut feeling as I watched the orange glowing orbs or balls was that the flight was intentional, that they slowed as they passed us next to the pool and that we were being watched as we watched them, strong feeling. ((NUFORC Note:  We extend our gratitude to Eric Byler, Co-Founder of Oregon UFO Research, for sharing this report with our Center.  Eric is an exceptionally experienced and dedicated investigator of the UFO phenomenon, and we know him to be an unusually reliable source of information.  PD))",
      "link": "http://www.nuforc.org/webreports/091/S91812.html",
      "state": "OR",
      "duration": "minute...minute and a hal"
    },
    {
      "_id": "64d005f478aba2ec5a3be2a3",
      "summary": "White to red constant one light, to black saucer.",
      "city": "salem",
      "shape": "disk",
      "date": "2012-08-05T00:00:00",
      "story": "white to red constant one light, to black saucer. At first I saw a oval shaped VERY bright light that came out of the sky.  I quickly reached in my pocket, and pulled out phone to take a video of it.  When I got the camera up,  I could not see the light anymore while filming.   After watching the film that I had taken, I realized I took this picture of the UFO in some black Stealth form.",
      "link": "http://www.nuforc.org/webreports/091/S91352.html",
      "state": "OR",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3be39f",
      "summary": "UFO SIGHTING FEBRUARY 8TH 2012 2 PM SALEM OREGON  While driving to Salem on Wednesday the eighth of February on the Interstate 5 Southb",
      "city": "salem",
      "shape": "teardrop",
      "date": "2012-03-13T00:00:00",
      "story": "UFO SIGHTING FEBRUARY 8TH 2012 2 PM SALEM OREGON  While driving to Salem on Wednesday the eighth of February on the Interstate 5 Southbound, my wife and I noticed about a mile ahead near the North bound side of Freeway approx. 15 miles outside of Salem Oregon, what looked like a balloon or blimp shaped object that would be tethered to a rope at maybe a car dealership (to announce a sale?)  But as we moved further south the thing quickly appear to both of us as a small hang glider or experimental aircraft.  My wife thought she saw the operator underneath but that was when the UFO made a deliberate left bank and from about 30-50 feet up in the sky, crossed over the top of the North bound freeway lanes to the Southbound lanes and came right towards us (and everyone behind us in heavy traffic).  It was then we both got an incredible close-up view of this thing as follows: only about 4 feet in length, and about two feet across, dark dull gray in color with kind of like a tear drop shape, the rear being much smaller than the front.  There was something hanging just under the body, like a camera mount but no markings on the craft.  I was stunned at the proximity to us and failed to turn on my camera phone function.  It was traveling about 50 mph…I say this because the speed limit was 70 in that area and it was coming from the North bound side of freeway but wasn’t quite a! s fast as the traffic.  Since my wife was driving, I turned in my seat and watched it fly right over a semi-tractor and make controlled right and then left banking, then into a completely straight path.  At that point my wife said, “ what the hell was that? “ I told her I think it’s some kind of new surveillance machine the state patrol was using, because I’d read that there are new technologies emerging for military and police applications, that this might be one of them.  I called my son in Nevada and asked him to look these things up on the computer.  He said there were some discussions abut a year ago that the Oregon department of agriculture was thinking about using drones.  Later that night, I got on the Internet myself and looked it up, only to find a ridiculous looking octopus shaped device with eight little helicopter blades which would be Oregon's drone.  What a laugh!  What we saw was actually sleek, quick and beautiful in a weird sort of way.  There was no visible means! of propulsion at all and as I said, no markings.  Please, I would love to have someone reading this correct me and tell me that what we saw can be easily explained.",
      "link": "http://www.nuforc.org/webreports/087/S87151.html",
      "state": "OR",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3be49a",
      "summary": "The object struck me as pretty because it was like a mirror with green lights.",
      "city": "salem",
      "shape": "sphere",
      "date": "2012-08-05T00:00:00",
      "story": "The object struck me as pretty because it was like a mirror with green lights. What I saw appeared to be a horseshoe shape, it was clear or mirror like with pretty chartreuse green lights.  It fell from the sky like a falling star then quickly stopped and flew up above the trees and hovered for a while and then it bolted to the power plant.",
      "link": "http://www.nuforc.org/webreports/091/S91465.html",
      "state": "OR",
      "duration": "35 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3be50b",
      "summary": "Lights over Salem, Oregon",
      "city": "salem",
      "shape": "light",
      "date": "2012-06-14T00:00:00",
      "story": "Lights over Salem, Oregon We were outside on our front porch when noticed lights approaching at a fast speed.  The object began to slow down, then hovered for about three to five seconds.  Then the object quickly ascended approximately 20-30 feet then quickly descended to the original position.   The object again hovered for a few more seconds then quickly moved to the right; faster than any plane I have ever seen.  It made another quick right, stopped, hovered, then made a quick descend out of our sight.   The lights were a yellowish-orange color that pulsated and changed to red.   This has to be the craziest thing I have ever seen and I hope it was a UFO because I have never seen one before!",
      "link": "http://www.nuforc.org/webreports/089/S89465.html",
      "state": "OR",
      "duration": "90 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3be566",
      "summary": "VERY  LARGE FORMATION OF 10 OR MORE ORANGE LIGHTS FAR WEST OF SILVERTON OREGON",
      "city": "salem",
      "shape": "formation",
      "date": "2012-05-13T00:00:00",
      "story": "VERY  LARGE FORMATION OF 10 OR MORE  ORANGE LIGHTS FAR WEST OF SILVERTON OREGON FROM SILVERTON WEST>        WALKING DOG IN YARD, WIFE YELLED TO COME SEE, VERY LARGE FORMATION OF  ORANGE BLINKING LIGHTS WAY OVER SALEM MOST LIKLEY EVEN FARTHER, IT WAS HUGE MOVING FORMATION BOOT LIKE IN SHAPE HEADING WEST AWAY FROM US SLOWLY FADING OUT, WE SEE ALOT OF  NATIONAL GUARD REFUELING GOING ON WITH HELICOPTERS AND TANKERS BUT WAY TOO MANY LIGHTS TO BE THAT AND  FAR AWAY MAYBE  IN THE COAST RANGE IT WAS A HUGE MOVING PATTERN.",
      "link": "http://www.nuforc.org/webreports/088/S88722.html",
      "state": "OR",
      "duration": "5 min."
    },
    {
      "_id": "64d005f478aba2ec5a3bea83",
      "summary": "Salem Ohio 3-12-12  Dome shaped yellowish-white flying objects traveling northeast",
      "city": "salem",
      "shape": "formation",
      "date": "2012-03-13T00:00:00",
      "story": "Salem Ohio 3-12-12  Dome shaped yellowish-white flying objects traveling northeast At 04:30AM, when leaving for work early in the morning, I looked up at the beautiful star filled sky and then continued towards my car that is normastantlly parked outside.  Then as I reached in my pocket for the car keys something caught my attention, at first I thought it might be a shooting star, but then I quickly realized from the shapes and movements that they had to be something else.  I watched two dome shaped yellowish-white lights move across the sky in a north east direction, each moving back and forth but continuing forward.  The lights did not blink like an airplane's or were small and bright like the rescue helicopters that fly to the hospital nearby, the lights were constant yet large and dim, pointing straight down.  I wasn't able to see if their was any other shapes that they might have been ommitting from, my only assumption is that they were two separate units flying together.  I was initial shocked to look up and see such a thing happenin! g right here in my home town.  What solidifies my conclusion that they definitely UFO's, is that for the low altitute, roughly 150ft above the ground, their was absolutely no sound at all.  If they were planes or helicopters it would have been load enough to hear.  I sorry I don't have any more info.  I simply stood in amazement and watch until the objects continued out of sight.",
      "link": "http://www.nuforc.org/webreports/087/S87622.html",
      "state": "OH",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bf336",
      "summary": "5 orange circular objects in shape of right faced cheveron to the right of the Salem Powerplant. Two of the objects joined at one point",
      "city": "salem",
      "shape": "chevron",
      "date": "2013-07-03T00:00:00",
      "story": "5 orange circular objects in shape of right faced cheveron to the right of the Salem Powerplant.   Two of the objects joined at one point and disappeared.  On and off for about 10 min until all of the objects vanished.",
      "link": "http://www.nuforc.org/webreports/098/S98494.html",
      "state": "MA",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bf421",
      "summary": "Observed one bright red/orange light at first, then saw three more identical objects following it forming a triangle shape as soon as t",
      "city": "salem",
      "shape": "circle",
      "date": "2013-02-04T00:00:00",
      "story": "Observed one bright red/orange light at first, then saw three more identical objects following it forming a triangle shape as soon as the triangle formed the were least 8 to 9 objects swarmed the sky",
      "link": "http://www.nuforc.org/webreports/095/S95491.html",
      "state": "OR",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bf5a5",
      "summary": "7 glowing &quot;orbs&quot; floating from W. Salem OR from the west headed north. Stopping mid flight then up into the clouds.",
      "city": "salem",
      "shape": "oval",
      "date": "2013-02-04T00:00:00",
      "story": "7 glowing &quot;orbs&quot; floating from W. Salem OR from the west headed north. Stopping mid flight then up into the clouds. West Salem OR Xmass night (25th) 730pm...from the west came 7 glowing (red/orange) spheres spaces 5-10 seconds apart, one after another.  They arced north, stopped, continued and ascended up into the clouds one by one.  No sound, quite bright, quite close...followed similar path, but different individual \"behaviors\"   Very slow, graceful and deliberate.  Amazing stuff! ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/095/S95527.html",
      "state": "OR",
      "duration": "5-7 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bf702",
      "summary": "Low flying star-like object transforms into shining golden triangle in Salem, OR.",
      "city": "salem",
      "shape": "triangle",
      "date": "2013-10-14T00:00:00",
      "story": "Low flying star-like object transforms into shining golden triangle in Salem, OR It was around 9:50pm (21:50) on Friday October 4, 2013 that my husband and I decided to go outside and observe the stars.  It was a clear, cloudless, starry night perfect for observing the night sky.   We went out front to the driveway which is facing south, and began looking at the stars when my husband noticed a small bluish-white star-like light moving slowly and noiselessly SE.  He alerted me to it and my mind automatically thought “it’s a plane,” but also that it was strange that it was flying so low, close to the dark outline of treetops behind the neighbor’s field.   It moved behind a tall tree and we couldn’t see it anymore, so we moved a small distance west up the street to try and see it but still was not able, so we walked east back down the street.  It slowly came out to a clearing to the west of the tall tree making short, jumpy movements, like stop, go, stop, go, heading towards another outline of clustered trees.   It, still moving west, went behind those trees where we could not see, so again, we moved west trying to follow and a few seconds later, it flashed a bluish-white light through the trees at us and started moving back eastward past the trees and over the clearing (by this time we were running back east to follow it) toward the tall tree again, still making short, jumpy movements.   It went behind the tall tree again (we are now facing the tall tree) and that’s when I saw it flash its bluish-white light even brighter (almost flashlight-like) right through the tree at us!  It moved east of the tree slowly, staying really low to the treetops of the line of trees next to it.  It stopped suddenly and hovered for a few seconds right over the treetops.  Then, all of a sudden I see it drop straight downward below the treetops where I could not see.  It disappeared for what seemed like a few minuets but every once in a while, I could see the bluish-white light peeking up around and through the treetops almost as if it was trying to play “peek-a-boo” with my husband and I, moving left a! nd right , up to the treetops and back down again, in a slow fashion.  As it was doing this, I also noticed a small red light on the object’s left/east side that would sporadically blink, not in any fashion similar to our commercial aircraft.  It then rose straight up over the treetops and began to change shape and colors changing from its original bluish-white light to blue to red and back to bluish-white light, its little left/east side red light flashing, it moved up, down, east, west in such unpredictable movements, going back westward toward the tall tree.  It went behind the tall tree still changing color and shape and came out to the west of it into the clearing, and right next to the west of the tree made a diamond-like shape pattern going east, down, west, up, and back to its eastern starting point slowly turning into a big yellow-golden glowing triangular shaped star-like light object that slowly moved into the middle of the clearing growing bigger and brighter, hovering there right in front of us.  While hovering, we got to better observe the object.  Overall, it had a yellow-gold light.  The shape of the object was triangular (point up) with a glowing golden light in the center.  There were three golden triangular shaped lights shining from the two sides and bottom of the object.  On the left/east side of the object, right underneath the glowing light, was the erratically flashing red light I saw from earlier. But its shape and size changed also.  This time I saw that it had a big red light and right underneath that light was a smaller red light.  Hovering there in the clearing, it glowed big and bright and constantly flashed its red lights at us.  We were directly in front of it.   After hovering in the clearing for what seemed like minutes upon minuets, the object slightly turned facing its red lights right at us, and started moving westward again at a leisurely pace toward a large tree that it disappeared behind.   My husband and I ran westward back up! the street to see if we could see it again, but it was gone.  It was 1 0:05pm (22:05) when the object left, making the duration of our experience around 15 minuets total. The whole time my husband and I were exclaiming things like “Whoa!?!”, “What?!?”, “Wow!?!”, “Oh my gosh!?!” when it was star-like and making unpredictable movements and changing colors and speeds.   After it changed its shape and color to a triangular golden light object we still were exclaiming as described above, but then I heard my husband say (almost in a trance-like but still fully aware state) “It’s so beautiful!” to which I responded in a similar fashion “It’s angelic”.  But when I heard my husband say that and after I responded to him, a feeling of emptiness and despair came over me.  I felt like the object was something malicious trying to trick our minds.  My husband seemed to experience a bodily reaction at the time of the sighting.  He started shaking and breathing heavily and exclaiming.  I was in such bewilderment and shock at what I was seeing (trying to keep myself together), but it was most definitely like NOTHING I have EVER seen in the sky before and it was UNMISTAKABLY, UNDOUBTEDLY, something that is not of this world. ((NUFORC Note:  We spoke via telephone with this witness, and we found her to be unusuall eloquent, sincere, and sober-minded.  She probably is an excellent witness, we suspect.  PD))",
      "link": "http://www.nuforc.org/webreports/103/S103008.html",
      "state": "OR",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bf703",
      "summary": "Brilliant star-like object hovers above trees and shines bright lights before changing into golden triangle.",
      "city": "salem",
      "shape": "triangle",
      "date": "2013-10-14T00:00:00",
      "story": "Brilliant star-like object hovers above trees and shines bright lights before changing into golden triangle. On the night of October 4, 2013 around 9:50pm, my wife and I decided to go look at the stars. We were in front of my parents house in Salem, Oregon facing south.  The sky was very clear that night and, after a minute or two I spotted something that at first I thought might have been a far off plane.  It came out from behind a group of trees that was SW of us flying at a very low altitude (the object was parallel with the tops of the trees), and heading East at a very slow pace.  I was confused because it was low flying, slow and noiseless, so I alerted my wife to it and she immediately noticed it also.  We were observing what appeared to be a small bluish-white light with the occasional blink of red light that seemed to be too off tempo to be a planes.  After a minute or so, it finally went behind a larger tree that is taller than the others around it.  Interestingly, I noticed that before it reached the tree it changed direction  going slightly up.  Then, as it wa! s behind the tree, it changed course completely and was now going West with jumpy, erratic movements.  Almost like it was caught on a fishing line and was getting reeled in, at first fast then slow, then almost motionless all the while with an occasional blink of red. This startled me and I exclaimed out loud to my wife and myself.  Ending up behind the same group of trees that I originally first saw it fly out of, it then changed course again coming back out of the trees going east.  At that moment, it was Very bright and shone through the trees whitish light.  Coming into the clearing, it was clearly visible with a star-like shining white-blue light that was glinting off of a dark shape.  The light was brightest on the right side and on the left is where the red blinking light was located.  Finally, with the same unpredictable skip-like movements, it flew behind the tall tree and at that time shone a very bright white light right through the tree at us that illuminated the area.  This made us booth exclaim aloud and as we watched it, it smoothly came out of the other side of the tree, hovering east parallel to the smaller treetops.   It slowly moved east then seemed to stop and descend behind the trees where we lost sight of it for a minute. We knew it was there and shortly later we caught sight of it moving just below the tree tops, kind of going up and down. It was like it was playing hide and seek with us and it made awkward movements right above the trees, going side to side and up and down. Ascending slowly into the sky, it made all sorts of movements, going in all directions. At this time it was clearly visible and I tried desperately to make out what it looked like. It was like a blue-white arrowhead shaped light that was very radiant and star-like. The light it produce seemed to be bouncing off of its own shape on all sides, especially on the right which was clearly arch-like, and the bottom. Now it started slowly moving west, growing in brightness and gaining a clearly defined central triangular light. Going b! ehind the tall tree, it moved in an unexplainable pattern and then slowed dramatically. At this point, I was very shaken up and when I saw it moving around I was like a frightened animal shaking in fear. It was just beyond the tall tree and what amazed me is that it changed from the white light I was seeing to an incredible golden radiance. It stood almost motionless and seemed to be growing much more radiant than before. The shape looked exactly like an angel. Continually moving west, it seemed to turn slightly and stop. That is when we saw something extraordinary. It now had a translucent golden arrow-head shape encompassing the central light and two constant red lights on its left side, one atop the other. The central light was brilliant golden with the same arrowhead shape and light coming from all sides. Then moving west at a quicker pace, I noticed that the central light could have been three lights grouping together in a triad formation right before it disappeared be! hind a large group of trees and we lost sight of it for good. \tI watched this object the entire time it was in view, never taking my eyes from it. In the beginning of the encounter, I had thought that my eyes were playing tricks on me but as I continued to watch, I knew my eyes were fine and I was witnessing something incredible. I was amazed and astounded at what I had seen and exclaimed a lot during the event. Its magnificent star-like radiance left me awestruck. By the time it was leaving, it was large, bright and obvious in the sky, and the golden triangle that surrounded it was very clearly defined. The way this object moved is absolutely unexplainable and confirmed to me that it was definitely not one of our typical aircraft. The event lasted about 15 minutes.",
      "link": "http://www.nuforc.org/webreports/103/S103107.html",
      "state": "OR",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bf708",
      "summary": "Red lights floating east to west.",
      "city": "salem",
      "shape": "sphere",
      "date": "2013-07-03T00:00:00",
      "story": "Red lights floating east to west There were eight red sphere like lights tracking west to east.  One seemed to have separated into multiple lights and fade out.  Only two of the lights made it out of city limits before fading out.  No zipping. Just floating, almost sailing across the sky. No boom from fireworks being launched, burning, or popping sounds.  They were completely silent. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/098/S98665.html",
      "state": "OR",
      "duration": "~10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bf6ea",
      "summary": "Green fireball in sky",
      "city": "salem",
      "shape": "fireball",
      "date": "2013-09-30T00:00:00",
      "story": "green fireball in sky I looked out the window and saw a Large Green fireball like object passing through the sky in a slight arch.  Couldn't tell if it was headed to the earth or just getting close.  It disappeared from sight after a few seconds.  It was incredible.  Never seen anything like it before in my life!",
      "link": "http://www.nuforc.org/webreports/102/S102536.html",
      "state": "NH",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bf7df",
      "summary": "Three orbiting lights visualized in western sky over Salem, MA.",
      "city": "salem",
      "shape": "light",
      "date": "2013-10-14T00:00:00",
      "story": "Three orbiting lights visualized in western sky over Salem, MA. Drive from NH to Boston, passing Salem, MA.  One MIT scientist, one health care professional.  Three orbiting orbs sighted.  They swooped, shifted, careened across the western sky.  Light intensity constant.  Visible in fog for 10 mi. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/103/S103005.html",
      "state": "MA",
      "duration": "13 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bf838",
      "summary": "Greenish blue object  with white tail  sighted in salem,  oregon.",
      "city": "salem",
      "shape": "cigar",
      "date": "2013-05-15T00:00:00",
      "story": "Greenish blue object  with white tail  sighted in salem,  oregon. I was flying a kite with my daughter, one cigar shaped object flew behind it at a fast rate of speed and an angle of  10-15 degrees off horizontal.  The object was greenish blue with a white tail.  No sound at all. It lasted only about 2 seconds and then it was gone.",
      "link": "http://www.nuforc.org/webreports/097/S97310.html",
      "state": "OR",
      "duration": "seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bfa9e",
      "summary": "Orange oval glow flying/ hovering for 4 minutes outside Salem Or.",
      "city": "salem",
      "shape": "oval",
      "date": "2013-06-02T00:00:00",
      "story": "Orange oval glow flying/ hovering for 4 minutes outside Salem Or. 1  bright oval orange glow that appeared to be on fire when flying silently from the N.E, the object stopped and hovered in one spot for 4 minutes before dropping quickly towards earth. Sky was a little cloudy.",
      "link": "http://www.nuforc.org/webreports/097/S97860.html",
      "state": "OR",
      "duration": "4 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bfe60",
      "summary": "Bright white or reflecting silver ball hovering...others flying by?",
      "city": "salem",
      "shape": "circle",
      "date": "2013-07-22T00:00:00",
      "story": "Bright white or reflecting silver ball hovering...others flying by? Bright reflective silver or white \"ball\" hovering.  Clear blue skies with no clouds or chemtrails.  1 object in the frame with possible others flying by in the frame. Looked like a possible haze around it too.",
      "link": "http://www.nuforc.org/webreports/100/S100215.html",
      "state": "OR",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c03d8",
      "summary": "Object sighted in West by South-west sky at about 21:20.  Object appeared round/circular in shape with a dark center; had glow.",
      "city": "salem",
      "shape": "circle",
      "date": "2013-05-15T00:00:00",
      "story": "Object sighted in West by South-west sky at about 21:20.Object appeared round/circular in shape with a dark center; had glow around central portion.  Object did not generate any noise.  First sighted about 30 degrees above horizon and proceeded at undetermined speed toward East by North-east sky until about 45 degrees above horizon.  Objected faded from sight, either into cloud cover or simply faded from view.  Object had an orange glow for entire duration of transverse.  Travel time of about 1.5 to 2 minutes.",
      "link": "http://www.nuforc.org/webreports/097/S97716.html",
      "state": "OR",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c0764",
      "summary": "An oval shaped craft emited an intense silver light. The bottom of it had a red/blue streak. Then it very fast left blinking red.",
      "city": "salem",
      "shape": "oval",
      "date": "2014-01-10T00:00:00",
      "story": "An oval shaped craft emmited an intense silver light. The bottom of it had a red/blue streak. Then it very fast left blinking red. We were driving down Interstate 5, away from Salem.  As we were approaching our exit we noticed this light hovering about forty or fifty feet about the main road.  It was so bright, and the intensity of the blue-silver like increased and increased.  It then suddenly seemed to burn out.  We drove under it and i saw it was oval, with two striped of light going down the length of it on the bottow.  Each light was connected by three balls of light.  One stream was red while the other was blue.  As we were driving away we saw it blinking red and it zoomed away very fast. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD)) ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/105/S105774.html",
      "state": "OR",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c073f",
      "summary": "Object seen but nothing came out on film.",
      "city": "salem",
      "shape": "egg",
      "date": "2014-01-10T00:00:00",
      "story": "objesct seen but nothing came out on film It was shortly after school ended in the year of 1994 I was 14 at the time.  My brother was watching TV and I was in my room playing my saga.  When my mom comes in and asks me to come in to the kitchen to look out the window.  So, I did and saw this disk glowing just over the tree line.  We watched it for about 20 minutes then my mom grabs her camera snaps off a whole fresh roll of 32 photos.  The object took off or cloaked after the flash went off about the 14th time.  But my mom still shoot  the hole roll.  The next day she went to get the film developed.  She sent it out  on a 3-5 day ticket it took a month to get the film back and when she did  the photos were blank  not a single shot came out.  I’ve shared this story many times and heard you on Clyde Lewis and felt this should be brought to you for documentation.",
      "link": "http://www.nuforc.org/webreports/106/S106084.html",
      "state": "NY",
      "duration": "45 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c0889",
      "summary": "Clearly a triangular craft with a white light on each corner and slowly blinking red light in the center",
      "city": "salem",
      "shape": "triangle",
      "date": "2014-03-18T00:00:00",
      "story": "Clearly a triangular craft with a white light on each corner and slowly blinking red light in the center My wife and I were traveling north on Rt 28  roughly 1 1/2 miles south of Walmart and saw 2 bright lights approximately 150 above ground.  We both thought it was a helicopter covering a story of some sort as it was hovering and not moving. As we got closer and almost underneath I saw that the lights were not spot lights and that there were clearly 3 lights ( one on each corner) and 1 slowly blinking red light in the center.  We could clearly see the outline of the craft and i would guess that it was at least 60-80 ft from point to point.  We were close enough to realize that it was making no noise.  It slowly hovered to the south and then to the west maybe 600 feet to the west of rt 28.  We drove in to Walmart parking lot as a Police car was speeding out in the same direction towards the craft.  We quickly parked and got out of the car to watch it and it was gone.",
      "link": "http://www.nuforc.org/webreports/107/S107547.html",
      "state": "NH",
      "duration": "90 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c08d6",
      "summary": "Dual, nondescript white lights hovering motionless over the interstate.",
      "city": "salem",
      "shape": "light",
      "date": "2014-03-18T00:00:00",
      "story": "dual, nondescript white lights hovering motionless over the interstate. I-5 North at mile marker 255.  While I'm the only person reporting the event, I expect everyone else in that traffic would have seen it as well, numbering in the hundreds. Two white lights, spaced roughly 10 feet apart, hovering motionless 100 feet over the north bound road.  As I approach any light in the sky I always attempt to identify any blinking lights as are required by the FAA.  This had none. It was dark outside but the clouds in the landscape were lit slightly by the city below and through the two lights in the sky I could see the clouds.  I saw no craft supporting the lights. I looked for it through my rear view upon moving further down the interstate, but the lights had vanished by then. When you called me, I was a bit unclear on the exact location, and I'm sorry for that.  I've since gone back down the interstate and identified a landmark beside which I saw the lights.",
      "link": "http://www.nuforc.org/webreports/107/S107556.html",
      "state": "OR",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c0cb6",
      "summary": "Six yellow-orange lights with reddish halos moving from NE to SW at midnight on New Year's Eve spaced about 45 seconds apart; no sounds",
      "city": "salem",
      "shape": "light",
      "date": "2014-01-10T00:00:00",
      "story": "Six yellow-orange lights with reddish halos moving from NE to SW at midnight on New Year's Eve spaced about 45 seconds apart; no sounds My wife and I went out on our deck about a half minute past midnight on New Year's Eve to watch some neighbors' fireworks.  As I lookup up I saw a fairly bright yellow-orange light with a reddish halo around it moving silently from the NE to the SW.   My wife also saw it.  We could not determine how high up it was as the sky was clear and there was no frame of reference.  It did not seem to be a plane or helicopter as the light did not blink and there was no sound.  It moved moderately fast covering perhaps a 45 degree arc of sky in about a minute.  As we watched, a second light came into view over our roofline from the same direction and on the same route as the first.  It was about 45 seconds behind the first.  Watching the first light, it dimmed as it got further from us, then was not seen.  Changing to watch the second, a third light appeared, same time interval, same path.  This occurred six time; six lights.  Several of them seemed to change their course slightly to the south as they moved away.  Because of our roofline, I was not able to observe where any of them originated. I thought perhaps the lights were some kind of flares suspended from balloons - but they moved too identically for that in my opinion.  Another thought was some type of crafts watching the firework displays for New Years.  However, there were very few fireworks seen; our deck has a good view over the city.  The only other thing I could think of was some kind of night maneuver with our local national guard unit - but I don't think our small unit has six helicopters.  I have read some other observations of similar light sightings over the past months.",
      "link": "http://www.nuforc.org/webreports/105/S105886.html",
      "state": "OR",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c0d0f",
      "summary": "Approx. 7 orange orb that looked in formation of the Big Dipper then disappeared and faded away.",
      "city": "salem",
      "shape": "sphere",
      "date": "2014-02-07T00:00:00",
      "story": "Approx. 7 orange orb that looked in formation of the Big Dipper then disappeared and faded away.",
      "link": "http://www.nuforc.org/webreports/106/S106805.html",
      "state": "OR",
      "duration": "1 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c0d0e",
      "summary": "Formation of glowing red objects",
      "city": "salem",
      "shape": "unknown",
      "date": "2014-02-07T00:00:00",
      "story": "Formation of glowing red objects I was approaching Front Street coming from the north east, coming up to the stop sign and prepare to turn right I had spotted something odd in the sky to the south.  I take my right turn and grab my phone while keeping an eye on what these objects could be.  Front St runs parallel with the Willamette river and along waterfront Park and Marion Street bridge spanning across the river to West Salem.  I started up my video recorder on my phone and was approaching the overhang of the bridge so I discounted the idea that these objects weren't attached to the bridge.  After coming from under the bridge that was when I was able to get a clear and unobstructed view.  These objects were solid red in color and never changed to any other color, just a constant red, I counted at least 10 of these objects all within a loose cluster, they weren't too far from one another and they appeared to be in what I can remember was a zig zag formation, like the letter \"Z\".  At that time I ! was approaching a stop light and was basically right under the formation of these objects.  I was stopped in my vehicle and studying these objects and as I was looking directly at them the upper part of these objects broke formation and slowly started towards the south with the bottom half heading in all different directions, so five broke south and the other five went in random directions.  What shocked me the most was when I witnessed these things break formation none of them made any sounds whatsoever.  I went back to the video I had recorded after I got back to my place of employment and watched it frame by frame and  was able to capture a few screenshots of my siting.",
      "link": "http://www.nuforc.org/webreports/106/S106848.html",
      "state": "OR",
      "duration": "35 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c0dd9",
      "summary": "Looked like some sort of patrol or scouting team.",
      "city": "salem",
      "shape": "circle",
      "date": "2014-01-10T00:00:00",
      "story": "looked like some sort of patrol or scouting team Four bright red lights large in size appeared fallowing eachother traveling south then all four hit a high rate of speed until they were out of sight,   assume out of atmosphere/ ((NUFORC Note:  Witness provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/105/S105852.html",
      "state": "OR",
      "duration": "7 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c0f54",
      "summary": "Brilliant colorful flashing lights moving in a very unconventional way @ 1:30am on January 25, 2014 in Salem Oregon.",
      "city": "salem",
      "shape": "flash",
      "date": "2014-01-30T00:00:00",
      "story": "Brilliant colorful flashing lights moving in a very unconventional way @ 1:30am on January 25, 2014 in Salem, Oregon. At approximately 1:30 AM on January 25, 2014 I was getting into bed and noticed a very bright shining/flickering light in the South-East sky in Salem Oregon.  At first I thought it was an aircraft, but the light emanating from the object didn’t flash in any recognizable pattern as one would expect from an airplane; my next thought was that it was a satellite because the flashes it was emitting were full spectrum, it seemed to be emanating all the colors one might expect to see in a rainbow, but this is where it started getting weird, the object started moving in a back and forth pattern very rapidly for a few moments; something I've never seen conventional aircraft or satellite do.  It would remain in place for a few minutes, moving in a whiplash back-and-forth movement, then it started to wander lazily in random directions, moving in a westerly direction over the span of about one-and-a-half hours before it disappeared from view.  I reported the lights to a ne! ighbor who also confirmed the lights and the same movement patterns I described.  We could not discern any shape, we could only see the flashing/flickering lights; we both described the light as brilliant, agreeing it was far too bright to be a star or a satellite.  As an end-note: I’ve never seen anything remotely like this in my life, and I’m in my 30s.",
      "link": "http://www.nuforc.org/webreports/106/S106634.html",
      "state": "OR",
      "duration": "1.5 hours"
    },
    {
      "_id": "64d005f478aba2ec5a3c11c4",
      "summary": "Bright light, then disappeared.",
      "city": "salem",
      "shape": "circle",
      "date": "2014-02-14T00:00:00",
      "story": "Bright light then disappeared. Watched a bright round orb in the northern sky get really bright and then disappear.",
      "link": "http://www.nuforc.org/webreports/107/S107110.html",
      "state": "OR",
      "duration": "2-5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c121d",
      "summary": "Triangle ufo seen up close with binoculars in southern New Jersey.",
      "city": "salem",
      "shape": "triangle",
      "date": "2014-01-24T00:00:00",
      "story": "Triangle ufo seen up close with binoculars in southern New Jersey. 1/20/14  I have worked 12 hour nights for almost 3 years now.  I am an avid night sky watcher (meteor showers, planet conjunctions, satellites spotting, comets, I.S.S. passings, etc.), so I am quite familiar with \"normal\" night sky sightings. On the night of January 20th 2014, I saw something I've never seen before.  As I was walking out the back door of my workplace to smoke a cigarette at 11:25pm EST, I first noticed the moon about 25 degrees off the horizon straight in front of me. It was the first clear night we've had in at least a week.  As I was looking at the moon a bright light traveling northeast caught my eye.  This light was traveling pretty much in the same location from my vantage point as the moon so it was easy to see.  My first initial thought was that this bright light was the I.S.S., so I ran to my truck 10 feet away and grabbed my binoculars to look at it.  I put my elbows up on my truck so I was steady and found this bright light through my binoculars.  What I saw as one solid bright white light with naked eye turned out to be a triangle shaped UFO, with 3 lights. I could not believe what I was seeing.  I watched it for 30-40 seconds as it traveled away from me. The details of this object: the front light of the triangle was a huge solid white light. It did not change color or blink.  The back 2 light were the same size but were flashing at random it seems from, white/red/blue.  The elevation was probably a little higher than normal helicopter traffic.  Although, since it was dark it was hard to tell. I saw this thing clear as can be through those lenses. I'm not particularly happy I saw, everyone I've told has laughed at me, thought I was joking around, or just don't believe me.  But, I stand by my story, I know what I saw.",
      "link": "http://www.nuforc.org/webreports/106/S106580.html",
      "state": "NJ",
      "duration": "35-45"
    },
    {
      "_id": "64d005f478aba2ec5a3c145b",
      "summary": "We saw 3 lights in the sky!!!",
      "city": "salem",
      "shape": "triangle",
      "date": "2013-12-23T00:00:00",
      "story": "We saw 3 lights in the sky!!! I was going on a walk with my friend. out of the corner of my eye i saw three hovering lights in the nights sky.  They were  in a triangular formation and slowly glided together. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/105/S105511.html",
      "state": "OR",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c1532",
      "summary": "Rectangular space craft following me and basically stalking  me it had looked like extraterrestrial creatures were inside.",
      "city": "salem",
      "shape": "rectangle",
      "date": "2013-12-02T00:00:00",
      "story": "Rectangular space craft following me and basically stalking  me it had looked like extraterrestrial creatures were inside I saw a rectangular space craft type thing with trailer like ruining lights.It happened         when I was taking a walk at 6:00pm  then I looked up in the sky and that's when I         noticed  a space craft thing following me I ran back to my house then peaked out the window and it was hovering over my Condo!!  Also It had windows with weird extraterrestrial creatures inside.",
      "link": "http://www.nuforc.org/webreports/104/S104975.html",
      "state": "OR",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c16a1",
      "summary": "Metallic object reflecting the Sun, then vanishes.",
      "city": "salem",
      "shape": "cigar",
      "date": "2013-10-23T00:00:00",
      "story": "Metallic object reflecting the Sun, then vanishes. I was traveling on I-93S around Salem at 8:10 am on 10/20/13.  In the center of my windshield, above the horizon,  I see a metallic sphere or cylinder reflecting the Sun at approx. 15,000-25,000 ft.  As I’m trying to identify object as a plane, it disappears in thin air.   The sky was totally clear.  The Sun was at 10 o’clock and the object was at 12 o’clock.  Very interesting indeed… ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/103/S103465.html",
      "state": "NH",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c1708",
      "summary": "Triangular-shaped object witnessed by two people at close range.",
      "city": "salem",
      "shape": "triangle",
      "date": "2014-06-04T00:00:00",
      "story": "Triangular-shaped object witnessed by two people at close range. On November 10, 1991, my cousin and I were subject to an object that not only crossed our paths that night, but would affect both of our way of thinking for some years to come.  It was 10:15 P.M.  Central Standard Time as we were traveling east on highway H and was coming back into the town of Salem, Missouri.  We had just crossed the one- lane bridge that resides approximately 5 miles out of town on H highway, and made our way up and over the hill just ¼ of a mile past DD intersection.   Upon topping over the hill, my cousin notices what he believes is an airplane to our far left in the cattle ranchers’ field and this object is traveling south.  Upon further notice, we both realized that not only was this airplane descending, but it made absolutely NO SOUND as it made its way across the field and toward H highway in which we were traveling on.  Believing that it was an airplane, we accelerated to approximately 90 miles per hour so as to pass under the plane as it crossed the highway.  The object reached H highway before our car had the chance to pass under it or even get close to it, and much to our dismay the object came to a complete stop above H highway.  As our car came to a screeching halt, it slid up under the object and stalled out. Sitting in the middle of the highway, my cousin and I stared up at the object, still believing that it was some sort of a helicopter, when we both noticed that the object was making no sound, it was not moving, and the unknown object hovered silently not 30 to 40 feet above us.  In fear, my cousin rolled up his window and we sat silently staring up at the craft.  He turned to me and asked “what do you think it is?”  To which by this time I realized that neither of us knew the answer to his question.  The object had three circular lights on its underside that were extremely bright.  These lights formed a triangular shape and the light source did not waver in energy, in fact, the lights were so bright that the whole highway was illuminated as though it was daytime.   After sitting motionless above the highway for what I believe was approximately two or three minutes, the craft began to slowly move diagonal from its original route and hovered to a clearing in the open field that lay ! to the right of my car.  The object hovered just above the tree tops, almost brushing them as it passed over them, until it had reached an opening in the field. The object stops again and then, much to our dismay, starts to turn onto its side and then slowly lower itself to the ground.  So close to the ground in fact, that I could see the silhouette of the field grass as the light from the lower of the two back lights shined through them.  After sitting at ground level for no longer than one minute, the object slowly left our side and made its way down the forest that rested to its immediate right.  The object then leveled back out flat to the ground as it traveled and after flying about 300 yards, it ascended at a 30 degree angle.  It flew up into the night sky, never to be seen again by my cousin or myself.   After much deliberation, my cousin and I agreed that we had not experienced any lost time nor have we ever found any explanation for what we witnessed.  However, after attending a recent UFO conference an investigator told me that he has studied triangular-shaped UFOs for some time and with my experience, I had come closer to one th! an anyone that he had ever heard of.  During that same conference I spoke to a psychologist who has studied the phenomena, and he listened to my story and was surprised to find that I had not experienced any lost time.  He began to ask me a lot of questions concerning my childhood and after that evening I began to question many events in my childhood that have followed me even into my adult life.  I have had many strange events in my life, and my children seem to also be affected by some of these phenomena.   After many years of not speaking about the event, I contacted my cousin and asked him to tell me his version of the events, only to find that everything lined-up with my story except the ending where he told me that the object followed outside the car as we drove off. ((NUFORC Note:  Source of report indicates that the date of the incident is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/109/S109585.html",
      "state": "MO",
      "duration": "3-5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c19bd",
      "summary": "Metallic sphere moving and changing directions.",
      "city": "salem",
      "shape": "sphere",
      "date": "2014-07-05T00:00:00",
      "story": "metallic sphere moving and changing directions It looked like a white metallic ball to the north and it was heading to the south-east at a fairly good rate of speed.  After about 8 minutes it stopped and and moved in a jagged serpentine manner in that location for a few minutes. Then it continued on to the south-east until it was close to the area of the sky where the moon was located.  At that time it appeared to split into 2 separate spheres for maybe 20 seconds.  Then it began moving back to the north as one sphere. During the movement to the north, 2 separate jets went by heading to the south.  Both times the sphere disappeared for a second or two then reappeared on its same trajectory. When it got to about the same area that it was in when we first noticed it, it disappeared.",
      "link": "http://www.nuforc.org/webreports/110/S110914.html",
      "state": "OR",
      "duration": "~24 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c19c7",
      "summary": "No sound - see my Facebook page... photos posted…",
      "city": "salem",
      "shape": "circle",
      "date": "2014-07-26T00:00:00",
      "story": "No sound - see my Facebook page ... photos posted ... Orange objects traveling east-west across northern part of city ... about a minute and a half apart ... low clouds ... no sound ... moving quite fast ... under low clouds est'd 130-140 mph ...",
      "link": "http://www.nuforc.org/webreports/111/S111730.html",
      "state": "OH",
      "duration": "4 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c2025",
      "summary": "Peculiar cluster of colored lights in the sky, changing pattern, one pattern was an oval, the brightest one was red and in the middle",
      "city": "salem",
      "shape": "changing",
      "date": "2014-06-04T00:00:00",
      "story": "Peculiar cluster of colored lights in the sky, changing pattern, one pattern was an oval, the brightest one was red and in the middle My sons (10 and 7) were in the front yard playing when I noticed them looking at the sky in awe, I asked what was happening and the older one told me I should go out and see, it took me a few seconds to get out and when I got there above us in the distance (miles perhaps) high up there was a peculiar cluster of colored lights, I want to say their colors were white, red, green, blue, yellow.   They were changing pattern quite fast, not zipping though, some were big and some smaller.  At one point I noticed that the formed a nice oval, at that point the brightest one was red and in the middle... they were traveling South.  I posted on Facebook to see if anyone else noticed but I got no response so far. By the time I was able to take a picture they were far and almost invisible, I will send it to you anyway, if you can take a look at it the cluster is in the very middle of it.",
      "link": "http://www.nuforc.org/webreports/109/S109886.html",
      "state": "OR",
      "duration": "~2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c200d",
      "summary": "A bright orange orb, pulsing light.",
      "city": "salem",
      "shape": "sphere",
      "date": "2014-05-08T00:00:00",
      "story": "A bright orange orb, pulsing light. Low on the horizon, south of payson.  A pulsing Orange, reddish orb that was stationary.  Watched the orb for about ten minutes through my spotting scope.   This was not a star or planet.   It caught my attention and stood out in the night sky",
      "link": "http://www.nuforc.org/webreports/109/S109152.html",
      "state": "UT",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c20a9",
      "summary": "True story of alien army seen!!!!!",
      "city": "salem",
      "shape": "triangle",
      "date": "2014-06-06T00:00:00",
      "story": "True story of alien army seen!!!!! The first one we saw was glowing bluish green and it started moving straight and wobbling in an \"S\" pattern.   Shortly after I went to the store me and my boyfriend were joking about seeing something.   As we got home he started running inside and so did I joking around and as he looked back he said baby look what's that?!  And that's when we both turned and saw three glowing orange craft objects.  That's when we actually flew inside, falling over each other trying to get into the door.  My boyfriend and I were beyond  frantic and we had to get my mom to see what was outside....  As we went outside we noticed there was nothing in the sky anymore.  Within a few minutes, from the horizon came one of the orange crafts this was one of eight.   The first four went into what looked like a spade formation then while In this formation one craft was glowing brighter than the rest and slowly dimmed in place and disappeared very quickly then from there more crafts appeared from the horizon then dissapeared even quicker.",
      "link": "http://www.nuforc.org/webreports/109/S109994.html",
      "state": "OR",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c2206",
      "summary": "Large Orange Oblong Light Travelling Slowing Across The Sky.",
      "city": "salem",
      "shape": "other",
      "date": "2014-05-02T00:00:00",
      "story": "Large Orange Oblong Light Travelling Slowing Across The Sky. At approximately 9:30 pm on Thursday, May 1st, my husband and I were sitting in our living room with our front door open.  It was a clear night, and our living room was dimly lit.   I just happened to glance out the front door from where I was sitting and saw a large, deep orange oblong light slowly traveling across the sky from the South.  It had no trail and there was no sound.  It was quiet outside.   My husband looked out and we just watched it. We turned our living room light off.   The large, oblong light was at least 3 times the size of a street lamp.  The oblong shape did not change in shape nor size.  It was travelling North.  It seemed to hover so slowly and at one point we were looking directly up.   Then, it started to move further upward and higher at a steep angle above our home.  It travel North East until it just disappeared.   From the time we were looking at it up until the time it disappeared took approximately 2 minutes. ((NUFORC Note:  We spoke via telephone with this witness, and we found her to be exceptionally eloquent and sober-minded.  We suspect that both witnesses are highly reliable witnesses.  PD))",
      "link": "http://www.nuforc.org/webreports/109/S109102.html",
      "state": "OR",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c24b8",
      "summary": "3 bright dots Salem.",
      "city": "salem",
      "shape": "unknown",
      "date": "2014-11-06T00:00:00",
      "story": "3 bright dots Salem To the West of downtown Salem, OR. Noted two red dots in the sky, traveling Northeast at a constant rate of speed.  Both maintained a consistent path and velocity, based upon distance between.   Approx 1min into observation, a third dot appeared roughly halfway between two red dots, but further west.  Assumed same path and trajectory, quickly falling into parallel line.   All 3 lights increased brightness, then vanished. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/114/S114434.html",
      "state": "OR",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c2945",
      "summary": "Ufo",
      "city": "salem",
      "shape": "oval",
      "date": "2014-11-06T00:00:00",
      "story": "Ufo I saw a weird object spinning near the airport and thought it was a airplane it was not a airplane spinning with yellow red lights. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/115/S115064.html",
      "state": "OR",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c29fb",
      "summary": "Chevron shaped craft passes through sky north east of Salem, Oregon.",
      "city": "salem",
      "shape": "chevron",
      "date": "2014-10-03T00:00:00",
      "story": "Chevron shaped craft passes through sky north east of Salem Oregon Saw faint chevron shaped craft passing slowly through the sky.  Craft was north east of my location. It seemed to be illuminated white or pale yellow however the light was faint, possibly obstructed by clouds.  Craft was moving in the direction of the point of the chevron. Craft faded quickly after being visible for about 10 seconds",
      "link": "http://www.nuforc.org/webreports/114/S114041.html",
      "state": "OR",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c2a97",
      "summary": "An object was spotted hovering far to the SE of Salem with multicolored star-like lights that flashed randomly in a triangular shape.",
      "city": "salem",
      "shape": "unknown",
      "date": "2014-10-03T00:00:00",
      "story": "An object was spotted hovering far to the SE of Salem with multicolored star-like lights that flashed randomly in a triangular shape. Object was viewed and captured on camera phone SE of witness' location hovering above trees south of  Downtown Salem, Oregon, at approximately 2:40 AM, lasting until about 3:45. The object appeared to be  large and far away, but the witness is unsure just how big and how far away the craft was.  The witness  observes that it could be a few football fields in size about 10 miles away or could be 20 miles across, the witness had no way to tell for sure as the visibility was slightly hazy with city light pollution, no stars  were visible, it was not cloudy.  The object hovered, but moved about a central area, bobbing and wobbling. The object appeared  triangle in shape due to flickering and flashing, multicolored star-like lights that followed no noticeable  timed intervals or which star-like light would flicker or flash.  There were also multicolored star-like  lights flashing around the object that did not appear to be attached to it..  The witness describes that  this looks very similar in behavior to one the witness had spotted multiple times but facing north,  intermittently over the previous six to eight months and much farther away from the observer.",
      "link": "http://www.nuforc.org/webreports/114/S114042.html",
      "state": "OR",
      "duration": "67 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c2aac",
      "summary": "Blinking lights in the New Hampshire sky.  ((NUFORC Note:  Possible \"twinkling\" stars.  PD))",
      "city": "salem",
      "shape": "unknown",
      "date": "2014-09-18T00:00:00",
      "story": "Blinking lights in the New Hampshire sky. It first was spotted as an unusual flashing light in the night sky.  It does move slowly in an up and down pattern.  Some times left and right.  Object stays in the same spot through out the night.  I have been seeing the lights for about a month or more every night.  They are usually in the same location.  Tonight there were 2 objects.  Not together, but far apart from each other.  They blink and flash different colors.  You can not really see a shape because they are far away.",
      "link": "http://www.nuforc.org/webreports/113/S113484.html",
      "state": "NH",
      "duration": "10 hours"
    },
    {
      "_id": "64d005f478aba2ec5a3c2ade",
      "summary": "Balloon like clusters over Salem daylight sighting.",
      "city": "salem",
      "shape": "other",
      "date": "2014-10-03T00:00:00",
      "story": "Balloon like clusters over Salem daylight sighting 1.  Where were you and what were you doing at the time? - We were taking a walk in a suburban neighborhood near our apartment, up Cottage St. to \"Clark Creek Park\" with our 4 year old & 7 month old daughters around 6:00 PM. It was twilight but still very light out. 2.  What made you first notice the object? - I don't know, I just looked up into the sky and saw the 1st one of the \"balloon-like\" clusters. 3.  What did you think the object was when you first noticed it? - The objects looked like balloon clusters at first, descending down from the many wisps of clouds high overhead. Then it became apparent that instead they were some \"balloon-like\" cluster UFOs that we'd studied about before. 4.  Describe the object and its actions and motions in detail. - These were the infamous \"balloon-like\" clusters, as well as some single spheres that seemed to slowly move in paths. The 1st group had 3 separate sphere clusters, the 2nd group had 2 separate sphere clusters. Some groups had a red sphere within a cluster of apparently white spheres. We've seen many photos, videos and have read about these \"balloon-like\" clusters before this event today. They would move along on slowly and then seem to stay in the same area for awhile at times.  5. Describe your feelings, reactions and actions, during and after sighting the object. - We had no strange feelings, just excitement. We've had different types of encounters numerous times, but have never witnessed these \"balloon-like\" clusters in person. We've also never gotten any photos or video of any other incidents before this.  6. How did you lose sight of the object? - We never really lost sight of the objects except when they eventually would rise above and beyond certain wisps of high clouds after awhile. We continued on to the public park.  I am emailing photos and a short video clip of the objects",
      "link": "http://www.nuforc.org/webreports/114/S114064.html",
      "state": "OR",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c2d92",
      "summary": "Multiple objects with blinking lights moving around in a strange way for the past hour and half",
      "city": "salem",
      "shape": "unknown",
      "date": "2014-09-10T00:00:00",
      "story": "multiple objects with blinking lights moving around in a strange way for the past hour and half For the past hour and a half we have witnessed multiple objects in different directions of the sky. They had bright flashing lights and seemed to be moving in very odd sequence. They kinda swayed back and forth and slowly moved farther away. We witnessed one that moved from the west to the northwest and in the past hour has moved back to the west but the entire time it was kinda swaying and dipping down for a bit and then a little while later it went back up. Did this same kinda movement all the way to the north  sky and back. We witnessed  two more to the south and one to the northeast. These objects are all moving the same way and are still in the sky at the time of this report",
      "link": "http://www.nuforc.org/webreports/113/S113306.html",
      "state": "OR",
      "duration": "90 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c2e82",
      "summary": "Unusually large glowing sphere travels across the sky.",
      "city": "salem",
      "shape": "sphere",
      "date": "2014-09-10T00:00:00",
      "story": "Unusually large glowing sphere travels across the sky. I was laying in my backyard stargazing when I saw this unusually big glowing sphere appear in the sky, it hovered for a moment before dimming slightly and then brightening again. It then made its way off in a different direction, dimming and glowing as it went until I lost sight of it behind some trees. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/113/S113365.html",
      "state": "OR",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c2f5f",
      "summary": "Parallel red and white stationary lights.",
      "city": "salem",
      "shape": "formation",
      "date": "2014-08-22T00:00:00",
      "story": "Parallel red and white stationary lights. Red and white lights sitting parallel and completely stationary in hole in the clouds over route 93.",
      "link": "http://www.nuforc.org/webreports/112/S112598.html",
      "state": "NH",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c3054",
      "summary": "3 small balls of light coming from different directions dissapeared into a dark spot in the sky. They were not satellites.",
      "city": "salem",
      "shape": "light",
      "date": "2014-08-29T00:00:00",
      "story": "3 small balls of light coming from different directions dissapeared into a dark spot in the sky. They were not satellites. While going for a walk on Wheeler dam off of north main street in Salem.  My friend and I were looking at the stars when we stay 2 balls of light just above the atmosphere flying from the direction of Arlington pond.   At first I thought the balls of light could have been a couple satellites.  Which is very common to see at night when star gazing. Both object disappeared once they reached a certain point in the sky.   Suddenly as both balls of light disappeared we noticed a 3rd light approaching from the Haverhill Ma direction.  This ball of light disappeared when it reached the same location in the sky.  All the objects reached the same point in the sky within about 10-15 seconds of each other.  As we stood in disbelief we noticed that the point in the sky where the objects disappeared seemed to black out other stars.  We noticed a circler type black spot in the sky.  Then we noticed the dark spot slowly fade out revealing the stars behind it.   After the whole incident ended we noticed a very unusually amount of small engine aircraft in the area.  Just small planes,  No helicopters.  We counted 5 planes total.  Which is also unusual for this particular area. (3) balls of light and (1) dark circle in the sky that blocked out stars. for a total of what I would consider to be (4) objects.",
      "link": "http://www.nuforc.org/webreports/113/S113017.html",
      "state": "NH",
      "duration": "40 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c3331",
      "summary": "Red flashing light over downtown salem oregon, then hovers over bush park.",
      "city": "salem",
      "shape": "circle",
      "date": "2015-03-13T00:00:00",
      "story": "red flashing light over downtown salem oregon, then hovers over bush park. This was in the middle of downtown Salem.  I can't be the only one.   I was at Mission Mill Museum, taking trash out the back. It flew right over me, semi big, no sound, primarily redish orange.  It was pulsing white and red.  It was low enough where the building would have blocked it out if I was standing on the other side.  Flew quickly (faster than an airplane) over 12th St. and Willamette University soccer field.  Then stopped 5 blocks further over Bush Park area and just hovered for about 2 mins.   I grabbed the only person around (an older laidy) she agreed it was hovering and looked abnormal.  It stayed for about 2 mins.  Moved further slowly, then blinked in and out a few times, the disappeared, like someone turned off the light switch.   I took a video.",
      "link": "http://www.nuforc.org/webreports/117/S117646.html",
      "state": "OR",
      "duration": "4 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c3415",
      "summary": "10 orange orbs 1/2-1 mile above on Morningside Dr SE/13th Street SE Salem, OR 9:00 pm - 9:07pm in a file, banked to right, slow vanish",
      "city": "salem",
      "shape": "fireball",
      "date": "2015-03-26T00:00:00",
      "story": "10 orange orbs 1/2-1 mile above on Morningside Dr SE/13th Street SE Salem, OR 9:00 pm - 9:07pm in a file, banked to right, slow vanish I went to the top of a street 1313 Morningside Dr SE, Salem, OR, 97302, and as I  turned right onto a short drive called 13th Street SE going towards Hillendale, I pulled over to observe an orange illuminated orb about 1/2 - mile in slow movement, over the trees coming from the west to east in a straight line.  It was incredibly close.   Then it took a right angle turn going south just about in front of me and began to get dimmer and dimmer with the glow turning more into embers or slight flares and then I could see its outline continuing southward and upward but without light of any kind, just fading into the night sky, but could see the outline for many seconds, without the orange, and the outline did not appear to be round, like the orb was.  Then this exact thing happened again, and again, and again, up to 10 times.  The 3rd one seemed to try to catch up to the 2 in front and sped up a bit, it also seemed larger, and it slightly veered further straight before it took its right angle turn.  Each one had the basic same protocols.  I could not see where they came from because they would come over a tree top to the west of this small tiny street about the size of 3 houses.  In all it was 7 minutes.  I waited about 10 minutes to see if any more came, and none did.  One seemed to stop a short while, or slowed way down before it banked right.   I am not technical, I have an old fashioned cell, and I don't know how to take pics.  Now I should learn.  And did not have your ph # with me, but now I will.",
      "link": "http://www.nuforc.org/webreports/117/S117954.html",
      "state": "OR",
      "duration": "7 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c3684",
      "summary": "((HOAX??))  I was driving to home and talking with my wife by phone and I see a triangle with bright lights in front of me.",
      "city": "salem",
      "shape": "triangle",
      "date": "2015-02-12T00:00:00",
      "story": "I was driving to home and talking with my wife by phone and I see a triangle with bright lights in front of me.. like few miles on the sky.  For about 1 minute...  omg.",
      "link": "http://www.nuforc.org/webreports/117/S117218.html",
      "state": "VA",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c3750",
      "summary": "3 orange lights over Salem, Utah.",
      "city": "salem",
      "shape": "light",
      "date": "2015-01-07T00:00:00",
      "story": "3 orange lights over Salem Utah I was outside using my snow thrower, when I observed 3 orange lights traveling south, then abruptly they turned east in unison, they were under the clouds.   At my location we are approx. 6500 ft, the cloud cover was below the mountain tops of approx 8500-9000 feet.  They were traveling at a very slow speed, appeared to be coming from elk ridge/Payson area.   They reach about and 85 degree angle when all three climbed above the clouds as if to clear mountains.  I had shut off my machine, and there was no sounds.   As they were almost overhead they were the same glowing orange light, but had grow large in size.  There were no navigational lights as required by FAA regulations, and no bright landing lights, only a glow that showed equally not directional.",
      "link": "http://www.nuforc.org/webreports/116/S116194.html",
      "state": "UT",
      "duration": "5-10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c394f",
      "summary": "There was only one very large BRIGHT yellowish light traveling from sw to nw.  It was going WA6 faster than any known obj..",
      "city": "salem",
      "shape": "light",
      "date": "2014-12-22T00:00:00",
      "story": "There was only one very large BRIGHT yellowish light travelling from southwest to northwest.  It was going WAY faster than any known aircraft.  It ended up joining a foggy mist and disappeared in the cloud. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/116/S116091.html",
      "state": "OR",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c3a97",
      "summary": "Light High.",
      "city": "salem",
      "shape": "light",
      "date": "2015-08-06T00:00:00",
      "story": "Light High I observed a single light, very high in the sky, without any blinking lights.  It was traveling north from south. The speed was faster than a jet but not as fast as the ISS.   While viewing it, still it disappeared while I still had a clear view of it.  It did not \"blink out\"-simply just disappeared. No regular aircraft travel this route or follow any flight plans such as this.  I did observe a small aircraft traveling west to east just after my sighting.",
      "link": "http://www.nuforc.org/webreports/120/S120773.html",
      "state": "NH",
      "duration": "15 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c3bfc",
      "summary": "A loud humming/whistling object with bright lights flew over my home.",
      "city": "salem",
      "shape": "unknown",
      "date": "2015-07-31T00:00:00",
      "story": "A loud humming/whistling object with bright lights flew over my home. I live by the town woods, which are near my bedroom window.  I was awoken by a loud humming/whistling noise that sounded like a sweeper truck or something.   As I went to look out the window it got really loud and there was a bright light that was with the object.  It was either a large object or a small one that went directly over my home because it was very noisy.   My dog was going nuts.   It didn't sound like a plane, but as I said was a loud humming, whistling noise.  Maybe military exercise? ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/120/S120715.html",
      "state": "NH",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c3d21",
      "summary": "UFO sighted in Salem, OR, over park at around height of airplanes and is white and shiny with translucent halo blinks out & comes back.",
      "city": "salem",
      "shape": "circle",
      "date": "2015-07-17T00:00:00",
      "story": "UFO sighted in Salem, OR, over park at around height of airplanes and is white and shiny with translucent halo blinks out & comes back. My two young daughters and I were at Clark Creek park in Salem, Oregon, 07/14/15 at around 5:10 pm.  The sky was clear and blue with a few clouds and it was a warm nice day.   I looked up near the southeastern part of the sky and noticed a stationary white object that was round, and had a sort of white or metallic look to it.  It might have very slowly moved while we observed it, but I can't be sure.   I had my Canon camera with me at the park, so I started to film it, and it was hard to keep it steady because my kid started crying, as most toddlers do when the stroller stops moving.   My 5 year old was talking about it as we have talked about ufos in the past and she was very interested in it.   It disappeared right before our eyes after only being there for a few short minutes, and we continued walking in the park picking berries.  I looked up again to see and it showed up again in around the same area of the sky.  It sort of had a translucent halo around it that was very! hard to see but I noticed it nonetheless.   It disappeared again and we were pretty excited.   A regular big white airplane showed up and flew past the area we had sighted the ufo, maybe the same height in the sky as well, and according to the size of the plane I'll guess that ufo was maybe half the size of the plane and a much brighter shiny white color.  I have witnessed and filmed some other objects before, and my husband and I are very interested ufo researchers.  He has college background I have graduated high school and we're intelligent and read a lot.  This type of sighting only has me feeling they will be back again.  I have submitted a report to MUFON and uploaded the video I shot today as well.",
      "link": "http://www.nuforc.org/webreports/120/S120399.html",
      "state": "OR",
      "duration": "4 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c3efc",
      "summary": "06/10/2015, Salem, Oregon, Flash, 2-3 minutes at the most, bright flashes in the sky, 06/10/2015",
      "city": "salem",
      "shape": "flash",
      "date": "2015-06-15T00:00:00",
      "story": "06/10/2015, Salem, Oregon, Flash, 2-3 minutes at the most, bright flashes in the sky, 06/10/2015 I saw a bright flash to the North.  I called my son out to see it and within a minute we saw another bright flash, it had moved quite far in that time, and was seen in the northeast sky.  Within 10 seconds another bright flash which would make one to believe it was heading in a northeast direction, again, a great distance from the previous flash.  After that we didn't see it anymore. These are large flashes of light and I have been seeing them for a number of years now and I have never seen anyone reporting in them.  The bright flash does not always stay \"on course\", I've seen many nights that it wifi start in the north, appear next to the east, then back to the northwest. Also, based on the timing of the flashes, this light is moving much faster than an airplane or satellite, or the space station.  In fact, I've seen the light on nights when the space station is not flying over our state. I marked 1-3 crafts due to the fact of distance moved between each flash.  Maybe I'm not seeing one flash flashing 3 times but maybe 3 flashes slashing 1time.  (Does that make sense?\"",
      "link": "http://www.nuforc.org/webreports/119/S119482.html",
      "state": "OR",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c3f5b",
      "summary": "Weird glowing cylinder far away & multiple jets followed 5 minutes later.",
      "city": "salem",
      "shape": "cigar",
      "date": "2015-06-05T00:00:00",
      "story": "Weird glowing cylinder far away & multiple jets followed 5 minutes later. Saw weird cylinder glowing thing far away thought it was her at first but took a video and when I REWATCHED it clearly moved backwards then forwards",
      "link": "http://www.nuforc.org/webreports/119/S119226.html",
      "state": "OR",
      "duration": "40 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c406a",
      "summary": "Light in the sky.",
      "city": "salem",
      "shape": "light",
      "date": "2015-05-22T00:00:00",
      "story": "Light in the sky. I saw a bright flash in the sky that was not lightning, had a circular shape and lasted about a second, and was somewhat brighter than lightning with a blueish-white color to it.  Seen AS SOON as I walked to my window. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/119/S119045.html",
      "state": "VA",
      "duration": "1 second"
    },
    {
      "_id": "64d005f478aba2ec5a3c410c",
      "summary": "Sighting on Lake Harding in East Alabama.",
      "city": "salem",
      "shape": "unknown",
      "date": "2015-05-13T00:00:00",
      "story": "Sighting on Lake Harding in East Alabama Lake Harding (located on the Alabama/Georgia State line in East-Central Alabama) I walked out on my front porch.  I observed an odd light and watched to see what it was.  It became obvious it was NOT an airplane.  The light(s) color was a red-orange and appeared to be multiple lights.  There was no flashing, or green, light as exhibited in an airplane.  I walked back to the door and told my husband I was looking at something that didn’t look like an airplane.   I returned to my original position and still observed the odd lights.  I walked off my porch into the yard and it changed direction to the west.  It had originally been approaching from a south-southwest direction.  As I walked off my front porch, the lights became very small and vanished in an instant. Background:  I worked in the local District Attorney’s Office for 32 years before retiring.   After taking a year off, I decided to use my real estate license, obtained in 2008, and have been working as a Realtor® for the past 4 years.  I have been a Board Member on the Opelika Chamber of Commerce as well as the National Association for Justice Information Systems.  I have lived on Lake Harding, a tributary of the Chattahoochee River, for 16 years.   My husband indicated, after I explained what I saw, that he has seen similar activity in the past. I want them to come back so I can talk to them!",
      "link": "http://www.nuforc.org/webreports/118/S118893.html",
      "state": "AL",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c42f5",
      "summary": "Large silver orb moving through space with a smaller flashing cigar shape following behind it",
      "city": "salem",
      "shape": "circle",
      "date": "2015-04-17T00:00:00",
      "story": "large silver orb moving through space with a smaller flashing cigar shape following behind it Out using telescope with daughter and saw a large silver orb moving through space with a smaller flashing cigar shape following miles behind it.  They were perfectly distance apart, the one in the front was big and glowing steadily and the one following was smaller, cigar shaped and slowly flashing brighter to dimmer.  Watched them until they disappeared into the darkness. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/118/S118481.html",
      "state": "OR",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c4320",
      "summary": "Object came in like a shooting star at a angle from east to west.  A yellow orbe came out of the flash at end of streak.",
      "city": "salem",
      "shape": "changing",
      "date": "2015-11-19T00:00:00",
      "story": "Object came in like a shooting star at a angle from east to west.   A yellow orbe came out of the flash at end of streak. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/124/S124055.html",
      "state": "OR",
      "duration": "2-3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c4442",
      "summary": "Something huge just fell towards Earth.",
      "city": "salem",
      "shape": "fireball",
      "date": "2015-10-29T00:00:00",
      "story": "Something huge just fell towards Earth. I was sitting outside on my back porch.  I caught a light out of the corner of my eye.  It was huge.  I thought it was a shooting star.  But it was huge, and got closer to earth than anything I've seen before of that nature.  And it wasn't as fast like I have seen them before.   It was bright pale yellow at first then turned a light blue as it got closer to the ground, it had a smoke trail behind it.  I thought it would have burned up but it didn't and I could continue to see it until it was out of sight and behind the trees in my line of vision.   I've never seen anything like it.  I'm actually scared right now.  It lit up the sky and I thought I was going to feel it hit.  But I felt nothing.  I'm shaking right now.  I've never seen anything like it before.",
      "link": "http://www.nuforc.org/webreports/123/S123010.html",
      "state": "OR",
      "duration": "1 second"
    },
    {
      "_id": "64d005f478aba2ec5a3c446d",
      "summary": "UFO and strange energy phenomena.",
      "city": "salem",
      "shape": "",
      "date": "2015-11-19T00:00:00",
      "story": "ufo and strange energy phenomena I have posted a previous sighting on your website and have read all of the numerous sightings in the southern New Hampshire area.  Most have seen the type of shiny object in the sky (even during the daytime as I did report).  We cannot help but to be very aware of strange energy occurrences happening also in the area.  This is a problem especially in the evenings.  It would be nice to know if there are any ufo special stste or scientists that study strange energy changes in the area.  Sometimes things that are supposed to be \"normal\" in society in a small town add up to things that just are not making clear and logical sense.  Angry energy or anger enticing energy seems to be apparent along with a sense of aloofness.  Hope this makes some sense to those of you that study strange phenomena. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/123/S123884.html",
      "state": "NH",
      "duration": "30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c463c",
      "summary": "A green, saucer-shaped, object flew right in front of us on highway.",
      "city": "salem",
      "shape": "disk",
      "date": "2015-11-06T00:00:00",
      "story": "A green saucer shaped object flew right in front of us on highway. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/123/S123286.html",
      "state": "NH",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c47cc",
      "summary": "4 identical reddish orange orbs moving silently NE to SW across the sky before slowly disappearing.",
      "city": "salem",
      "shape": "fireball",
      "date": "2015-11-26T00:00:00",
      "story": "4 identical reddish orange orbs moving silently NE to SW across the sky before slowly disappearing. I was walking the dog and noticed one reddish orange orb moving at a steady pace, but not fast.  At first it appeared to be a plane on fire; however it continued to travel across the sky going northeast to southwest. There were no flashing lights or tail, which may indicate a plane or meteor. As It moved across the sky it appeared as if it were a Chinese lantern but it was too big for that and higher in the sky, yet lower than a jet that was also flying in the area. Because I was walking the dog, and wanted a witness, I started to jog home to alert my wife and son.  Before I reached the house it had slowly disappeared.  By the time I got to the driveway there were three more following the same path. My son came outside and we observed them as they flew by.  They seemed close enough that we should have been able to hear engine noise, but they were completely silent. Each object slowly disappeared into the night sky.  It took ~45 seconds to 1 minute for each object to cross the sky from the northeast and disappear while travelling in a southwesterly direction. ((NUFORC Note:  Witness provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/124/S124372.html",
      "state": "OR",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c49b0",
      "summary": "Two balls of light moving fast West to East in Salem, Oregon.",
      "city": "salem",
      "shape": "light",
      "date": "2015-09-17T00:00:00",
      "story": "Two balls of light moving fast West to East in Salem, Oregon. My two friends and I were in our backyard on the patio around 7:30 PM. It was pretty much daylight. We were chatting when I noticed what I can only describe as a ball of light traveling West to East (I was facing South). The object did not have a clearly defined outline--no hard edges.  It was a bright luminous mass and while I would describe it as round in shape it did not appear perfectly round or disc-like.  It was moving quickly, was completely silent and moved in a straight line. We tracked the object as it moved in and out of sight behind trees.  It was not high in the sky. Just about the time we lost sight of the object, another one appeared.  It looked like the other one and moved along the same path. Again, we tracked it until it moved out of view.  It was not shaped like a plane and none of us had ever seen anything similar moving in the way these objects did.  One might describe this as having the characteristics of a comet. It gave the impression of a gaseous ball of light, in that it did not appear solid exactly.  And while you could not see through the object, it had a translucent character.  It had soft edges and a glow or aura.  Shortly after this event we did see several planes in the sky, which only reinforced how very unique the previous objects were.",
      "link": "http://www.nuforc.org/webreports/121/S121983.html",
      "state": "OR",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c49d6",
      "summary": "Circular shape with 3 colors in downtown Salem, NH.",
      "city": "salem",
      "shape": "circle",
      "date": "2015-10-09T00:00:00",
      "story": "Circular shape with 3 colors in downtown salem nh Right above 28/97 intersection of Salem NH.  Where the Dunks, car shop and bank is. A circular shape with 3 colors.  Left side green, middle is yellow and right side is red.",
      "link": "http://www.nuforc.org/webreports/122/S122560.html",
      "state": "NH",
      "duration": "few minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c4b12",
      "summary": "10-12 red/orange large glowing globe moving slowly from the mountain range across the sky then stopped moving forward changing dir..",
      "city": "salem",
      "shape": "circle",
      "date": "2015-08-27T00:00:00",
      "story": "10-12 red/orange large glowing globe moving slowly from the mountain range across the sky then stopped moving forward changing direction to the left slowly and disappearing seconds later.  20 minutes after three smaller glowing globes appeared to rise from the ground remaining about 5 minutes and disappeared in order of arrival one at a time from the lowest to the highest in seconds.   No sound was heard and the light/globes were well below the cloud line between the ground and just above the Poor Mountain range.",
      "link": "http://www.nuforc.org/webreports/121/S121385.html",
      "state": "VA",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c4b8b",
      "summary": "Sighting while watching the eclipse.",
      "city": "salem",
      "shape": "triangle",
      "date": "2015-09-29T00:00:00",
      "story": "Sighting while watching the eclipse. I was outside the university watching the blood moon/super moon.  There were over 50 students present watching the moon.  It was still in the process of being covered since it was only about 10 pm.  I am a loner so I went to watch it alone on one of the benches meanwhile everyone else was sitting around 150 feet from me. There were 2 girls sitting on the other bench near mine to my left.  Everyone was preoccupied in their chatter and I was cold and bored with nothing much to do so I kept looking around.  The moon was to the right and so were the big crowd of students.  However when I looked to the left a very large aircraft went by.  I couldn't believe what I was seeing since I have lived near the airport for 18 years and am very aware how aircrafts look and could easily identify them at night.  This was different though since it was triangular in shape and upon closer inspection it was made of a black metallic object.  I thought I may be overexagerating which is why I I spoke up and asked the girl next to me if she thought the plane looked odd. I pointed the plane out to her and she agreed that it was in fact unlike anything she has seen before. I had my IPad in hand since I was taking pictures of the moon and quickly took pictures of the object. At the same time I was focusing on the sound it was sort of whizzing but it made no sense because there was no way you could hear an airplane in Salem.  It was a hard sound to make out because of the loud chatter and laughing of the students.  It was going too fast my camera couldn't focus so I tried to do the best I could go get one picture that could at least make out the light formation that I was seeing.  Although I could see the plane in decent detail my camera only picked up five lights in a triangular formation.  The sort of formation that birds use when migrating.  I could only get two pictures in poor quality because of how quickly it had happened.  I presume no one else saw it since there was no one freaking out like me or the girl next to me.  Eve yone was occupied looking the other way towards the moon.",
      "link": "http://www.nuforc.org/webreports/122/S122382.html",
      "state": "MA",
      "duration": "15 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c4bd9",
      "summary": "Saw triangle shaped purple green and red UFO on interstate heading from Salem to Luka.",
      "city": "salem",
      "shape": "triangle",
      "date": "2015-09-25T00:00:00",
      "story": "Saw triangle shaped purple green and red UFO on interstate heading from Salem to Luka. Was heading down the interstate from Salem to Luka and saw what I thought was a purple star in the distance.   I pointed it out to my friend and we realized we were getting closer to it.  It wasn't a plane, it wasn't moving at all.  We passed it a little to the left and we saw it had flashing red green and purple lights. Don't know what it was but it wasn't moving at all.",
      "link": "http://www.nuforc.org/webreports/122/S122068.html",
      "state": "IL",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c4c6b",
      "summary": "I was walking down the street in West Salem  Or. and it was completely black outside. The sky was cloudy and full of trails. Two balls",
      "city": "salem",
      "shape": "circle",
      "date": "2015-09-25T00:00:00",
      "story": "I was walking down the street in West Salem, OR, and it was completely black outside.  The sky was cloudy and full of trails.   Two balls of light appeared  suddenly from the South and traveling North.  They were a distance apart, but simultaniously on the same path and appearing to be going the same speed.   Suddenly, one ball appeared to speed up and merge with the second ball and it became brighter and then they quickly separated never leaving the path.  Immediately after the separation, one vanished and the other faded out.   These lights were very bright like a star, but too low to be a star and WAY too fast to be an aircraft.   Dogs were barking in the neighborhood I can only assume it was from the strange sight, but I couldn't say for sure. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/122/S122236.html",
      "state": "OR",
      "duration": "~10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c4d49",
      "summary": "Sighting over downtown Salem, Oregon.",
      "city": "salem",
      "shape": "diamond",
      "date": "2015-08-27T00:00:00",
      "story": "Sighting over downtown Salem Oregon While driving East over the Center Street Bridge I looked up over the skyline of downtown and saw the craft in the sky.  It was flat and square with silver and black.  It was high enough up above the buildings that it was alone in the sky.   At first I thought it was a small plane but it didn’t have wings.  It was shaped more like a personal drone but upon closer inspection it would have had to be HUGE to be so far away.  It was traveling too fast to be a plane or jet, at an angle that would be impossible.   I watched it for a few seconds trying to figure out what it was, then I blinked and it was gone.  It was too high up in the sky to go behind a building or a tree and if it had fallen, I would have seen it.  This is my first sighting.",
      "link": "http://www.nuforc.org/webreports/121/S121293.html",
      "state": "OR",
      "duration": "~30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c4dec",
      "summary": "Round white object in southern NH sky, moved very rapidly and severely, and was visible despite foggy conditions.",
      "city": "salem",
      "shape": "circle",
      "date": "2015-08-27T00:00:00",
      "story": "Round white object in southern NH sky, moved very rapidly and severely, and was visible despite foggy conditions. I was sitting in my car in the parking lot of a Red Roof Inn.  Despite the fog and low cloud deck, a bright white circular object zigzagged very quickly in the sky, just northwest of me.   The circle would stop, then a minute or two later resume for several minutes.   I cannot be positive of the exact beginning and ending time, but I am very sure that nothing man-made could produce a similar viewing.  The object moved very quickly and erratically, unlike a light of sort, and too severely to have been a drone. If there was a solid object, it was completely surrounded by the round white ball of light. ((ADDENDUM FROM SOURCE OF REPORT)) Hi Peter; I may have erroneously hit RI as the state---- this sighting was in Salem, NH.  I'm sorry I didn't have my phone with me to take some video. Thanks, ((name deleted)) ((END ADDENDUM))",
      "link": "http://www.nuforc.org/webreports/121/S121452.html",
      "state": "NH",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c4e82",
      "summary": "Silent, explosive lights traveling away from Salem.",
      "city": "salem",
      "shape": "flash",
      "date": "2015-08-13T00:00:00",
      "story": "Silent, explosive lights traveling away from Salem. In bed next to girlfriend and woke up because thirsty.  Southwest of the city, flashes/explosive lights filling the sky.   No sounds, just silent, near blinding lights.  Duration was ~1.5s every 2-4 minutes.   As I type, it is continuing to move on a westward trajectory toward the coastal hills.   When closest to this location, streetlights, fans and AC units would dim when flashes occurred.",
      "link": "http://www.nuforc.org/webreports/121/S121057.html",
      "state": "OR",
      "duration": "30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c5013",
      "summary": "Bright ball of light over Salem, NH; 2 witnesses.",
      "city": "salem",
      "shape": "light",
      "date": "2016-02-26T00:00:00",
      "story": "Bright ball of light over Salem, NH; 2 witnesses. I was walking up my driveway whilst taking up the trash barrels with my friend and we witnessed an extremely bright ball of light suddenly flying southwest over my home in Salem.  We both stopped dead in our tracks and I scrambled for my cellphone to take video.   Typically if I see a plane or a satellite, I don't bother even looking for more than a moment as they are very common in my area.  However once what i thought to be a satellite at first slowed down then stopped I had to take a closer look.  Just as i began recording the video the object starting moving as if it never stopped.   There were several small aircraft in the night sky and they're were on their normal flight paths.  It was clear and there were many stars.  Just as the main object started to fade in the distance the object which was just a brilliant white ball of light disappeared over methuen ma just a few miles in the distance but not before a smaller and less luminous object appeared directly above me and my friend.   This object flew quickly over head and was heading south of Salem.  I've seen simular objects before mostly satellites, however these objects were not characteristic of a satellite or high altitude aircraft.  I've been an observer for 18 years and wouldn't report anything that i felt was typical.   After the second object appeared it faded off into the distance.  I checked this site to see if anyone else had any sightings in New Hampshire and they did.  Not exactly  the same as what i saw but ufos have a funny way of changing their appearance.  So their sighting may or may not be related to mine.  Here is a link to the video taken that evening.  I hope it helps: https://youtu.be/g_eCM9OErdo ((NUFORC Note:  We have looked at the video, and it shows a white speck of light, moving around the Moon, in the night sky.  We are not convinced that it is an authentic UFO.  PD))",
      "link": "http://www.nuforc.org/webreports/125/S125954.html",
      "state": "NH",
      "duration": "4 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c51e1",
      "summary": "I was waiting too watch fireworks on new years and watching from my yard I saw three spears of lights dancing around the top of the mou",
      "city": "salem",
      "shape": "sphere",
      "date": "2016-01-05T00:00:00",
      "story": "I was waiting too watch fireworks on New Year's, and watching from my yard, I saw three spears (sic.  Spheres) of lights dancing around the top of the mountain.  This went on for ten minutes, and then the fireworks stated going off  and the spears went straight up in the air and went over the mountain.   When I reported the incident, I saw others who lived in Elk Ridge also reported seeing the same incident. ((NUFORC Note:  We have spoken with the witness, in order to confirm the time and date of the sighting, which was New Year's Eve in December 2014.  Witness had a second, and similar, sighting on December 31st, 2015.  PD))",
      "link": "http://www.nuforc.org/webreports/125/S125074.html",
      "state": "UT",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c521c",
      "summary": "White oval object, hovering very smooth.",
      "city": "salem",
      "shape": "oval",
      "date": "2016-01-29T00:00:00",
      "story": "White oval object hovering very smooth I noticed from my work window a white object..  It was oval/egg shaped moving very smooth at a decent speed coming from the north, then changing to a southeast direction near Reed Rd SE.   It was in a steady pace, very smooth motion, never going up or down or erractic.  Very calm like,  watched it till it disappeared past clouds into the distance. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/125/S125446.html",
      "state": "OR",
      "duration": "~4 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c522c",
      "summary": "Massive square shaped lights forming 2 lines in the sky over Hatch, NM.",
      "city": "salem",
      "shape": "rectangle",
      "date": "2016-01-29T00:00:00",
      "story": "Massive square shaped lights forming 2 lines in the sky over Hatch, NM. I was facing the horizon above the freeway connecting Garfield to Hatch from a hill in Salem.  The sky was clear but very dark, when gigantic squares (probably 4 to a row) lit up very bright yellow or white light and formed two rows.  I have never seen anything this large in this sky in my life.   The lights lasted about 5 minutes, and then faded out.  It was too obscured to see what shape they were when the lights went out, but you could see that the object was still in the sky.   Also, when the lights went dark you could see a helicopter with dim lights fleeing from the object at great speed. ((NUFORC Note:  We have requested more, and more detailed, information from the witness.  We will include it here, if and when it arrives.",
      "link": "http://www.nuforc.org/webreports/125/S125494.html",
      "state": "NM",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c5332",
      "summary": "Christmas was just over, I stepped out to smoke in the cold, I focused on a bright star that seemed to b flickering, I lost contact.",
      "city": "salem",
      "shape": "changing",
      "date": "2016-01-05T00:00:00",
      "story": "Christmas was just over, i stepped out to smoke in the cold, i focused on a bright star that seemed to b flickering, i lost a contact lens, so i thought it wuz juz a blurry glare.  Then i noticed that it had moved a good length.   So i closed my blurry eye n this object kept moving n displaying an incredible light show.  It wuz so peaceful...  It appeared to throw off glitter like or pixie like dust to the shape it took n it would slowly dim off b4 doin it over n over...  Amazing...  I called my gf to come out n see it, so i know i wuznt the only one seeing it.  Then it slowly took itz time getting higher n further away til it wuz not visible... ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/125/S125047.html",
      "state": "OR",
      "duration": "30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c53cc",
      "summary": "I was driving home from work and I saw 3 orange lights coming from the south west moving slowly, I stopped the car next to a food store",
      "city": "salem",
      "shape": "sphere",
      "date": "2016-01-05T00:00:00",
      "story": "I was driving home from work and I saw 3 orange lights coming from the south west moving slowly, I stopped the car next to a food store to get a better look.   When I got out I saw two orange red spears (sic.  spheres) next too each other, with a bigger spear behind.  One of the spears went completely sideways, then back went back.  By this time crafts got over my head right over my head the lights shrunk and the two crafts disappear.  The third craft comes to the same spot and it disappears also but this time I see a black shadow of of the craft move off, then I lost sight off it. Then I look back too the southwest and in the same formation three more craft are coming.  They came the same flight plan and formation, and lights went out at the same spot.   Two police saw also which came to see what was doing and saw the last craft disappear all lasting 8 minutes. ((NUFORC Note:  We spoke via telephone with the witness, and he sounded to us to be sincere and sober-minded.  He confirms the date was New Year's Eve, and we have corrected the date.  Witness submitted a second report for a similar sighting in Salem, UT, on the evening of December 31st, 2014.  PD))",
      "link": "http://www.nuforc.org/webreports/125/S125076.html",
      "state": "UT",
      "duration": "6 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c5649",
      "summary": "Green sphere obsereved in southwest virginia",
      "city": "salem",
      "shape": "sphere",
      "date": "2016-07-15T00:00:00",
      "story": "Green sphere obsereved in southwest virginia I was walking my dogs and started watching the end of a fireworks display when I noticed a green sphere off in the northeastern sky far from where the display was going on.  Put the dogs away and just watched the sphere from my pouch through a set of power lines.   The green object changed altitudes several times as viewed through the power lines then turned to a glowing red and sped off the northwest.  It reappeared after a few minutes to the previous position and turned back to a green color where it stayed for a while.   After the display was over the object turned red and shot straight up in the sky.   I need to mention the weather, which was solid low cloud cover with no stars visible and thunder storm clouds with some variable amounts of sheet lighting.",
      "link": "http://www.nuforc.org/webreports/128/S128384.html",
      "state": "VA",
      "duration": "1 hour"
    },
    {
      "_id": "64d005f478aba2ec5a3c56ac",
      "summary": "Saw a red/orange ball of light slowly pass overhead. I know it had nothing to do with fireworks. I did not see any solid shape, just an",
      "city": "salem",
      "shape": "light",
      "date": "2016-07-08T00:00:00",
      "story": "Saw a red/orange ball of light slowly pass overhead. I know it had nothing to do with fireworks. I did not see any solid shape, just an red/orange ball of light.  I thought it was a headlight of a plane but it was too big. It was about how high a plane is in the sky. I have not told anyone.  I don't want to get teased, but I know it was odd.",
      "link": "http://www.nuforc.org/webreports/128/S128308.html",
      "state": "NH",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c5b76",
      "summary": "As me and my fianse were sitting outside smoking we saw multiple amber and white colored lights appear and then dim out w/n 2-5sec in t",
      "city": "salem",
      "shape": "other",
      "date": "2016-04-15T00:00:00",
      "story": "As me and my fianse were sitting outside smoking we saw multiple amber and white colored lights appear and then dim out w/n 2-5 sec in the Eastern Night sky in the constellation of Ursa Major toward the South.  Any info on this would be great. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/126/S126789.html",
      "state": "OR",
      "duration": "90 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c5bae",
      "summary": "While observing the moon tonight at about 9:20 pm PST my daughter said, \"Look, I saw a flash in the sky over there three times.\"",
      "city": "salem",
      "shape": "flash",
      "date": "2016-04-15T00:00:00",
      "story": "While observing the moon tonight at about 9:20 pm PST my daughter said, \"Look, I saw a flash in the sky over there three times.\" While observing the moon tonight at about 9:20 pm PST my daughter said, \"Look, I saw a flash in the sky over there three times.\"  I looked where she was pointing, low in the western sky, and then I also saw a bright white \"Flash.\"   She then said it was moving.   As we both watched it would randomly flare at intermittent intervals with random duration and intensity.  It climbed to South of overhead and continued to a point South of Jupiter before it was no longer seen by us.  We observed this for 5-6 minutes.  It was bright white in color and would flare intensely and then the next flare may be dim.   The duration of each flare was also random in its length of duration.  It moved through the sky slower than most satellites.",
      "link": "http://www.nuforc.org/webreports/126/S126794.html",
      "state": "OR",
      "duration": "6 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c5cb5",
      "summary": "Approx. noon of this day in October. I was relaxing on my car and just la",
      "city": "salem",
      "shape": "disk",
      "date": "2016-12-05T00:00:00",
      "story": "Sunday October eight nineteen hundred and seventy-eight approximately noon of this day in October.  I was relaxing on my car and just laying on the hood with my back against the windshield. As i was lying there with my face looking upwards to the beautiful blue sky.  i noticed a metal object falling from the sky. There was three other people with me. And I told them to look at that thing falling from the sky.  They couldn't see it. So i made them lay on the car where i was located, and pointed there head to the object. then I told them to keep looking straight up till you see what i see.  They found the object too.  At that time it appeared the object stop in its falling.  And hovered there for a long time.  Eventually all four of us was watching this object flash on and off.  The three of them sat there for over four hours total. Then all of a sudden, all three of them started moving northwards I was located in Salem, New Hampshire, at that time.  They started moving very slowly and started to go faster, and then short into space very quickly. I couldn't stop looking up for the rest of the day.  Then i notice from the Southeast another object coming but this one was totally lite up.  It went to the same place the other three object where sitting for three to four hours. Sat there for less then a minute.  Then it headed off in the same flight path the other three went. this one must of hit its boosters because it took off very fast and was out of sight in one second heading north. Then a fifth object came from the west to the same location. and did the same as the forth. sat there for a few minutes and blasted off towards the north in the same direction. it went so fast i could only see its burners as it moved northwards… ((name deleted)) ((NUFORC Note:  Source of report indicates that the date of the incident is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/131/S131598.html",
      "state": "NH",
      "duration": "5 hours"
    },
    {
      "_id": "64d005f478aba2ec5a3c5cd3",
      "summary": "We witnessed a cluster of blue lights blinking randomly and moving around sporadically for 3 minutes, then disappeared.",
      "city": "salem",
      "shape": "other",
      "date": "2016-12-05T00:00:00",
      "story": "11-14-16 Monday/late evening in search of the &quot;Supermoon&quot; 2 people were driving down Hwy22 towards Stayton, OR. We witnesse 11-14-16 Monday/late evening in search of the \"Supermoon\" 2 people were driving down Hwy 22 towards Stayton, Or. We witnessed a cluster of blue lights blinking randomly and moving around sporadically for 3 minutes, then disappeared. ((NUFORC Note:  Witness provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/131/S131315.html",
      "state": "OR",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c624a",
      "summary": "3 yellow-ish/orange orbs that looked like oblong chunks plucked out of the sun, were seen moving across the Salem, OR, sky.",
      "city": "salem",
      "shape": "",
      "date": "2016-09-15T00:00:00",
      "story": "3 yellow-ish/orange orbs that looked like oblong chunks plucked out of the sun, were seen moving across the Salem, OR, sky. With great shock and amazement, four of us watched a single bright-orange, oblong-like orb, soar very quickly and silently, in the (West) Salem, OR, sky at 10 pm on 9/9/16!   After we lost sight of it, we turned to see two more of the same, but much more closely, and clearly, as it was only about 50 ft. higher than the tree tops that were directly in front of our eyes.   These strange oblong orbs had no tail, looked like they were made up from a chunk plucked out of the sun and moved consistently and steadily while making no sound whatsoever!  It was freaky-amazing!  What the heck were these?!!",
      "link": "http://www.nuforc.org/webreports/129/S129836.html",
      "state": "OR",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c6263",
      "summary": "Quiet comet like fireball with a long trail across the skyline at a downward angle fast moving went behind the trees lost sight",
      "city": "salem",
      "shape": "fireball",
      "date": "2016-09-09T00:00:00",
      "story": "a quiet comet like fireball with a long trail across the skyline at a downward angle fast moving went behind the trees lost sight ((NUFORC Note:  Anonymous source; no contact information.  We have changed the time above, to reflect a nighttime sighting, but we have no way to confirm.  PD))",
      "link": "http://www.nuforc.org/webreports/129/S129668.html",
      "state": "OR",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c645f",
      "summary": "Two times, I  saw four red balls of fire that were just above rooftops.",
      "city": "salem",
      "shape": "fireball",
      "date": "2016-08-02T00:00:00",
      "story": "Two times on Carpenter St. in Salem (different years, but between Oak St and Chestnut St), I  saw four red balls of fire that were just above the rooftops of the two buildings.   They appeared over, then they burned out before they reached the ground.   The sightings were on diagonal corners.  One sighting was over the house where Catholic sisters lived. ((NUFORC Note:  One of two reports from same witness for past dates.  Please see other posted report for Salem, NJ, for June 30, 1988 (date approximate; time unknown).  PD))",
      "link": "http://www.nuforc.org/webreports/128/S128884.html",
      "state": "NJ",
      "duration": "20 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c6460",
      "summary": "Me and my girlfriend was leaving Whispering Waters apartments when we saw a large green fireball moving North to South while facing Ken",
      "city": "salem",
      "shape": "fireball",
      "date": "2016-08-02T00:00:00",
      "story": "Me and my girlfriend was leaving Whispering Waters apartments, when we saw a large green fireball moving North to South while facing Kent Street.   It disappeared due south over the horizon.   I waited for it to fall and explode but it never did. ((NUFORC Note:  One of two reports from same witness for past dates.  Please see other posted report for Salem, NJ, for June 30, 1975.  PD))",
      "link": "http://www.nuforc.org/webreports/128/S128875.html",
      "state": "NJ",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c69ce",
      "summary": "White flashing explosion.",
      "city": "salem",
      "shape": "flash",
      "date": "2017-03-17T00:00:00",
      "story": "White flashing explosion I live in Veneta, Oregon.  I looked up at the sky facing north at 21:41 and about 50 miles north, I saw a large white light, then it flashes three times then exploded and light up the sky bright white ......that was all ....there was 4 planes in the area that might have saw it also",
      "link": "http://www.nuforc.org/webreports/133/S133151.html",
      "state": "OR",
      "duration": "3 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c6d99",
      "summary": "Bright spark slowly cruising around the moon",
      "city": "salem",
      "shape": "other",
      "date": "2016-12-15T00:00:00",
      "story": "Bright spark slowly cruising around the moon, seemed to disappear around the back after glimmering a few different colors.   Definitely not a star or earth born vehicle, garbage or satellite because it changed trajectory and speed. ((NUFORC Note:  We have attempted to contact the source of the report, but have been unsuccessful in doing so.  PD))",
      "link": "http://www.nuforc.org/webreports/131/S131747.html",
      "state": "OR",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c6dc8",
      "summary": "Three saucer shaped ships.  High in the sky, metallic but no shine.  Rather dull gray.  They hovered overhead in a V formation.",
      "city": "salem",
      "shape": "disk",
      "date": "",
      "story": "Three saucer shaped ships.  High in the sky, metallic but no shine.  Rather dull gray.  They hovered overhead in a V formation and from time to time seemed to dip down and they had a bubble shaped top. ((NUFORC Note:  Witness indicates that the date above is approximate.  PD)",
      "link": "http://www.nuforc.org/webreports/135/S135871.html",
      "state": "OR",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c6fd4",
      "summary": "Saw a a light start glowing bright blue then suddenly vanish.",
      "city": "salem",
      "shape": "light",
      "date": "2017-08-17T00:00:00",
      "story": "Saw a a light start glowing bright blue then suddenly vanish.",
      "link": "http://www.nuforc.org/webreports/135/S135715.html",
      "state": "MA",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c730f",
      "summary": "Blue spherical in West Salem, OR.  ((NUFORC Note:  The blue-green object appears to us to be a lens flare.  PD))",
      "city": "salem",
      "shape": "circle",
      "date": "2017-06-15T00:00:00",
      "story": "Blue spherical in West Salem I was taking pictures for my mother in law to compare the dark clouds over her house to the clear sky at my house as we only live a few miles apart, but we live at a higher elevation so our weather is completely different.  So I quickly snapped the pictures and sent them then I reviewed the pictures later and noticed the object. The object is a blue spherical shape that appears just above the trees.   I am sending two images that show the clouds behind the object moving but the object stays stationary.  As I looked at the picture closer and zoomed in the object appears to have texture of some sort. ((NUFORC Note:  The blue-green object appears to us to be a lens flare.  PD))",
      "link": "http://www.nuforc.org/webreports/134/S134542.html",
      "state": "OR",
      "duration": "?"
    },
    {
      "_id": "64d005f478aba2ec5a3c75ea",
      "summary": "Lights seen over Salem, Oregon same week as object witnessed in skies over Independence, Oregon.",
      "city": "salem",
      "shape": "circle",
      "date": "2018-01-12T00:00:00",
      "story": "Lights seen over Salem, Oregon same week as object witnessed in skies over Independence, Oregon! 15 Dec. 2017 6:48pm. On this date and time, this investigator spoke with the witness (who is also a relative of mine)  This was in regards to a sighting of strange lights seen from his father's back yard in the area of East Salem, cross streets 45th and State Street on Wednesday 6 Dec. 2017. (witness says it may have been the day before, Tuesday 5 Dec. 2017). How this sighting came to the attention of this investigator, I had posted a photo only with no details of a sighting that took place in Independence, Oregon on my Facebook.  My cousin contacted me through a post that he had seen the same object as he was looking west of Salem the same week of the Independence incident. Witness was out with his dog in the back yard, looked up at about 60-70 degrees off the horizon to the west, saw an object with multiple lights (yellowish at some point) stationary- then seemed to be rotating.  Square lights could be seen, 7 of them in a row, a perfect line. Witness said if he held out this thumb, object was larger than the end of his thumb.  Distant estimated 1/2 to 1 mile west of his location. Witness stated the object was hovering, lights rotating then it blinked out.  It is this investigator's belief that this witness may have seen the same object and lights that were seen by 2 or more witnesses in the Independence/Buena Vista area of Polk County.  Witness sent a drawing of what he saw.  From the drawing showing the 'square' lights/windows it is consistant with the previous report and sighting in Independence, Or.  (See drawing) ((NUFORC Note:  We express our sincere gratitude to Mr. Ron Wright, a skilled and experienced UFO investigator in Sprague River, Oregon, for preparing this report, and submitting it to our Center.  We encourage anyone who has information about this case, or any other case in Southern Oregon, to contact Mr. Wright, using the following contact information:  P. O. Box 2 Sprague River, OR 97639; (971) 237-7828; rw@lonewolfslodge.biz.  PD))",
      "link": "http://www.nuforc.org/webreports/138/S138012.html",
      "state": "OR",
      "duration": "10"
    },
    {
      "_id": "64d005f478aba2ec5a3c7a4a",
      "summary": "Swarm of bees sound.",
      "city": "salem",
      "shape": "unknown",
      "date": "2017-11-22T00:00:00",
      "story": "swarm of bees sound I heard a buzzing sound like a swarm of bees and was looking up into the sky.  I caught a glimpse of the craft moving sideways and tail lights that were red and aqua blue set into the craft just like an automobile.  It was heading west and disappeared into the clouds.",
      "link": "http://www.nuforc.org/webreports/137/S137351.html",
      "state": "OR",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c7aa1",
      "summary": "Break away size-shifting balls of light dance around trees.",
      "city": "salem",
      "shape": "fireball",
      "date": "2017-11-22T00:00:00",
      "story": "Break away size-shifting balls of light dance around trees. What first appeared as two orange/amber street lights, two objects started to increase in height up to about 50 ft pulsating in brightness and changing in shape from what appeared to be similar to softball size all the way up to 6 foot in diameter.  They we're dancing around a tree like neurons or protons do so around a nucleus of an atom.  Movements didn't appear to follow wind patterns, there was no sound and appeared to move with intelligence changing direction and speed gracefully and swiftly.  They increased speed very rapidly heading North towards Portland at the same time as they dimmed down and disappeared as fast as they showed.",
      "link": "http://www.nuforc.org/webreports/137/S137332.html",
      "state": "OR",
      "duration": "90 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c7aee",
      "summary": "3 UFO’s. Triangular, silent , 6 lights and fast.  ((NUFORC Note:  Report submitted by aviation mechanic.  PD))",
      "city": "salem",
      "shape": "triangle",
      "date": "2017-11-03T00:00:00",
      "story": "3 UFO’s. Triangular, silent , 6 lights and fast. I saw 2 unusual bright lights in the sky.  As i was studying the lights a 3rd craft flew directly into my direction and over my car at a super low altitude.  I did not hear a sound and it had 6 super bright lights however it did not light the ground below it.  It was SUPER fast , I repeat, this craft made no sound.  At this point i lost sight of the original 2 craft on the horizon.   I am an aircraft mechanic.  I know of NO type of silent aircraft.  I also am located on Logans approach, so I see a lot of traffic but not from the south heading north.",
      "link": "http://www.nuforc.org/webreports/137/S137048.html",
      "state": "MA",
      "duration": "00:04"
    },
    {
      "_id": "64d005f478aba2ec5a3c7b20",
      "summary": "I noticed this bright blue light the lit up the sky.  Seconds right after it happens again.  ((anonymous report))",
      "city": "salem",
      "shape": "light",
      "date": "2017-11-09T00:00:00",
      "story": "I was leaving from the Rockingham Mall in Salem NH to head back to MA.  So I took the highway back home.  As soon I start merging to the highway, I noticed this bright blue light the lit up the sky.  Seconds right after it happens again.  I’ve seen this happen multiple time from the same direction and it always happened when it’s dark and cloudy.   I’ve passed by during the day, but you can’t see nothing that will light up the sky blue. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/137/S137150.html",
      "state": "NH",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c7b99",
      "summary": "I was on break from work when i noticed a brite light up sky. It was just below the cloud line. It was so  brite it could not figure ou",
      "city": "salem",
      "shape": "triangle",
      "date": "2017-11-03T00:00:00",
      "story": "I was on break from work when i noticed a brite light up sky. It was just below the cloud line. It was so  brite it could not figure out what it was.  It was just hovering and then it moved what seemed about a few mile in just a few second.  It was in the shape of a triangle ..I dont know what it was ...  But i Do know it was not a helicopter or a airplane..  It was very huge it did not make any sound..",
      "link": "http://www.nuforc.org/webreports/137/S137088.html",
      "state": "NH",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c7cd4",
      "summary": "Was standing in the driveway looked up and to the right noticed a red strobing light flashing from left to right.  ((anonymous report))",
      "city": "salem",
      "shape": "disk",
      "date": "2017-09-28T00:00:00",
      "story": "Was standing in the driveway looked up and to the right noticed a red strobing light flashing from left to right.  Looked like three red lights tightly formed in the front of object then a red light flashing from top to bottom.  Object was incoming to my location, then stopped and hovered for several minutes.   Took out cellphone and began recording object for over 40min.  Took still photos as well.  Object then proceeded to move off away from my vicinity but stopped to hover again.  I walked up the road to get a clearer view away from the tree lin and the object proceeded to loiter around the area for a long time.  It would move left to right then come closer to me never getting as close as I would have liked.   All lights on this object were red and moved in irregular patterns sometimes the horizontal lights would go then the vertical would flash.  I do not believe this object was a standard aircraft as it made no sound.  And I do not believe it was a drone because of ! lengh of time of observation and battery kimitations on drone vehicles.  I went to retrieve a neighbor to witness as well but on returning the object had left.  I had a similar sighting about 8 years ago from much further away in the early am and on that occasion 2 F-16's gave chase. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/136/S136390.html",
      "state": "VA",
      "duration": "40 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c7d33",
      "summary": "Object was bright white and round in shape seemed to come down from somewhere all lite up from the SW then slowed.",
      "city": "salem",
      "shape": "sphere",
      "date": "2017-09-14T00:00:00",
      "story": "Object was bright white and round in shape seemed to come down from somewhere all lite up from the SW then slowed and turned to the W and seemed to fly back up and then disappeared as it when back up?",
      "link": "http://www.nuforc.org/webreports/136/S136146.html",
      "state": "OR",
      "duration": "11 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c7d30",
      "summary": "Object was white and round shaped, seemed to change directions after it come out of the north then headed NW",
      "city": "salem",
      "shape": "circle",
      "date": "2017-09-14T00:00:00",
      "story": "Object was white and round shaped, seemed to change directions after it come out of the north then headed NW",
      "link": "http://www.nuforc.org/webreports/136/S136148.html",
      "state": "OR",
      "duration": "35 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c85b9",
      "summary": "The power just went out for about 1min. Then came back on. I went out side to investigate and instantly noticed a flashing in the sky.",
      "city": "salem",
      "shape": "triangle",
      "date": "2018-08-31T00:00:00",
      "story": "The power just went out for about 1min.  Then came back on.  I went out side to investigate and instantly noticed a flashing in the sky.  It was a couple flashes then spread out to 3 flashing lights into a triangle.  Then flashed a couple times then spun in a full circle.  Then they came to a small faint triangle flashing then repeated that pattern over and over.  A few times when it spun in a circle it went in opposite direction and had 5 lights.  The event happened in the NW direction.",
      "link": "http://www.nuforc.org/webreports/142/S142895.html",
      "state": "OR",
      "duration": "1 hour"
    },
    {
      "_id": "64d005f478aba2ec5a3c8a32",
      "summary": "Extremely bright object changes color & shoots into sky.",
      "city": "salem",
      "shape": "light",
      "date": "2019-09-12T00:00:00",
      "story": "Extremely bright object changes color & shoots into sky. I was washing my father's Jeep, he recently had a stroke & asked me to clean it for him, we ran to the car wash.. This was a bit before 8:00pm.  After finishing washing the Jeep, my partner & I drove out behind NAL (business in town) to drive down the road & dry off the majority of the water.  I stopped the Jeep before the end of the road, under a streetlight, to get out & finishing drying it off with a towel. When I was almost done I noticed a VERY bright object up in the sky (circular but bright), towards the east.  At first, I figured it was an airplane or helicopter but the object was moving in too many directions for an aircraft(bobbing up & down, but moving left to right far too quickly for a plane).  I yelled for my partner to look & when he got out of the Jeep he said it was probably a drone, but I’ve never seen a drone with a hazy orb around it.  We couldn’t tell if the bright object  was very far away or somewhat close.  As I told my partner to go get his phone, to take a video  it became I creasingly brighter, & the color changed from a bright white to what almost resembled fire.  The object seemed to shoot off in a matter of seconds to the North & left a small faint trail of yellow light behind where it originally shot off.  We heard the noise of cars on Main Street & the Jeeps engine running.  There was no loud boom, like a jet breaking the sound barrier. I have never believed in aliens visiting Earth (UFOs), and to be honest, I still don’t know what we saw.  After witnessing whatever this was we were both were confused & just laughed about it.  My partners bestfriend is married to a police officer, so we called to see if he was on duty, he was, & to see if anyone else had reported this weird light in the sky.  He thought we were joking & after we explained what happened he told us that it was probably an airplane headed back to the airport or something from Scott Airforce Base.   Again I don’t know what we saw, but I know it wasn’t a drone or airplane.  Maybe it’s something else & you’re sites employees can answer what it was?  We are both scientifically minded, educated adults with good careers & don’t want people thinking we are crazy, but we have gone from confused to almost scared by what we witnessed.  We just want an answer. Ps.  We didn’t know there was a hotline until coming home & researching what happened & finding your site.",
      "link": "http://www.nuforc.org/webreports/148/S148712.html",
      "state": "IL",
      "duration": "30-45 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c8f63",
      "summary": "Two disk saucer crafts witness account Salem, Oregon.",
      "city": "salem",
      "shape": "disk",
      "date": "2018-11-24T00:00:00",
      "story": "Two disk saucer crafts witness account Salem, Oregon. Round disk craft witness account 11-10-2018  Saturday 6:35pm Salem, Oregon.  I am writing this witness account the same evening the event took place.  It is fresh in my mind.  The evening was cold  at  49 degrees and it was a waxing crescent moon large in the sky with no clouds to block the views, I could see the stars very well…and Mars also I believe.  I look to my right while driving on Kuebler Ave., heading south, and I saw a silver (dark silver) disk hovering to my right over some large trees in the distance, about a quarter of a mile from me. The saucer type craft  was spinning while hovering mid air.  There were I believe 8 lights around the outside of the disk; red, green and white.  Lights also on the bottom which were white.  I was approaching Battle Creek  Rd. and it started to go straight up then head off towards Fairview Ave. where a lot of businesses and manufacturing plants are located.  I decided to follow it, so I turned right on Battle Creek Rd. I lost sight of it for about 30 seconds then it reappeared.  I pulled to the side of the road and took a few pictures and a video.  The craft made no sound at all.  It would dip down low like it was landing, then I would look far away only to see it back up and further than I would think it could make it in just a few seconds. I felt as if I was playing a game of cat and mouse with it for 10 or so more minutes before  thinking about heading home, my two daughters are in the car with me and I needed to get them home.  It was strange there seemed to be no other cars around just us and this UFO.  I then noticed a second disk shaped hovering craft, identical to the one I saw at first, and it was hovering over a large business.  It was truly an awesome sight.   I was able to get several pictures and a couple short videos before leaving which I will email to you.",
      "link": "http://www.nuforc.org/webreports/143/S143712.html",
      "state": "OR",
      "duration": "10-12 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c8fef",
      "summary": "Object flying S no noise no wings of any sort cylindrical shape approx 80 ft long",
      "city": "salem",
      "shape": "cylinder",
      "date": "2018-11-24T00:00:00",
      "story": "Object flying south no noise no wings of any sort cylindrical shape approx 80 ft long. Flew by approx 2000 ft off ground no noise moving in northern Salem, NH, heading south No wings or noise object was approx 80 ft length and 20 ft dia..",
      "link": "http://www.nuforc.org/webreports/143/S143861.html",
      "state": "NH",
      "duration": "Fly by"
    },
    {
      "_id": "64d005f478aba2ec5a3c90ef",
      "summary": "Several Balls of light Observed of Salem Ma",
      "city": "salem",
      "shape": "formation",
      "date": "2019-12-01T00:00:00",
      "story": "Several Balls of light Observed of Salem Ma I was located on the roof deck bar of the Salem hotel.  I arrived there approximately at 21:15 hrs with my wife and a friend.  Upon settling in at the bar and waiting for our first order of drinks of the night.  I noticed 5 lights off in the distance.  They were rounding a telecommunications tower off in the distance.  At first I thought it might have been aircraft lining up going towards Logan international airport, but after observing them for sometime the lights were just hanging there not moving, and after several mins they began to move.  I asked several people there that night if that was a normal occurrence.  The two bar tenders and waiting staff replied no, it was the first time they had ever seen something like that.  The lights began to move off in another direction and towards the ground were they were not visible anymore.  If this was a flight pattern for landing air craft there should have been more coming in intervals, but have after these lights were g! one there were no more lights that came.  From my vantage point I believe the lights were near Swampscott, Ma, and the Salem, Ma. Roughly seven mins after being there I took a picture of these lights, and then they began to move, but they were going very slow, not like an ordinary planes flight path that should have looked quicker even at the distance that I was at.  This stuck with me and I wanted to check and see if there were any other reports of these lights and I came across your website. I have seen many things, I am month away from my contract ending with the military and I am Staff Sergeant I’m the Army.  I am aware of the way aircraft work and act during observation Wether fixed wing or rotary.  I also should mention there were no visible indication lights, the normal red-green blinking lights, nor were there any landing lights. What I am describing can be viewed on any aircraft.  These lights did not fit that description.  They looked like white balls of lights.",
      "link": "http://www.nuforc.org/webreports/149/S149830.html",
      "state": "MA",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c92e2",
      "summary": "Lights above Salem Oregon.",
      "city": "salem",
      "shape": "light",
      "date": "2019-12-01T00:00:00",
      "story": "Lights above Salem Oregon. Looked to be one craft that was bluish white and leaving a light trail as it moved back and forth erratically then up and down. Didn’t seem to have a pattern to its movements but kept in the general same area and bobbed all over. Lasted quite a while and was still there when I went to the bedroom. Got up an hour later and it was gone.",
      "link": "http://www.nuforc.org/webreports/150/S150165.html",
      "state": "OR",
      "duration": "30 minutes or more."
    }
  ]
}