{
  "city": "saltlake",
  "fetch_timestamp": "2025-07-12T14:36:39.207574",
  "record_count": 5,
  "pages_fetched": 0,
  "api_calls": 1,
  "source": "ufo_aficionado_api",
  "records": [
    {
      "_id": "64d005f478aba2ec5a3b55d1",
      "summary": "Bright stationary/slow moving star in daylight",
      "city": "saltlake",
      "shape": "light",
      "date": "2008-06-12T00:00:00",
      "story": "Bright stationary/slow moving star in daylight It was a nice sunny day, no clouds in the sky. My husband, my self, son, and his friend and my female neighbor were out in our backyard enjoying the sunshine. We saw some birds fly by in the sky. I noticed way high up there was a bright star, not moving. I said guys what is that? It was 3pm in the afternoon, blue sky why is there a star? My husband went in an got our 2 set's of binoculars, and gave one to me. It was slowly and I mean slowly moving northwest. We watched it for about 15 minutes, all 5 of us! I got a closeup of it, and it was a bright round white light. When it was out of site, my son's friend noticed another one about 15 minutes later, north again, same size but this one was flashing. We were surprised. It was like it was flashing on and off for us. It was the size of a bright star. We live in the path of the airport and watched the planes fly all day. These were no planes, and the bright lights were really, really high up. The flashing one we saw headed slowly northwest until we couldn't see it anymore. We all knew we saw something strange. ((NUFORC Note:  Witness elects to remain totally anonymous;  provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/062/S62889.html",
      "state": "UT",
      "duration": "15 Minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3be0b1",
      "summary": "Bright orange lights hovering in the sky.  ((NUFORC Note:  Possible sightings of stars??  PD))",
      "city": "saltlake",
      "shape": "light",
      "date": "2012-11-19T00:00:00",
      "story": "Bright orange lights hovering in the sky. I noticed a bright orange light in the sky.  There was a slight cloud cover, but I could still see this orange light.  I was not sure what it was so I watched it for a while.  It appeared that another light and up to 2 more lights appeared and stayed together in the same area.  They appear like a star but I have never seen stars or planets that are in this area that are orange.   I work night shifts so I am awake at night.  These lights are still there.  I can distinctly see two of them.  They are not moving.  They appear to just be sitting in the same spot. I wondered if it was a reflection of some sort but I don't know of what. It almost has the color of fire in the sky. They appear to be definate points of light, like a star, but I have seen up to three of them, then it goes down to two or one. Right now I can see two. I will keep watching to see if I can figure out what this is. ((NUFORC Note:  Possible sightings of stars??  PD))",
      "link": "http://www.nuforc.org/webreports/094/S94553.html",
      "state": "UT",
      "duration": "90 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c474c",
      "summary": "6+ lights in very large formation descend into the Salt Lake City Valley",
      "city": "saltlake",
      "shape": "light",
      "date": "2015-11-26T00:00:00",
      "story": "6+ lights in very large formation descend into the Salt Lake City Valley. From the west benches, we saw 6 lights high above the Salt Lake Valley in a large formation, moving north from at least 5400 S.  They were all slowly descending, and when we made it home, we were able to watch the last two land into the city lights and disappear.  One near the Salt Lake International Airport and the other in South Salt Lake.  Were they helicopters?  Drones?  I can't find any information about them.",
      "link": "http://www.nuforc.org/webreports/124/S124345.html",
      "state": "UT",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c6e69",
      "summary": "5 to six lights in the ski over north east mountains. Put my hand in the air and used whatever unexplained thing I can do since I was a",
      "city": "saltlake",
      "shape": "",
      "date": "2017-09-05T00:00:00",
      "story": "5 to six lights in the ski over north east mountains.  Put my hand in the air and used whatever unexplained thing I can do since I was a child...and the lights seemed to go behind some kind of a mist and disappeared.",
      "link": "http://www.nuforc.org/webreports/135/S135936.html",
      "state": "UT",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c7d21",
      "summary": "Cluster of unsual lights as u see in video they approched then dissaperd shot up in yellow id say snowmobile size ((anonymous report))",
      "city": "saltlake",
      "shape": "circle",
      "date": "2017-09-21T00:00:00",
      "story": "saw cluster of unsual lights  as u see in video they approched then dissaperd shot up in yellow id say snowmobile size yellow dots !whhen object saw me it went dark # listen ive worked for nasa  studied niburu at univerisities  and ufos are common this shit is wild ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/136/S136259.html",
      "state": "UT",
      "duration": "10 minutes"
    }
  ]
}