{
  "city": "sanantonio",
  "fetch_timestamp": "2025-07-12T14:18:12.317423",
  "record_count": 170,
  "pages_fetched": 8,
  "api_calls": 9,
  "source": "ufo_aficionado_api",
  "records": [
    {
      "_id": "64d005f478aba2ec5a3b41d7",
      "summary": "Sometime in March, 1995, at 0630, facing west, l  saw a large fireball move very fast from south to north, changing colors as it moved",
      "city": "sanantonio",
      "shape": "fireball",
      "date": "2006-05-15T00:00:00",
      "story": "Sometime in March, 1995, at 0630, facing west, l  saw a large fireball move very fast from south to north, changing colors as it moved At 0630 sometime in March,'95 while waiting for a bus to take me to work, I saw a fireball zooming at great speed across the sky. It changed colors as it streaked across the horizon, going from south to north, parallel to the ground but seeimg to arc downward as it disappeared over the northern horizon.   I expected an implosion and braced myself but neither saw nor heard any evidence of ground impact.  There was no tail, no stream, and no noise as it moved across the sky. It wasn't far away and it wasn't high above.  And, it was large. Can't say how large. If it had been a meteor it would have made a tremendous expolsion.  Meteors do not, I believe, move parallel to the ground.  Later, at work, I fouind out that another person, a woman, an English as a Foreign Language instructor as myself, had also seen the fireball that same morning at the same time.  In fact, she and her teenage daughter had seen it as they drove to the girl's school. There were no reports of sightings either in the newspapers or TV news broadcasts. ((NUFORC Note:  Witness indicates that the date of the event is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/049/S49650.html",
      "state": "TX",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b425b",
      "summary": "First 7 then up to a dozen lights at very high altitude darting around.",
      "city": "sanantonio",
      "shape": "formation",
      "date": "2006-05-15T00:00:00",
      "story": "First 7 then up to a dozen lights at very high altitude darting around. My wife and I were on vacation visiting San Antonio, Texas staying at Holliday Inn on the \"River Walk\". We were on the roof of the building in the Hot Tub when another couple joined us who we did not know. We chatted a little with them and they were visiting from Witchita Kansas where the Male was employeed at Boeing (As an Engineer if my memory is correct). My wife asked \"What is that!\" and she was looking up and over at a 45+ degree angle (cannot remember direction E or W). The four of us looked up and saw 7 lights darting around eachother like fire flies in the sky. I did not have my glasses on at this point and I said it was probably sparkler fire works from one of the theme parks near by. The make of the other couple said \"No, that is not fireworks!\" and he, his wife and mine got out of the hot tub and watched the lights dance in the sky. I rushed over to the table and retreived my glasses and was shocked when I put them on. The number of lights had grown to about a dozen lights very very high in the sky. The lights looked as though they were forward pointing lights on individual craft and as they changed direction and the light pointed away the light would disappear to us and another would appear as it banked its turn and came back down. We watched in quiet awe for half an hour. We were interupted by a security guard that came out and told us the roof/pool/spa was now closed and we had to leave. I asked him \"What the hell is that?\" and he looked up and says he has no idea. We agreed that the lights were well above commercial flight altitude. The security guard was an older man who said he was retired military and he had never seen anything like it either. After a few minutes he made us leave the roof. My wife and I walked all around the building looking out windows trying to see the lights but the angle was wrong. We have talked for many years now about what we saw. I am curious if there are any other reports during that time frame in that location. ((name deleted)) Plano, Texas ((NUFORC Note:  Witness indicates that the date of the event is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/049/S49565.html",
      "state": "TX",
      "duration": "30 Minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b4325",
      "summary": "V-Shape, lighted craft seen in San Antonio just over tree line.",
      "city": "sanantonio",
      "shape": "triangle",
      "date": "2006-05-15T00:00:00",
      "story": "V-Shape, lighted craft seen in San Antonio just over tree line. First of all, let me say that my father and uncle, two very normal men claim to have been ubducted.  I am very skeptical, myself, but I cannot identify what my girlfriend and I saw that night.  Right above tree line was a v-shaped craft. At first only three lights shined on each point of the triangle. The lights were similar to those new, almost blue, lights you see on some cars (neons?). The craft was moving too slow to be a regular plane. It couldn't have been a helicopter. A few moments later, more lights came on. I didn't count exactly but I'd estimate a total of 7 lights at this point. The object speeded up a little and eventually moved out of sight.  It sounded like...? Wind? Like a very quite plane, but no engine sound.  Wish I had known to count and notice direction. I was in shock at the time. Wasn't really thinking about anything else except to watch it...  I have to note that there IS a military base nearby, so perhaps the object I saw was some new test plane? I have no idea. It was the weirdest thing I have ever seen. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/049/S49575.html",
      "state": "TX",
      "duration": "3 Minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b4380",
      "summary": "Triangular aircraft tumbling on it's side!",
      "city": "sanantonio",
      "shape": "triangle",
      "date": "2006-05-15T00:00:00",
      "story": "Triangular aircraft tumbling on it's side! I was driving down a street at night and saw lights ahead of me and to the right out of the corner of me eye. I saw what appeared to be a triangle on it's side at about a quarter mile ahead and just above the tree line. I could not see the triangle shape, but saw lights at each corner (three lights) that made up a form of a triangle. The lights were not blinking. I do not recall if there was a blinking light or not anywhere on the object. The aircraft appeared to be on it's side and appeared to be \"tumbling\" forward. It then leveled off and made a 90 degree turn. This aircraft was going very fast. This sighting took place about a mile from Kelly Air Force Base, Texas. I do not know what this aircraft was, but I do know three things: 1) I have never seen an aircraft tumble forward and then level off in this manner. 2) I have never seen an aircraft travel at the rate of speed it was traveling. 3) I know of no aircraft that can make a 90 degree turn at this rate of speed, although the B-2 Stealth Bomber comes close, but I know that it does not tumble on its side. I have been observing aircraft for a long time and have worked on different types of aircraft in my carrer. This was no regular aircraft!",
      "link": "http://www.nuforc.org/webreports/049/S49682.html",
      "state": "TX",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b4438",
      "summary": "Confirmed Blue Egg Lights San Antonio March 2000.",
      "city": "sanantonio",
      "shape": "circle",
      "date": "2019-08-23T00:00:00",
      "story": "Confirmed Blue Egg Lights San Antonio March 2000. I have been searching for information regarding an event that occurred to me around this same time period in the same city, and I found a report that describes almost the same thing on your site as a \"Blue Energy Egg\" (Occurred : 3/17/2000 04:00 (Entered as : 3/17/00 4:00am) Reported:  10/23/2000 23:31 Posted:  2/25/2003  Location:  San Antonio, TX  Shape:  Triangle  Duration:  2 minutes).  It was around this same time period that I was living in Twin Lakes Mobile Home Park, and I remember waking up and seeing the bedroom of the mobile home filled with a blue light that seemed to be coming from the SW(?)side of the mobile home.  With the blinds drawn it appeared in the bedroom window that a bright blue light circular in shape was being cast onto the window but illuminated the entire inside of the mobile home.  So it had a point of origin but appeared to be equally brilliant in the room...if that makes sense.  At the time, I was a Police Officer at Ft. Sam Houston, I had no idea why this woke me, there was no noise and my ex-wife did not wake up, I immediately got up and secured my pistol as my first thought was pranksters or somebody trying to do ill to me or my family. as soon as I secured my weapon I began to attempt to look through the blinds to see where the light was coming from and as I did this POOF...the light was gone.  I checked the other windows before heading outside, armed, to investigate.  When I went out on the rear deck, I heard and saw nothing.  No animal noises, like dogs barking, etc. that would indicate anything was wrong.  Very still and quiet.  I chalked it up to craziness and went back to bed.  Odd thing is, last few days I have had dreams about this incident that spurred me to look, and I found this here.  WOW.... ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/148/S148232.html",
      "state": "TX",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b458c",
      "summary": "Saw silver ball and rectangle fly from South to north over San Antonio Texas.",
      "city": "sanantonio",
      "shape": "",
      "date": "2019-08-23T00:00:00",
      "story": "Saw silver ball and rectangle fly from South to north over San Antonio, Texas. At 21:00 hours I sat on my front porch facing south.  After about 10 minutes 21:10, I noticed something moving in the sky at about 45 degrees in height directly south of my location moving to the North Northwest.  It took 15 seconds to move 90 degrees and remained at between 45 and 60 degrees in height. It looked like a silver ball with a black rectangle circling the silver ball.  It flew It moved on at same speed north northwest.",
      "link": "http://www.nuforc.org/webreports/147/S147873.html",
      "state": "TX",
      "duration": "25 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b4798",
      "summary": "In the south I saw some lighted objects that went on for about 3 sec. then nothing.",
      "city": "sanantonio",
      "shape": "circle",
      "date": "2019-07-25T00:00:00",
      "story": "In the south I saw some lighted objects that went on for about 3 seconds, then nothing. ((NUFORC Note:  Source elects to remain totally anonymous.  PD))",
      "link": "http://www.nuforc.org/webreports/020/S20937.html",
      "state": "TX",
      "duration": "30 sec."
    },
    {
      "_id": "64d005f478aba2ec5a3b47d8",
      "summary": "Have video of light moving erratically in the sky. A less bright light followed its motions. Phone died after getting good footage",
      "city": "sanantonio",
      "shape": "light",
      "date": "2019-08-23T00:00:00",
      "story": "Have video of light moving erratically in the sky.   A less bright light followed its motions.  Phone died after getting good footage.",
      "link": "http://www.nuforc.org/webreports/148/S148235.html",
      "state": "TX",
      "duration": "20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b4e6f",
      "summary": "I saw a bright round light.then the sky flashed red then yellow then green.  Power shut off many buisnesses.  ((anonymous report))",
      "city": "sanantonio",
      "shape": "",
      "date": "2019-04-08T00:00:00",
      "story": "I saw a bright round light.  then the sky flashed red then yellow then green.  And the power shut off to many buisnesses, even mcd's and apartment complexes in that area.   Went to check  it out.  No car accident in power poles.  No rain no lightning.  Just light drizzle. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/145/S145478.html",
      "state": "TX",
      "duration": "PM"
    },
    {
      "_id": "64d005f478aba2ec5a3b4ed3",
      "summary": "I saw a dark square shape floating over seaworld.. along with a silver light close by. Drove around the neighboorhood and took a pictur",
      "city": "sanantonio",
      "shape": "changing",
      "date": "2019-04-08T00:00:00",
      "story": "I saw a dark square shape floating over seaworld..  along with a silver light close by.  Drove around the neighboorhood and took a picture of it, but it had moving slowly away from seaworld.",
      "link": "http://www.nuforc.org/webreports/145/S145480.html",
      "state": "TX",
      "duration": "3 min"
    },
    {
      "_id": "64d005f478aba2ec5a3b4fa1",
      "summary": "Three red-orange lights in triangular formation hovering over apartments.",
      "city": "sanantonio",
      "shape": "triangle",
      "date": "2019-04-12T00:00:00",
      "story": "Three red-orange lights in triangular formation hovering over apartments. We pulled into the parking lot of our apartment complex, and started unloading the trunk.   My fiancé told me to turn around and look behind me in the sky.  I immediately put my bags down and just watched in awe.  Right above the tree line there were three giant red-orange glowing lights.  They never pulsated.  They were in a triangular shape.  It hovered there for a bit, then I realized I needed to record it.  By the time I got my phone out it had raised a little in the sky and seemed less big.  It still hovered, but also rotated slightly.  We watched as one by one each light eventually went out.  We agreed that the weirdest thing was never actually seeing a shape.  When the lights went out, there was literally nothing there.  It was night time, but we could still see the sky and clouds.  It was as if there was a craft that was invisible except for the lights.  Immediately after the ufo disappeared, two helicopters came from two different directions.  I went inside shortly afterward.  There was never any sound to the ufo.  I have clear video of the sighting.",
      "link": "http://www.nuforc.org/webreports/145/S145615.html",
      "state": "TX",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b4f8f",
      "summary": "((HOAX??))  Spinning rainbow colored lights.  ((anonymous report))",
      "city": "sanantonio",
      "shape": "circle",
      "date": "2019-04-12T00:00:00",
      "story": "Spinning rainbow colored lights Two space craft like circles, spinning.  Both have rainbow lights going in a circle, over and over. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/145/S145571.html",
      "state": "TX",
      "duration": "~1 hour"
    },
    {
      "_id": "64d005f478aba2ec5a3b522f",
      "summary": "We saw a UFO that night that was about 400 feet long that made no sound and had a beacon of light shining out of it like it was looking",
      "city": "sanantonio",
      "shape": "disk",
      "date": "2008-06-12T00:00:00",
      "story": "We saw a UFO that night that was about 400 feet long that made no sound and had a beacon of light shining out of it like it was looking It was about 2:00 AM in the morning I and my bother in law were fishing on some property I had near San Antonio Texas. I looked over to my right shoulder and there was a light on the ground. The pattern was about 10 feet wide. But there was not a shaft of light coming to the light on the ground. I look up and about 150 away from me in the tree line was a UFO just hovering above the tree tops. No sound emitting from it at all.  I told my brother in law and you believe that. We both looked at each other and kept fishing. We both are very well educated and have white collar jobs. We did not say anything to anyone in fear of losing our careers that we want to keep. So we made a pack not to tell anyone about this sighting. Until now we have not repeating to anyone what we saw. I just wanted someone to know what I saw. It was about 400 feet long and not a light on it. I could only see it by the light of the moon being behind it. I was there for about ten minutes and it took off. The craft went staight up and out of sight. Just wanted to tell my story to someone that might understand what we saw that night. Regards  ((name deleted)) ((NUFORC Note:  Witness indicates that date of incident is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/063/S63303.html",
      "state": "TX",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b5516",
      "summary": "Picture of UFO out the window of my plane on a trip to Las Vegas",
      "city": "sanantonio",
      "shape": "sphere",
      "date": "2007-10-08T00:00:00",
      "story": "Picture of UFO out the window of my plane on a trip to Las Vegas I was on a plane and I looked out the window and I took a picture of what looked like a silver ball flying with us, I just took the picture and saw it again recently and thought you would like to see it. After I took the picture, it was gone. ((NUFORC Note:  Date of the event may be approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/058/S58407.html",
      "state": "TX",
      "duration": "unknown"
    },
    {
      "_id": "64d005f478aba2ec5a3b575d",
      "summary": "Low flying craffts over the city with figures inside",
      "city": "sanantonio",
      "shape": "other",
      "date": "2008-03-04T00:00:00",
      "story": "Low flying craffts over the city with figures inside It was a little after midnight and I was outside grabbing something from my car. I looked up at the sky which I do every night to look for UFOs, because I always seem to see them in the sky at night. I saw two red hovering objects. These objects were hoving really really low and they were giving off a red glow. They were moving quickly toward the north while flying at the same speed and very close. It looked like figures inside these crafts. No sound at all! ((NUFORC Note:  Witness indicates that the date of the incident is approximate.  PD)) ((NUFORC Note:  Witness elects to remain totally anonymous;  provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/060/S60119.html",
      "state": "TX",
      "duration": "5 mintues"
    },
    {
      "_id": "64d005f478aba2ec5a3b57fb",
      "summary": "((HOAX??))  Flying object that looks like a Hawk or Eagle",
      "city": "sanantonio",
      "shape": "other",
      "date": "2008-03-04T00:00:00",
      "story": "Flying object that looks like a Hawk or Eagle I saw a hovering object in the softball field at work. It was around 2 AM and as I slowly walked closer to it I noticed it looked like a huge hawk or eagle that was as big as a man. It was hovering w/ it's wings closed. I heard a low mechanicle sound coming from it. I also heard some tones like you would hear on a computer or telephone. I picked up a rock and threw it at the object. I saw the rock deflect off of it and when the rock hit it, it sounded like it was hitting metal. The object spreaded it's wings in mid air, I briefly saw tiny green and red lights flash on it, and then it made a sound like a hawk or eagle as it began to fly towards the south. I would guess this thing was 5 to 6 ft in height, and had a 15 to 20 ft wing spand.  Afterwards I read this one story online that a college kid from Colorado went to Mexico with a couple of his classmates that were from that country. They were hiking near the US-Mexico border outside of Texas in the late 1990s. They were resting between two hills behind some large trees near an isolated road. A military type vehicle drove up and stopped. The college hikers were out of it's view about 30 yards away. Four men got out of the vehicle, three of them appeared to be Chinese and one a Mexican National. The three men that appeared to be Chinese seemed to be speaking in an oriental language.  About two minutes later the college hikers saw this huge bird fly up and landed 20 yards from the four men. They went and got the huge bird and carried it and placed it in the back of their vehicle, then drove away.  I thought this story might have some connection to what I witnessed in July 2006.  My guess is that this bird type object could be some sort of spying flying object that an Asian country such as China is conducting on the U.S.  I've heard of several large bird sightings in the Southwestern USA for years.  I just find all this to be interesting. ((NUFORC Note:  Witness indicates that the date of the incident is approximate.  PD)) ((NUFORC Note:  Witness elects to remain totally anonymous;  provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/061/S61649.html",
      "state": "TX",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b5881",
      "summary": "Three bright orbs of light over San Antonio suburb.",
      "city": "sanantonio",
      "shape": "light",
      "date": "2007-08-07T00:00:00",
      "story": "Three bright orbs of light over San Antonio suburb. AT 9:30 at night in a San Antonio suburb, myself and my two friends were outside talking when a bright star caught our eyes. Then we noticed that this unusually bright star was gradually moving upwards into the sky. We thought it was a comet, but it couldn’t be, it was moving upwards.  Then the light started to gain speed, and as it moved upward, this bright object broke up into three identical orbs of light, we tried to get a closer look but by that time the orbs had disappeared behind the trees.",
      "link": "http://www.nuforc.org/webreports/057/S57684.html",
      "state": "TX",
      "duration": "4 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b5b16",
      "summary": "((HOAX??))  abduction, but no success",
      "city": "sanantonio",
      "shape": "unknown",
      "date": "2008-03-04T00:00:00",
      "story": "abduction, but no success   I had an experience where I was almost abducted, but no success.  I was laying in bed and I awoke to my body being totally paralyzed.  I felt hands on my back which were holding me down and keeping me paralyzed.  I heard litte girls giggling and laughing, telling me to sleep and to relax.  I fought this with all my might. I finally got up and turned around and discovered someone with a hooded robe in my room.  the hooded robe was purple and the being had a beard. I heard a loud dong noise and then it disappeared! I was so scared and frightened to tears. I don't know what's going on in san antonio's westside neighboorhoods, but it needs to stop. ((NUFORC Note:  Possible hoax??  Witness elects to remain totally anonymous;  provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/060/S60301.html",
      "state": "TX",
      "duration": "30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b5b55",
      "summary": "TWO DISK SHAPED OBJECTS OVER SAN ANTONIO",
      "city": "sanantonio",
      "shape": "disk",
      "date": "2006-10-30T00:00:00",
      "story": "TWO DISK SHAPED OBJECTS OVER SAN ANTONIO STRANGE DISK SHAPED OBJECTS CAME ACROSS THE SKY FROM THE WEST SLOWLY CIRCLED AND HOVERED BITH OBJECTS SEEMED TO BE COMMUNICATING AND THEN ONE OF THE DISKS SHOT AWAY AT HIGH SPEED I REACHED FOR MY CAMERA AND WAS TOO SLOW I MISSD THE SHOT BUT I HOPE YOU WILL GET MORE REPORTS ON THIS ((NUFORC Note:  Witness elects to remain totally anonymous;  provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/051/S51591.html",
      "state": "TX",
      "duration": "5 mins"
    },
    {
      "_id": "64d005f478aba2ec5a3b5c39",
      "summary": "UFO sighting in San Antonio, Texas",
      "city": "sanantonio",
      "shape": "changing",
      "date": "2008-06-12T00:00:00",
      "story": "UFO sighting in San Antonio, Texas My grandparents and I were driving into San Antonio, Texas yesterday, just before noon, and I was taking pictures of the beautiful hill country from the car window, when I looked up in the sky towards the sun and saw this flat saucer-like object in the sky. I pointed it out to my grandmother, who was in the passenger seat at the time and she also saw it.  I managed to get one picture of it with my digital camera before it moved, it kept changing positions around the sun, it was first on the left, then above it, then underneath it. I took some more various photos but they are a bit blurry but still easy to see. About two minutes after I started taking photos of the object I spotted two round objects very close together in the sky, that were different colors. I also have a picture of them.  I also took one photo, and didn't see the object until I got home and enlarged the photo on my computer, it was a silver colored perfectly spherical object, in front of a cloud which was in front of the sun. I took about 10 photos total, and about 5 of them actually have the visible objects.  The whole sighting lasted only about 5 minutes total. It wasn't until I got home that I saw on the news that there was another sighting that evening in Texas, in Baytown. I thought that was eerie.  The pictures I have have not been altered, I have the exact originals on my computer and still on my camera as well, but I also have copies where I enlarged the objects and cropped them.",
      "link": "http://www.nuforc.org/webreports/062/S62845.html",
      "state": "TX",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b5d4a",
      "summary": "Green spec of light flys right over me",
      "city": "sanantonio",
      "shape": "unknown",
      "date": "2008-03-04T00:00:00",
      "story": "Green spec of light flys right over me   Green light came across and as it lowered to the ground it was so small and as it came closer I remember feeling so paralyzed and I automatically blacked out.  I Dont remember anything after, but just laying in bed. ((NUFORC Note:  Witness elects to remain totally anonymous;  provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/060/S60174.html",
      "state": "TX",
      "duration": "1 hour"
    },
    {
      "_id": "64d005f478aba2ec5a3b6447",
      "summary": "Two intense bright diamond shaped craft seen.",
      "city": "sanantonio",
      "shape": "chevron",
      "date": "2008-01-21T00:00:00",
      "story": "Two intense bright diamond shaped craft seen. I was outside waiting for AAA to arrive because I had a flat tire and I didn’t have any tools. I was with my brother talking about how it was a cloudy night and couldn’t see any stars. That’s when a very bright yellow light appeared. You could see this light pass through the clouds, that’s how powerful that light was. It was low in the horizon and just hovered in the sky. A couple minutes later a second bright yellow light appeared next to it about a football field length away. It wasn’t as bright as the first and it too hovered in place. After about 5 minutes of staring at it, they began to alternate in brightness. One would get dim and the other brighter. I had never seen anything like this before. After about 5 minutes of that, one of the lights began to move away in a southwest direction. It was slow moving but as it passed overhead the light disappeared. While this was happening the other light remained hovering in place. After the 1st light dimmed out the second light followed in the same direction and passed closer to us where I could make out the shape of the object. It was diamond shaped and had bright yellow lights on each corner. It too dimmed out and vanished. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/060/S60990.html",
      "state": "TX",
      "duration": "15 min."
    },
    {
      "_id": "64d005f478aba2ec5a3b6488",
      "summary": "blue fire ball shoots down from sky and stops in mid air",
      "city": "sanantonio",
      "shape": "fireball",
      "date": "2007-11-28T00:00:00",
      "story": "blue fire ball shoots down from sky and stops in mid air traveling south on  highway 16 when i noticed a blue ball of fire. I thought maybe it was a falling star so i turned to my girlfriend and right when i was getting ready to tell her to look it stopped in mid air for about a split second and then continued to fall. i began to yell \"look!!\" \"holy s**t\" there was a few cars in front of me that i knew also saw because we were all going about 20 mph in a 70 mph speed limit. after a few seconds we then saw a very very bright light shoot up straight to the sky. looked like a reverse thunder bolt ((NUFORC Note:  Witness elects to remain totally anonymous;  provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/059/S59460.html",
      "state": "TX",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3b652e",
      "summary": "red plasma ball of light with a helicopter in the vicinity.  ((NUFORC Note:  Possible contrail, illuminated by setting Sun??  PD))",
      "city": "sanantonio",
      "shape": "light",
      "date": "2007-06-12T00:00:00",
      "story": "red plasma ball of light with a helicopter in the vicinity The sun had just set over San Antonio and I was looking up at the nice orange sky when i noticed a  red plasma ball appear in the sky for a good 2 minutes.  It was flashing really bright and then it just disappeared.   I assume that the object had been hovering over the city for a while because shortly after there was a helicopter in the vicinity of the red plasma ball of light. ((NUFORC Note:  Witness elects to remain totally anonymous;  provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/056/S56916.html",
      "state": "TX",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b6596",
      "summary": "I left my condo for work, looked up into the sky saw the moon with clouds around it, just then I saw an round object yellow in color mo",
      "city": "sanantonio",
      "shape": "sphere",
      "date": "2008-06-12T00:00:00",
      "story": "I left my condo for work, looked up into the sky saw the moon with clouds around it, just then I saw an round object yellow in color moving fast from south to north, it happen in seconds, it was gone into the clouds before I knew it, it had no flashing lights, so I guess it wasnt an aircraft.",
      "link": "http://www.nuforc.org/webreports/063/S63546.html",
      "state": "TX",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b65ba",
      "summary": "((HOAX??))  Saw a 40 long by 12 ft tall saucer shoot up straight  up into  the air.",
      "city": "sanantonio",
      "shape": "disk",
      "date": "2008-02-14T00:00:00",
      "story": "Saw a 40 long by 12 ft tall saucer shoot up straight  up into  the air. This happened to my best friend ((name deleted)).   He told me the story today after playing golf.  He was in a two story house that was being built close to his  house in Northwest San Antonio,7:30 pm.  He was listening to his ipod and looked out  the second story window in a large backyard and  then he saw something.                               This was only for  a couple of seconds, as he looked down in the yard he saw a 40 ft round saucer shaped vehicle.  he said it looked like two pie plate one on top of each other.  It was twelve feet high with a platinum/silver color.        No  markings, as soon as he saw it it took off straight up into the air. His ipod no longer works. thank you  ((name deleted)) ((NUFORC Note:  Probable hoaxed report, we suspect.  PD))",
      "link": "http://www.nuforc.org/webreports/061/S61347.html",
      "state": "TX",
      "duration": "seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b668d",
      "summary": "Small dark objects over San Antonio, TX.",
      "city": "sanantonio",
      "shape": "changing",
      "date": "2006-10-30T00:00:00",
      "story": "Small dark objects over San Antonio, TX. My friend and I were driving south on San Pedro Ave. around 8:00 pm, when we noticed three triangular dark (black) shaped objects, along with a circular (ball shaped) object flying at low altitude in the middle of the city, about 2.5 miles south of the San Antonio Airport.  We both noticed them at the same time and tried to figure out what they could be.  We named every possible flying object and discounted every single thing that it could have been. We were facing south, and they were to the west of us flying south. They were at a distance of about 150 to 200 yards away. They slowed down and then hovered in one area for a few seconds then turned and faced west and started to fly west.  But when they turned, the triangular shaped objects became \"sliver like\" thin, except the ball shaped object, and continued on.   About the time when they were almost out of our view, we were surprised to see another strange triangular shaped object with something hanging from it, just beneath it.  We thought it might have been an \"ultralight\" singleman plane with someone sitting in the seat below the wing, but quickly dismissed due to the fact that it was beginning to become dark outside, and the fact that small air crafts like \"ultralights\" are not allowed in the city.  And we had just had a light rain storm in some areas of the city with lightning reported in other areas with no rain. Near my house the sky was green with no rain or lightning. (My house was about the same area where the objects would have been flying over.)  They also made no sound, and flew very slow and uniform. My friend and I are still very perplexed over what we both witnessed and wondered if anyone else saw the objects too.",
      "link": "http://www.nuforc.org/webreports/052/S52269.html",
      "state": "TX",
      "duration": "5 min."
    },
    {
      "_id": "64d005f478aba2ec5a3b68c8",
      "summary": "As I pulled out of a gas station, I saw a UFO hover over me.",
      "city": "sanantonio",
      "shape": "chevron",
      "date": "2007-11-28T00:00:00",
      "story": "As I pulled out of a gas station, I saw a UFO hover over me. I was pulling out of the gas station and turning on to the main road headed to work. I was adjusting my mirror when i glanced up & noticed 2 lights. Not the normal lights of an airplane that you would normally see that flash. These 2 Lights were not as bright either. The lights were circular and appeared to be on each ends of the chevron shape. Then in the middle i noticed a red light not as big as the other light I would say about half the size of the other light which appeared to be about the same size as the wing. For a minute i thought maybe it is a plane or maybe it's just a helicopter so i rolled the window down but no noise. Certainly if it was one the 2 aircrafts i would hear something. Then I noticed it was flying way too slow to be an airplane or helicopter. It almost seemed as it was hovering over but it was moving. I drove under it and lost sight then I looked in the mirror to see it because I was still coming to grasp with what I saw. But when I looked in the mirror I didn't see it. I thought maybe the angle I was at didn't allow me to see so I turned the car around, and to my suprise it was gone completely from the sky. I looked around to see maybe it just trailed off but i was gone.",
      "link": "http://www.nuforc.org/webreports/059/S59624.html",
      "state": "TX",
      "duration": "40-45seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b68fc",
      "summary": "green fireball over san antonio, texas",
      "city": "sanantonio",
      "shape": "fireball",
      "date": "2006-10-30T00:00:00",
      "story": "green fireball over san antonio, texas my wife and i were coming out of a sports bar, when out of the corner of my eye to the east i saw a green fireball coming down at an angle with a trail of smoke.the object quickly disappeared.that instance i told my wife look and she replied what was that? i replied,i dont' know but thats the second time i've seen that!",
      "link": "http://www.nuforc.org/webreports/052/S52310.html",
      "state": "TX",
      "duration": "2 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b6cac",
      "summary": "my brother and i wached 4 cigar shaped figures for about 20 min. ((NUFORC Note:  Student report.  PD))",
      "city": "sanantonio",
      "shape": "cigar",
      "date": "2006-07-16T00:00:00",
      "story": "my brother and i wached 4 cigar shaped figures for about 20 min. it was my birthday and my brother and myself were out side cleaning out an ice chest. as we were going back inside my brother saw a cigar shaped figure in the sky. he tapped me on the shoulder and said what is that i thaugt it was a plain. then all of a sudent it darted away, then came back with 3 more objects with it. they sat ther for about 20 min then shot off in the same direction leaving with a weird light around them. ((NUFORC Note:  Student report.  PD))",
      "link": "http://www.nuforc.org/webreports/051/S51042.html",
      "state": "TX",
      "duration": "30 min"
    },
    {
      "_id": "64d005f478aba2ec5a3b6f67",
      "summary": "Large fireball across the sky",
      "city": "sanantonio",
      "shape": "fireball",
      "date": "2008-01-21T00:00:00",
      "story": "Large fireball across the sky We saw a bright fireball going from north to south at a high altitude. The fireball was moving southwest visible for a long period. We took several pictures.",
      "link": "http://www.nuforc.org/webreports/060/S60735.html",
      "state": "TX",
      "duration": "45 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b6fd2",
      "summary": "My cousin, brother and I were playing outside when we saw a circle disc object in the sky.",
      "city": "sanantonio",
      "shape": "circle",
      "date": "2006-12-07T00:00:00",
      "story": "My cousin, brother and I were playing outside when we saw a circle disc object in the sky. ((NUFORC Note:  Witness elects to remain totally anonymous;  provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/053/S53174.html",
      "state": "TX",
      "duration": "afternoon"
    },
    {
      "_id": "64d005f478aba2ec5a3b70d1",
      "summary": "Guitar Pick shaped UFO Flies Over Houses In San Antonio Subdivision",
      "city": "sanantonio",
      "shape": "changing",
      "date": "2008-03-04T00:00:00",
      "story": "Guitar Pick shaped UFO Flies Over Houses In San Antonio Subdivision My wife with brother and I were sitting outside on our patio deck when I noticed something I thought might have been a floating bag drifting over from the direction of our neighbors house toward us. I pointed it out to my wife and made a joking comment about it being a UFO as she is a serious skeptic on the subject. My brother and I started discussing how the object was at a high altitude for it being a plastic bag and discussed the physics behind the strength of the wind needed for it to stay aloft. As we  we discussing this, the object made a lazy L-shaped U-turn toward the house behind us. It was at this point that both my brother and my wife noticed that the object had a \"guitar-pick\" shape and was not a plastic bag. I also noticed that the object was rocking back and forth on its axis in a slow wobble. We stood motionless watching the object as it continued toward the street in front of the house behind ours. I would approximate its altitude at being between 50-100 feet from the ground. Its length was 3-5 feet and had almost no width that I could see, making it extremely flat. The objects color was very white with no lights or moving parts seen. It made no sound that we could hear. When it reached the next street behind our house it started to gain altitude steadily. We could not begin to guess the speed at which it rose but it must have been extremely fast because it reached a very high altitude in around 30 seconds. At some point before we lost sight of it in the sky, I noticed that there was a tiny white round object that had seemingly materialized from the sky and flew very close to the \"guitar-pick\". I mentioned this to my brother who then stated that I must have been staring too long at the sky and was seeing a reflection of the light. I stood close to him and pointed the object out. He grew excited as he saw another white orb streak by the \"guitar-pick\". My wife suddenly pointed out yet another one moving in the opposite direction the other 2 had taken. These white orbs were moving at speeds that were impossibly fast and seemed to orbit the \"guitar-pick\" in motion. The \"guitar-pick\" at this time was almost out of visual range but looked as if it was still gaining in altitude. There were no other aircraft in the sky that day. There are sometimes military aircraft in the vicinity but as it was a Sunday very few if any were flying. I served in a ADA (Air Defense Artillery)Army unit for 3 years and can readily identify many types of aircraft by sight and sound. I have never witnessed anything to the same likeness before and probably will never again.",
      "link": "http://www.nuforc.org/webreports/061/S61984.html",
      "state": "TX",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b7404",
      "summary": "PLane looking object  disenegrates over Texas sky.",
      "city": "sanantonio",
      "shape": "other",
      "date": "2007-04-27T00:00:00",
      "story": "PLane looking object  disenegrates over Texas sky. There was an object of what looked to be a plane traveling from straight above the horizon about 60 degrees traveling towards a zero degree horizon at a high rate of speed. It looked like a plane and a contrail. The object was visiblly moving unevenly as it descended. It broke up and created more white smoke as it disenegrated over the sky. There was small puffs of smoke periodically after the main event as it dissapeared to the horizon.",
      "link": "http://www.nuforc.org/webreports/056/S56111.html",
      "state": "TX",
      "duration": "25 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b7446",
      "summary": "Driving home my wife and I were driving west of FM471 in San Antonio Texas toward Medina Lake.  We saw a craft that was very large with",
      "city": "sanantonio",
      "shape": "triangle",
      "date": "2007-08-14T00:00:00",
      "story": "Driving home my wife and I were driving west of FM471 in San Antonio Texas toward Medina Lake.  We saw a craft that was very large with what appeared to be moving very slow with two huge what appeared to be large turbine engines that were not making any noise but the craft was moving.  In an instance the craft was gone with no trace of the what I think were the engines that shined very brightly. ((NUFORC Note:  Witness indicates that the date of the incident is approximate.  PD)) ((NUFORC Note:  Witness elects to remain totally anonymous;  provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/058/S58086.html",
      "state": "TX",
      "duration": "10 Minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b74c5",
      "summary": "A humming noise  and then a bright light in the sky which I saw at home at an appartment complex on northside east  SA tx  off  HW1976",
      "city": "sanantonio",
      "shape": "unknown",
      "date": "2007-02-24T00:00:00",
      "story": "A humming noise  and then a bright light in the sky which I saw at home at an appartment complex on northside east  SA tx  off  HW1976 My self and my wife we saw a bright light on this November 28,  It was about 9:30 and there was a light outside.   My wife and I saw it and it was pretty dark out side there was no other persons outside of the apartment complex where we lived. the light was so bright when I looked out the blinds I could see a shadow on the living room wall.  The light was like no other I had seen. being former Navy I have seen many different aircraft and  lights they would use for illumination.  This light was very surreal and like a fire bright orange like when the sun sets and it lite up the entire complex and the back alley. there was nothing in the sky when I checked the out side. It was a dreary night and looked as if it would rain but it did not. the entire event took place I would say in about five to ten minutes.",
      "link": "http://www.nuforc.org/webreports/055/S55216.html",
      "state": "TX",
      "duration": "10-15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b7602",
      "summary": "the light streaked across and then another light appeared behind the car a was just hovering above",
      "city": "sanantonio",
      "shape": "light",
      "date": "2008-01-21T00:00:00",
      "story": "the light streaked across and then another light appeared behind the car a was just hovering above First, there was a ball of light streaking across the sky similar to a falling star that disappeared into the distance. But it was too large, too close, and too bright for a star. Soon after, there was a ball of light hovering in place as we drove away. We turned around at the nearest exit to get a better look, but it had disappeared.",
      "link": "http://www.nuforc.org/webreports/061/S61021.html",
      "state": "TX",
      "duration": "1:00"
    },
    {
      "_id": "64d005f478aba2ec5a3b764b",
      "summary": "Aurora/U.F.O. sighting in San Antonio",
      "city": "sanantonio",
      "shape": "triangle",
      "date": "2007-08-07T00:00:00",
      "story": "Aurora/U.F.O. sighting in San Antonio At approximately 12:00AM on July 27th, 2007 my brother and I were outside and  I noticed a glowing yellow ball hovering over Bush Middle school and told my brother. He quickly told me it was probably just a plane. It started rising higher and higher but not coming any closer so we started walking down our couldesac to go check it out. We walked closer and it seemed as if two human objects were glowing in the sky. The objects weren't lights, as they were just a very bright glow. As I am a christian and never believed in U.F.O.'s I thought the second coming of christ was happening and told my brother.  We were drawn to the glowing objectst by curiousity. It hovered high for about ten minutes and the two glowing balls seemed to turn back into one glowing ball. It almost is as if it knew we were there. We ran back home scared and it's almost as if it followed us. We looked over head and it's almost as if it slowed down, not like any plane can do but rather fast. Then we both saw it overhead and it looked like some type of plane but with a triangular shaped \"torso\". It took off very fast and had basically no noise whatsoever. I heard what sounded like little girls singing, but I'm not sure if this was the sound of the plane or not.  I did some research and found out about the Aurora project and looked at videos on Youtube and Google articles, it looks similiar to those projects but still not entirely sure, it seemed to all happen so fast. I now am a firm believer that I U.F.O.'s exist, regardless if it was exrtra terrestials or a government project. My brother called the non emergency policy number and told the lady he was a college student that wasn't prank calling or doing drugs. They said they would have somebody check it out. Good luck with that! ((NUFORC Note:  Witness elects to remain totally anonymous;  provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/057/S57852.html",
      "state": "TX",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b7647",
      "summary": "\"Star\" moving extremily fast across the sky, not a sattelite or plane.",
      "city": "sanantonio",
      "shape": "unknown",
      "date": "2007-08-07T00:00:00",
      "story": "\"Star\" moving extremily fast across the sky, not a sattelite or plane. My husband's friend called last night, telling us to go outside and look at the sky. He and his girlfriend were outside along with two of there neighbors, witnessing lights in the sky. They said they were all moving very fast and changing directions. My husband and I did not see what they were talking about but as we were about to go back inside, we did see something. It looked just like a star in the sky, so it was in outer space. It was moving upwards in a vertical direction in the sky. It was moving so fast! Within seconds it had moved from right above the horizon line to the other side of the sky. I don't think it was a satellite because I don't think they travel that fast. It definitely wasn't a plane or a jet because it was like a star, so I know that it was in space. Maybe it was the space station? I thought it would be brighter though. Anyways, that's what we saw, but our friend says he saw much more that night.",
      "link": "http://www.nuforc.org/webreports/057/S57859.html",
      "state": "TX",
      "duration": "30 min"
    },
    {
      "_id": "64d005f478aba2ec5a3b77ab",
      "summary": "ON SUNDAY 10 01 06 MY WIFE AND I WERE DRIVING HOME FROM WHITE RUIDOSO NEW MEXICO. APPROXIMATLEY AT 11:20 PM I NOTICED OFF TO MY LEFT BO",
      "city": "sanantonio",
      "shape": "circle",
      "date": "2006-10-30T00:00:00",
      "story": "ON SUNDAY 10 01 06 MY WIFE AND I WERE DRIVING HOME FROM WHITE RUIDOSO NEW MEXICO. APPROXIMATLEY AT 11:20 PM I NOTICED OFF TO MY LEFT BOUT 1 MILE TO THE WEST A RED FLARE GUN SHOOT OFF AND ARC INTO THE SKY. I NOTED THE MILE MARKER ON HYWAY 380 AS MILE 47 JUST IN CASE WE SAW A POLICE OFFICER TO LET HIM KNOW.  APPROXIMATLEY AT 11:40 PM WE WERE 15 MILES SOUTH OF THE OWL CAFE BETWEEN SAN ANTONIO AND SOCCORRO NEW MEXICO.   A VERY BRIGHT WHITE LIGHT CAUGHT MY ATTENTION OUT THE DRIVERS SIDE WINDOW - FROM THE WEST NORTH WEST , THINKING IT WAS A  WEATHER BALLOON. IT SHOT ACROSS , MOVING ACROSS MY WINDSHIELD IN 3-5 SECONDS. I SAW AN AFTER BURNER EFFECT COME FROM ITS TAIL END LIKE A FIGHTER JET - I WOKE UP MY WIFE.  SHE SAW THE TAIL END OF THE AFTERBURNER EFFECT AND IT PASSED TO THE EAST OUTSIDE HER WINDOW. I BROUGHT THE CAR TO A STOP THE AFTER BURNER SHOT OUT A HUGE BLAST OF FIRE AS A STRING OF 5 ORBS OF WHITE LIGHT LIKE A STRING OF PEARLS IN A ROW LIT UP THE SKY FOR ABOUT 5 SECONDS THEN DISAPPEARED INTO THE SOUTHEASTERN SKY - EAST OF SOCCORRO.  WE WERE BOTH IN AWE MY WIFE WAS SPEECHLESS IT TOOK OUR BREATH AWAY. WE GRABBED THE ROAD MAP AND LOOKED TO SEE WHERE WE WERE AT - TO THE WEST OF US WHERE I FIRST SAW THE LIGHT WAS THE NORTHERN TIP OF WHITE SANDS MISSLE RANGE - WHEN I INITIALLY SAW THE RED FLARE GUN 20 MINUTES PRIOR WE HAD JUST PASSED BY SIGNS FOR THE TRINITY SIGHT - WHERE THE 1ST ATOMIC BOMB WAS DETONATED.   IT WILL BE A NIGHT TO REMEMBER.  I WOKE UP MY WIFE TO LET HER KNOW AS I BROUGHT THE CAR TO A STOP - SHE SAW A TAIL END OF THE AFTER BURNER EFFECT AND AT THAT POINT I LOST VISUAL SIGHT OF IT.  MY WIFE SAID SHE SAW A SUDDEN BURST OF FLAME COME OUT OF IT AS IT PASSED ON THRU HER PASSENGER SIDE WINDOW MOVING EAST",
      "link": "http://www.nuforc.org/webreports/052/S52810.html",
      "state": "NM",
      "duration": "20 SECONDS"
    },
    {
      "_id": "64d005f478aba2ec5a3b7ba0",
      "summary": "We were stunned to believe what we saw!!!!!!!!!!!!!!!!!!",
      "city": "sanantonio",
      "shape": "disk",
      "date": "2006-10-30T00:00:00",
      "story": "We were stunned to believe what we saw!!!!!!!!!!!!!!!!!! It was a clear and breezy night around 8:30pm when my daughters and I saw somthing weird in the sky when I brought it to my daughters attention. We were on our way to drop one of my daughter's off at grandmas house.  Whatever it was in the sky, the craft was like going crazy and zigzagging in the air as we were driving slowly trying not to loose it. We saw bright lights in the sky so we went to drop her off and on the way home to our apartment we saw it again but this time it kinda disappear what we thought it did so as I was coming into the complex I just turned over to the left thru some bushes there it was something hovering over these large trees and I told my daughter do you see that. She said yes it was round on the bottom of it was like a dome with a bright light and a circle of lights on the bottom of that. It was grayish-black and we still had the car running and all I could think of to get the camera inside the house.We were surprise and stunned. So we left to get the camera but if was gone. On Oct.19, 2006 we saw another sighting but this time around the same time again but it was above us. This craft was going slow throughout the air there was no sound but the craft was flying slowly and made a kinda of a u turn towards us I was yelling to my daughter to call her brother outside but I stood there looking in the air and the craft was coming towards and we got to see the structure of the craft underneath it.It was triangluar with 3 lights on the corners of it. It look huge above us we were also stunned couldnt believe we were seeing this underneath it.Then all of a sudden it turn around and disappear.",
      "link": "http://www.nuforc.org/webreports/053/S53074.html",
      "state": "TX",
      "duration": "nighttime"
    },
    {
      "_id": "64d005f478aba2ec5a3b7f58",
      "summary": "I witnessed a strange craft hovering not too far above me in the atmosphere and then it shot off at warp speed with no warning.",
      "city": "sanantonio",
      "shape": "oval",
      "date": "2009-12-12T00:00:00",
      "story": "I witnessed a strange craft hovering not too far above me in the atmosphere and then it shot off at warp speed with no warning. A friend in I were in her car in the drive thru of a fast food restaurant.  It was the middle of the day, and there were very few clouds in the sky.  I happened to look out my window and saw a medium-sized oval shaped craft hovering in the sky 45degrees to my right, with two distinct whie blinking lights on it.  I pointed it out to my friend, and we just sat and watched it for no more than 30 seconds.  Then all of a sudden, it started moving horizontally very slowly, and then it shot off vertically into the atmosphere, at I guess what you would call warp speed, and leaving behind a streak that disappeared within one second.  It was extremely fast, I'd only seen a craft move that fast in science fiction movies.",
      "link": "http://www.nuforc.org/webreports/073/S73421.html",
      "state": "TX",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b812b",
      "summary": "amorphous, floating ink-spot in the night sky",
      "city": "sanantonio",
      "shape": "other",
      "date": "2008-10-31T00:00:00",
      "story": "It was literally like an amorphous, floating ink-spot in the night sky.  No lights, no noise.  I saw it for less than a minute.  I lived on Randolph Air Force Base at the time, less than a mile from the flight line.  I saw planes take off and land every day.  I know what planes look like and I am sure that was no plane. If nothing else, it would have made some kind of noise.  It was eerily silent, though that could have been the shock I felt at having seen the \"blob\".  It didn't even seem to leave wind in its wake.  I would love to know if there is anyone else out there who can explain what it was because I don't believe that aliens visit this planet. ((NUFORC Note:  Witness indicates that date of incident is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/066/S66176.html",
      "state": "TX",
      "duration": "10-20 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b8225",
      "summary": "bright yellow lights over san antonio texas",
      "city": "sanantonio",
      "shape": "cylinder",
      "date": "2009-01-10T00:00:00",
      "story": "bright yellow lights over san antonio texas it was a dark and cold night when me and my freind were camping when suddenly a bright glowing objects appeard and hovered above us and we staired in amazement and started to freak out so we ran inside and called the police. description( it was a cylinder shape craft with three dark lights from the bottom and seven side lights and made a werid noise like a vacum cleaner.) ((NUFORC Note:  Witness elects to remain totally anonymous;  provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/066/S66828.html",
      "state": "TX",
      "duration": "3 mintues"
    },
    {
      "_id": "64d005f478aba2ec5a3b8367",
      "summary": "Light forms that  disappear and reappear that seem to be dancing around each other.",
      "city": "sanantonio",
      "shape": "light",
      "date": "2009-03-19T00:00:00",
      "story": "Light forms that  disappear and reappear that seem to be dancing around each other. My friend and I were sitting on top of his apartment complex downtown, which is about 16 stories.  It has a very nice view of all downtown and then some, and has a great view of the city.  It was very late for me and was about 3:30am.  My friend had taken off for awhile to go inside his apartment.  While he was gone, I was noticing the historic Emily Morgan Hotel and a hawk- like bird, which seemed to be huge flying around the top of the building that was lit.  I thought it was rather odd, so I keep on looking in that direction.  Before you know it, I was noticing an object that looked like a star that was very bright that just appeared from nowhere around the same area.  It was moving around the same general area and would disappear and reappear and was flying by really fast, I later found out that this was no star.  I thought this was really strange.  Then I was trying to follow it around with my eyes and I was really excited to be witnessing this.  Another light that looked like the same one appeared in another direction below that to the right and it looked like they would appear and reappear and fly away.  I was really excited to be seeing this and hoped that it would last as long as possible.  Later, I had seen a third object that had looked like the same of them appear in another direction (to the lower left), kind of like an off triangle formation.  By this time, my friend had come back and I was hoping that he saw the same thing that I was seeing just to reaffirm and because I just couldn’t believe it.  He saw the same thing that I was seeing.  For about 20-30 minutes, these 3 light objects were appearing and disappearing, getting brighter and lighter, and seemed to be like dancing in the sky between one another.  It was the coolest and most bizarre thing that I have ever witnessed. ((NUFORC Note:  Source of report indicates that the date of the incident is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/069/S69202.html",
      "state": "TX",
      "duration": "20 min."
    },
    {
      "_id": "64d005f478aba2ec5a3b83d8",
      "summary": "Triangular UFO with blue smoke coming from it over San Antonio, Texas",
      "city": "sanantonio",
      "shape": "triangle",
      "date": "2009-03-19T00:00:00",
      "story": "Triangular UFO with blue smoke coming from it over San Antonio, Texas At approximately the time shown, on the date showm, there was a triangular shaped UFO with blue smoke coming from it.  It was going in zig zags, the left the area headed due west.  A few minutes later the UFO reappeared almost in the same area.  It once again zig zagged, and flew due west  Each time it appeared,the signting lasted for about 20 minutes in duration. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/068/S68874.html",
      "state": "TX",
      "duration": "30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b8694",
      "summary": "Large gray disk, appears to be at least 15 to 20 time bigger than airplane in the vicinity.",
      "city": "sanantonio",
      "shape": "disk",
      "date": "2009-03-19T00:00:00",
      "story": "Large gray disk, appears to be at least 15 to 20 time bigger than airplane in the vicinity. A friend of mine took this picture about 5 p.m. about 6 weeks ago.  He took the photo because he was looking at a plane that he thought that was not leaving chemtrails but contrails (a rarity in the last many years). He took the photo and then look up and notice a bright star and took another photo about 10-20 seconds later of the star. While looking at the photo at a later date a nephew noticed, after blowing up the photo, a UFO to the left of the star and airplane trail.  Then they blew up the other photo and saw the same UFO but at about a ninety degree angle difference than the first photo. ((NUFORC Note:  Source of report indicates that the date of the incident is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/068/S68917.html",
      "state": "TX",
      "duration": "10-20 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b87a1",
      "summary": "BRIGHT WHITE FLASH IN NIGHT SKY, FAIGHT OBJECT MOVED AWAY FAST IN ARC",
      "city": "sanantonio",
      "shape": "unknown",
      "date": "2009-12-12T00:00:00",
      "story": "BRIGHT WHITE FLASH IN NIGHT SKY, FAIGHT OBJECT MOVED AWAY FAST IN ARC RELAXING IN BACKYARD, LOOKING TOWARDS BIG DIPPER HANDLE (NORTH), NOTICE A HIGH FLYING PLAN BLINKING AND AT APPROXIMATELY 9:15 JUST ABOVE THE BLINKING PLAN A VERY BRIGHT WHITE FLASH, LIGHT MUCH OF THE SKY IN THE AREA, VERY BRIGHT THEN NOTICED A VERY LIGHT OBJECT AFTER MOVING AWAY FAST IN AN ARC, OBSERVED FAINT OBJECT MOVING AWAY FOR A SECOND THEN LOST CONTACT.  WENT TO THE FRONT OF THE HOUSE, SAW THE BLINKING PLAN NOW FAR TO THE NE, BUT COULD NOT FIND THE OBJECT AGAIN.",
      "link": "http://www.nuforc.org/webreports/072/S72623.html",
      "state": "TX",
      "duration": "3SEC"
    },
    {
      "_id": "64d005f478aba2ec5a3b87c1",
      "summary": "Shiny, oval shaped object in the sky, hovering above San Antonio",
      "city": "sanantonio",
      "shape": "oval",
      "date": "2009-01-10T00:00:00",
      "story": "Shiny, oval shaped object in the sky, hovering above San Antonio I was driving northbound on I-37 entering the southern part of the downtown area in San Antonio, TX.  I spotted something shiny, hovering in the sky.   I pointed it out to my mother and we watched it for about 30 seconds. t was oval shaped, and at one point vanished and then reappeared for couple of seconds and it was gone. It was daylight, I-37 is a busy highway, we may not be the only people to have seen it.   I don't know how high it was, but I know it was not an airplane or anything I've ever seen.",
      "link": "http://www.nuforc.org/webreports/067/S67019.html",
      "state": "TX",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b8968",
      "summary": "object moved south on 410 and moved very fast",
      "city": "sanantonio",
      "shape": "teardrop",
      "date": "2009-08-05T00:00:00",
      "story": "object moved south on 410 and moved very fast oval shaped in front seemed white and bright but moved fast thought it was a falling star but suddenly it stopped and changed direction. object moved fast and looked like it dimmed it's lights but still continued to move in circles . Four other objects followed object and then military planes were heard circling the air space. i have witnessed these objects several times before but i truly have no answers. i caught one on video also. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/070/S70653.html",
      "state": "TX",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3b89bd",
      "summary": "bright flash of white light seen over san antonio texas.",
      "city": "sanantonio",
      "shape": "flash",
      "date": "2009-08-05T00:00:00",
      "story": "bright flash of white light seen over san antonio texas. I am a 40 year old truck driver from texas i have been driving for 6 years i normally drive at night so i see falling stars and satelites cross the night sky on a daily basis but this night i  was standing outside my home in the front yard facing south it was a clear night i often look up at the night sky and see satelites cross the night sky but this object had a bright flash of white light then it shrank to the size of a small star,then it continued on a southwest path for approxmately 10 seconds.My first guess is that it my have been a satelite or the shuttle i have seen the space station cross my night sky it has great speed,this object didn't if i hadn't seen the flash before i would just think i was watching a satelite cross the night sky.Well if anyone can help with suggestions on what this object may have been i would appreciate it greatly.",
      "link": "http://www.nuforc.org/webreports/070/S70682.html",
      "state": "TX",
      "duration": "30 sec"
    },
    {
      "_id": "64d005f478aba2ec5a3b8bd2",
      "summary": "San Antonio, TX. September 2008 - 3 Witnesses - Triangular Formation in the sky.",
      "city": "sanantonio",
      "shape": "triangle",
      "date": "2010-04-13T00:00:00",
      "story": "San Antonio, Tx. September 2008 - 3 Witnesses - Triangular Formation in the sky. Im telling this exactly as it happened because I think alot of people don't come forward like they should so I'm telling what I saw.  Unfortunatley, I never thought of reporting it til now, but this is how it went. It happned around mid september 2008 in San antonio Tx, on the Southeast side.  Me and my friends ((male name #1 deleted)) and ((male name #2 deleted)) were walking we were about a little past ((female name deleted)) coming down Schley going the west when Nathan told us to look in the sky,I didnt see it at first until my friend nathan pointed it out, but when I did I was like \"What the hell is that!!!\"   The thing seemed to be about a mile away and it didnt seem to do much but move real slow.  But let me tell you, I watch the History channel and seen about stealth but damn this was like nothing I've ever seen.  The thing would kinda glow on and off to where when it would glow, there were about 20, what I guess could be called bulbs, floating in a triangular formation that would turn white, but then it turned transparent. It continued to do this at about a rate of 1 pulse every 2 seconds, fading white then gone, white then gone, non stop. The thing moved real slow and kinda, came towards our way as we were walking. The whole time I was freaking out to seeing something like that. At one point I tried to take a picture but my camera phone wasnt able to zoom that far or even make it out at all. So we continued looking at it until it went behind some trees and we couldnt see it anymore. Just for the refrence,  This thing was not a plane, It was not birds, or a meteroite or any natural occurance for that matter. It was something beyond my undertanding. I've never seen a plane fly that slow either, it just cant be done... I've seen planes all my childhood when my dad worked on them. This was not a plane! And I've never seen a bird change colors before. We know what we saw and I will put it on everything to stand by it. But what could this possibly mean?  Are they here to observe us?  Or is it the government?     -Thank you ((NUFORC NOTE:  Witness indicates that date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/074/S74424.html",
      "state": "TX",
      "duration": "About 5 Minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b8bcb",
      "summary": "Bright  Light Fading in and Out in Southwestern part of the sky.  ((NUFORC Note:  Venus.  PD))",
      "city": "sanantonio",
      "shape": "light",
      "date": "2009-03-19T00:00:00",
      "story": "Bright  Light Fading in and Out in Southwestern part of the sky I saw a bright light in the sky toward the Southwest. It was about ten times brighter than any star in the sky that night and about 5 times larger. It would go from being extremely bright and fade to almost no light.The object was orange in color. At one point I went inside for a couple minutes and came back out and it was gone. I later came out about 5 minutes after that and it had reappeared. It continued to fade from bright to dim. It was closer than a star yet further than an airplane. An airplane flew underneath the object in the sky and the object didn't seem to be much further than the airplane. I have no idea what this is but I know it is something I can not explain nor have ever seen. ((NUFORC Note:  Venus.  PD))",
      "link": "http://www.nuforc.org/webreports/068/S68207.html",
      "state": "TX",
      "duration": "1 hour"
    },
    {
      "_id": "64d005f478aba2ec5a3b8d08",
      "summary": "Invisable by the human eye but caught on infared film.",
      "city": "sanantonio",
      "shape": "oval",
      "date": "2008-08-12T00:00:00",
      "story": "Invisable by the human eye but caught on infared film. In April of 2006 I filmed with a infrared camera what I believe to be something not of this world.  Floating with a smokey figure and moving up, down & slow then quickly.  This was all filmed in my front yard. I want to send my video to someone to have it analyzed.  I am willing to send a copy to you or maybe someone you know that knows about these things,,what ever it is. thank you ((NUFORC Note:  Witness indicates that date of incident is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/064/S64459.html",
      "state": "TX",
      "duration": "1 hr 32 min."
    },
    {
      "_id": "64d005f478aba2ec5a3b8e28",
      "summary": "star like object",
      "city": "sanantonio",
      "shape": "light",
      "date": "2010-04-13T00:00:00",
      "story": "The week had been very cloudy.  This particular day the sun started to come out and there were scattered clouds.  I was staying at a hotel downtown and decided to go to the roof where the swimming pool was.  There were two other gentlemen that were maintnence, they were testing the pool for chlorine. I looked into the sky and saw two star like objects, the first I saw for one second, and it whisked away before I had time to focus on it.  The other hung in the air for about 5 minutes and did not move.  The sun hit it and you could tell it was a metallic object. I went over to the maintnence workers and asked if they saw what I was looking at and they did.  They did not know what it was either and were very flabbergasted. As the three of us watched it, it began to glow orange.  Then it changed shaped, then again, back to a star like shape. It then began to move across the sky very slowly, until we could not see it anymore.",
      "link": "http://www.nuforc.org/webreports/074/S74597.html",
      "state": "TX",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b9266",
      "summary": "Black, gumdrop/bell shaped object sighted over downtown San Antonio, TX",
      "city": "sanantonio",
      "shape": "other",
      "date": "2010-05-12T00:00:00",
      "story": "Black, gumdrop/bell shaped object sighted over downtown San Antonio, TX I was 21, working as a valet driver at a downtown hotel in San Antonio, TX.  It was a slower day and I was parking a vehicle behind the hotel in the parking lot.  As I was walking I was looking up across the top of the hotel for a hawk that usually picks off pigeons and stuff.  I then noticed an object, not directly above the hotel, but from my line of sight I can surmount that it was just a little bit further out over the city.  The first thing that popped in my mind was that it looked as if someone had placed a black gumdrop in the sky.  I am a college student and I know what things are, this was no helicopter or anything that could have been produced with our current technology.  It was clear as day right before my eyes, almost as if I could reach out and grab it.  I attempted to take a picture with my phone but could not get a distinguishable shot.  From what I could see there were no openings, lights, windows, or protrusions of any kind; just a solid be! ll/gumdrop shaped object.  There were cirrus clouds that day so I was able to gauge if it was moving, it wasn't.  I watched it for about 3-5 minutes then I ran inside, down to the maintenance room to see if the engineering guys had any binoculars.  There weren't any so I ran back up to the front to see if any guests had arrived, everything was clear so I immediately ran to the back again because the sun and trees obscured my vision in the front.  When I got back, I searched for it and was able to find it again, still there not moving.  Total time elapsed so far would of been about 8 minutes.  I watched it for another 2 or so minutes until I was interrupted by my radio that a guest needed assistance in the front.  When I was done with that I ran back again only to find nothing there that time.  I waited for a few minutes watching the sky around me but could not find it.  When this was over I went back to the front and about ten minutes later I noticed a very high altitude je! t going over, heading roughly north to south.  Then after that! one had passed, about 5 minutes later, another high altitude jet flew south to north.  I hadn't seen anything like that fly over all day, so if it was a coincidence then it was perfect timing. ((NUFORC Note:  Witness indicates that date is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/075/S75268.html",
      "state": "TX",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b92a5",
      "summary": "white, egg shaped object traveling very fast and no sound what so ever",
      "city": "sanantonio",
      "shape": "egg",
      "date": "2008-08-12T00:00:00",
      "story": "white , egg shaped object traveling very fast and no sound what so ever egg shaped object appeared in evening ,clear skies .This object was traveling in very straight horizontal line from West to East .Object was white in color and traveling in avery fast rate of speed .Which I do not believe to be a plane ,etc... This object was covering distance very quickly ..There appeared to be no sound comming from oject ..It traveled very fast , very queitly ((NUFORC Note:  Witness elects to remain totally anonymous;  provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/064/S64366.html",
      "state": "TX",
      "duration": "6 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b92b1",
      "summary": "Video surveillance of unidetified flying object moving in zig zag pattern and disappearing in sky.",
      "city": "sanantonio",
      "shape": "disk",
      "date": "2009-01-10T00:00:00",
      "story": "Video surveillance of unidetified flying object moving in zig zag pattern and disappearing in sky. I have the image recorded on my computer.  The bright, white object looks like a space craft of some kind, but moves in a zig zag formation and upward/downward/and can all of a sudden disappear with a very fast speed.I have all of this recorded on video and the two space crafts were seen in different directions upon entry and both leave \"disappear\" at the same location.  The video was taken with a surveillance camera.  My husband and I were outside at the time and we did not hear any plane or helicopter in the sky.  No clouds were present in the sky at the time the video of the strange object was taken.  The two objects dissappear and move north abruptly in the sky.  They have no tail like a comet or shooting star, but do have sparks that are only present went it moves in the horizontal position.",
      "link": "http://www.nuforc.org/webreports/067/S67218.html",
      "state": "TX",
      "duration": "3:08"
    },
    {
      "_id": "64d005f478aba2ec5a3b9310",
      "summary": "Quick object overhead San Antonio / Schertz TX",
      "city": "sanantonio",
      "shape": "chevron",
      "date": "2008-08-12T00:00:00",
      "story": "Quick object overhead San Antonio / Schertz TX I'm outside, literally 5 minutes ago, smoking a ciggarette. I look to the southwest down I-35 towards downtown san antonio, and notice a fast, erratic moving object fly out of sight. it gave me an uneasy feeling, literally made me a believer.",
      "link": "http://www.nuforc.org/webreports/064/S64372.html",
      "state": "TX",
      "duration": "3 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b93b2",
      "summary": "3 Morphing Red Sphere Lights No Sounds.",
      "city": "sanantonio",
      "shape": "sphere",
      "date": "2010-04-13T00:00:00",
      "story": "3 Morphing Red Sphere Lights No Sounds. The ufo had 3 morphing red sphere lights. It was coming from the northeast going south then disappeared. It went so fast past my neighbors house it made their car alarm go off. When it got to my house it stopped for about 5 seconds and then took off. And this ain't the first time i've seen one, In the february of 08 i had my first encounter. this would be my second. THIS IS NOT A HOAX.",
      "link": "http://www.nuforc.org/webreports/074/S74958.html",
      "state": "TX",
      "duration": "30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b940e",
      "summary": "Group of star like objects moving rapidly to the north over the San Antonio airport 12:36am July 10, 2008.",
      "city": "sanantonio",
      "shape": "formation",
      "date": "2008-08-12T00:00:00",
      "story": "Group of star like objects moving rapidly to the north over the San Antonio airport 12:36am July 10, 2008. I was sitting on my backporch facing north when I noticed a group of what looked like stars, about the brightness of Vega which is straight up in the sky at this time. There were 5 or 6 of them in a cluster and then one trailing. They were moving rapidly to the north. I had only about a 30 degree window of sky from the edge of my roof to the tree line. I live just southeast of the San Antonio airport and they were moving at 10 degrees north just west of the north star Polaris. At arms length they covered an area about the size of my thumb. Before they reached the treeline it seemed the one in the rear had caught up with the main group. There was no sound. My wife and I witnessed something of the same sort back sometime late April or early May in the evening right after sunset.",
      "link": "http://www.nuforc.org/webreports/064/S64433.html",
      "state": "TX",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b94aa",
      "summary": "I witnessed a bright blue object that appeared to move downwards and vanish in about 2 seconds",
      "city": "sanantonio",
      "shape": "oval",
      "date": "2009-01-10T00:00:00",
      "story": "I witnessed a bright blue object that appeared to move downwards and vanish in about 2 seconds Please bear with me as my phone is all I have to work with. It was almost 12:30 at night when I was walking back to my apartment complex. I was walking through the grass in the front of the apartments that had a gate where u could get back in.  Anyways I was just about to the gate when I saw a very bright blue light out of the cirbir of my eye. I looked up at the sky and there was this blue oval looking object.  The object was I would have to say less than a half mile in the sky. It was there and gone as soon as I looked up at it. It appeared to be moving downward into a field right across the street. I was very scared of the fact that it moved so quickly and seemed to vanish before getting to the ground. There was no noise at all from the object. I would have to say I was less than 300 yards away from it as well.  As soon as I saw it vanish I felt chills.  The area where the object was has a lot of dear that roam around at night. I didn't see any dear in sight. It's about an hour after I have witnessed the unidenitifief object.  I still don't see any deer, and they are always coming into the field around this time from across the street where I spores the object.  Anyways like I said I looked up saw a blue oval looking object and as fast as I saw it, the thing shot downwards and appeared to vanish all within about 2 seconds.  That's as much information as I'm available to give about what I've seen.  It's late and I'm shooken up about it.  I hope my information helps.",
      "link": "http://www.nuforc.org/webreports/067/S67288.html",
      "state": "TX",
      "duration": "2 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b95d5",
      "summary": "Three separate sightins which ocurred in rural south Texas between 01/01/03 and 03/01/09.",
      "city": "sanantonio",
      "shape": "triangle",
      "date": "2009-06-09T00:00:00",
      "story": "Three separate sightins which ocurred in rural south Texas between 01/01/03 and 03/01/09. I have lived in various towns South Texas since 1999.  Since 2004, I have worked outdoors most if this time, mostly at night with minimal light pollution from large cities.  I have three separate sightings to report with no specific dates, regrettably.  All I cab say is that the first sighting occurred after 01/01/06 before 2007.  The second sighting occurred between 01/03/09 and 02/20/09.  The third sighting occurred between 04/01/09 and 05/15/09.  The first two sightings occurred while I was working.  The last sighting occurred during my off time.  I will recount my experiences here. All three sightings occurred in the rural Texas landscape in between Del Rio, Texas to the west, San Antonio, Texas to the north, Corpus Christi, Texas to the east and Laredo, Texas to the south.  In between these four cities are smaller, rurally populated towns.  Outside of the towns are millions of acres of privately owned ranch land that is inaccessible to few consisting of ranch owners, their families, hunters and in areas closer to the Mexican border, the U.S. Border Patrol. I’d like to emphasize that this area in between the aforementioned cities is sparsely populated and dominated by private land.  Also, after I had observed the objects in all three sightings, I believed the aircraft to be military.  The cities of Del Rio and San Antonio have Air Force installations.  The city of Corpus Christi has a Naval Air Station.  There is also a bombing range approximately 30 to 40 miles east of Cotulla, Texas on Farm to Market Road (FM) 624. I will report these observations as clearly and accurately as I can, devoid of any opinion or speculation.  I did mention earlier that I believed these objects to be military, but that’s based on the fact that these events occurred within the triangle of those installations where there are several remote miles to operate in without many eyewitness accounts. FIRST SIGHTING: I was with a coworker traveling westbound on the FM Road 133 which connects Artesia Wells, Texas (LaSalle County) to Catarina, Texas (County).  Both towns are sparsely populated and are surrounded by dense brush for several miles.  Artesia Wells is a town of probably 20 that is approximately 50 miles north of Laredo, Texas, outside of it’s city limits and maybe 90 miles outside of San Antonio, Texas.  Artesia Wells is on IH-35 in a heavily traveled stretch of highway that is relatively clo0se to the Mexican border. FM 133 is maybe 15 to 20 miles long and only runs from Artesia Wells to Catarina.  There are no tons in between Artesia Wells and Catarina.  Catarina has a population of maybe 50 or more, if not less. I am not certain as to the time of year, and do not want to speculate.  I do remember that I initially observed the object approximately 10 miles west of Catarina and thought that it was a low flying aircraft.  This was about 45 minutes before sunset.  Approximately 5 miles outside of Catarina, both my coworker and commented that the aircraft did not appear to be moving.  The object was several miles west of the FM 133 and Highway 83 intersection just south of Catarina. The object appeared to be black in color, triangular shaped with no lights or visible markings.  The object did not make any sounds that I could hear.  Also, the object appeared to be hovering.  The object’s hover was not consistent with that of a helicopter in that a helicopter moves up and down and side to side as it hovers.  This object appeared to be perfectly still.  I did not notice and type of exhaust emitting from the vehicle. My coworker and I attempted to get as close as we could to the object via dirt roads.  The dirt roads we were on took us due south and not west.  The object appeared to be hovering over brush.  From my position, I couldn’t identify any land monuments to pinpoint the object’s location.  There were only trees and plants below the object.  I still would like to say that my coworker and I were still around about 10 miles or so from the object. We watched the object until the sun set.  The object remained stationary for the duration.  My coworker and I attempted to get the object’s attention by pointing flashlights at it and using flashing lights while we were stationary. At sun set, the object became impossible to see with the naked eye.  I used night vision goggles to view the object.  With very little sub light being used as a light source, I could clearly see the object at the same location, still stationary.  My coworker observed the object through the night vision equipment as well. It was at this time that we left the area.  The object was not visible after sun set.  The object did not appear to have any lights. SECOND SIGHTING: I was working alone near the Artesia Wells area between the hours of 2200 and 0100 hours when I observed lights in the sky.  I was traveling westbound on a rural ranch road one mile south of Artesia Wells and approximately one mile from IH-35 when I first saw a bright light in the sky. On this night, the sky was clear and there did not appear to be any clouds in the sky.  I was I was traveling westbound, a bright light that I can best describe as resembling a headlight caught my eye.  The light was very bright and flashed on and off before disappearing.  There appeared to be lights north of this light’s location; these lights seemed relatively close to the first light. I observed the very bright “headlight” and the others for only a couple of seconds.  I continued traveling west until I reached IH-35.  I parked my vehicle, got out and attempted to signal the area where I observed the light with my flashlight. I was at the intersection of IH-35 and FM 133 when I attempted to signal this light.  At this point the light was not visible.  I scanned the sky and observed a high flying aircraft that could have been a plane.  This object was traveling southbound on the east side of IH-35 but crossed over IH-35 traveling westbound.  Shortly after crossing over, the object began to travel north.  It took the object between 8-12 minutes before it disappeared out of sight due to distance.  Another aircraft appeared to be several miles behind it. I turned my attention back to the west sky where I observed three high hovering objects.  These objects appeared to be in a triangular formation.  I could not make out any shapes or sizes.  The lights on these objects appeared to be consistent with conventional aircraft.  They omitted a white beacon every couple of seconds or so.  These objects did not appear to have the typical red port side light or green starboard side light that many aircraft and vessels have.  They remained stationary for several minutes, flashing. I attempted to signal these objects as well, to no avail. To characterize the initial object, I’d say it was about the size of a military flare.  I did not emit smoke and a shadow like military flares and did not appear to be descending under a parachute like a military flare.  It is best described as a single vehicle headlight in the sky.  This object was not a radio or cell phone tower light and was not a vehicle.  It was too high in the sky to be mistaken for vehicle. This entire experience lasted about 30 minutes. THIRD SIGHTING: On this particular evening, I was traveling home from a shopping trip in Laredo, Texas with my family when my daughter, my wife and I observed an object in the sky.  I was at about the 27 mile marker of IH-35, two miles south of the Border Patrol checkpoint when I observed 4 to 5 bright lights, lined up within three to four times their width from each other.  These objects appeared to be in a much disciplined formation.  These objects appeared consistent with the object I saw in my second sighting.  The objects were very bright and appeared similar to headlights.  They flashed off sequentially, starting with the southern most light.  These lights were in the western sky. I immediately notified my wife and daughter and they too saw the lights.  I did not stop to investigate or signal to them.  I continued traveling northbound until arrival at the Border Patrol checkpoint. The 27 mile marker is approximately 27 miles form the Mexican border.  The lights appeared to be hovering over rural densely brushed and sparsely populated ranches.  There are no major towns or cities northwest of Laredo, Texas that would line up directly west of the 27 mile marker.  The nearest town would be Catarina which is several miles north of Laredo on Highway 83.  The next nearst town would be Encinal, which is 39 miles north on IH-35. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/070/S70393.html",
      "state": "TX",
      "duration": "1: 45 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b9915",
      "summary": "i was about 7years old. my parents and sister and brother were sitting at the table eating breakfast when the greyish metalic sphere hi",
      "city": "sanantonio",
      "shape": "sphere",
      "date": "2008-07-05T00:00:00",
      "story": "i was about 7years old. my parents and sister and brother were sitting at the table eating breakfast when the greyish metalic sphere hit the screen window.  stayed their for seconds then at a high rate of speed went towards downtown but didnt go downtown and when it got to the other end of the creek went straight up into the sky. their were neighbors who saw it also. no one remembers but me now . i try to bring up what had happen but no one memory buy mine . i did notice i believe their was a dark colored lincoln with some men in suits. no its not men in black. that came to mind but i guess the object hit the other side of the creek before hitting our scree window. thats been the only experience i have gone thew ((NUFORC Note:  Witness indicates that date of incident is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/063/S63862.html",
      "state": "TX",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b9b1b",
      "summary": "strange object of lights over san antonio, tx",
      "city": "sanantonio",
      "shape": "unknown",
      "date": "2009-08-27T00:00:00",
      "story": "strange object of lights over san antonio, tx i was sitting at the computer when my wife was looking outside and said she saw a light in the sky. we went to the window and when i saw it first, i thought it was a plane. it was giving off the blue, and red lights that planes give when flying at night. but this wasn't moving. we watched for about 5 minutes before we went outside to get a better look. the lights seemed to be moving left to right in a circular motion. we sat there and continued to watch it, but it never moved, it just sat there. we started to notice that it appeared as if it were slowly moving up and down, but that could just be because we were staring right at it. it was also bright, so it might have been a star, but there were stars scattered around tonight, but none were acting like this, this was definitly strange. yes sir, i typed in the wrong date. it was the 13th of August when i saw the object. since that morning i stayed up the next two days to see if i could see the same object and nothing in that general area ever showed up. i'm not exactly sure what it was, i figured it might have been a star, but don't they stay in about the same area. anyway, thankyou for the writing back and sorry once again for the mix up on dates.   THANK YOU,",
      "link": "http://www.nuforc.org/webreports/071/S71626.html",
      "state": "TX",
      "duration": "1 hour"
    },
    {
      "_id": "64d005f478aba2ec5a3b9be7",
      "summary": "comet looking object seen on NW side of San Antonio TX at 10:19pm 1/21/10",
      "city": "sanantonio",
      "shape": "sphere",
      "date": "2010-02-14T00:00:00",
      "story": "comet looking object seen on NW side of San Antonio TX at 10:19pm 1/21/10 I was driving from Bandera road down mainland about ¼ Mile away from Tezel road.  As I was driving I looked up in the upper right hand corner of my windshield and I saw what looked like a shooting star or some type of firework.  I have seen shooting stars before but they always look so far away.  What stood out to me was this shooting star scared me because it appeared so close, it seemed to be a few blocks ahead of me.  It kind of looked like fire work show or comet but is didn’t have a long tail.  However I could see clearly that it was shooting in a downward direction in a way that I have never seen a firework do.  It also seemed to be too large to be any type of firework.  Basically it looked like a cylinder shape fire ball that shot down the sky and disappeared before it hit the ground.  It was the strangest thing I have ever seen and at this moment I think I either saw a comet, shooting star or a UFO, ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/074/S74145.html",
      "state": "TX",
      "duration": "1/2 Second"
    },
    {
      "_id": "64d005f478aba2ec5a3b9e89",
      "summary": "A RECTANGLE BLACK OBJECT STATIONARY IN MID -AIR ABOUT AN HR. WITNESSES ON HAND.",
      "city": "sanantonio",
      "shape": "rectangle",
      "date": "2009-01-10T00:00:00",
      "story": "A RECTANGLE BLACK OBJECT STATIONARY IN MID -AIR ABOUT AN HR. WITNESSES ON HAND. 12-20-08 a huge retangle shape dark object was very visable at 12 oclock high,and stationary for about an hour in the sky,as many espectators pointed to the object,then it began to move very slowly toward the southeast,then disappered from the sky.altitude estimated 12,ooo ft.many witnesses from parking lot,and few got out from their cars to see the object.the object did not make any noises.seen two spectators taking pictures with cam corders.410 south,curcit city store and ross store parking lot,between 4:45pm and 5:48pm. GOD IS WITNESS ALSO!  NO JOKE HERE!! from SAN ANTONIO,TEXAS.it might come out on t.v. news. ((NUFORC Note:  Witness elects to remain totally anonymous;  provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/067/S67566.html",
      "state": "TX",
      "duration": "1-hr."
    },
    {
      "_id": "64d005f478aba2ec5a3ba15f",
      "summary": "Triangular lights directly overhead moving silently and slow then saw edge of craft in moon light (circular).",
      "city": "sanantonio",
      "shape": "triangle",
      "date": "2010-04-13T00:00:00",
      "story": "Triangular lights directly overhead moving silently and slow then saw edge of craft in moon light (circular). Hello, I am a witness to a flying saucer,  my buddy already filed a report but my buddy got a call from the lead investigator, who told my buddy for me to make my own report.  So, this is my report. As we were walking our dogs, my buddy decided to drop his dogs off and then go back to my house. As I was waiting outside I wanted to look for the big dipper because it was pretty clear outside.  Then directly overhead I noticed what I thought was a flock of geese in a V pattern.  To my amazement the Geese were not Geese, I was looking at a brilliant V shape set of lights.  I watched them directly and clearly right above me, moving very slow and silent. I could not believe what I was looking at.  It was what I’ve come to know as a UFO.  As soon as I could I called for my friend, come here and look!  As he dashed outside I was pointing straight up at the craft.  He then saw it himself.  We watched, without blinking for about 25-30sec. until the craft traveled out of eyesight. What I saw was seven lights in a triangular formation traveling east at a very slow pace. As it moved away I caught a glimpse of what looked to be more than the V pattern itself, it was a dark circular shape around the lights.  It was HUGE!  At arms length the object was at least 3 inches wide.  It looked, to my perspective that it was at an altitude of one – two miles.  I could not understand what I was looking at, but I knew it was there (right above us).  Nothing will ever change my mind about what I saw, knowing that it will never be erased from my mind. Thanks for this website.  My friend and I will always be linked by this event I Just wished it lasted longer.",
      "link": "http://www.nuforc.org/webreports/074/S74955.html",
      "state": "TX",
      "duration": "25-30 sec."
    },
    {
      "_id": "64d005f478aba2ec5a3ba264",
      "summary": "Daytime sighting on busy freeway, UFO landed.",
      "city": "sanantonio",
      "shape": "oval",
      "date": "2008-08-12T00:00:00",
      "story": "Daytime sighting on busy freeway, UFO landed. Hello, I am a 27 year old truck driver and My wife is a Registered nurse, we had a sighting a couple sundays ago. This is the first time we have ever seen a ufo.  I was driving my wife to work on Loop 1604 West in San Antonio Texas, Sunday July 27, 2008 at about 13:10. I was driving and she was looking outside the passenger window.  The sky was blue, no clouds in the sky, very sunny. She said she had seen this object  flying to her right, about 200 feet up.  She said she watched it for about a minute before she realized she didn’t know what it was and told me to look at it.  It was hard to see at first because it was sliver and was like a flat egg, it blended in so easily to the sky but I did finally see it and we watched it accelerate to a very fast pace and then slow down again, at this point it was in front of us, over the freeway.  Then it continued a steady pace to our left, and landed.  It went straight down to land, not like an airplane.   I wanted to exit and look for it but my wife did not want to. So we drove on.  It was not a helicopter and it was not an airplane.  We did not see any markings on it.  We did not take any pictures with our phones, when it was happening we were in such disbelief that we didn’t even think of takings pictures of it.  This happened before the 281 highway exit on 1604, it landed behind a Shopping center.  We do not think it was a remote control toy because of the distance it was traveling, the height and the speed is unlike anything we have ever seen.  This location is not near any military base. Has anyone else reported seeing this?",
      "link": "http://www.nuforc.org/webreports/065/S65185.html",
      "state": "TX",
      "duration": "3 minutes or so"
    },
    {
      "_id": "64d005f478aba2ec5a3ba57c",
      "summary": "Saw 4-5 bright lights in sky zigzagging up/down and side to side in an extremely fast manner in San Antonio, TX at approx 12:45 am",
      "city": "sanantonio",
      "shape": "light",
      "date": "2009-06-09T00:00:00",
      "story": "Saw 4-5 bright lights in sky zigzagging up/down and side to side in an extremely fast manner in San Antonio, TX at approx 12:45 am A friend and I were meeting at a parking lot where I was to give her some items after she got off work.  The place we were meeting at was for me a former work place , but one that my friend still works at during the day; the parking lot of the Santiko Embassy theater located off of Bitters Rd near Hwy 281 in San Antonio TX (this location is about a half a mile or less from the San Antonio airport).  The movies had finished and I believe the only cars left were those of the employees still inside. We were standing at our cars just talking when I turned from facing south to the east, and as I looked at the sky I saw lights; as we are near the airport didn’t think anything of it as I just assumed it was one of many planes that fly in and out all hours of the day.  But within what seemed less than a second the light zigzagged not only up and down, but sideways as well.  My first thought was “what the heck”, second thought “helicopter”, third thought, “hell no they don’t move like that”, then I saw that there was more than one light.  It was partially cloudy and the lights would disappear and appear depending on if they were behind a cloud or not.  Because they did not all disappear and appear around the clouds at the same time it was hard to say if there was more than 4 lights or not.  I was not able to judge the distance or height but it appeared to be higher than the landing or takeoff height of the planes around the area of the airport.  Trying to be logical about what I was seeing I then assumed they were doing something at the airport or at least in the vicinity of the airport, something like floodlights; but to the best of my ability during a cloudy sky flood lights appear to shine off the clouds and of course have a trail of light to lead you to their location, not disappear behind the clouds without once showing a trail of light.  Understand that this all took less than a minute while I was just staring at lights; meanwhile my girlfriend (who was facing north towards me) was still talking.  I then shouted out, “did you see that”, and of course she said “what”.  I pointed up to the area where there was now nothing to see as they appeared to have gone behind the clouds; she again said what when suddenly one then 3 or more appeared and were zigzagging all over that one area.  I again asked if she “saw that” and she replied “yes”, and asked her what she thought they were planes or helicopters, she said no way, they don’t move that way or that fast.  We just kept watching them zigzag extremely fas! t in and out of the clouds but always in the same area.  I thought maybe lights from the planes, but that didn’t make sense as they don’t move that fast or zigzag up and down.  We watched for several minutes and talking excitedly about we thought we might be watching and at this time I checked the time and it was 12:48; I believe I first saw the lights at 12:45 and then my friend said “this is just to weird I’m leaving”, by this time I myself was getting scared and said “me too”.  Neither of us had a camera; her cell phone had previously be damaged and the screen would only show black, I had a new phone and don’t know how to use it yet but to be honest didn’t even think about it. Since I only first noticed the lights at 12:45am and stopped watching at 12:55am I have no idea how long they might have actually been visible.  At approximately 12:54 I was driving off, went to hwy 281 and headed north towards hill country where I live 3-4 miles outside the city limits on a bluff overlooking the area both south towards Johnson City and north towards the airport and town.  As soon as I got home I went to the highest point near my home to look at the sky but saw nothing but sky, stars, clouds and the lights from the planes flying overhead.  By this time it was about 1:20 and as I tried to calm down and think of what I should do I went onto my computer and went to white pages where I looked up numbers for the airport and non-emergency Bexar County police.  I got in touch with the airport police and asked them if they were doing anything with lights at the airport which they responded no and asked them if anyone had reported seeing lights.  I explained what I saw and he said no one had called, took my name and we said good night.  At least he asked me my name and thanked me for calling, that he would check around, the Bexar county policewoman who took my call asked me nothing, just listened said no when I asked if anyone else had called then thanks for calling and we hung up.  I’m still excited about what I saw and unless someone can tell me that there was some kind of light show going on at this time of the night on a Monday or anything in the least bit believable, I will always believe I saw UFO’s; but they’d have to be pretty convincing, since as I said there was no normal cloud effects with these lights, just extremely fast zigzagging in and out of them.  This morning I got up with the knowledge that I was going to call someone else and report what I saw so I went on line an entered “UFO Sightings” and got you, next I’m going to enter FAA and see if there is a number I can call.  I’m not crazy and in fact worked for 15 years with the Metropolitan Washington Airports Authority before retiring early and moving to San Antonio.  Please somebody tell me something.",
      "link": "http://www.nuforc.org/webreports/070/S70324.html",
      "state": "TX",
      "duration": "10 min"
    },
    {
      "_id": "64d005f478aba2ec5a3ba636",
      "summary": "Cigar shaped object over the San Antonio International Airport Thursday June 4th 2009 10:12 am CDT",
      "city": "sanantonio",
      "shape": "cigar",
      "date": "2009-06-09T00:00:00",
      "story": "Cigar shaped object over the San Antonio International Airport Thursday June 4th 2009 10:12 am CDT The morning of June the 4th Thursday 2009 at approximately 10:12 am CDT. I was traveling south bound on Jones Malts burger Rd at the intersection of Nakoma near the Blossom Athletic Complex, when I noticed a strange object which I thought was a plane as it was directly over the San Antonio INTL Airport.  It was a cigar shaped craft about the size of a Cessna or leer jet.  It was following the same trajectory that a normal plane would make on approach to landing, however it was not descending.  The object traveled from my left (the west) to my right (the east).  It was a very slow moving object and I watched it for about 1 minute.  The object then turned 90 degrees away from me and traveled south.  When it turned it was like I was looking at the back end of it so it was now circular in shape and had no wings.  The object then seemed to vanish.  It did not speed off, it just kind of de-materialized.  It was almost as if it had gone behind a cloud however the sky was extremely clear and there was no haze present at all.  When I got to a high interchange I looked at downtown San Antonio just to see if there was any sort of haze and there was none.",
      "link": "http://www.nuforc.org/webreports/070/S70376.html",
      "state": "TX",
      "duration": "1 minnute"
    },
    {
      "_id": "64d005f478aba2ec5a3ba6de",
      "summary": "Object quietly glides of neighborhood-no lights no sound!!",
      "city": "sanantonio",
      "shape": "chevron",
      "date": "2009-05-12T00:00:00",
      "story": "Object quietly glides of neighborhood-no lights no sound!! Hi, I was just wondering if any people have reported any ufo sightings near 1604/281 area. I saw something flying low, blackish-gray boomerang shaped, no lights, no sound, gliding slowly over the neighborhood around 2130 sunday night. I thought it was a flock of birds but it never broke formation and was to perfect of a shape, and there is noway it was a plane because it had no lights or sound, plus a plane flew over, in a different direction, maybe 30 seconds after in which I could hear sound and see blinking lights on it, at a much higher altitude.  Two other people saw the ufo fly over also and none of us have ever seen anything like it before.  Just checking to see if any other reports have came in.  If you have any questions please call or email me.  Thanks",
      "link": "http://www.nuforc.org/webreports/070/S70001.html",
      "state": "TX",
      "duration": "15 secs"
    },
    {
      "_id": "64d005f478aba2ec5a3ba802",
      "summary": "I was traveling I-10 west and saw a hovering object .  It appeared as if it was hovering between Fred Rd and DeZavala on I-10.",
      "city": "sanantonio",
      "shape": "other",
      "date": "2008-07-05T00:00:00",
      "story": "I was traveling I-10 west and saw a hovering object .  It appeared as if it was hovering between Fred Rd and DeZavala on I-10. I was on I-10 west, when I noticed a black object against the cloud in the background.  At first I thought it was a helicopter, because I was near the Medical Center area, and it appeared as it was hovering.  I thought to myself for a few seconds, and remembered that the medical helicopter is white and blue.  I remember thinking that the object didn't look like a helicopter, and that the object didn't appear to be moving toward me or away from me.  I passed a three bridge underpass, and when I looked for it, it was gone.  I looked in the direction of the Medical Center, and I didn't see a helicopter.  I traveled another 2 minutes on the interstate and looked in the direction of where I saw the object and I saw a jet flying through the area.  I thought maybe that's what I had seen, but I remeber that the object was hovering, which a jet can't do.  I was kind of puzzled because nothing like this had happened to me before.  I know that it wasn't a helicopter and I know that it wasn't a jet.  What I saw?  I don't know, but I figured someone else may have seen it also. ((NUFORC Note:  Witness elects to remain totally anonymous;  provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/064/S64218.html",
      "state": "TX",
      "duration": "1m"
    },
    {
      "_id": "64d005f478aba2ec5a3ba87c",
      "summary": "The object came after me after I tried to take a picture and I think the camera flash caused it all.",
      "city": "sanantonio",
      "shape": "other",
      "date": "2008-07-05T00:00:00",
      "story": "The object came after me after I tried to take a picture and I think the camera flash caused it all. I was just a few miles outside of San Antonio putting gas in my car and after I left, while at the four way stop I noticed an object in the sky above a field. At first I thought it was a U.S. Border Patrol Helicopter tracking illegals. But then it moves rapidly across the sky. The only way to describe how fast it moved and ca,e to a complete stop, is just like the pointer on the computer when you slide the mouse across the screen.  This gained my interest so i tried to use my cell phone video but I couldn't get anything on the screen. So I just drove towards it and when I got close enough to see what it was, it climbed higher in to the sky where i couldn't make it out. I parked my car and went and got my camera out of the trunk. When I focused on the object I still could see exactly what it was but I could see it flashing it's lights. they went from red to green to blue to yellow then all the colors at the same time. I snapped the picture and as soon as the flash on my camera went off the object started coming closer to me.  At this point I thought the safer place to be was in my car. As the boject got closer it began flashing just like a camera flash. I drove away as fast as I could and then the object passed over my car and disappeared. It was only about a minute later that I saw the object slong side of my car. I only noticed it when it began to flash again. I text my friend and let her know what was going on. By the way, she is the one that gave me this number. Anyway, I took an exit an headed towards Cambleton. I figured I would try and drive to the only store there and just kinda let whatever it was go away. There was nothing open in Cambleton and then I saw the object again just over me and it flashed again. Then I figured the only thing safer to do was to get back on Interstate Highway 37. As I was driving down the road headed back to IH-37, the object was there. This time I saw it. It was at car level and just to my side. It is the strangest thing I have ever seen in my entire life. It looked like a helicopter and the texture of it was just like looking at the pavement on the road but it had a white glow all around it. The object passe me up on the drivers side of my car and went up about 100 yards in front of me. I stopped my car as fast as I could and the object came closer towards me .  I just sat there for a few seconds trying to think of what I was going to do next. I tried to call my friend to tell her what I was facing but my phone would not work at this point. I reversed but the object quickly gained distance between us. So I just put the car in park and said enough is enough. I am a police officer and I always carry my side arm with me so I grabbed it and got out of my car. As I raised my weapon and pointed towards the object, it let out multiple stobes of flash blinding me and I must say the heat was quite intense. So I lowered my weapon since I couldn't see then the flashing stopped. I yelled at the thing while gaining my vision back but all I could hear was my car and nothing else. After a few moments of nothing happening just looking at the thing in front of me not moving just floating idle . I raised my weapon again and the flashing began again and just the same stopped when I lowered it. After gaining my vision back I got back into my car and tried to reverse again. It came towards me and flew over my car then I put my car in drive and drove towards IH-37. The object was nowhere to be seen .  After making it back onto IH-37, I drove for a while and then here was the object again a few minutes later. I stayed with me for about thirty more minutes flashing at me and then going away momentarily back and forth. At this point I made the call to your office and left a message.  Then I came up to a thunder storm and the object just gained altitude and I never saw it again. So after getting home and not really sleeping to much when I did wake up in the morning I noticed I was sun burned. That's my weird story . This isn't in any way a hoax or a joke. In fact I wish it never would have happened. However I do want to get some sort of answer or expalnation as to what it could have been.  Please take this serious and if you can not get me some sort of answer then could you please put me in contact with someone who may have some answers for me.  Thank you.",
      "link": "http://www.nuforc.org/webreports/064/S64270.html",
      "state": "TX",
      "duration": "1 hour"
    },
    {
      "_id": "64d005f478aba2ec5a3ba893",
      "summary": "red and green flashing object hovering.",
      "city": "sanantonio",
      "shape": "light",
      "date": "2008-07-05T00:00:00",
      "story": "red and green flashing object hovering. red and green flashing object hovering to the northwest for around 20 mins, moving southwest and hovering again for around 15 mins. ((NUFORC Note:  Witness elects to remain totally anonymous;  provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/064/S64310.html",
      "state": "TX",
      "duration": "45 min"
    },
    {
      "_id": "64d005f478aba2ec5a3bac1f",
      "summary": "Large, bright, orange, fireball-like sphere seen in San Antonio TX night sky",
      "city": "sanantonio",
      "shape": "fireball",
      "date": "2010-11-21T00:00:00",
      "story": "Large, bright, orange, fireball-like sphere seen in San Antonio TX night sky On Saturday 9 OCT 2010, at approximately 942 p.m. CST, while travelling S/SE-bound in Northwest San Antonio, TX (by Shavano Park), my significant other and I witnessed an unidentified object in the night sky. The sky was clear and the weather was calm; it was not raining, snowing or foggy. The object was a single, large orange ball of light with a slight trail (also orange in color).  It darted from the right to the left in a 45 degree angle and did not emit fragments or particles.  The duration lasted approximately three to five seconds and the object was somewhat low in the sky. We have seen many meteors before and this did not appear to be a meteor.  The object was obviously not commercial or military aircraft, did not resemble a lightning ball and was definitely not an emergency flare.  The object was rather large but definitely smaller than the moon and appeared to be within our atmosphere.  The object entirely disappeared and did not fizzle out, burn up or make impact; it was spherical and disappeared as such, without fragmenting.   The object did not emit any sound.",
      "link": "http://www.nuforc.org/webreports/078/S78284.html",
      "state": "TX",
      "duration": "3 - 5 Seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bad81",
      "summary": "Several white lights outside my daughters home.",
      "city": "sanantonio",
      "shape": "other",
      "date": "2011-05-02T00:00:00",
      "story": "Several white lights outside my daughters home. My daughter called me that she was seeing an objected that was bright white  outside her house,  it would fade in and out.  I asked her to try and get a photo and she did ,its hard to see the object but you do see something that kind of looks like a cloud but she said it was several lights.  She sent the picture to me and I would be happy to forward this to you.  She said it didn't make a sound and it was quite big.  This happened at 3:21 pm Texas time.",
      "link": "http://www.nuforc.org/webreports/080/S80778.html",
      "state": "TX",
      "duration": "few minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bad99",
      "summary": "Hovering, silver disk viewed from Park Mountain towards downtown San Antonio, TX.",
      "city": "sanantonio",
      "shape": "circle",
      "date": "2011-05-02T00:00:00",
      "story": "Hovering, silver disk viewed from Park Mountain towards downtown San Antonio, TX. This report is for an individual that does not use a PC.   Mr. ((name deleted)) works and lives on my property in the Park Mountain subdivision in North West San Antonio.  The subdivision is in the beginning of the Texas Hill Country and one hill beyond the view of downtown San Antonio.  This location is just below the intersection of air traffic heading to the San Antonio International Airport in an approximately east direction and the Lackland Air Force Base traffic heading approximately south.   Mr. ((name deleted)) had gone outside his room that morning at 2:00 because he heard dogs barking.   As he looked around, he saw a silver disk hovering and making no noise but flashing red linear lights up in the shape of a V and a single red light flashing straight down.    Since my home is on a sloped lot, he moved up hill to get a better view.  The craft was more clearly visible and it appeared to be a silver color with a yellow light around the circumference.  ((name deleted)) reported t! his information to me the day after the sighting.   He had tried to call me on my cell phone several times beginning at 2a.m. but I had left it in my car.   The circular craft was approximately 50 feet in diameter and was approximately 200 yards away.  It was situated in a position to look over the horizon towards downtown San Antonio and towards Lackland AFB.   ((name deleted)) tried to snap photos with his cell phone but due to the distance and night sky, he could not capture the craft.   The craft hovered for approximately 3.5 hours and disappeared just before sunrise.  It has not been seen since but I have advised ((name deleted)) to definitely contact me regardless of the time if a similar situation occurs again.",
      "link": "http://www.nuforc.org/webreports/080/S80928.html",
      "state": "TX",
      "duration": "3.5 hours"
    },
    {
      "_id": "64d005f478aba2ec5a3baddc",
      "summary": "the object just stood there quietly just starring at use it filled the sky .",
      "city": "sanantonio",
      "shape": "oval",
      "date": "2010-08-24T00:00:00",
      "story": "the object just stood there quietly just starring at use it filled the sky . Me and my father, brother were sitting outside behind the car port talking and looking at the sky we had a clear veiw . are house was in the rear behind our landlords house we were surrounded by large trees and woods it was a queit nigth when a large object appeared it had lots of ligths it just stood there ,like it was looking at us there was no sound ,it was shape like a large bird with its wings spread out (oval) shape there was a large tree in front, the object moved beheind the trees and that slowly came back and in an instent desappaered . i say it was like 5 to 10 mins. my brother said that it was probly a weather balloon but i have never seen any weather ballon like that , my father told us nver to say a word about what we say that night . i was about 7 yrs. old the year 1977. ((NUFORC Note:  Date of sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/077/S77076.html",
      "state": "TX",
      "duration": "10 mins."
    },
    {
      "_id": "64d005f478aba2ec5a3bae47",
      "summary": "Large rectangular object with muticolored lights like needled in  a pin cushion",
      "city": "sanantonio",
      "shape": "rectangle",
      "date": "2010-08-24T00:00:00",
      "story": "Large rectangular object with muticolored lights like needled in  a pin cushion UFO SEEN NEAR DOWNTOWN SAN ANTONIO  It was after 8:15 in the evening.  I was getting into van to pick-up daughter from dance classes.  I just entered vehicle and was getting ready to start van and observed a bright flash hit the window.  I thought, I had blow car battery or some electrical problem.  I leaned forward and saw an object threw van window. I observed object for a few seconds and exited van.  The object was dark or black and had a rectangular shape. I estimated from a lamppost nearby that the object was about 80 ft above me. It was sort of a large trunk like shape.  It had multicolored lights that were at the ends of what look like rods that projected out from the structure of ship, like needles in a pincushion.  It was about three medium- car lengths long and about two car lengths wide.  It did not emit any sound.  I walked to a parking lot next to my driveway and that object was motionless for about 5 seconds.  The object begin to move in a southeast direction slowly and then made a turn to the northeast and began to rise.  I moved to follow it and went to corner of street and major intersection.  I looked up and down street to see if anyone else was able to see object.  I did not see any persons or vehicles in the area it was very quiet. It then began to move and suddenly seemed to stretch out and then disap! peared from my view into what was northeast direction,  After incident, I went back to my van and attempted to start engine but it would not start and the following day or days I removed battery and took it to nearby car radio and video shop.  The shop guy stated that battery was blow and he noted that battery cables were fused when he returned with new battery to replace blown battery. This craft was beautiful and seemed to just float and move with little effort.  The effect of it stretching out was like observing in going into a tunnel and then it was gone. ((NUFORC Note:  Witness elects to remain semi-anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/077/S77032.html",
      "state": "TX",
      "duration": "36 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bb10f",
      "summary": "A blinking light making a triangle shaped form in the night sky.",
      "city": "sanantonio",
      "shape": "light",
      "date": "2011-04-03T00:00:00",
      "story": "A blinking light making a triangle shaped form in the night sky. I was having a conversation with my spouse as i looked up into the night sky because my girlfriend said she saw a shooting star.  As i looked up i saw it comming down at a high speed blinking a bright white light when it had stopped in its tracks. It then shot back up, came back down at an angle , shot to the right and headed back up forming a triangle shape at a very high speed then disappered.  That was not an aircraft or shooting star.  From what i recall aircrafts or falling stars do not form triangle shape then just vanish.  This thing was just going way to fast and. . . I cant explain it this was just very strange and disturbing to me.",
      "link": "http://www.nuforc.org/webreports/080/S80575.html",
      "state": "TX",
      "duration": "45sec"
    },
    {
      "_id": "64d005f478aba2ec5a3bb1b8",
      "summary": "Multiple witnesses observe stationary, highly-reflective object in daytime sky.  Triangular??",
      "city": "sanantonio",
      "shape": "chevron",
      "date": "2010-08-24T00:00:00",
      "story": "Multiple witnesses observe stationary, highly-reflective object in daytime sky.  Triangular?? July 31, 2010, 2:15 PM, the weather was clear, no sign of clouds, only blue sky with an occasional commercial aircraft approaching from the north heading towards the San Antonio International airport to the southwest.  We are located at the outer limits of approach aircraft. The object appeared as a bright reflective object, located N30E, approximately 30 to 35 degrees above the horizon.  I was located in our backyard swimming pool, the bright object and relatively stationary appearance caught my attention.   I have seen high flying aircraft, rising party balloon, birds during the daytime.  But this object did not fit those observations.  This object was somewhat stationary and seemed to rise like a balloon, but never this bright and never a shape which seemed to rotate, vary in brightness and shape. Object seemed to hover and slightly rise in the sky until it just vanished.  At one point when the object seemed to nearly disappear, observation what I thought was a much larger triangular object, just catching a straight edge about twenty diameters in length as compared to the bright object (no color, bright white starlike).  It disappeared shortly thereafter.   I looked for it but never saw it again.  The duration of this observation lasted about 15 min.",
      "link": "http://www.nuforc.org/webreports/076/S76970.html",
      "state": "TX",
      "duration": "15 min."
    },
    {
      "_id": "64d005f478aba2ec5a3bb2a8",
      "summary": "is it a comet coming towards earth?",
      "city": "sanantonio",
      "shape": "changing",
      "date": "2010-08-24T00:00:00",
      "story": "is it a comet coming towards earth?   comet light shape traveling slowly.  Flashing tail like objects surrounding it.  Also gets brighter and looks like getting closer to earth.  South east of the moon.  Moving south at slow pace. Blue tails appear and dissapear. A cloudy fog light surrounds it.",
      "link": "http://www.nuforc.org/webreports/076/S76947.html",
      "state": "TX",
      "duration": "1hr"
    },
    {
      "_id": "64d005f478aba2ec5a3bb287",
      "summary": "300 glowing globes hovered over downtown skyline in San Antonio.",
      "city": "sanantonio",
      "shape": "oval",
      "date": "2011-03-23T00:00:00",
      "story": "300 glowing globes hovered over downtown skyline in San Antonio Thousands of people in San Antonio were reporting hundreds of UFOs over the downtown skyline before midnight. https://www.examiner.com/headlines-in-san-antonio/hundreds-of-ufo-s-over-san-antonio-identified",
      "link": "http://www.nuforc.org/webreports/080/S80479.html",
      "state": "TX",
      "duration": "40 min"
    },
    {
      "_id": "64d005f478aba2ec5a3bb3fa",
      "summary": "Sphere-like object with flashing lights seen in western sky over San Antonio, TX.  ((NUFORC Note:  Sighting of Venus, we suspect.  PD))",
      "city": "sanantonio",
      "shape": "sphere",
      "date": "2010-08-24T00:00:00",
      "story": "Sphere-like object with flashing lights seen in western sky over San Antonio, Texas Just wanted clarify some things on my previous report.  The object appeared in the west according to my compass not north.  When I said the lights flickered, they actually changed colors as if they were automatic not random.  The object also appeared to be moving since my telescope could not keep a fixed position on it. ((NUFORC Note:  Sighting of Venus, we suspect.  PD))",
      "link": "http://www.nuforc.org/webreports/077/S77044.html",
      "state": "TX",
      "duration": "20-30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bb3fb",
      "summary": "Sphere-like UFO sighted over San Antonio, Texas August 5-6, 2010",
      "city": "sanantonio",
      "shape": "sphere",
      "date": "2010-08-24T00:00:00",
      "story": "Sphere-like UFO sighted over San Antonio, Texas August 5-6, 2010 The object appeared in the northern sky above Camp Bullis, Texas.  The object looked identical to the video taken in Moscow back in June 25-27, 2010.   The object was so high it looked like a star flickering in the distance.  With the naked eye, you can see it flickering colors of blue, red and yellow-white and it appeared to be standing still.  With the telescope, it appeared to be moving since I could not keep a fixed position on it.   The next day, a video was posted of the object during the day by another bystander.  You can view the video at www.latest-ufo-sitings.net, look for the August 6, 2010 video in San Antonio.",
      "link": "http://www.nuforc.org/webreports/077/S77043.html",
      "state": "TX",
      "duration": "30 minutes or so"
    },
    {
      "_id": "64d005f478aba2ec5a3bb402",
      "summary": "\"V\" shapped formation with 4 objects .",
      "city": "sanantonio",
      "shape": "formation",
      "date": "2010-08-24T00:00:00",
      "story": "\"V\" shapped formation with 4 objects . well i was driving south on 35 going to San Antonio from Austin and i stopped at a rest area. then i look up to the sky and see a \"V\" shaped object flying threw the sky really fast . it looked like it was a boomerang object . it was very high in the sky i didnt get a really good look nut it looked as if there were 3 other objects were flying with it in a \"V\" formation and the sky was clear so i knew it couldnt have been falling  stars or any air plains or jets it couldnt have been it was going way to fast .",
      "link": "http://www.nuforc.org/webreports/077/S77015.html",
      "state": "TX",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3bb5bb",
      "summary": "I saw a light trail flash in in the sky.",
      "city": "sanantonio",
      "shape": "flash",
      "date": "2010-08-24T00:00:00",
      "story": "I saw a light trail flash in in the sky. Okay, So i was walking back home from a friends house around 9:55 PM.  I was walking around the corner of m street when i just took a quick glance at the sky.  Right as i take that glance i see a red and white light trail and it just dissapeared.  It was way too fast be any aircraft such as a plane or a helicopter. Im not sure if it was a UFO or a shooting star, But i know that a shooting star is white and a bright red.",
      "link": "http://www.nuforc.org/webreports/077/S77113.html",
      "state": "TX",
      "duration": "1 sec."
    },
    {
      "_id": "64d005f478aba2ec5a3bbcf5",
      "summary": "white dod, look like a plastic bag and jelly fish.",
      "city": "sanantonio",
      "shape": "other",
      "date": "2011-10-10T00:00:00",
      "story": "white dod, look like a plastic bag and jelly fish. Today when I leave the house, I saw the plastic bag flying at naibors house.  I thought was plastic bag. but it wasn't .  I recorded video, it moved high to sky, and disappeared. I have a video, but it is not good quality....",
      "link": "http://www.nuforc.org/webreports/083/S83381.html",
      "state": "TX",
      "duration": "front of house"
    },
    {
      "_id": "64d005f478aba2ec5a3bbd35",
      "summary": "Myspace.com/larrysamaniegojr all pics under the My Photo Album and the \"UFOs by night\" pic under the 4/23/11 tornado Album",
      "city": "sanantonio",
      "shape": "oval",
      "date": "2011-12-12T00:00:00",
      "story": "myspace.com/larrysamaniegojr all pics under the My Photo Album and the \"UFOs by night\" pic under the 4/23/11 tornado Album It was a dark black oval ufo with two red lights, it was like an upside down bowl, the reason for that is cuz it was not ready to land, but it will be back soon and ready to land and talk to me but i need a place to go to tell of what they plan on telling me when they do come back,",
      "link": "http://www.nuforc.org/webreports/085/S85785.html",
      "state": "TX",
      "duration": "ufo sighting"
    },
    {
      "_id": "64d005f478aba2ec5a3bbd94",
      "summary": "A white light traveling  randomly at a very high rate of speed",
      "city": "sanantonio",
      "shape": "light",
      "date": "2011-12-12T00:00:00",
      "story": "A white light traveling  randomly at a very high rate of speed I went to the mailbox one morning with my camera hanging around my neck (it was recording). I didn't check the tape for 2 days and almost erased it.  To my surprise, a white light traveling randomly at a very high rate of speed,(approx. 10x's faster than the Space Shuttle) had been capture on tape accidentally.  The sighting appeared low in the south sky, N/W San Antonio. You can see this strange event on YouTube. \"UFO in San Antonio Oct 6 2011\"  also  \"UFO in San Antonio Oct 6 2011 / slow motion\"",
      "link": "http://www.nuforc.org/webreports/084/S84919.html",
      "state": "TX",
      "duration": "1 sec."
    },
    {
      "_id": "64d005f478aba2ec5a3bbeb1",
      "summary": "Triangular Unidentified Object with lights covering all 3 sides flying at medium speed",
      "city": "sanantonio",
      "shape": "triangle",
      "date": "2011-10-10T00:00:00",
      "story": "Triangular Unidentified Object with lights covering all 3 sides flying at medium speed Me and my friends were eating and enjoying the music at karaoke night when a triangular object moving at medium speed appeared out of nowhere and flew above the reastraunt.  It had lights on all 3 sides which were flashing rappidly.  It scared us half to death.",
      "link": "http://www.nuforc.org/webreports/083/S83660.html",
      "state": "TX",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bc257",
      "summary": "There was a green flash of light over the city of San Antonio for about a second on Nov 18 at 2320.",
      "city": "sanantonio",
      "shape": "",
      "date": "2011-12-12T00:00:00",
      "story": "There was a green flash of light over the city of San Antonio for about a second on Nov 18 at 2320. I live in on a hill that oversees the whole city of San Antonio.  As I was driving home, there was a flash of green light that lit up the sky from the downtown area to the Medical Center.  There were no craft that I could see, but it was cloudy. ((NUFORC Note:  Source of report indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/085/S85427.html",
      "state": "TX",
      "duration": "1 second"
    },
    {
      "_id": "64d005f478aba2ec5a3bc642",
      "summary": "((HOAX??))  The light just came out of the sky then just shoot a cross then came back then it stop.",
      "city": "sanantonio",
      "shape": "light",
      "date": "2011-08-07T00:00:00",
      "story": "the light just came out of the sky then just shoot a cross then came back  then it stop then a big ball of light came out of it then it just shoot back up in the night sky. i know this was know shooting star star don't do stuff like this. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/082/S82964.html",
      "state": "TX",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3bc79f",
      "summary": "White lights around a large circular object moving down from the dark sky behind some trees",
      "city": "sanantonio",
      "shape": "circle",
      "date": "2011-12-12T00:00:00",
      "story": "White lights around a large circular object moving down from the dark sky behind some trees I was over at my neighbor’s chatting with her & her brother on the front porch. It was a cloudy that night. I was facing toward the south & I happen to catch a row of six circular white lights moving slowly downwards. The object was about a block away. I pointed at the object to show my neighbors & to make sure I wasn’t the only one seeing it.Their mouths dropped when they saw it. The object was moving downwards in a diagonal direction to the right & was moving around in a circular motion while doing this. It was a relatively large object, I wouldn’t say larger than the moon though, maybe half the size of the moon if you were looking at the two side by side in the sky.  It was moving really slow at first so I ran off the porch & snapped a couple of pictures of it on my iPhone.  It looked like it was pretty close to the surface, definitely not the height a plane would be traveling at. It started to pick up speed & soon it vanished behind the trees.  I tried running around the corner to see if I could look through the trees, but didn’t catch any suspicious lights.  The neighborhood dogs started barking & I heard a strange ringing in my left ear.  After that I got freaked out & ran back to my neighbor’s porch.",
      "link": "http://www.nuforc.org/webreports/085/S85788.html",
      "state": "TX",
      "duration": "about a minute"
    },
    {
      "_id": "64d005f478aba2ec5a3bc779",
      "summary": "Disk shaped object broad daylight pursued by jet",
      "city": "sanantonio",
      "shape": "disk",
      "date": "2012-01-12T00:00:00",
      "story": "disk shaped object broad daylight pursued by jet I witnessed a white/silver, disk shaped object, seen briefly. I was at the corner of Callaghan and Evers heading towards Bandera road, when the object caught my eye.  It was heading south towards Lackland A.F.B, at what appeared to be a slow rate of speed and positioned in the air at about 140 degrees relative to my position when suddenly I lost sight of it, but seconds later a high altitude aircraft traveling at a high rate of speed approached the area where I had last seen the object.  The intercepting craft appeared to be coming from the direction of Lackland A.F.B.  Minutes later as I was arriving at my destination I witnessed the same fast traveling aircraft returning back in the direction of the base.  Visual contact with the unknown object lasted mere seconds but the whole event took place over a period of 8 minutes or so.",
      "link": "http://www.nuforc.org/webreports/086/S86514.html",
      "state": "TX",
      "duration": "8 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bc80d",
      "summary": "2 spacecraft and huge blue light in the sky",
      "city": "sanantonio",
      "shape": "triangle",
      "date": "2011-10-19T00:00:00",
      "story": "2 spacecraft and huge blue light in the sky I was just heading home and while driving on the freeway on 410 going west I saw the triangular spacecraft(one only at first on my right side) cruising at medium speed high up in the sky definately looking/waiting for something. My intuition felt that there was some sort of rare threat as I also saw a few more law enforcement than usal on the freeway, so  thought this could've been an advance military spacecraft or something on the lookout..    But then the second one showed up looking the same as the first on my left.  They had some distance but were pretty close to each other basically facing each other at a perfect line for a few minutes...until this huge blue light filled the sky for just a second.  This light was so powerful and bright and seemed like some kind of explosion.",
      "link": "http://www.nuforc.org/webreports/084/S84513.html",
      "state": "TX",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bc92d",
      "summary": "Orange sphere over TX",
      "city": "sanantonio",
      "shape": "circle",
      "date": "2011-08-07T00:00:00",
      "story": "Orange sphere over TX It was a clear blue sky and noticed an orange sphere travelling westwardly.  It seemed to be following a straight path.  It wasnt travelling fast and there was no trailing tail. ((NUFORC Note:  Witnesses elects to remain totally anonymous; provide no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/082/S82728.html",
      "state": "TX",
      "duration": "10 secs"
    },
    {
      "_id": "64d005f478aba2ec5a3bc94b",
      "summary": "San Antonio UFO sighting in 1970 while parking with girlfriend.",
      "city": "sanantonio",
      "shape": "oval",
      "date": "2011-07-17T00:00:00",
      "story": "San Antonio UFO sighting in 1970 while parking with girlfriend. When I was about 16, my girl friend and I were parking, she said look at that light.  I said its just a plane.  Later, she said, look its moving around.  I said its just a hellicopter.  Then she said look its coming closer,then it dropped came up over the oak trees, about 100 feet away.  An oval yellowish white glow, humming.  Scared ((deleted)), I started truck, threw it in reverse and hauled ass.  Later, I realized the only way from such a far distance away it could have zoomed in on us had to be from my girlfriend looking and thinking about it, some sort of mental thalepophe. ((NUFORC Note:  Source of report indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/082/S82468.html",
      "state": "TX",
      "duration": "10.00 min."
    },
    {
      "_id": "64d005f478aba2ec5a3bcad6",
      "summary": "A triangular shaped object seemed to be floating and flashing bright, different colored light. Over a course of 45 minutes it slowly ch",
      "city": "sanantonio",
      "shape": "triangle",
      "date": "2011-08-07T00:00:00",
      "story": "A triangular shaped object seemed to be floating and flashing bright, different colored light.  Over a course of 45 minutes it slowly changed locations several times and eventually faded away.  At moments it seemed like there were other lights moving around the triangular object. ((NUFORC Note:  Witness elects to remain totally anonymous; provides little contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/082/S82911.html",
      "state": "TX",
      "duration": "45 min"
    },
    {
      "_id": "64d005f478aba2ec5a3bce91",
      "summary": "San Antonio UFO caught on camera.",
      "city": "sanantonio",
      "shape": "disk",
      "date": "2011-05-29T00:00:00",
      "story": "San Antonio UFO caught on camera Date: May 22, 2011   Time: 8:15 PM (according to the time on my camera)   Place: San Antonio, Texas Drury Hotel 105 S Saint Mary's St San Antonio, TX 78205   I am looking southeast on the 23rd floor (there is an exercise room that guest can use). Camera: I am using a Canon 30D with an 18-55 mm Canon lens. I am using a tripod that I have balanced on a window ledge facing the southeast (through glass).  When I first set up I noticed the florescent lighting in the room was bouncing off the glass and right into my lens.  The hotel had adjustable curtain/shades that are normally used to hide the morning sunlight.  Ipulled that same curtain/shade over my head and blocked out all of the fluorescent lighting and glare from the room. Camera settings: ISO: 1000 55 MM I focused on the Hemisphere tower F27, @ 3.0 (seconds)  I will be emailing you images that I am referring to. Please see the map: MAP-SA.jpg  This is a Google map of the area. A)  \"Drury Hotel B)\"  Hemisphere C)   Mariott Hotel (only seen in IMG_3064.jpg). This is the first photo and it is to give you a perspective of a horizontal view. Photos emailed to you:  These images were converted from \"raw\" to \".jpg.\" 1)  MAP-SA.jpg  2)  IMG_3064.jpg (horizontal photo)  3)  IMG_3065.jpg (upper left corner)    There is a \"disk\" shape that I didn’t see until I got home and looked at it in Adobe Lightroom. 4)  IMG_3065-closeup.jpg   I have zoomed in at 100% and cropped on that area. 5)  IMG_3067.jpg   This image was taken 2 minutes later with the same settings.  As you can see the sky is really dark.  I had to adjust the exposure/lighting and the \"disk\"  is still there. Please contact me if you have any questions.",
      "link": "http://www.nuforc.org/webreports/081/S81494.html",
      "state": "TX",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bd033",
      "summary": "Two black rectangular objects rotating in a consistent straight line heading West.",
      "city": "sanantonio",
      "shape": "rectangle",
      "date": "2012-09-24T00:00:00",
      "story": "Two black rectangular objects rotating in a consistent straight line heading West. Put sunglasses on and walked outside, looked up and noticed a chemtrail style halo among the clouds. As I stared for a few seconds, in the path of my focus was a black rectangle which was moving straight West. The object maintained a steady rotation. It never changed direction or speed as I could not take my eyes off of it.  I have 20/20 vision and I eyeballed that object until it was so far West, it was no longer visible. As I composed myself to keep it together, I looked up at the sky again and WOW! Another exact duplicate black rotating rectangular object following the direct path and speed consistency as the first. As high up as the two objects were, I would estimate about a mile high, they were approximately 15-20 feet in length and thin. Solid black and awesome.  I have only been fascinated by my lucid dreams of flying or having fun in the dreamworld prior to the two objects I witnessed. I am amazed at the thin blue lines before sleep that evolve into symmetric patterns only to be introduced to a diamond grid which is made apparent by the unseen force behind it. A presence or Some &quot;thing&quot; is swooshing cursive-like gleaming, sparkling, glowing, shimmering communication. Hard to believe is not my concern, I simply do not understand exactly.  I also have had a black triangle become apparent in my presleep light show. I am used to the star cluster normal activity when the eyelids are closed. But just a few days ago, I was messing around with concentration and the ultra violet or purple clusters opened up in the center and formed a black triangle. THEN, a star or spark appeared in the exact center. Wow, then I see those two black rectangles in the sky?? I have NEVER messed with acid or mushrooms. Been weird forever it seems.",
      "link": "http://www.nuforc.org/webreports/092/S92200.html",
      "state": "TX",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bd381",
      "summary": "Object in picture I took",
      "city": "sanantonio",
      "shape": "circle",
      "date": "2012-10-30T00:00:00",
      "story": "Object in picture I took My gf and I were sitting outside and I took a picture with my cell phone of the moon.  Then noticed the strange shape we saw.  It looks like a ufo, I've never been a believer in ufo's so this came as a shock to me and my gf.  I still have the picture saved on my phone.",
      "link": "http://www.nuforc.org/webreports/093/S93254.html",
      "state": "TX",
      "duration": "??"
    },
    {
      "_id": "64d005f478aba2ec5a3bd7af",
      "summary": "Bright white diamond shaped light",
      "city": "sanantonio",
      "shape": "diamond",
      "date": "2012-10-30T00:00:00",
      "story": "I was randomly staring into the sky, when all of a sudden a bright white diamond shaped light appeared out of nowhere.  It moved east to west, west to east, then slowly started to ascend upward towards the north.  As it was ascending, it disappeared, like a light turning off. The time was around 815 pm, sky was clear and I could see stars in the sky.  I live on the southside of town, off of Military Dr and Zarzamora.",
      "link": "http://www.nuforc.org/webreports/093/S93454.html",
      "state": "TX",
      "duration": "2-4 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bd972",
      "summary": "70 to 115 Red-Orange balls of light traveling in a line across the skies over San Antonio, TX",
      "city": "sanantonio",
      "shape": "fireball",
      "date": "2012-07-04T00:00:00",
      "story": "70 to 115 Red-Orange balls of light traveling in a line across the skies over San Antonio, TX Myself and 2 friends of mine were sitting in my friends front yard when he noticed something in the skies, I turned and looked and observed red-orange fireballs of light moving across the sky, when my friend noticed them, about 15 to 20 of these must have already passed, I stood and began counting these objects and asking for a camera, nobody had one, I  counted to 73 before I stopped counting and began simply observing them and trying to figure out what I was seeing. Another 50 or so must have gone by, one following another in a slanted but straight line, as if afixed to a wing, but I could see stars through them so they must not have been attached to anything. My friends and I had the eerie feeling that they were observing us observing them.  My friends neighbor, an elderly lady came home and she observed the lights as well, he then went in his house to call out his sister who also came out and observed the lights. The lights went across the sky from North to South, once the lights reached the end of the horizon they seemed to &quot;blink out&quot;.  Once one blinked out, another would appear on the north side horizon.  After about 20 minutes of this the last light appeared and followed the rest, from the rear of the last light it seemed as if a corner of a wing could be seen, yet, invisible.  Over the years I've seen UFO's before, but never anything on this scale, the sheer number of the objects was staggering. This was a major event, and yet, nobody repoted it.  Execpt me.  Hopefully others will come forward about this.  Thank you.",
      "link": "http://www.nuforc.org/webreports/090/S90116.html",
      "state": "TX",
      "duration": "15-20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bd96f",
      "summary": "Saw a  Round white object, in the air-above a tree, had bluish/white beam light from it, directly on me.",
      "city": "sanantonio",
      "shape": "circle",
      "date": "2012-07-04T00:00:00",
      "story": "Saw a  Round white object, in the air-above a tree, had bluish/white beam light from it, directly on me. went to my dark backyard to bring in jn bathmats & a bright light was on me. I thought it was a spot light fr a helicopter looking for a fugitive in my yard. But I heard no noise or felt any wind. so I turn to my rt, where the light was coming from & up in the air, next to my neighbor's front yard tree was this bright bluish-white light, coming downward on me, from a BIG round shape object, that at first glance looked like the moon. it did not move, just stood still. I then took 3 steps toward it. Then as I was looking at it, it just disappeared in a blink of an eye. So I went inside & went to the front yard & my neighbor's, but saw nothing. Ran inside & started to pray!!!",
      "link": "http://www.nuforc.org/webreports/090/S90177.html",
      "state": "TX",
      "duration": "4-5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3be1a7",
      "summary": "Moved quick with no noise.",
      "city": "sanantonio",
      "shape": "sphere",
      "date": "2012-08-19T00:00:00",
      "story": "Moved quick with no noise. Reporting two white/silvery objects heading almost due north about 1.5 mile north o San Antonio, TX  airport. Time approx. 10:15am on 08-14-2012.   Objects were moving rather quickly at around 1000+ or- feet altitude. I check wind speed, at 3000 feet 12mph.  These moved faster than that.  No other aircraft was heard or seen at this time. Shape was almost disc shaped, more round. No noise of any kind noted. I watch aircraft fly around all the time, this was not the normal.",
      "link": "http://www.nuforc.org/webreports/091/S91809.html",
      "state": "TX",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3be41f",
      "summary": "Silver cigar shaped craft",
      "city": "sanantonio",
      "shape": "cigar",
      "date": "2012-05-29T00:00:00",
      "story": "Silver cigar shaped craft I work for HHSC Food Stamp Office off of Horal and Hwy 90 and one of the security guards came and got some us workers to report there was someting wierd in the sky and if we saw what he was seeing.   The object was cigar shaped, silver in color, approx the size of a football field and hovered right below the clouds and made no sound.  You could see it change colors from dark to light and it moved to the south and disappeared.",
      "link": "http://www.nuforc.org/webreports/089/S89008.html",
      "state": "TX",
      "duration": "15"
    },
    {
      "_id": "64d005f478aba2ec5a3bed21",
      "summary": "Triangle and oblong shaped saucers",
      "city": "sanantonio",
      "shape": "changing",
      "date": "2013-08-30T00:00:00",
      "story": "Triangle and oblong shaped saucers Saw them first changing colors,red,blue,white! I then went inside to get camera and zoomed in and took  so me picture.it hovers above for a long time but changed colors the whole time!  When I zoomed in it was crazy what was seen!  I have pictures if needed",
      "link": "http://www.nuforc.org/webreports/100/S100578.html",
      "state": "TX",
      "duration": "45 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bf417",
      "summary": "I watched it until it flew out of sight over San Antonio.",
      "city": "sanantonio",
      "shape": "disk",
      "date": "2013-07-03T00:00:00",
      "story": "I watched it until it flew out of sight over San Antonio. During the mid to late 1970's between midnight to 0200 hours I was standing on our back patio on the Southside of San Antonio looking up at the night sky. It was a clear late summer / early fall evening.  Out of the North flying South was a bright flying object. It took me a couple of seconds to realize that if wasn't a jet or an airliner.  I was between 9 - 10 years old. I was and still am a huge science fiction fan. It wasn't the USS Enterprise or a Klingon Battlecruiser.  That would have been cool.  This was better!  The object was roundish to almost egg shaped. It had window's all around the sides. But only in the middle of the craft.  But they went all around the craft. The craft did spin but it also spun from end to end. If it had ends.  Hard to explain. There were no other craft in the sky. I was so enthralled it didn't occur to me to wake up my parents.  Looking back the object probably would've been gone by the time my folks would've gotten out of bed. Well! that's my story from my only UFO encounter of my life.  I'm now a former US Army MP and a 3 time OIF veteran.  I'm now a civilian police officer at Fort Sam Houston.  Also 80% disabled by the VA. Very glad you all have given people a forum to put down their UFO  experiences.  Good luck on your continued endeavors.",
      "link": "http://www.nuforc.org/webreports/098/S98541.html",
      "state": "TX",
      "duration": "20 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bf60e",
      "summary": "ORANGE SPHERES IN THE SKY.",
      "city": "sanantonio",
      "shape": "formation",
      "date": "2013-09-30T00:00:00",
      "story": "ORANGE SPHERES IN THE SKY. SEVERAL ORANGE GLOBES SEEN IN THE SKY OVER WOODLAWN LAKE AREA IN SAN ANTONIO, TX  TRAVELING  SOUTH BOUND",
      "link": "http://www.nuforc.org/webreports/102/S102500.html",
      "state": "TX",
      "duration": "20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bfd90",
      "summary": "Fireball over San Antonio.",
      "city": "sanantonio",
      "shape": "fireball",
      "date": "2013-05-15T00:00:00",
      "story": "Fireball over San Antonio My wife and I were sitting on our front porch facing north. We were observing the thunderstorm approaching us.  My wife was taking pictures of the dark clouds when we heard a plane flying low.  We were looking at the plane flying over the houses.  As it was flying in one direction, we noticed a light come out of the clouds in front of the plane.  As the plane veered to the left, we kept watching the light come closer towards us.  As it flew over our house, it looked like a fireball with a red haze behind it.  That is when my wife took pictures of it in the sky.  We were able to take three pictures of it.  As it passed our house it disappeared in the clouds.",
      "link": "http://www.nuforc.org/webreports/097/S97502.html",
      "state": "TX",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c042f",
      "summary": "Flashing blue lights on craft, flashed 2 different patterns and was not indicative of  any aircraft in our area.",
      "city": "sanantonio",
      "shape": "unknown",
      "date": "2013-02-04T00:00:00",
      "story": "Flashing blue lights on craft, flashed 2 different patterns and was not indicative of  any aircraft in our area. Strange type of flashing blue lights on a craft that hovered over area west of downtown San Antonio.  Thought it was a helicopter until I realized that they do not have blue lights.  Light configuration was not indicative of any other aircraft we have in the area (and we are the HQ of USAF and location of Boeing repair so we have many types of aircraft in our area).  Lights appeared to have two different (or differently timed) flashing patterns and these lights were strobing so brightly that they obscured the vision of the craft.  I viewed this for at least 10-15 minutes as I was driving home from a meeting going through downtown San Antonio (from north SA to south SA).  It may have been traveling southwest to northeast, very slowly.",
      "link": "http://www.nuforc.org/webreports/095/S95977.html",
      "state": "TX",
      "duration": "~10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c07ef",
      "summary": "Low altitude disc shaped Unidentified Phenomena fly's into cameras range of view, in and out of dimension, executes two U-turns!",
      "city": "sanantonio",
      "shape": "disk",
      "date": "2014-03-18T00:00:00",
      "story": "Low altitude disc shaped Unidentified Phenomena fly's into cameras range of view, in and out of dimension, executes two U-turns! Using my Logitech C615 camera, I pressed the record button.  Approximately one minute and thirty seconds in, this disc shaped Unidentified Phenomena flies into my cameras range of view.  The camera is mounted outside on my balcony railing facing directly up, feeding the USB wire into my Dell PC inside, where I was at the desk observing this on my monitor.  Anyway, this object seems to know my cameras range of view, STAYS within the cameras range of view and makes a U-turn!  The object seems to shift in and out of atmospheric dimension?  The object fly’s off screen but makes another U-turn back into my cameras range of view, then splits again.  See this link, please.  Sorry for the cursing, it was meant for a few naysayers at the time. https://www.youtube.com/watch?v=fEZFd4ciD_w ((NUFORC Note:  Witness indicates that the date of the event is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/107/S107587.html",
      "state": "TX",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c0810",
      "summary": "Unidentified egg shaped phenomenon moving slow among visible birds passing it up!",
      "city": "sanantonio",
      "shape": "egg",
      "date": "2014-03-18T00:00:00",
      "story": "Unidentified egg shaped phenomenon moving slow among visible birds passing it up! 2013 around September, recorded using my Logitech C615.  The camera is fixed onto the end of an apparatus which extends outside my window upstairs.  The USB wire is fed into my PC where I view the monitor inside my house.  My monitor was turned off.  So, when I turned the monitor on, right there smack dab in the center of the monitor is this hovering Unidentified phenomena.   I stared for a few seconds in major disbelief as it wobbles slowly heading outside the cameras range of view.  Since this object was moving so slow, I had the grand opportunity to press record AND also to look out my open window to the direction and exact location of this hovering object.  My bare eyes could not locate this object, I was able to see only the birds which fly by CLEARLY on the video.  The object was only visible to my camera, I know this for a fact because of my opportunity to see outside with my own eyes.   As I tried to follow the slow moving object, my pull string technology camera controls busted as I pulled too hard I guess.  I was still able to view more of this somewhat bulky pulsating object.,    https://www.youtube.com/watch?v=Sa_1qtHu6Jo ((NUFORC Note:  Witness indicates that the date of the event is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/107/S107578.html",
      "state": "TX",
      "duration": "12 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c11de",
      "summary": "2 fireball like objects over Southern Bexar County in evening sky 1-20-2014.",
      "city": "sanantonio",
      "shape": "fireball",
      "date": "2014-01-24T00:00:00",
      "story": "2 fireball like objects over Southern Bexar County in evening sky 1-20-2014. At 8:05 p.m. on Jan. 20 th , 2014.  My brother spotted a fireball like object as he was exiting his vehicle, he then called me and my mom out to the front of our home.  He stated that it went low right over the house and when I arrived outside I saw it was reddish yellow in color.  Nothing distinctive in shape, other than round.   My mother also witnessed it and we called out to each other what are we seeing and yes fireball like object in South Eastern sky.   It headed S.E.and faded out of our line of vision.   I and my mother went back inside our home and again,my brother called  and we witnessed a second fireball like object, and did the same as first, it faded out of view.   My mother then called my aunt that lives near Stinsonfield Airport on the Southern part of Bexar County.  She too witnessed the 2 objects and stated over the phone that they were now side by side.",
      "link": "http://www.nuforc.org/webreports/106/S106511.html",
      "state": "TX",
      "duration": "1-2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c11df",
      "summary": "2 fireball like objects over Southern Bexar County in evening sky 1-20-2014.",
      "city": "sanantonio",
      "shape": "fireball",
      "date": "2014-01-24T00:00:00",
      "story": "2 fireball like objects over Southern Bexar County in evening sky 1-20-2014. I was called outside by my son who was standing out by his truck and shouted to my daughter and I to look in the sky.  I observed in the night sky a fireball like lights that were flickering red traveling slow and then faded out. Immediately after that my son called out again and I went outside and witnessed the same thing as I stated before.  I then called my sister in law, because she lives by a small airport called Stintson field, I told her to go outside to look at a UFO,So she went out side with her daughter and did witness the lights side by side.  They live in Southern Bexar County.  The lights were to their vantage point South Eastern sky.  As of now, 9:35 p.m. they are no longer their as per my sister in law .",
      "link": "http://www.nuforc.org/webreports/106/S106514.html",
      "state": "TX",
      "duration": "1-2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c12a1",
      "summary": "Two fast moving fireballs spotted over Medical Drive, San Antonio.",
      "city": "sanantonio",
      "shape": "fireball",
      "date": "2014-01-16T00:00:00",
      "story": "Two fast moving fireballs spotted over Medical Drive, San Antonio. I'm traveler staying in a Hotel in San Antonio.   I got up and was praying by looking outside and suddenly I saw a tiny round spot looks like a fireball has flown fast and within 1 second another one has flown following the first one.   I heard a sound of a blower kind and it remained for another 30 seconds and it was fine later.",
      "link": "http://www.nuforc.org/webreports/106/S106268.html",
      "state": "TX",
      "duration": "3 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c145c",
      "summary": "Saucer Craft moving above highway.",
      "city": "sanantonio",
      "shape": "disk",
      "date": "2013-12-23T00:00:00",
      "story": "Saucer Craft moving above highway. I was driving home from picking up a meal for the family.  I was driving on IH 37 South just prior to reaching Loop 410.   I noticed an object moving from right to left very slowly. the object was saucer shape with a dome on the center.  The color of the sides was a pale yellow and the dome was a lighter color.   The object moved slowly and seemed parallel then tilted to the left approximately 60 degrees and continued slowly.  I kept sight of the object and it disappeared for approximately two seconds and reappeared further south approximately 500 ft away and it also dropped elevation approximately 300 ft.   The object continued slowly at a parallel motion for three seconds then disappeared again and I could not locate.   I stopped on side of road to locate for approximately 1 minute then proceeded home after I could not locate the object.",
      "link": "http://www.nuforc.org/webreports/105/S105480.html",
      "state": "TX",
      "duration": "20 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c16b3",
      "summary": "Triangle shape.",
      "city": "sanantonio",
      "shape": "triangle",
      "date": "2013-10-23T00:00:00",
      "story": "I saw a triangle shape with three bright white lights blinking in the sky on Oct.21, 2013, at about 8:30 PM.",
      "link": "http://www.nuforc.org/webreports/103/S103470.html",
      "state": "TX",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c1a48",
      "summary": "Large Black Triangle With 3 Orange Lights Seen In Northwest San Antonio, TX Sky Over Treetops",
      "city": "sanantonio",
      "shape": "triangle",
      "date": "2014-06-04T00:00:00",
      "story": "Large Black Triangle With 3 Orange Lights Seen In Northwest San Antonio, TX Sky Over Treetops Tonight, 21 May 2014, in San Antonio, Texas, at approximately 10:06 p.m. CST, I was driving northeast bound on Woodstone Dr. towards Vance Jackson Rd, and saw a large black triangle shaped object in the sky.  The triangle had 3 orange lights on the underbelly, one close to each corner, but not directly on the corners.   The object was very low to the ground, about 20-50 feet above the trees, and was traveling very slowly in a northeast direction; it looked as if it were hovering.   My initial thoughts were that it was an aircraft flying extremely low to ground, or 3 separate helicopters, but I did not hear any noise, and as I drove closer realized that it wasn’t either a commercial airliner or 3 helicopters flying in unison.   The object was pitch black and I could not see the trees or sky behind/above it.   I continued to drive, and as I drove closer, the road curved and after about 10-20 seconds, the object was no longer in view.   When I completed the curve in the road, I could no longer see the object.  It was just gone.",
      "link": "http://www.nuforc.org/webreports/109/S109382.html",
      "state": "TX",
      "duration": "10-20 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c1b1b",
      "summary": "Red sphere over 410 in San Antonio 7/4/14.",
      "city": "sanantonio",
      "shape": "sphere",
      "date": "2014-07-05T00:00:00",
      "story": "Red sphere over 410 in San Antonio 7/4/14. While traveling eastbound on 410, directly before NW Military Drive, I saw a reddish orange sphere floating about 200ft in the air.   No movement, no flashing lights, no shadows as if it were a commercial craft.",
      "link": "http://www.nuforc.org/webreports/111/S111002.html",
      "state": "TX",
      "duration": "15 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c1c01",
      "summary": "Saw fireball orbs traveling in a straight line that eventually accelerated away.",
      "city": "sanantonio",
      "shape": "fireball",
      "date": "2014-06-13T00:00:00",
      "story": "Saw fireball orbs traveling in a straight line that eventually accelerated away. Youtube video: (warning there's some profanity in the video):   http://youtu.be/T6nCV707ZZs   http://youtu.be/vF6FmmilgK0   Apologize it was taken on an iPhone 3GS and it poor quality.  Doesn't really do it justice.  Myself, my wife, and two of our kids witnessed 3 fireball like orbs that traveled in a straight line near Clark High School in San Antonio, Texas, in December 2012 at 8 pm.  They looked like they were on invisible rails they traveled so straight.  Then they started going faster as they moved away.",
      "link": "http://www.nuforc.org/webreports/110/S110067.html",
      "state": "TX",
      "duration": "15 minutes?"
    },
    {
      "_id": "64d005f478aba2ec5a3c1cdc",
      "summary": "2 orbs caught on local news live broadcast",
      "city": "sanantonio",
      "shape": "light",
      "date": "2014-06-24T00:00:00",
      "story": "2 orbs caught on local news live broadcast On Thursday evening my wife and I turned on our local news station in San Antonio.  Prior to the weather announcements they always show a live screenshot of the city in the background.   What we saw looked like 2 orbs fly into the picture.  The anomaly on top comes into the screen in a downwards motion and then begins to zig zag and then flies off and disappears.   The anomaly that is on the lower area of the screen continues in almost a straightforward pattern and then disappears.  I've shown this video to several family and friends and they've all been astonished.   I am submitting the video to you in hopes that you can shed some expertise on what you think I have on video.   The recording you are viewing is from my Samsung S4 phone and it is a short clip but you can easily see these anomalies come into the picture.  Please contact me if you have any further questions.  Thanks",
      "link": "http://www.nuforc.org/webreports/110/S110570.html",
      "state": "TX",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c204d",
      "summary": "Two UFOs photographed in full daylight, one punched a cookie-cutter shape in a cloud.",
      "city": "sanantonio",
      "shape": "sphere",
      "date": "2014-05-02T00:00:00",
      "story": "Two UFOs photographed in full daylight, one punched a cookie-cutter shape in a cloud I am an attorney residing in the Northwestern US. I was vacation visiting a close friend at the time of this incident. I was taking a photo of the Chik-fil-A billboard at the intersection of Interstate Highway 10 and DeZavala Road in San Antonio and didn't realize until after I got home that I had photographed a UFO. Two UFOs, actually.  (The reason I was taking the photos was because I thought the billboard was somewhat humorous.)  I took a total of 10 photos starting at 4:56:12 pm, as I was departing the Taco Cabana drive through on Interstate Highway 10 and traveling toward DeZavala Road. The UFO doesn't appear in any photos until 4:57:57 pm, and was gone by 4:58:05 pm.  I have a total of three and possibly four photos that show one or both UFOs. The first photo shows two UFOs, one above the billboard and one in the bottom right quadrant, behind a tree. The second photo shows a UFO in the upper center and \"cookie cutter\" type hole the cloud, in the same size and shape of the UFO, and a second UFO now emerged from behind a tree in the bottom right quadrant of the photo. If you look at the photos closely, there are also some smaller, lighter grey dots that are hovering in an arc--possibly circular formation--around the UFO in the top center of the first two photos. This was not something on my windshield or camera.  If you enlarge the photos, in one image, you can see the overhead powerline in front of the UFO and the tree in front of the second UFO. Again, I didn't know I had photographed anything until hours later. I am willing to share additional photos, if you need them, taken before and after the photos that show the UFOs.  I am also willing to discuss the circumstances under which I took the photos and answer any questions that you might have.",
      "link": "http://www.nuforc.org/webreports/109/S109017.html",
      "state": "TX",
      "duration": "8 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c229c",
      "summary": "Six red lights forming a triangle was seen then disappeared in to the clouds.",
      "city": "sanantonio",
      "shape": "triangle",
      "date": "2014-04-11T00:00:00",
      "story": "Six red lights forming a triangle was seen then disappeared in to the clouds. April 5, 2014, @10:30pm, at highway 151, San Antonio, TX.   Six red lights formed a triangle with two at the tail end.   Weather, light rain and cloudy.   Formation speed was fast but not as fast as a flying jet.  They looked to be closer to the ground unlike air planes.   After 15 minutes, it was traveling with no sound then it disappeared in to the night clouds.",
      "link": "http://www.nuforc.org/webreports/108/S108388.html",
      "state": "TX",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c229b",
      "summary": "UFO sighting.",
      "city": "sanantonio",
      "shape": "triangle",
      "date": "2014-04-11T00:00:00",
      "story": "Me and my girlfriend were traveling down 410 exiting onto Hwy 151, when I witnessed something out of the norm in the sky to the south of us.   I noticed 6 objects to the left of me that looked bright fire red in the sky.  The objects were formed in a triangular shaped with one of the objects in the center, the other 2 objects were to the right of the triangular shape one atop of the other.  Not moving just at a stand still.  Couldn't been a plane or helicopter I told my girlfriend if she can see what I was seeing.  She then was just as curious as I was, she told me to exit Hwy 151, and I then proceeded onto Ingram Rd.  By then the objects began to move in a slow pace parting from each other. The skies were cloudy and a light mist, couldn't have been chinese lanterns,  we then parked our vehicle in a suburban area, which the objects the began to disappear one by one into the clouds traveling towards the west in a very slow speed.   We then researched after and there have been actual eyewitness of the same objects we spotted.   We do believe it was an actual UFO sighting without a doubt.   No blinking lights so this couldn't have been an aircraft.",
      "link": "http://www.nuforc.org/webreports/108/S108389.html",
      "state": "TX",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c24e5",
      "summary": "Strange moving light.",
      "city": "sanantonio",
      "shape": "light",
      "date": "2014-11-06T00:00:00",
      "story": "Strange moving light. This strange light was first seen in the western sky about 45 degrees above horizon.  It appeared to be an airplane but there was no sound and then it suddenly descended very quickly and then, just as quickly, it started ascending.   For a few seconds it was rising and falling and twisting and turning erratically.  The light was white but would fade to a reddish color at times.  It moved to the northeast.  It did not go directly over me.  I would guess that it was over Loop 1604 and I-10 when I last saw it.  As it traveled, the light would sometimes not be visible but would soon appear further along in the direction it was travelling.  The strange motion is what caught my eye and is the only reason this light was unusual.",
      "link": "http://www.nuforc.org/webreports/114/S114477.html",
      "state": "TX",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c261c",
      "summary": "White cylinder shape. Seen by 4 police officers in San Antonio Tx",
      "city": "sanantonio",
      "shape": "cylinder",
      "date": "2014-11-06T00:00:00",
      "story": "White cylinder shape. Seen by 4 police officers in San Antonio Tx We watched 2 of these cylinder shape objects in the sky. We made a video. They were white.  One of them came close enough that we were sure that we had no idea what it was. It moved slow and sometimes it just floated stationary.  It's movement was erattick. I know I am not crazy, actually I am a police officer and so were the other 3 officers that were with me. It was clear weather in daylight.",
      "link": "http://www.nuforc.org/webreports/114/S114783.html",
      "state": "TX",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c2687",
      "summary": "Octagon shaped object flying at low altitude above San Antonio.",
      "city": "sanantonio",
      "shape": "other",
      "date": "2014-12-05T00:00:00",
      "story": "Octagon shaped object flying at low altitude above San Antonio. About 2 weeks ago, I have noticed what we call an ufo… it was around 2:30am, I was just  getting out of my car when I heard a weird sound, like a “swish”, I felt a light breeze on my face… I looked up and I saw, hovering above my building, a flying object… it wasn’t round, rather a polygon… octagon or decagon… the angles were very clear!  It was rotating around its axis, very slowly, and there was a diffuse light coming from underneath it… a very bright blue colored light.   It stopped right above me for some seconds, then continued its flight, at a very low speed.  I did not see where it came from, but it left towards east… ((NUFORC Note:  Source indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/115/S115707.html",
      "state": "TX",
      "duration": "Seconds…"
    },
    {
      "_id": "64d005f478aba2ec5a3c355e",
      "summary": "Two bright orange lights were moving straight across the sky with no engine sound.",
      "city": "sanantonio",
      "shape": "circle",
      "date": "2015-01-07T00:00:00",
      "story": "Two bright orange lights were moving straight across the sky with no engine sound. I saw an orange light in the night sky moving from the northwest to the east as I was out walking my dog.   As I turned back to the northwest to return to my house I saw another bright orange light moving in the same pattern.   I asked my family to come out and look at the light.  We all thought the light appeared to be flickering but it was bright.  It moved in a straight line following the same path as the previous light but there was no sound. Comparing what we saw to a news report from Cape Coral, Florida, we felt we saw the same kind of light that was sighted the family there.",
      "link": "http://www.nuforc.org/webreports/116/S116343.html",
      "state": "TX",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c35c6",
      "summary": "2 objects one teardrop yellow center green, red outer layer and another small light hovering multi colored",
      "city": "sanantonio",
      "shape": "teardrop",
      "date": "2015-03-13T00:00:00",
      "story": "2 objects one teardrop yellow center green, red outer layer and another small light hovering multi colored On Northwest side of my neighborhood, just above roof tops of 2 story home, in the distance was a very bright light too low to be a star and not moving just a big bright hovering white light so I ran inside and got my binoculars.  After focusing the object I see the shape is a teardrop yellow bright light in the center and the outer edges seem to emit red and green lights slightly changing the shape to little cylinders coming off the lower part of the teardrop.  I stared at it for some time trying to figure what the heck it was - it seem almost gaseous looking the greens and reds seemed to be changing the outer layer. Very odd.  So I went inside and called a friend then after a while went back outside again and the object had moved several houses down the street in distance...  Now on the other side of the street at rooftop level again in the distance was another light that emitted red, blue green and yellow at a rapid pace but much smaller size and circular but very colorful like a xmas tree.  Wow two ufo sightings in one night and its only March!  I see lots of different odd things in the sky and I see planes a lot too but these two objects did not make any noise.  I don't believe satellites look like this nor do they hover so low in the sky.  The constellations were way up in the atmosphere so I know they were not stars. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/117/S117760.html",
      "state": "TX",
      "duration": "2+"
    },
    {
      "_id": "64d005f478aba2ec5a3c381c",
      "summary": "4 amber color diamond shape flying objects observed.",
      "city": "sanantonio",
      "shape": "diamond",
      "date": "2015-01-26T00:00:00",
      "story": "4 amber color diamond shape flying objects observed. 4 Amber color diamond shap objects were observed on a straight line.  To the naked eye they look like a ball of fire, zoomed with a video camera and a distinct diamond shape appeared.  I caught the last two on video.",
      "link": "http://www.nuforc.org/webreports/116/S116916.html",
      "state": "TX",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c37fa",
      "summary": "Was driving west on I-10 toward 1604 and saw 2 white lights that looked like wingtip lights, but they weren't flashing.",
      "city": "sanantonio",
      "shape": "triangle",
      "date": "2015-01-26T00:00:00",
      "story": "Was driving west on I-10 toward 1604 and saw 2 white lights that looked like wingtip lights, but they weren't flashing.  Also, i thought they were too far apart to be an airplane.   A bright red flashing light was following them about 1-2 miles behind.  Just thought it was very odd, because if it were a plane, its by far the biggest plane I've ever seen. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/116/S116919.html",
      "state": "TX",
      "duration": "unknown"
    },
    {
      "_id": "64d005f478aba2ec5a3c388e",
      "summary": "Captured on video a UFO hovering over us as we watched the fireworks on New Years Eve.",
      "city": "sanantonio",
      "shape": "sphere",
      "date": "2015-01-07T00:00:00",
      "story": "Captured on video a UFO hovering over us as we watched the fireworks on New Years Eve. At midnight on December 31 2015, we were watching the fireworks on New Year's eve downtown, I was actually video recording the event on my iPhone 6.   When the fireworks began everyone was cheering, when I heard multiple people around me saying what the hell is that?  I looked to my right, and above us a UFO came across the night sky, hovering red and green lights. It was round with green lights one one side but it had red lights on the other side of it, it flashed in both colors, at first my sister claimed it was the news filming the event, but the people including myself said that not a helicopter, it maneuvered across than accented up and than down, it turned and began trailing back. This isn't the first time I recorded this red and green flashing light UFO.  Last year, on Fourth of July, I recorded a craft with this same descriptions at a fireworks display going off.  It hovered over our home.  I wasn't sure if I could display the link to my actual video recorded footage from you tube.  I have also sent a description and uploaded my video to MUFON. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/116/S116434.html",
      "state": "TX",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3c38e7",
      "summary": "8 lights in the sky.",
      "city": "sanantonio",
      "shape": "light",
      "date": "2015-01-07T00:00:00",
      "story": "8 lights in the sky. We saw 3 lights hovering in the sky followed by 5 more lights that appeared from nowhere. Look like they were following another unknown object.  Took video…  Then just like that they vanished",
      "link": "http://www.nuforc.org/webreports/116/S116481.html",
      "state": "TX",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c3988",
      "summary": "yellowish orangeish triangular shape",
      "city": "sanantonio",
      "shape": "triangle",
      "date": "2014-12-18T00:00:00",
      "story": "yellowish orangeish triangular shape It was orange and triangular with the lights",
      "link": "http://www.nuforc.org/webreports/116/S116016.html",
      "state": "TX",
      "duration": "30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c4001",
      "summary": "Too fast to capture on camera.",
      "city": "sanantonio",
      "shape": "other",
      "date": "2015-06-05T00:00:00",
      "story": "Too fast to capture on camera. Looked like Space Shuttle with contrail, except flashing red and white lite very fast moving object.  Not a commercial plane.  Maybe a military plane, but supersonic. ((NUFORC Note:  Witness elects to provide no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/119/S119290.html",
      "state": "TX",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c467d",
      "summary": "greenish circle of light was moving at a steady pace straight downward.",
      "city": "sanantonio",
      "shape": "circle",
      "date": "2015-11-12T00:00:00",
      "story": "My best friend had just picked me up around 7 because it was getting dark, we were on 410 at a stoplight when this greenish circle of light was moving at a steady pace straight downward, we are both looking at it asking each other if we're seeing it, when it just stops for a second and dissipates, disappeared, vanished out of nowhere. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/123/S123803.html",
      "state": "TX",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c49e1",
      "summary": "Bright green circular object flies low across the night sky.",
      "city": "sanantonio",
      "shape": "circle",
      "date": "2015-10-16T00:00:00",
      "story": "Bright green circular object flies low across the night sky. A bright green circular shaped object flew across the sky for approximately 1 minute in the sky.  It flew a straight line and appeared to be 500 feet in the sky.  It traveled a straight line across the sky.  I have never seen anything like this ever.  It seemed to maintain the same speed and there was no noise associated with it. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/122/S122820.html",
      "state": "TX",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c4df1",
      "summary": "UFO flies into dark cloud and disappears.",
      "city": "sanantonio",
      "shape": "cigar",
      "date": "2015-08-13T00:00:00",
      "story": "UFO flies into dark cloud and disappears. I was on my way to an afternoon appointment, and I stopped at my subdivision's entrance, which intersects a very busy street in the Stone Oak area.  It was a typical South Texas day, hot as hell, and clear blue, but for a couple dark clouds.  We're in big sky country and I just glanced up as a I waited for a break in traffic to merge and I saw plane flying from east to west. No, not a plane.  That's not a plane.  I'm used to seeing aircraft in San Antonio, with all the army bases.  I know what most large military craft look like and they also fly very low.  But this was different.  This was cigar shaped kind of like a sleek Zeppelin, silver, no lights, no visible insignia. I'm watching traffic I think.  There's no one behind me so I lose many opportunities to merge so I can continue to identify the flying object I've become so drawn to.  I wonder if anyone else can see it. It's not a plane.  It's not a military plane or drone.  It's flying low enough to see it's not a plane.  It's just cruising and I'm watching it and it flies right into the only dark cloud in the very bright blue sky and never comes out the other end. Not possible. I don't pull over.  I don't want to know.  No one is behind me still and I merge into traffic and begin to drive but keep my eyes on the cloud.  The cloud remains and the object never comes out the other end. I stop at a near light and the object still doesn't come out. I'm stopped next to McDonalds.  The object still doesn't come out. That's not a plane. It's not normal but I need to keep moving.  I know I do.  I keep my appointments, I tell my immediate family and it's just another unexplained sighting that they think is really cool but dismiss after dinner. When I was younger, I didn't know any better and would report these sightings to police.  Now I know to report some to UFO centers and keep moving.  I am surprised by this one though, that it didn't make the news, that no one saw it.  It was so huge in such a bright sky, the middle of the day.  I don't think anyone saw it.  I saw the world go on like normal. I don't think they all saw it.  I don't know how they couldn't have.  It flew into that dark cloud and that was it, its tomb, it never came out.",
      "link": "http://www.nuforc.org/webreports/121/S121001.html",
      "state": "TX",
      "duration": "3 minutess"
    },
    {
      "_id": "64d005f478aba2ec5a3c4fcd",
      "summary": "Metallic cigar shaped objects.  Changed to round or were pulling away upwards.",
      "city": "sanantonio",
      "shape": "cigar",
      "date": "2016-03-04T00:00:00",
      "story": "Metallic cigar shaped objects.  Changed to round or were pulling away upwards. Very high altitude.  Traveling south just left of overhead.  Much higher than planes coming into airport.  Cigar shaped.  Easily visible with sun setting on metallic form.  No wings or lights.  Heading south and turning toward SSE.  Came back after a couple of minutes and crossed paths with a second identical object.  Both disappeared.",
      "link": "http://www.nuforc.org/webreports/126/S126124.html",
      "state": "TX",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c570c",
      "summary": "We see a diamond shape craft with 4 white lights at the four corners and a dim red light in the center.",
      "city": "sanantonio",
      "shape": "diamond",
      "date": "2016-06-24T00:00:00",
      "story": "As I drove up to my house, my daughter then states look up and points to the sky.  As we both look up to the end of our street, we see a diamond shape craft with 4 white lights at the four corners and a dim red light in the center.   It hovered for 5 seconds and immediately moved from left to the right and disappeared.  I then called my mother in law from the inside of the house and we all went to the front yard, where then it appeared again, and moved left to right rapidly and disappeared.  We were in \"awe\" and came into the house where we saw through our 5 by10 entrance window in our two story house, giving us the ability to see the sky while standing in our entrance.",
      "link": "http://www.nuforc.org/webreports/127/S127906.html",
      "state": "TX",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c5a6a",
      "summary": "Circular Craft with Red Flashing Lights",
      "city": "sanantonio",
      "shape": "circle",
      "date": "2016-04-29T00:00:00",
      "story": "Circular Craft with Red Flashing Lights Circular Craft.  Red lights flashing.  Moved at the same speed as an airplane.  About 6 or 7 lights on it.  On the outside only.  None on the inside of the craft.  Looked like a wheel.",
      "link": "http://www.nuforc.org/webreports/126/S126976.html",
      "state": "TX",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c5b90",
      "summary": "A Beautiful Rock full of different colors in the sky.",
      "city": "sanantonio",
      "shape": "fireball",
      "date": "2016-04-22T00:00:00",
      "story": "A Beautiful Rock full of different colors in the sky. On April 21, around 9:30pm, a flying object Shape like a Rock that has all those beautiful colors when you break it in half.  It was northeast of San Antonio. Tx  At first I thought the reason it looked like that was because  the moon was behind it. My screen couldn't capture it well. UFO Sighting: http://youtu.be/p18le9P0t-gi ((NUFORC Note:  We have attempted to look at the video, but unsuccessfully.  We have requested of the witness that she unblock the video.  PD)) ((ADDENDUM FROM WITNESS)) I was looking northeast . it lasted a while the beautiful  colors kept me from being afraid like God showing fiesta colors. ((END ADDENDUM))",
      "link": "http://www.nuforc.org/webreports/126/S126964.html",
      "state": "TX",
      "duration": "Evening"
    },
    {
      "_id": "64d005f478aba2ec5a3c5cd6",
      "summary": "A diamond shaped craft with white lights.",
      "city": "sanantonio",
      "shape": "diamond",
      "date": "2016-12-05T00:00:00",
      "story": "A diamond shaped craft with white lights. It was a diamond shaped craft.  It looked almost black.  There was a white light in each corner.  Only white lights.  It moved quickly but not with super speed.  It made no noise. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/131/S131324.html",
      "state": "TX",
      "duration": "15 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c5f20",
      "summary": "Brilliant Blue and Red Triangular object in the sky",
      "city": "sanantonio",
      "shape": "triangle",
      "date": "2016-11-11T00:00:00",
      "story": "Brilliant Blue and Red Triangular object in the sky At 23:11 couldn't sleep, feeling antsy so I thought I would open blinds to let moonlight in. In the southeastern sky was a triangular shaped object with brilliant blue lights.  The lights would change from blue, to red to blue and red.  It was a very cloudy night and I wanted to go outside, but I was afraid it would disappear.  I tried to telepathically communicate with it, but it cloaked itself and I could still see dark gray edges.  It had not left, but I turned to look at the clock, and when I looked back it was gone.  23:19.",
      "link": "http://www.nuforc.org/webreports/131/S131121.html",
      "state": "FL",
      "duration": "8 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c6446",
      "summary": "I live on the northside and at 8pm I notice that dark clouds and lightning began forming on the westside of town-my next destination. W",
      "city": "sanantonio",
      "shape": "light",
      "date": "2016-08-29T00:00:00",
      "story": "I live on the northside and at 8pm I notice that dark clouds and lightning began forming on the westside of town-my next destination.  Weather radar reports not the slightest rain in town. Half an hour later as im traveling south, I spot 2 white lights, no other colors. One is circling the other. 20min later, the lowest one drops at terminal velocity.  Fastest ive ever seen.  The circling light remained but eventually faded away.",
      "link": "http://www.nuforc.org/webreports/129/S129522.html",
      "state": "TX",
      "duration": "1 hour"
    },
    {
      "_id": "64d005f478aba2ec5a3c6b9f",
      "summary": "Green orb shot out of white light  ((NUFORC Note:  We suspect a sighting of Venus.  PD))",
      "city": "sanantonio",
      "shape": "light",
      "date": "2017-01-26T00:00:00",
      "story": "Green orb shot out of white light I saw a white light in the sky it almost looked like a star but was too close to be a star I thought it could've been a plane light and it wasn't I kept staring at it and it shot a green light orb out of it to earth.  The white light it shot out of had a haze around it.  Possible it's a laser of sorts that make crop circles?  The white light was so close I captured a picture and usually stars you can't get a picture of.  It look like a mini moon with an aura. ((NUFORC Note:  We suspect a sighting of Venus.  We have corrected the date above.  PD)) ((ADDENDUM FROM WITNESS)) I don't think Venus disappears around 11 pm, or shoots green orbs of light out of it.  Thanks. ((END ADDENDUM))",
      "link": "http://www.nuforc.org/webreports/132/S132305.html",
      "state": "TX",
      "duration": "90 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c6b8a",
      "summary": "Strange object immerges from dark portal and streaks across sky ahead of oncoming storm and disappears into another dark portal.",
      "city": "sanantonio",
      "shape": "cigar",
      "date": "2017-01-26T00:00:00",
      "story": "Strange object immerges from dark portal and streaks across sky ahead of oncoming storm and disappears into another dark portal. At approximately 7:15pm EST on January 22th, 2017, San Antonio, Fl.   I looked out my front window at the oncoming storm and saw a strange object come out of the darkness above and travel directly across the sky extremely fast and disappear into the darkness (like a portal opened and closed on both ends of its journey).  This wasn't falling from the sky and wasn't on fire nor did it have a tail like a meteor typically would.  I don’t think it was a shooting star or lightning.   The object was a thin cigar shape and a bright white or a silver white glowing light and moved in a seemingly straight horizontal path.   It happened so quickly I did not have a chance to photograph it.  Because of the fast speed it traveled I don’t believe it was a plane, I have no idea what it was and wondered if anyone else saw it.",
      "link": "http://www.nuforc.org/webreports/132/S132275.html",
      "state": "FL",
      "duration": "seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c6c5c",
      "summary": "Procession of 11 fireballs.",
      "city": "sanantonio",
      "shape": "fireball",
      "date": "2017-01-06T00:00:00",
      "story": "Procession of 11 fireballs What I initially noticed was a large orange light that was kind of glowing rather than blinking like normal aircraft...  As I continued to watch the craft fly from right to left (south toward the north) about 50 degrees from the horizon I realized it's too big to be a Chinese lantern (about half the size of a dime held at arms length) and is not any kind of aircraft I am familiar with.. no other lights just one large glowing fireball.  It was flying at a normal airplane speed.. maybe a little slower and produced no sound.  About a minute later I see a second object flying from the same direction..  It to goes by then a third, a fourth..  I watch ten orange fireballs go by.  They were flying at different altitudes and distances, some are larger some smaller and have slightly different 'shape'.  The tops produced a slight halo of a lighter shade of orange.   I ran into the house and grabbed my iphone and came back outside in time to film the final one go by.  I think it was 11 total but it may have been 12.  It was like a ufo parade.  Very strange.  I'm certain others must have seen it as they flew across the whole of east and north San Antonio.  After they left a couple airplanes, possibly military, flew past the general area.",
      "link": "http://www.nuforc.org/webreports/131/S131932.html",
      "state": "TX",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c6c8d",
      "summary": "New Years @ ~12:30am, my father and I observed an object in the sky appearing red at a distance but then turned bright orange.",
      "city": "sanantonio",
      "shape": "fireball",
      "date": "2017-01-06T00:00:00",
      "story": "On new years at about 12:30am, my father and I observed an object in the sky appearing red at a distance but then turned bright orange with a flicker of red as it flew closer. The object hovered over our street originating from the south. It flew in a quarter circle pattern over the convent property across from us as it dimmed its light and dissapeared. Two identical objects followed after the first object in the same pattern at the same speed and dissapeared at the exact same spot as the first. The only conclusion I can come to, what ever they were, they must have been drawn by the fireworks. They appeared to have been observing them as they hovered over our street at a very low altitude. I never saw an aircraft, nor did I hear an engine sound or propeller sounds and it made no contrail as it flew by. I only saw three separate individual orange redish lights in the sky. And the weather conditions for 01/01/2017 at 12:58am central time in San Antonio TX is,  Weather conditions were clear  Temperature 48 degrees farenheight  Dew point was 46 degrees  Humidity was 94%  Barometric pressure was 29.83  Wind speed was 0 mph from the north. Precipitation was 0 inches  And visibility was 10 miles. ((NUFORC Note:  We spoke via telephone with the source of the report, and he sounded to us to be quite serious-minded.  We suspect that he is a very capable and reliable witness.  PD))",
      "link": "http://www.nuforc.org/webreports/132/S132037.html",
      "state": "TX",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c6c9f",
      "summary": "BRIGHT OBJECT; GREEN LIGHT ON ONE SIDE; FLICKERED OUT, STARTED AGAIN UNTIL SHOOTING OFF.",
      "city": "sanantonio",
      "shape": "light",
      "date": "2017-01-06T00:00:00",
      "story": "BRIGHT OBJECT; GREEN LIGHT ON ONE SIDE; FLICKERED OUT, STARTED AGAIN, UNTIL SHOOTING OFF.",
      "link": "http://www.nuforc.org/webreports/131/S131995.html",
      "state": "TX",
      "duration": ":30"
    },
    {
      "_id": "64d005f478aba2ec5a3c7026",
      "summary": "Like a very very large square window, shape of bright white light",
      "city": "sanantonio",
      "shape": "other",
      "date": "2017-07-23T00:00:00",
      "story": "Like a very very large square window, shape of bright white light.",
      "link": "http://www.nuforc.org/webreports/135/S135265.html",
      "state": "TX",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c73c4",
      "summary": "There was only one UFO and circular in shape. There was no noise. What woke me up early in the morning was the bright light reflecting",
      "city": "sanantonio",
      "shape": "circle",
      "date": "2017-06-02T00:00:00",
      "story": "There was only one UFO and circular in shape.  There was no noise.   What woke me up early in the morning was the bright light reflecting off my dresser mirror.  I heard no dogs barking.  What surprised me the most was that my own dog, who sleeps next to me, didn't even stir.  He usually barks at any thing at night time! ((NUFORC Note:  For some reason, witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/134/S134338.html",
      "state": "TX",
      "duration": "~5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c7463",
      "summary": "The watcher's were spotted.",
      "city": "sanantonio",
      "shape": "light",
      "date": "2017-05-15T00:00:00",
      "story": "The watcher's were spotted. In the early morning night sky my wife and I noticed a really bright light in the sky.  We at first thought it was a star but there were no other stars and the light was way too bright.  It seemed to be hovering for some time, so we sat and watched as it held altitude and location for over thirty minutes.   As the sun started to rise the round light slowly started moving higher, and after an hour it was so high and far in the atmosphere it could not be seen.  There is no explanation for what we saw, it was not an aircraft, meteor, or star.  This was an object of some sort though, it had defined shape and propulsion which made it move.   I have been around aircraft for over 28 years with the Air Force and my current position as an aircraft mechanic with Boeing Aerospace.  This was not any comercial aircraft or known military aircraft, but was some sort of propelled object.   I'm convinced now that earth is being watched by someone or something not wanting to be known, however this morning we saw you.",
      "link": "http://www.nuforc.org/webreports/134/S134115.html",
      "state": "TX",
      "duration": "1 hour"
    },
    {
      "_id": "64d005f478aba2ec5a3c7873",
      "summary": "4 orangish colored objects flying close together then crossed over each other and disappeared",
      "city": "sanantonio",
      "shape": "disk",
      "date": "2017-12-14T00:00:00",
      "story": "4 orangish colored objects flying close together then crossed over each other and disappeared I was sitting on my sofa and my wife was letting the dog out and noticed 4 orange objects in the sky and asked me to come look.  I got up and walked out the back door to see the 4 orange objects hovering at a slow pace then crossing over each other and then they slowing were out or range and disappeared.  I have worked on military trainings at night and have never seen anything like this in my life.",
      "link": "http://www.nuforc.org/webreports/137/S137695.html",
      "state": "TX",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c78af",
      "summary": "Stationary white light pulsating at about 10 degrees for 10 or so minutes.  ((anonymous report))",
      "city": "sanantonio",
      "shape": "unknown",
      "date": "2017-12-21T00:00:00",
      "story": "Stationary white light pulsating at about 10 degrees for 10 or so minutes.",
      "link": "http://www.nuforc.org/webreports/137/S137907.html",
      "state": "TX",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c78d2",
      "summary": "Red Pulsing Orb/Light over San Antonio, TX",
      "city": "sanantonio",
      "shape": "light",
      "date": "2017-12-14T00:00:00",
      "story": "Red Pulsing Orb/Light over San Antonio, TX On 12 Dec., 2017, at approximately 1850 hrs, my family and I witnessed a pulsing red light hovering over San Antonio.  It appeared to be floating over Kelly AFB, now Port San Antonio.  It gradually moved into position, then remained stationary for approx. 3 minutes.   No sound, and there were multiple a/c in the sky.  It did not appear that the other airborne craft were circling the object per se, it just looked as though they were in the traffic pattern for SA Int’l Airport.   The orb gradually disappeared by departing away from us to the east, as we were viewing from an elevated position to the west.  It remained perfectly still.  Not a helicopter, not a drone.  All witnesses (5) are ex-military two of which are private pilots.",
      "link": "http://www.nuforc.org/webreports/137/S137730.html",
      "state": "TX",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c7a92",
      "summary": "Ufo spotted, right before it vanished.",
      "city": "sanantonio",
      "shape": "cigar",
      "date": "2017-11-09T00:00:00",
      "story": "Ufo spotted, right before it vanished. San Antonio, Texas 11/03/17 approximate time 0710  The object flying that was seen appear to be hovering with a neon light of a shape a long oval craft from my angle about 400m when it noticed It had been spotted it it flew rapidly with another bright light tail and vanished in to thin air I and my passenger double looked the open clear sky and it was gone, so therefore, it couldn't had a been a airplane of any type with details of vanishing with in four seconds. ((NUFORC Note:  We spoke via telephone with the witness, and he confirmed that the sighting had occurred in the morning.  PD))",
      "link": "http://www.nuforc.org/webreports/137/S137112.html",
      "state": "TX",
      "duration": "4 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c7ac0",
      "summary": "Two objects flying together, with strange lights",
      "city": "sanantonio",
      "shape": "sphere",
      "date": "2017-11-03T00:00:00",
      "story": "Two objects flying together, with strange lights We were at the Halloween horror theme park, Scream-a-geddon, waiting in line for the hayride.  I looked up into the trees, and saw two “airplanes” flying close to each other, side by side.  It was an odd way to be flying so close, so I took notice. I told my husband to look how close they were, and as he watched, they moved from. Ext to each other to over top of each other.  They were silent, and not helicopters. As me and my husband watched, trying to figure them out, we noticed the lighting was way different than airplanes.  It wasn’t blinking, it was flashing consstantky, with colors.  Like red, yellow, white, red, yellow, white... in a cir Jose formation, not a blinking red light, like a plane.  They slowed down once they moved in the vertical formation, and disappeared behind the trees.  I can’t stop thinking about them, they were silent, ave",
      "link": "http://www.nuforc.org/webreports/137/S137001.html",
      "state": "FL",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c7ec0",
      "summary": "20-25 metallic triangular objects spotted on Cinco de Mayo in San Antonio.",
      "city": "sanantonio",
      "shape": "formation",
      "date": "2018-05-10T00:00:00",
      "story": "20-25 metallic triangular objects spotted on Cinco de Mayo in San Antonio. We were at Bandera & Loop 1604 sitting in traffic and we saw about 20-25 metallic triangular objects that I don’t believe were balloons or birds, but formed a circular shape and flew together in a formation.   At that point I grabbed my cell camera and caught a video of it. ((NUFORC Note:  We spoke via telephone with the witness, and have requested a copy of the video.  We have not received the video, as of the date of the posting of this written report.  PD))",
      "link": "http://www.nuforc.org/webreports/139/S139742.html",
      "state": "TX",
      "duration": "2-5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c807d",
      "summary": "Orange sphere travels from E to W/",
      "city": "sanantonio",
      "shape": "sphere",
      "date": "2018-03-23T00:00:00",
      "story": "Orange Sphere Travels From East to West Bright orange sphere traveled from east to west approximately 300 ft off the ground.  Object floated silently overhead at a constant rate of speed, maybe accelerating slightly.  Considered it may be a drone, but it was extremely silent.   Consulted a friend that is a drone enthusiast and they stated that \"orange\" is not a common color for drone illumination.  They contacted other drone enthusiasts to see if any of them knew of/had an orange illuminated drone. No one had orange lights or knew of anyone with orange lights on their drones.   I had seen the exact same object a year ago hovering over 410 and NW Military Hwy about 150-200 ft off the ground.  There were 2 of them at that time, and both orange, but exactly the same as this recent sighting.",
      "link": "http://www.nuforc.org/webreports/139/S139156.html",
      "state": "TX",
      "duration": "45 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c816d",
      "summary": "Spacecraft seen by two people over power lines, poles, and electrical cables.",
      "city": "sanantonio",
      "shape": "oval",
      "date": "2018-02-22T00:00:00",
      "story": "spacecraft seen by two people over power lines, poles, and electrical cables On Wednesday, February 14, my husband and I returned to our San \tAntonio, Texas apartment complex at around 7:45 PM.  As we got out of \tthe car we heard a loud rumbling, with a kind of chugging undertone, and it \tsounded unfamiliar.  When we got off the elevator and walked to our \tapartment we saw what appeared to be oval-shaped planes flying much too \tlow… somewhat shocked, we walked inside our apartment, went to the large \tliving room windows, and saw two spacecraft directly across the street, \tin the sky. \t\tThey were a silver metallic color, larger than helicopters, and they \t“parked” directly above poles for electricity and cables.  There were two \tspacecraft, and one of them faced the other, a bit lower, and at an angle. \tI had a better view of the one on the right, and there two lit windows on the \tside – gold light.  Both of them were square, and one window was smaller \tthan the other. \t\tNo wings attached to the spacecraft. \t\tThey were stationary over the power lines and the poles for \tapproximately 20- 25 minutes.  I would come back to check if they were \tstill there from time to time. When I was away from the window we heard \tthe loud rumbling noise again. I went to the window – they were gone. \t\tI did hear the same rumbling two more times during the next 48 \thours, but no sighting. \t\tI should mention that previously on Monday, Feb. 12, I saw an owl in \ta tree through the same living room window. The tree it stood in is only about \t15 feet from these poles and power lines for electrical cables, etc!  And very \tunusual to see an owl here, and this close on a city street. \t\tThe owl was asleep, woke up, and looked directly at me \t\tbefore it flew away.",
      "link": "http://www.nuforc.org/webreports/138/S138895.html",
      "state": "TX",
      "duration": "25 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c82db",
      "summary": "Strange Light Over San Antonio (Fresno St/Edison HS Area)",
      "city": "sanantonio",
      "shape": "rectangle",
      "date": "2018-11-09T00:00:00",
      "story": "Strange Light Over San Antonio (Fresno St/Edison HS Area) I was picking up my friend from her house around 10 o’clock.  She was trying to sneak out of her house, so my other friend and I waited in the car for her.  We didn’t want people to notice us so we turned off the headlights completely and lowered the inside lights coming from the console down (thus there was no chance it was a glare).   We were waiting and then in an instant, both of us see this yellow-greenish light.  It was rectangular.  The street itself was completely dark with the exception of a light post off in the distance.  It just appeared out of nowhere.  It glided downwards for 5 seconds and then it just ended.  It didn’t touch the ground, all of this happened mid-air.  It was so quick but very vivid.  We could tell it was a rectangle with a green-yellow light/aura coming from it.   It was that high but it wasn’t that low.  I would say it was at the height of when airplanes just take off, like when they haven’t reached their height cruising speed but not that low.  It was very odd.   The windows were down to and we didn’t hear anything coming from it.  It couldn’t have been a firework or flare as it didn’t come up, it just appeared and then went down.  It couldn’t have been a drone, we would have seen the lights continue and it wouldn’t have just appeared out of nowhere.  And it definitely wasn’t an airplane or a helicopter.",
      "link": "http://www.nuforc.org/webreports/143/S143657.html",
      "state": "TX",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c8955",
      "summary": "Bright lights 60 feet above ground near abandoned improved assisted living facility",
      "city": "sanantonio",
      "shape": "triangle",
      "date": "2019-09-06T00:00:00",
      "story": "Bright lights 60 feet above ground near abandoned improved assisted living facility Hi –  Ok – I personally know the person who posted the 2/21/18 report from San Antonio.  I admit that when the original poster shared her sightings with me, my analytical mind started looking for ways to “explain” away her reports.  However, I do trust the original poster. Several months after the 2/21/18 poster shared her sightings with me, I woke up at about 2 a.m.  I live directly below the original poster.  While laying on the couch, I could see out my blinds across the abandoned yet improved adjacent property.  I could see through the blinds three very bright lights . . . in close formation.  The lights appeared to change in colors and I do recall a red light and a very bright cold blue light.  I know I saw what I saw – I even got up off my couch and walked out onto my balcony.  The lights/device/thing was probably 100 yards away – to the North – and appeared to be about treetop height – approximately 60 feet in the air.  I kept staring at whatever it was.  With a few exceptions, it remained stationary.  My initial thought was “drone.”  My second thought was “drone flown by some pervert trying to look into our apartment windows.”  But it was all too weird. Look – I have a graduate degree.  I’m 48 years old.  I love science.  I consider myself pretty sharp and definitely not hysterical.  I dig on the scientific method and I get that the simplest explanation is often the correct one.  But . . . based on operational logistics and the location of the observation, something was strange and inexplicable.  I saw what I saw – it got my chalupa eating hiney off the couch and onto the patio for a better view.  It was too large to be a drone.  Plus – why at 2 a.m.  . . . over a very abandoned but secure retirement community???  If someone were flying a drone, they would “fly it” . . . as in it should move . . . instead it hovered for like 15 minutes til it simply disappeared with no change in elevation. Very strange. I would be interested to know whether my location was the same as an earlier poster above from April 2019 who reported seeing an object while with her fiancée.  I wonder if that occurred in the same area/location. I saw what I saw.  I was intrigued enough to go outside for a better look.  My upstairs neighbor has seen similar objects.  Weird.",
      "link": "http://www.nuforc.org/webreports/148/S148594.html",
      "state": "TX",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c8d9d",
      "summary": "I saw fiery orange lights no sound flying at low altitude no noise they moved south then flanked back but they all flanked at the same",
      "city": "sanantonio",
      "shape": "sphere",
      "date": "2019-01-11T00:00:00",
      "story": "I saw fiery orange lights no sound flying at low altitude no noise they moved south then flanked back but they all flanked at the same area  as they flew higher I took pictures and video  I tried to close up to see if they were lanterns but there was no flickering I have seen them before, but can’t identify them.",
      "link": "http://www.nuforc.org/webreports/144/S144369.html",
      "state": "TX",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c8f6c",
      "summary": "Was driving home heading south on Commercial avenue on the south side of San Antonio. We noticed a large flash of light in the south ea",
      "city": "sanantonio",
      "shape": "flash",
      "date": "2018-11-24T00:00:00",
      "story": "Was driving home, heading south on Commercial Avenue, on the south side of San Antonio.  We noticed a large flash of light in the south eastern part of the sky.  Each flash was blue in color.  Flashes lasted only a few seconds, but continued for several minutes around the San Antonio River and Loop 410 area.  There was no accompanying sound, smoke or any reports of electrical power being lost.  The flashes light up the entire portion of the sky.  There was a gas main that caught fire, but it was reported at 0100 hrs a full 5 hours after these flashes were observed.",
      "link": "http://www.nuforc.org/webreports/143/S143752.html",
      "state": "TX",
      "duration": "3-8 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c92b1",
      "summary": "I have a security video I would like to submit for your consideration, this is just one of many events that have happened on our proper",
      "city": "sanantonio",
      "shape": "light",
      "date": "2019-12-01T00:00:00",
      "story": "I have a security video I would like to submit for your consideration, this is just one of many events that have happened on our property!  Not to mention I am a true believer as many years ago I have seen what could only be a ufo!  Anyway I do have this video pics y’all should see!  Thank you Mlg",
      "link": "http://www.nuforc.org/webreports/150/S150798.html",
      "state": "TX",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c944e",
      "summary": "Aliens walking into the Bank , conducting bank transaction, and walking out.",
      "city": "sanantonio",
      "shape": "",
      "date": "2019-12-19T00:00:00",
      "story": "Aliens walking into the Bank , conducting bank transaction, and walking out. I am an experienced retail banker with over 12 years of experience in Mortgage Lending/Branch banking. I have my bachelors degree in business management, and I have clear vision and of sound mind.  My co-workers who are also close friends of mine are witnesses as well. There are about 5 of us who have this conversation annually so I wanted to report this information.  Once a month in 2014, a family- who we are convinced are aliens disguised as humans -would enter our bank branch and cash small checks. Prior to my encounter, When my co-workers would tell me about a family that would come into our branch and looked like aliens, I would laugh it off.  However, I encountered them twice and I changed my mind.  When we tell people our story, it sounds crazy to outsiders.  The family would captivate your attention the second they would walk into the bank. There were 5 people in the \"family\".... a \"dad\", \"mom\", and \"three daughters\". All three daughters appeared to be teenagers and the same exact height. Both parents were the same exact height. They were ash/grayish in color, and their heads were shaped like inverted triangles and their heads formed cone-ish towards the back. This was more prominent on the dad as he was completely bald. The women had short, blond-ish hair. Their garments were always drab. The Parents were an estimated 5 foot 3 inches. the kids, 5 foot 1 inch.  What was interesting about them was they would walk into the bank in a single file line. Their legs would walk together military-like and in unison, and their energy captured all of the attention of everyone in the bank, including our bank customers. People had a hard time keeping their eyes off of them.  The dad came directly to my teller line and was a foot in front of me. His eyes matched the rest of the family- dark, large pupils, and I felt like he was staring into my mind. I can't explain it. The family stood directly behind him and stared at me the entire transaction as well, without saying a word. The father had a muffled English voice. Once the transaction was over, the family turned and walk in a single file line out of the branch.  This happened an additional time that I can recall, but the dad did not come to my teller line. However, the family had everyones attention throughout the entire transaction once again.  This happened a few times, and all of my friends can recall up to 4 separate times they entered the branch.  None of us can remember their names, their accounts, or anything. We never thought to take a picture. The only reason I can give as to why we didn't document it, was because of the attention they grabbed from us, and how shocked we were after each encounter. It was strange and indescribable.  They all wore red garments.",
      "link": "http://www.nuforc.org/webreports/151/S151455.html",
      "state": "TX",
      "duration": "10 minutes"
    }
  ]
}