{
  "city": "sanfrancisco",
  "fetch_timestamp": "2025-07-12T14:19:08.645790",
  "record_count": 141,
  "pages_fetched": 7,
  "api_calls": 8,
  "source": "ufo_aficionado_api",
  "records": [
    {
      "_id": "64d005f478aba2ec5a3b434f",
      "summary": "LIGHTS FLYING OVER SAN FRANCISCO",
      "city": "sanfrancisco",
      "shape": "light",
      "date": "2006-05-15T00:00:00",
      "story": "LIGHTS FLYING OVER SAN FRANCISCO ON MARCH 12 2006, ME AMD MY FAMILY SAW 15 OR MORE FLASHING LIGHTS IN THE SKY, THEY LOOKED LIKE BALLES OF LIGHT THAT WAS FLYING AROUND. THEY WERE FLYING TOGETHER IN A CIRCLE, THEN THEY FLEW APART.LIKE IN A FLOCK OF BIRDS. THEN THEY FLEW APART FLYING IN DIFFERENT DIRECTIONS. IN TWO DIFFERENT GROUPS THEY FLEW AWAY OUT OF SIGHT. THEN WHEN IT WAS ALMOST OVER THEY FLEW TOGETHER OUT OF SIGHT IN TO THE CLOUDS. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/049/S49585.html",
      "state": "CA",
      "duration": "20"
    },
    {
      "_id": "64d005f478aba2ec5a3b509d",
      "summary": "Circlulating lights, pulsating yellow squares",
      "city": "sanfrancisco",
      "shape": "disk",
      "date": "2006-12-14T00:00:00",
      "story": "Circlulating lights, pulsating yellow squares I find it hard to believe that I am so far the only person in San Francisco to report this (I can't find any account of this online anywhere), and I've never seen a UFO before and didn't really believe in them up until this, but I have no explanation for what I saw.  I first saw it out of the corner of my eye as I was reading a book as it passed over our apartment, and went to another window the check it out. It flew steadily with yellow/orange lights on its rim that circled intermittently like a neon sign. It has two small red lights on one side that didn't blink. There was also a sequence of rectangles on its underside that pulsated out from its center like this: [[[[ ]]]].  It flew steadily over the city and out of sight, at one point passing a plane that seemed to take no notice. But seeing it juxtaposed againt what was obviously an airplane made it seem even stranger looking. ((NUFORC Note:  Witness elects to remain totally anonymous;  provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/053/S53873.html",
      "state": "CA",
      "duration": "5 mins."
    },
    {
      "_id": "64d005f478aba2ec5a3b5197",
      "summary": "glowing ball just under the surf about 2 1/2 feet off the beach south of san francisco/ocean beach approx 9/94",
      "city": "sanfrancisco",
      "shape": "sphere",
      "date": "2006-10-30T00:00:00",
      "story": "glowing ball just under the surf about 2 1/2 feet off the beach south of san francisco/ocean beach approx 9/94 a friend and i were walking her dogs along the bluff overlooking the water just south of ocean beach.  it was getting dark and we noticed a glowing object about the size of a basketball in the surf.  we assumed it was garbage and phosphersence but it was a perefct orb shape.  it then seemed to stop breifly before it began to pace us about 2/12 feet off the beach moving south.  we watched it for several minutes trying to figure out what it was.  when we determined it was now moving south she then became so scared she ran to the car.  I caught up to her as she was heading back to the small parking area. before we got there we saw a white jeep cherokee that we assumed was a park service vehicle there about the thing we saw. as we got closer we found the driver door opened and the vehcle running with it's headlights on. there was another couple by thier car and we asked about the jeep and they said someone must've fallen off the bluff or something.  there was nothing in the paper about any accidents and there was never anything reported about that evening.  we have never forgotten that incident and we've never seen anything similiar before or since. ((NUFORC Note:  Witness indicates that the date of the incident is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/052/S52418.html",
      "state": "CA",
      "duration": "10-15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b51ad",
      "summary": "Boomerang Shaped Objects w/ dark & light color scheme",
      "city": "sanfrancisco",
      "shape": "triangle",
      "date": "2006-10-30T00:00:00",
      "story": "Boomerang Shaped Objects w/ dark & light color scheme It was a sunny Sunday afternoon and we (4 of us) were watching football in my friend's 2nd floor apartment in the Richmond Dist.  I spotted two men on the street below looking upwards and pointing.  We all thought they were looking up at one of the windows in the apartment building across the street.  My buddy yelled down to them \"what are you looking at you perverts\".  They looked up and shouted back \"wholly shit....do you see it too?\".   They were both almost hysterical. One of the men had a small eye piece he was looking through.  He tossed it up to us so we could see for ourselves.  There was a boomerang shaped craft way up in the sky.  It remained motionless as white puffy clouds were passing underneath. You could barely see it without the eyepiece. Then one of the guys said \"look, there's more\".  Sure enough we could see 2 then 3....I counted 4 total.  All the same shape hovering close to one another.  They all seemed to have the same segmented color scheme. A dark band followed by a light color band followed by another dark band.  Kind of like a bumble bee.  We all went out onto the street and continued watching the craft. No one had a camera so we began stopping people on the street and pointing out the objects to them. I guess this was an attempt to prove to ourselves we weren't crazy or seeing things.   After a while of watching & telling people, it was weird, there was nothing else we could do.  Eventually we went back up stairs and I continued looking back up in the sky to see if they were still hovering. I looked up the last time and they were gone.  We never saw them zoom off...they just disappeared.  I found this site while surfing the new google video search engine. When I did a search by date and saw a similar sighting on the same day in NY I had to post this.  This was very real!  It was in broad daylight on a clear day and the objects were seen by several people.",
      "link": "http://www.nuforc.org/webreports/052/S52364.html",
      "state": "CA",
      "duration": "30 min"
    },
    {
      "_id": "64d005f478aba2ec5a3b51e9",
      "summary": "I and the Bridge of The Uss Abraham Lincoln  witness  a U.F.O of the coast of Northern California..",
      "city": "sanfrancisco",
      "shape": "light",
      "date": "2006-10-30T00:00:00",
      "story": "I and the Bridge of The USS Abraham Lincoln  witness  a U.F.O of the coast of Northern California.. On the above date I was stationed on The USS Abraham Linclon.   One particular night I was on low visibility watch due to rain in the area.  I would estimate we where about 20 miles north of San Francisco when this incedent happened. When on watch that  night I witness a flash of light about 2 o clock up into the night sky.   About in 10 seconds later I witnessed the same flash moving in a counter clockwise movement.  I called up to the bridge and ask if they had any air contact on there radar. They answered negative.  I noticed after the bridge that the light continued in the same direction.  I estimated by the intervals in of flashing light that the object would be directlly in front of the ship.  At that same moment the bridge began yelling  \"We have surface contact!  Do you have a visual!  I answered negative, I see no surface contact.   Then in an instant, the surface contact disappeared.",
      "link": "http://www.nuforc.org/webreports/051/S51548.html",
      "state": "CA",
      "duration": "5-10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b5300",
      "summary": "101 freeway South of S.F.  mysterious lights, orbs of intelligent energy being captured ..  what was that?",
      "city": "sanfrancisco",
      "shape": "sphere",
      "date": "2006-10-30T00:00:00",
      "story": "101 freeway South of S.F.  mysterious lights, orbs of intelligent energy being captured ..  what was that? we traveled into s.f. 101 frwy.( about 1 hr.away ) i saw a tree line from the car we sped past .. looking into the distance (up to 1/2 mile) there were intelligent balls of light being produced from the ground .. people were pulled off the side of the road squatting to collect these things.. saw about 15 there.. then we came up to a huge facility that was installed into a 5 mile long mound.. there were many trucks and freight being hualed into and out of the plant.. during the pass of this site. i saw many machines (ATV LOOKING) being controlled by humans to collect and keep these balls of intel lights.. it seemed the orbs wanted to escape being captured.. i heard a sound being sent to me in the sense of a call for help, but i could feel the stress of the things as they were being pulled from the ground.. the orbs changed all colors and intensity of light..but the  chase was on. the teams of human collectors was up to about 10 per team and i saw about 10 teams, spread out over a 2 mile space after the huge mountain above ground base.. it was none the less strange and i cant imagine what was the true intent of theses events.. looking out of a speeding car i witnessed this and so did the guy sitting next to me. no words just a very strange vibe..hmm  101 freway travel to wonder bout. Love ((NUFORC Note:  Witness indicates that the date of the incident is approximate.  PD)) ((NUFORC Note:  Witness elects to remain semi-anonymous;  requests no contact.  PD))",
      "link": "http://www.nuforc.org/webreports/051/S51755.html",
      "state": "CA",
      "duration": "5 mins"
    },
    {
      "_id": "64d005f478aba2ec5a3b5395",
      "summary": "Object with bright light above San Francisco accelerated towards my plane at impossible speed for a normal aircraft",
      "city": "sanfrancisco",
      "shape": "light",
      "date": "2008-06-12T00:00:00",
      "story": "Object with bright light above San Francisco accelerated towards my plane at impossible speed for a normal aircraft On Sun Feb 17 2008 I was flying into SFO from Toronto on AC755. The time was about 10-15 minutes before our scheduled landing time of 7:52 PM, which would make it around 7:30-7:45 PM. We were flying over land that was spotted with some bodies of water. I was sitting on a window seat on the left side of the plane so I assume I was looking south. Here is a picture I found on the net that is similar to the view I had:  http://www.factionfive.com/blight/uploaded_images/DSC02804-771617.JPG. I would guess we were about 10,000 feet high, but perhaps someone more knowledgeable can estimate the height given the information above.  I was admiring the view when I noticed a light that was noticeably brighter than the other city lights coming from an object above a small body of water (like a small lake).  The shape appeared to be a sphere but I can't be sure as it was far away.  It was unusual enough to keep my attention. The light was a bright yellowish white but seemed to change to a bluish white and did not blink. It was moving very slowly so at first I thought it could be a helicopter. After observing it for about 30 seconds I felt it was not a helicopter and was definitely not a plane. What happened next is why I think it is worth reporting as a UFO; the object started to accelerate at a geometric rate. It quickly sped up and flew up towards the plane and passed below and in front of us in about 2-3 seconds. If I had to guess, I would say the object was 15,000 feet away when I first saw it over the lake and it came within 2000 feet of the plane when it passed under and front of my view. I may have the absolute distances wrong but the relative distance (2000:15000) is about correct.  The point is the object appeared to accelerate from almost nothing to beyond 1000 mph in about 2 seconds.  It happened so quickly and I was in disbelief by what I saw. I looked around at the other passengers hoping that someone else saw it but no one appeared to have. I recall a red glow on the lower half of the object but I am not confident about this particular detail (this happened over 3 months ago) but the rest I am confident of what I saw. I have never reported a UFO before. I would like to know if anyone else saw this.",
      "link": "http://www.nuforc.org/webreports/063/S63558.html",
      "state": "CA",
      "duration": "60-90 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b546f",
      "summary": "San Francisco man, then 22, reported details of 1963 abduction to friend.",
      "city": "sanfrancisco",
      "shape": "disk",
      "date": "",
      "story": "San Francisco man, then 22, reported details of 1963 abduction to friend. This is a second party report of a UFO abduction which occurred in about 1963.  The abductee was about 22 years old at the time. He told the story to another person approximately in 1965, who first recounted it to me about two years ago. It is of high interest because the abductee apparently was able to remember the event in extreme detail. He worked as an outside salesman at the time of the abduction event, perhaps the reason he was not noticed as missing by person who knew him. The abductee said he was missing for three days. He described the abductors as being small \"people\" with large heads and large eyes. He considered them to be performing \"medical experiments\" on him. Evidently, he believed the abductors to be able to communicate telepathically, and reported that they conveyed to him that they would be contacting him again every 10 or 15 years. The abductee told the person who reported this story to me that his father owned a drugstore chain in San Francisco. Recently, my source talked to me again about this story, and recalled that he said that his family attended Temple Baptist Church in San Francisco. Evidently, he got married at Temple Baptist Church about in 1966. He was described as being of medium height and slim build, and a Scandanavian ethnic type with blond hair. I am not personally in a position to investigate this story since I do not live in the San Francisco Bay Area anymore or in California at all, but I think a good investigator could make quick work of finding out who this person was. If he is still alive, I imagine he would be willing to talk. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/057/S57316.html",
      "state": "CA",
      "duration": "3 days"
    },
    {
      "_id": "64d005f478aba2ec5a3b558d",
      "summary": "Abduction case,with 1 twist. Aliens left  unearthly communications object as proof of contact!  500 Lights On Object0: Yes",
      "city": "sanfrancisco",
      "shape": "other",
      "date": "2007-11-28T00:00:00",
      "story": "Abduction case, with 1 twist.  Aliens left  unearthly communications object as proof of contact!   Person driving home in typical big metropical city. Stopped at red light.  Suddenly very bright light overhead, loss of awareness. Person on alien chraft being spoken to, in various languages, and noise types. Aliens tried to explain themselves and purpose. Aliens, which were humanoid in appearance,then led person to observation point in chraft, gestured to look out.  Person is flying high in atmosphere/space looking down at planet earth.  Then person given an object, property of Alien origen.  Purpose of object,was a communication device, and given instructions on proper use.  Loss of awareness, person  at home. Person quit job,did not eat, come out!  Wrapped up object,put it in box, hid away. Person's son S.F.P.D. Give me description of object etc.,etc., I'll give more info! ((NUFORC Note:  Date may be approximate, although the witness does not indicate that fact.  PD))",
      "link": "http://www.nuforc.org/webreports/059/S59733.html",
      "state": "CA",
      "duration": "2-4 hours"
    },
    {
      "_id": "64d005f478aba2ec5a3b576a",
      "summary": "2 luminous triangular shaped objects pulsating white and blue lights in sky for 3 to 4 minutes.",
      "city": "sanfrancisco",
      "shape": "triangle",
      "date": "2008-06-12T00:00:00",
      "story": "2 luminous triangular shaped objects pulsating white and blue lights in sky for 3 to 4 minutes. 4/17/08 At 1:35 pm I was looking out my living room window and saw 2 objects that did not resemble any airplane or helicopter. I picked up my binoculars to get a better look and saw 2 luminous triangular shaped objects with pulsating white and light blue lights I'm not sure how far apart they were from each other. I watch them hover for approximately 3 to 4 minutes moving slowing higher into the sky until I could no longer see them.",
      "link": "http://www.nuforc.org/webreports/063/S63381.html",
      "state": "CA",
      "duration": "4 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b5dbe",
      "summary": "Egg shaped object over San Francisco",
      "city": "sanfrancisco",
      "shape": "egg",
      "date": "2007-02-01T00:00:00",
      "story": "Egg shaped object over San Francisco Around 5 pm, I was exiting the freeway (280-S)via the Geneva / Ocean off-ramp.  I caught the red light - so I was at a complete stand still.  I was facing southwest.  The sky was relatively clear.  I noticed this grey egg shaped object - flying west to east.  It had no wings - no tail.  At first I thought it was a helicopter - but it did not have the necessary parts (main rotor, tail rotor, etc.) - it was egg-shaped.  It wasn't a plane - it had no wings or tail.   I was at the stoplight for approx. 2 minutes.  In that time, it flew from my right(west)to my left (east)and continued eastward.  I am not able to determine speed - I did not hear any unusual noise - no was there any trace of a trail - there were no lights or beams coming from it either - and there were no other aircraft around it.  There was a woman in the car next to mine - she rolled down her window - I know she saw it - her mouth was wide open - and she stuck her head out to view it.  There was no time to share information - as soon as the light turned green I had to move fast.  I called the San Francisco Chronicle and reported it.  I have scanned the local papers and even Googled ever since -  but it apparently didn't make the news.",
      "link": "http://www.nuforc.org/webreports/054/S54393.html",
      "state": "CA",
      "duration": "1-2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b5ea3",
      "summary": "Steady light, stopping, and changing direction in the sky.",
      "city": "sanfrancisco",
      "shape": "light",
      "date": "2008-03-04T00:00:00",
      "story": "Steady light, stopping, and changing direction in the sky. Appeared like a satellite at first, heading north to south. Dull, steady, faint light, close in magnitude to Polaris. At about 60 degs from southeast horizon, the light stopped, paused, circled and then started heading due west at an accelerated speed. Light eventually disappeared behind a building. Sky was clear, no clouds. Was just a single steady light. 2 other witnesses next to me saw it after I pointed it out to them when the light paused. They saw it circle and then head off at an accelerated speed.",
      "link": "http://www.nuforc.org/webreports/060/S60249.html",
      "state": "CA",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3b5f38",
      "summary": "Bright red luminous round light seen moving slowly over SF Bay.",
      "city": "sanfrancisco",
      "shape": "light",
      "date": "2008-06-12T00:00:00",
      "story": "Bright red luminous round light seen moving slowly over SF Bay. We would like to report seeing a bright red luminous light in the sky over SF Bay last night about 10 pm.   We watched it for about 15 minutes as it moved slowly across the sky and were able to get about 2 1/2 minutes of video of it.  We saw a bright red luminous light much brighter and larger than  a star moving extremely slow across the Bay.  When we first noticed the light from our workshop at Hunter's Point Shipyard it was stationary over the SF Bay between SF and Oakland.   It was a very bright red light that didn't blink on and off.  It stayed the same intensity of red the entire sighting until a jet plane flew near it at which point it blinked completely out.  A second later it reappeared but at a much less intensity of brightness.  It blinked completely out again then reappeared a second time even less intensely for an instant then blinked out again and never reappeared.  The entire time we watched the light we could not hear any sound coming from the light.  It was moving much too slowly to be a plane or meteor.  If you want to view the video feel free to contact us.",
      "link": "http://www.nuforc.org/webreports/063/S63060.html",
      "state": "CA",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b603c",
      "summary": "Two solid, bright, sphere shaped objects flying erractly and fast over Pac Heights, San Francisco.",
      "city": "sanfrancisco",
      "shape": "sphere",
      "date": "2008-06-12T00:00:00",
      "story": "Two solid, bright, sphere shaped objects flying erractly and fast over Pac Heights, San Francisco. Two solid, bright, sphere shaped objects (both larger then a traditional helicopter in total mass) were flying over the Pacific Heights hill area, traveling from East to West. Initially, they appeared to be at 1,000 feet. They were moving about 200 mph, with one object trailing the other. Then the two bright objects began taking their own path, seeming to moving in a wave like motion, I yelled to my partner to look at them, then they moved into the light fog, which made them more noticeable due to the shimmer of round bright light reflecting in the fog. Then, they began to pick up speed, each taking two different paths, the front object rose in altitude rapidly and shot out toward Golden Gate Bridge and disappeared. The second object remained visible for about 3 additional seconds as it appeared to fly away at a lower altitude in more west then the prior. The weird thing was that the round pulsing light object seemed to get brighter in size as it speed off and dissipated into the fog.  These were no traditional aircraft. Secondly, they were not spot lights from the surface to the sky, they were fast moving, silent and erratic flying craft. They did not make normal flight patterns or aerial movements.",
      "link": "http://www.nuforc.org/webreports/063/S63162.html",
      "state": "CA",
      "duration": "15 sec"
    },
    {
      "_id": "64d005f478aba2ec5a3b61ec",
      "summary": "3 intensely bright, very small points of light,     high in the sky,      unmoving for at least 30-45 minutes",
      "city": "sanfrancisco",
      "shape": "light",
      "date": "2008-01-21T00:00:00",
      "story": "3 intensely bright, very small points of light,     high in the sky,      unmoving for at least 30-45 minutes It was my niece's birthday party. We were at San Quentin village on the little beach. I looked up into perfectly clear blue sky and happened to see 3, very small points of brilliant white light. The lower 2 seemed to be one over the other and the top light was equidistant from the other 2, but to the left, about 15 degrees. The 3 lights were \"joined\" by 2 very thin, black lines. I asked my brother if he saw anything up in the sky, without showing him and he described what I saw. I then went over to my 21 y/o niece, and without describing to her what I saw, asked her. She described the same  lights. The 3 lights were due south of San Quentin Prison, and possibly directly high over San Francisco. It wasn't possible to estimate the distance - but they were, as best I could tell (I triangulated with a tree branch) motionless over the city (or at least in that direction). There was an air show down in South Bay that day and 2 military jets did do a low pass over us before we saw the 3 lights. We saw the 3 lights for 30 to 45 minutes and then as my brother and I were watching, they \"seemed\" to flit up and disappear. They left no vapor trails Their light was almost lazer-like, dazzling and just a pinpoint with some slight \"flaring\". I am also a pilot and can state that it wasn't a satellite, a plane, a balloon or blimp. About a year later, I ran into my sister-in-law's brother - and - he recounted that he, from the South Bay, was working on his house on the weekend and also had seen a series of, what he proceeded to describe, as the same type of lights and about the same time of the year. He described them as \"over San Francisco\". So, if they were the same lights, We both, from different locations, saw them over San Francisco. He is a pilot, also.",
      "link": "http://www.nuforc.org/webreports/060/S60821.html",
      "state": "CA",
      "duration": "30-45 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b66b5",
      "summary": "Small White Sphere Stops Above Transamerica Building and Then Floats Away",
      "city": "sanfrancisco",
      "shape": "sphere",
      "date": "2008-03-31T00:00:00",
      "story": "Small White Sphere Stops Above Transamerica Building and Then Floats Away From the 18th floor of a building in downtown San Francisco, looking North, I saw a small spherical object appear to float above the Transamerica building where it stopped for a couple of minutes before continuing on to the right and out of view, behind another building.   I had time to show a friend who upon seeing it joked, \"It must be uploading from the Pyramid Building.\"   I grabbed my camera and took a few pictures.  They show a fuzzy white dot.   This is the second time I have a seen a white object appear to float above the Transamerica Building.  The first was about a month ago.   It didn’t stop but moved at a constant rate.",
      "link": "http://www.nuforc.org/webreports/062/S62058.html",
      "state": "CA",
      "duration": "4 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b66ba",
      "summary": "Small White Object Flies Over Golden Gate Park in Slight Wave Motion",
      "city": "sanfrancisco",
      "shape": "sphere",
      "date": "2008-03-31T00:00:00",
      "story": "Small White Object Flies Over Golden Gate Park in Slight Wave Motion While playing tennis in Golden Gate Park, I saw a small white object approaching from the East and heading to the South.   I pointed it out to my three companions and then took some photos of it.   Players on another court noticed it too.  It moved in a slight wave motion, side to side, but always forward.   It moved quickly across the sky in a matter of minutes.",
      "link": "http://www.nuforc.org/webreports/062/S62059.html",
      "state": "CA",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b6753",
      "summary": "I saw three lights that stayed still, then moved with contrails and made a perfect row, again staying motionless in line.",
      "city": "sanfrancisco",
      "shape": "formation",
      "date": "2008-03-31T00:00:00",
      "story": "I saw three lights that stayed still, then moved with contrails and made a perfect row, again staying motionless in line. I was standing at a bus stop facing East (approximately).  Above the horizon, I first noticed a small white light which looked like a star, but there were no other stars visible in the sky.  In a moment I noticed an identical white light above and to the right.  It started to move and left a clear con-trail.   After a half minute the first light also started to move upward with a contrail.  They both stopped and stayed.  A third light was then seen above and to the right of both.  It moved down with a contrail and stopped so all three lights were in a perfect row, diagonal.  They stayed for at least a minute perfectly still with no contrails visible anymore.  At that time my bus came and I left, but as the bus circled around (about 3 minutes later) for one last view, I still saw two of the lights staying.  I took three pictures with a low res cell phone but I can't see anything on the images.",
      "link": "http://www.nuforc.org/webreports/062/S62062.html",
      "state": "CA",
      "duration": "6 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b6960",
      "summary": "Bright Boomerang Object in the Sky in San Francisco on November 3th  500 Lights On Object0: Yes",
      "city": "sanfrancisco",
      "shape": "other",
      "date": "2007-11-28T00:00:00",
      "story": "Bright Boomerang Object in the Sky in San Francisco on November 3th   It was around 5am on Saturday, November 3th.  I was on my friends roof having a late night night cap.    All of a sudden we both looked up and there was this bright light above us.  It looked like a bright colored boomerang.  It was a clear night so it stood out pretty well in the sky.    We also noticed a redish and green light underneath it.  The object made no sound.   We were so scared that we ran into my friends building and viewed it from her window.   The object stayed outside the window for 10 minutes.   We didn't want to watch this anymore so we decided to call it a night.",
      "link": "http://www.nuforc.org/webreports/059/S59643.html",
      "state": "CA",
      "duration": "20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b69b0",
      "summary": "UPDATED REPORT - PLEASE UPDATE PREVIOUS REPORT - THX - Triangle of lights flies over San Francisco",
      "city": "sanfrancisco",
      "shape": "triangle",
      "date": "2007-10-08T00:00:00",
      "story": "Triangle of lights flies over San Francisco I was on 3rd Ave between Clement and California St. in the Richmond District of San Francisco when I saw three lights overhead in a nearly equilateral triangle formation traveling west rapidly without making a sound. The lights were of equal brightness. They were not as bright as the lights of an airplane and were approximately the color and brightness of bright stars. If I remember correctly, they were white with a slightly blue tint. The lights traveled over the city from slightly north of my position to directly west of my position. At its closest, the triangle appeared to be twice the size of a full moon.  It took approximately seven seconds for the triangle to travel into the distance when I lost sight of it near the tops of the houses on the west side of the avenue. (I was standing on the sidewalk of the east side of the avenue.) The triangle appeared to tilt slightly as it traveled into the distance. There were two airplanes in the area at the time. One was to the southwest and one was to the northwest. Their lights were considerably brighter and one airplane was loud. They crossed the sky at a much slower pace and with noise. After I lost sight of the unusual lights, I wondered if they had slightly changed formation near the end of my sighting or if the appearance of such a change was the result of the change in my perspective.",
      "link": "http://www.nuforc.org/webreports/058/S58812.html",
      "state": "CA",
      "duration": "7 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b6a70",
      "summary": "3 bright lights in triangle pattern stationary over SF Bay",
      "city": "sanfrancisco",
      "shape": "triangle",
      "date": "2008-03-04T00:00:00",
      "story": "3 bright lights in triangle pattern stationary over SF Bay February 16th at 6:15 pm while driving towards San Francisco on Highway 280, 3 unconnected bright lights in a triangular pattern on my right caught my attention. By my estimate they seemed to be on the other side of the bay in the direction of Oakland. Having grown up next to the SF Airport I knew right away they did not look like the lights from any plane I have ever seen before. Looking back and forth from the road to the lights I noticed they were not moving. I watched them for approx. 20 seconds. After another glance they disappeared. I had a clear view of the sky but were unable to see the lights anywhere. The sky that evening was just starting to become overcast.",
      "link": "http://www.nuforc.org/webreports/061/S61693.html",
      "state": "CA",
      "duration": "20 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b6cfd",
      "summary": "High speed and dacing lights in the southern sky.",
      "city": "sanfrancisco",
      "shape": "light",
      "date": "2007-04-27T00:00:00",
      "story": "High speed and dacing lights in the southern sky. I was up early for work reasons just around 5:30 am. I was in my kitchen but had not turned on any lights yet. I was looking out the window and admiring a dark but clear morning with many stars and Jupiter plainly visible. My view was of the southern sky over San Francisco and the penninsula. I noticed a couple of jet airlines passing overhead and heard them faintly.  Still looking I noticed five or six smaller lights moving quickly from east to west in the same area of sky.  They moved in somewhat of a formation, that is they all seemed to be moving at the same speed but some of them changed position as they went and at such a speed that it almost looked like \"dancing lights\".  I know of no aircraft that could so easily change position at such a high rate of speed.  I heard no noise from them and after they passed my positon I ran to the front of my house to see if I could continue to watch them but the bright street lights blotted out anything I might have been able to see.  The whole episode took approx 10 seconds.",
      "link": "http://www.nuforc.org/webreports/055/S55866.html",
      "state": "CA",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b6d4d",
      "summary": "Coming from the South, going towards North/Northwest. Maybe arcing downward. Very bright white intense light. Moving fast, no sound...",
      "city": "sanfrancisco",
      "shape": "sphere",
      "date": "2006-07-16T00:00:00",
      "story": "Coming from the South, going towards North/Northwest. Maybe arcing downward.  Very bright white intense light.  Moving fast, no sound...  and, as large as the size of a nickel held at arms length.   Probably could have been seen traveling over the Pacific Ocean by other witnesses.  I wonder if this sighting was some failed rocket/missile launch from central/southern California.",
      "link": "http://www.nuforc.org/webreports/050/S50579.html",
      "state": "CA",
      "duration": "10 sec."
    },
    {
      "_id": "64d005f478aba2ec5a3b6d70",
      "summary": "Long and short flashes of bright yellow/orange in San Francisco southwest sky on 3/19/08.",
      "city": "sanfrancisco",
      "shape": "",
      "date": "2008-03-31T00:00:00",
      "story": "Long and short flashes of bright yellow/orange in San Francisco southwest sky on 3/19/08. In the early morning hours of 03/19/08 I just finished a brief trip to the restroom and was returning to bed when I noticed a bright flash of yellow from the window.  I walked closer to look and saw several smaller, quicker flashes of the same color in the southwestern sky over the ocean.   The light was of such an unusual color that I was concerned, and having served active duty in the Air Force, I considered the rate at which the quick flashes occurred to either be weapons fire or a lightening storm.  I’ve seen several lightening storms, and they were never of this bright yellow/orange color.  My gut felt it was weapons fire of some type, and a sense of dread had me grabbing my dogs and running under the covers.  I don’t scare easily, but I was scared.   I told myself I must be wrong, overreacting, or half-asleep, and that I would see on the news in the morning that it was simply lightening.  No such incident was reported on the morning news, and nothing found on an internet search.   I know what I saw, and had to tell the truth in case somebody else noticed it or knows what it was and could explain it to me.",
      "link": "http://www.nuforc.org/webreports/062/S62241.html",
      "state": "CA",
      "duration": "20 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b6e38",
      "summary": "solid, white object seen over S. F. Bay in high atmosphere, momentarily stationary",
      "city": "sanfrancisco",
      "shape": "circle",
      "date": "2008-06-12T00:00:00",
      "story": "solid, white object seen over S. F. Bay in high atmosphere, momentarily stationary On Sunday June 8, 2008 my friend and I had just gotten out of a local museum, and were lying in the grass in Union Square (downtown San Francisco) from about 4-5:15 pm soaking up some sun. As we were lying there chatting, I noticed what I first thought were balloons (or a balloon) directly up into the sky close to the position of the moon.  After watching it for about five minutes wondering what it was, I determined that it wasn’t moving around like balloons might on a windy day at high altitude (it’s been fairly windy in S.F. these past few weeks), and it was also too close to be a star or planet.   I finally pointed it out to my friend, and he also suggested it was a balloon.  As we continued chatting, the object slowly began to pick up slight velocity drifting towards the horizon (towards the south), away from the position of the moon.  After about 10 minutes of drifting, the object appeared to look like a hyphen (it looked like a ball before), and I pointed this out to my friend.  Eventually we lost track of the object, and kept on with our conversation.  A few minutes later, I again looked back up towards the moon, and the object (or another object) reappeared to the location where we saw the first object.  I again pointed it out to my friend, and we both thought it was odd that earlier it had slowly drifted towards the south, and was now instantly right back where it started.  We left shortly after, not thinking too much about the whole thing.  The reason why I am posting this is because this morning on the news there was a short segment on an object that was observed (by whom I don’t know) Sunday afternoon over San Francisco Bay, and the news clip featured a video of the same object that we had seen.  The segment didn’t say much about what the object was, just that the F.A.A. had taken notice.  I am assuming many people had seen it if it had been featured on the Monday morning news, and was described on the news to have moved from above one city to another.  From my own observations, I can describe the object as white (non-metallic), not emitting light, larger than the size of Jupiter or Venus in the night sky, and fairly circular (upon our first observation).  The object appeared stationary at first (the object did NOT get smaller as a balloon would upon rising), but later drifted across the sky (faster than planets and stars appear to move at night, but much slower than man-made satellites move).  The object did not appear to change change size as it moved away, but did appear to look more liner as it drifted away.  It was definitely not an airplane (it was close enough so that we could resolve its outlines and determine a circular shape from our perspective), and looked very solid.  The whole experience did not seem very normal, and I am greatly wondering how many other people saw it, and what it may have been.",
      "link": "http://www.nuforc.org/webreports/063/S63788.html",
      "state": "CA",
      "duration": "approx. 25 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b6e9a",
      "summary": "4 white lights high up in the sky over San Francisco",
      "city": "sanfrancisco",
      "shape": "light",
      "date": "2006-10-30T00:00:00",
      "story": "4 white lights high up in the sky over San Francisco I noticed 1 bright white light very high up in the sky.  After watching, it became two bright white lights that spun around in circles very quickly.  As we continued to watch the lights spin around each other, two more white lights came in on different paths and looked as if they were going to join the two spinning lights.  They formed a very tight triangle, then the two lights then passed the spinning lights and all lights lined up in a perfect line, finally the spinning lights vanished leaving the two lights that remained motionless until dusk and then blended in with the stars.",
      "link": "http://www.nuforc.org/webreports/052/S52524.html",
      "state": "CA",
      "duration": "45 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b6f46",
      "summary": "Two Bright Purple lights fly strangely through clouds over San Fransisco State University",
      "city": "sanfrancisco",
      "shape": "light",
      "date": "2006-10-30T00:00:00",
      "story": "Two Bright Purple lights fly strangely through clouds over San Fransisco State University I am a freshman at San Fransisco State University. I was lying in my bed on Sunday night (early Monday morning) around 2:07 a.m. when I turned my head around to look out the window (my bed is facing away from the window, but is right next to it), I started to notice that I could see some of the major stars that night which was rare. Because it is usually always cloudy here at State, but the last couple of days have been pretty clear sky and ok visibility at night which allowed me to only see the very bright stars in the sky... After looking for about a minute I saw these two lights in the distance that looked like planes at first, but became much similar in size and appearance as the stars around them. But these two objects were coming straight towards my direction (still very far away and high altitude). After flying side by side they satrted to cross paths simultaneously in kind of a figure-8 type motion. while moving very quickly, and traveling very fast.. they stopped in mid-air for about 2 seconds.. At this point, I thought it was just my eyes and maybe I had been sitting for too long. but I adjusted my eyesight, even moved closer and away from the window. I know what I saw.. It was so amazing.. Then the two lights faded into a purple-pinkish color and started moving and crossing paths again in a way that defined the laws of gravity. They would squiggle for a second, then they casually coasted through the clouds and started whisking away parallel with my window (still far away)..and as they flew away they would travel while continuously fly over eachother and then cross paths like they were joy-riding or something. it sounds weird, but it was quite beautiful, it was almost like they were dancing at one point, i was so excited and amazed by it. I followed them with my eyes as they zipped very quickly away into the clouds. There is no way this could have been any commercial or military aircraft because of its color, comlexity, speed, and it's very odd way of manuevering.. I had never ! seen a U FO in my life until now. I don't do drugs and I wasn't drunk. I just had to get my story out. I wanted to know if anyone else saw something similar to this in the San Fransisco Area on September 18 around 2:00 AM....",
      "link": "http://www.nuforc.org/webreports/052/S52546.html",
      "state": "CA",
      "duration": "about a minute"
    },
    {
      "_id": "64d005f478aba2ec5a3b6fab",
      "summary": "One triangular, or arc shaped illuminated object moving arbitrarily south to north.",
      "city": "sanfrancisco",
      "shape": "triangle",
      "date": "2007-04-27T00:00:00",
      "story": "One triangular, or arc shaped illuminated object moving arbitrarily south to north. One illuminated object, triangular but muted by light, moving arbitrarily in the sky. a sort of semicircle over head and a crossing from south to north direction, out of sight",
      "link": "http://www.nuforc.org/webreports/055/S55974.html",
      "state": "CA",
      "duration": "3 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b706e",
      "summary": "Three amber ovals quicly transited the sky above San Francisco in loose formation at high altitude",
      "city": "sanfrancisco",
      "shape": "formation",
      "date": "2008-02-14T00:00:00",
      "story": "Three amber ovals quicly transited the sky above San Francisco in loose formation at high altitude Witnessed three amber colored oval shapes move across the horizon from East to West directly above San Francisco. They appeared to be at very high altitude and so were two or three times as large as the biggest stars in the sky. They were amber in color but it was more of a glow than a direct light source. They moved very quickly, much faster than any conventional aircraft as they went from the edge of the eastern horizon to the western skyline in about one minute. The objects flew in formation, but were constantly moving around one another in erratic sideways and diagonal movements that conventional aircraft are incapable of. While the movements were erratic they did seem coordinated and with purpose. ((NUFORC Note:  Witness elects to remain totally anonymous;  provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/061/S61429.html",
      "state": "CA",
      "duration": "60 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b729d",
      "summary": "I saw two \"stars\" shoot across the sky one after another - one vertically, the other at a 30 degree angle.",
      "city": "sanfrancisco",
      "shape": "light",
      "date": "2008-01-21T00:00:00",
      "story": "I saw two \"stars\" shoot across the sky one after another - one vertically, the other at a 30 degree angle. My husband and I were driving from Brooks, CA to our home San Francisco, CA.  He was driving, and I was on the passenger side.  I was staring out of the window, because it was dark and I had never seen so many stars at once.  Suddenly one of the \"stars\" shot vertically straight down and out of my line of sight, almost like a bullet.    Immediately afterward, a second \"star\", which was very near the first one, shot to downward and diagonally to the right at about a 30 degree angle.  Both disappeared out of my line of sight, as if past the edge of the Earth.  I told my husband, who used to study astronomy, and I asked him whether comets move like that.  He said no.  I didn't think about it again until I saw the Larry King Live report on mass sightings, so I thought I'd report it.",
      "link": "http://www.nuforc.org/webreports/060/S60987.html",
      "state": "CA",
      "duration": "seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b72ed",
      "summary": "Bright lights, three horizontal rows, maybe ten lights across each row, each light was bigger and brighter than any star.",
      "city": "sanfrancisco",
      "shape": "changing",
      "date": "2008-02-14T00:00:00",
      "story": "Bright lights, three horizontal rows, maybe ten lights across each row, each light was bigger and brighter than any star. I was walking my dog at around 7:30 in the evening; my dog is old so we do a lot of standing not so much walking. I was looking up at the stars because it was a very clear night and to the east is the Oakland Airport, so there are always lots of planes to see.  All of a sudden to the northeast, I saw bright lights, which seemed to appear from nowhere and made the few plans in the sky look like distant stars. As they got closer, which took only 20 seconds or so, It looked like it could possibly be round, there were three rows of horizontal lights, maybe ten across on each row, each light five times bigger than the brightest star. They were not flashing, but at one point it seemed to turn, so the lights appeared to rotate slightly and the shape of the object changed into a wide V shape,I called out to my husband but by the time he got outside it had disappeared behind a building and I didn’t see it again.In all it lasted about a minute.I was looking east,it apeared from the northeast and it traveled south.  I have never personally seen a UFO, my husband has, and I’ve always laughed at his description and told him it was just a plane, or possibly a star. I have lived here for nine years and the 7:30 dog walk is a nightly routine, and I have never seen anything like this.  My husband just came in and dragged me outside to look at another “UFO”…it was a star.",
      "link": "http://www.nuforc.org/webreports/061/S61517.html",
      "state": "CA",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3b7483",
      "summary": "observed v-shaped formation moving from ENE to W over evening sky for approx 10seconds",
      "city": "sanfrancisco",
      "shape": "formation",
      "date": "2008-03-04T00:00:00",
      "story": "observed v-shaped formation moving from ENE to W over evening sky for approx 10seconds My wife and I were outside on our deck looking at the constellations.  Our deck faces northern sky and has unobstructed views of the SF bay.   We observed a v-shaped formation of about 9 to 11 lighted objects moving from ENE in a general W direction at approx 65degrees above horizon.  The objects appeared distinct and moved relative to each other but maintained the general shape of the formation taking approximately 10 seonds to move across the sky.   The night was warmer than typical and sky clear;  the brightness of the individual objects equivalent or slightly fainter than average star that evening.",
      "link": "http://www.nuforc.org/webreports/062/S62035.html",
      "state": "CA",
      "duration": "10 sec"
    },
    {
      "_id": "64d005f478aba2ec5a3b78a5",
      "summary": "Blimp shape with red marking or door on the side?",
      "city": "sanfrancisco",
      "shape": "other",
      "date": "2007-02-01T00:00:00",
      "story": "Blimp shape with red marking or door on the side? A friend of mine and I were on an incredible bike ride through a somewhat busy street in the middle of the Presidio Park on our way to the Golden Gate Bridge.   At that moment I was riding by myself, no one around me and my friend ahead of me about 75 yards.  The trees block your view of the bridge and water every now and then, but when the tree line opened up I took full advantage of my chance to get a nice view of the bridge and the bay while still riding.   At that moment I looked to my left to view the bridge and the surrounding hills across the bay, I then saw an object that is hard to explain.  At first I thought it was a coast guard helicopter but this object was round and floating still.  It was a blimp shape with a slight edge on each side forming kind of a saucer, but it was more blimp like in shape, definitely shiny metal.   The thing that stood out the most was a red marking of some type, looked like a red door on the side of it or something.   I was going really fast on the bike at that moment and the tree line blocked my view of it, yelling for my friend to stop, I explained to him that I had just saw something odd, we headed to a side road to get a view of where I saw it, he thinking I've lost my mind at that moment, and me too, it was gone, of course!  I'm hoping someone has seen what I saw that day and reports something similar because it was floating about the same height as the top of the bridge, and was near the bridge on the east side.",
      "link": "http://www.nuforc.org/webreports/054/S54885.html",
      "state": "CA",
      "duration": "5 Seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b7a98",
      "summary": "black triangles were seen flying across the surface of the full moon",
      "city": "sanfrancisco",
      "shape": "triangle",
      "date": "2006-10-30T00:00:00",
      "story": "black triangles were seen flying across the surface of the full moon I was looking at the full moon through my telescope (Mead-Model 70AZ-AR)when I saw a small black triangle fly from left to right horizontally across the face of the moon.  It lasted about two seconds and once the triangle passed the lighted moon surface, I couldn't see it anymore. It looked, from what I could see, to be just a dark black surface- no lights on the object but with clear lines defining its triangle shape against the lighted surface of the moon.  About 5 minutes later another black triangle moved over the moon's surface from bottom to top.  This second black triangle moved much quicker, about a second or less, with the same black surface and clear lines.  Approximately 3 minutes later, another black object moved diagonally across the upper left hand side of moon's surface from left to right, very quickly, faster than the first two objects.  The third object was moving so fast that it looked to be more like a sphere, but with the same deep black color.  It was the color that I could clearly see against the moons surface.  All three objects had clear lines against the backdrop of the moon and dissapeared once they had passed the moons surface.  The first two objects had a clear delineated shape of a triangle against the moon's surface.  The third object was more of a definate color, a deep black against the moon, but not having as clear of a shape as the first two, due to its' was moving so fast.  The first two objects were the same size, the third looked a little smaller. I am currently a graduate student in psychology.  I couldn't sleep that night-but I was awake and lucid. I had been up around that time for the past three days writing papers.  I had gotten used to being up and awake around that time, so I wasn't surprised that I was awake.  It takes me a couple of days to get back to sleeping normally after I finish a big project.  Since I was up, I decided to take out my telescope and enjoy the full moon.  I had been looking at the moon, trying different lenses, trying to find different landmarks for about 10 minutes or so when I saw the first black triangle.",
      "link": "http://www.nuforc.org/webreports/052/S52889.html",
      "state": "CA",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b7ad0",
      "summary": "I sow one big bright light in the sky",
      "city": "sanfrancisco",
      "shape": "light",
      "date": "2007-02-24T00:00:00",
      "story": "I saw one big bright light in the sky. The color of the light bright object was - light cream. That day I run North on the Ocean Beach path and looked cross the San Francisco Bay to the hills in Marina county. Size of the object was (big) like size of the bright sun. The ages of the object had a little sparkling. The bright object move to the right slowly. After 2-3 min. object move to the left slowly. The light was bellow the top of the hills. Day was sunny, a little bit fog, but I could see the hills of the Marina county clearly. I looked at that bright object more then 10 minutes. After that object started  getting smaller, smaller, smaller and disappear from my vision. My time was approximately between 11:45 am and 1:30 pm. I never see the object like that!  All week, I try to find any information about it from the local newspapares and news.  I didn’t find any imfromation. ((NUFORC Note:  Witness indicates that the date of the incident is approximate.  PD)) ((NUFORC Note:  Witness elects to remain totally anonymous;  provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/055/S55342.html",
      "state": "CA",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b7bdb",
      "summary": "At roughly 10:10pm, on Tuesday, October 17, 2006, I went outside to have a cigarette. The observations that follow took place while I",
      "city": "sanfrancisco",
      "shape": "other",
      "date": "2006-10-30T00:00:00",
      "story": "At roughly 10:10pm, on Tuesday, October 17, 2006, I went outside to have a cigarette. The observations that follow took place while I was standing approximately 30 feet above the ground, on the back staircase of my apartment in San Francisco, California.  Almost immediately after walking onto the staircase, I noticed what quickly revealed itself to be a large bird, probably a bird of prey, flying from the Northwest to the Southeast, perhaps 100 feet above me. It was an unusual sight; as far as I know, birds are diurnal creatures. I could see the bird clearly and made a mental note that this was probably a result of the city lights reflecting. I watched it pass above my head.  Just as the bird had passed directly above me when I was distracted by something in the sky traveling in almost precisely the opposite trajectory as the bird. My most immediate thought was that I was looking at an airplane. The object passed directly over the bird I’d been watching, traveling in what looked to be exactly the opposite path.  It’s difficult to reconstruct the order of my impressions of the object. I will do my best.  My first unusual impression was that I couldn’t identify the sound.  At the time I thought little of it, but in the way that one tries to identify the sound of an aircraft (\"Is it a plane?\" vs. \"Is it a helicopter?\")  I came up empty. The sound was a mechanical, aeronautical sound that (I am trying not to characterize this retrospectively) that was close to that one would expect from a jet airplace than that of a helicopter, but was not the sound of an airplance nevertheless. It was an industrial, aeronautical sound that I could not decisively identify.  I had what I must in fairness describe as a mild sense of confusion driven by the fact that in addition to my inability to precisely identify the sound I was hearing, there was something not familiar about the color and intensity of the lights themselves. Given the volume of the sound (Again, I am describing as best I can thoughts and impressions that occurred in fractions of a second in real time) I had the impression that the aircraft was higher than the bird I’d been watching but low enough to make a strong sound--less than 3000 feet for sure. The lights seemed duller (less bright?) than they should have given the other variables. They were a dark red, or a blurry red--it was like a dulled orangeish red.  I have made dozens of attempts since the event to draw the distribution of the lights I saw on the object. The best description I can come up with: The representation of 5 on a standard die, with an additional light in between the two rightmost dots. ((NUFORC Note:  The formation did not survive the transfer from e-mail to our database.  PD))  •• • • ••     This pattern of lights moved from Southeast to Northwest for roughly 4 seconds. The part of the experience that was truly extraordinary came after the 4 seconds. As I watched with mild interest, the following happened; what I would call the lead light (the light farthest to the side of the direction in which the object was moving) reversed its postion. It took less than 1 second to do so; in that time, the lead light traveled clockwise until it occupied exactly the oppose position it had before. The object now looked like this:  •• •• ••   Then, in a fraction of a second and from my point of view, the object seemed to tilt in such a way that the western or leading edge went upward and the eastern or trailing edge downward. I say this not because it was directly visible as such, but because that was impression in the moment: the leading two lights disappeared from view, but I could still see the rear 4.  Almost immediately thereafter (much less than 1 second), the entire object vanishedfrom view. Watching, I did not have the impression of something speeding away. It seemed simply to vanish.  That is what I saw tonight. I have never seen anything remotely like it, and I have never before had a disposition one way or another vis a vis UFOs.  Please let me know if you can explain this event. ((name deleted)) San Francisco, Calif. (808) 232-((number deleted))",
      "link": "http://www.nuforc.org/webreports/052/S52974.html",
      "state": "CA",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b8549",
      "summary": "Dim Orange",
      "city": "sanfrancisco",
      "shape": "triangle",
      "date": "2009-03-19T00:00:00",
      "story": "I was on my roof deck admiring the beautiful night. All of a sudden I saw a strange light formation move across the sky. It was a V like object, similar in shape to a formation of flying birds that appeared for about 30 secs and moved steadily across the sky. It traveled in North Easterly direction, passing from Orion belt, under the moon toward Orion's head. It didn't appear to be a solid object (like the point of a plane) but was rather like a collection of dim orange lights. It made no noise. It is very difficult to describe its size or how high in the sky it was but it seems like it was as high as the stars and was, very roughly, about the size of 2 Orion's belts in a V shape. What we saw seems amazing similar to this report: http://www.nuforc.org/webreports/053/S53154.html",
      "link": "http://www.nuforc.org/webreports/068/S68482.html",
      "state": "CA",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3b86c9",
      "summary": "Two bright orange objects hovering,pulsing lights, akward movements",
      "city": "sanfrancisco",
      "shape": "fireball",
      "date": "2009-03-19T00:00:00",
      "story": "Two bright orange objects hovering,pulsing lights, akward movements We were walking home just after midnight from grabbing some food and I saw a very bright orange light.  And I turned to my boyfriend and pointed it out to him.  Him being so skeptical, I thought he was going to dismiss what I was seeing, but he looked up and said, \"what is that?\".  We both agreed it was not a plane or like anything we have ever seen before.   I am pretty positive it wasnt a plane because planes have red or white lights flashing and are always flying over head as we live near 2 major aiports; and seeing so many, this was in no way a plane.  The light was very bright, large and orange in color, wierd in shape (fireball-ish?), like nothing I've seen before. As we stared we noticed that the orange light was very bright and large for being a distance away. It was heading Northwest to Southeast, towards us. The first one stopped, stood still or hovered for more than a few seconds and then headed west. There was a second one behind it, just as bright orange as the first. It was coming from the same direction. It stopped and was hovering. It pulsed as did the first one when it was hovering, almost to the point of dissapperance. It did a small square flight pattern(looked very unatural), and headed west(was out of site pretty quickly once heading west-within 3-4 seconds). The duration was about 2 min and there was absolutely no sound whatsoever associated w/ the objects. My boyfriend is very skeptical, but he said it was like nothing he has ever seen before. The color was just such a bright rich orange color and the flight pattern was very akward. I have no idea what it was, I just know it was a first that I have seen something like this.",
      "link": "http://www.nuforc.org/webreports/067/S67996.html",
      "state": "CA",
      "duration": "2 min"
    },
    {
      "_id": "64d005f478aba2ec5a3b8755",
      "summary": "4 UFOs over the Sunset District in San Francisco CA on 6/14/09 around 9:00 pm.",
      "city": "sanfrancisco",
      "shape": "oval",
      "date": "2009-08-05T00:00:00",
      "story": "4 UFOs over the Sunset District in San Francisco CA on 6/14/09 around 9:00pm This evening just as the sun was beginning to set I saw what I thought were two planes heading from northwest moving in a southeast direction toward me.  I was standing at my living room window in the Sunset District of San Francisco watching the sunset over the ocean when I saw them.  As they approached I questioned if in fact they were planes. They were absolutely quite.  It seemed one was following the other.  They moved in a straight line almost directly toward me.  One got close enough that I could see four lights, one red, one yellow and 2 white lights.  The lights were pulsating.  Then I moved to my bedroom window trying to get a better view.  They were both still there after I transitioned rooms.  My bedroom window also has an ocean view looking west but is more south than my living room window. Then it seemed they were out of view so I went to my back decks on the east side of my building and saw them again.  They were still heading southeast and seemed to be heading toward a third object that looked like a star.  At the closest the larger one seemed the size of an eraser on a pencil. Then a fourth one came from the southwest and seemed to be heading north not following the others.  That one was quite big also, in that it was just over the rooftops and could not have been a star in that case. It also had 4 pulsating lights red, yellow and 2 white lights. It seemed a bit closer than the other two that seemed to pass overhead of the building I was in. All in all it felt like I watched for a good 10 to 15 minutes.  There was no sound at all and no trails of any sort.  I was not able to see any of them by the time the sun set. What did I see?  Today is 6/14/09.  It is now 10:14pm.  This sighting occurred as the sun set. It was quite a beautiful sunset in a clear sky after a warm clear day.",
      "link": "http://www.nuforc.org/webreports/070/S70510.html",
      "state": "CA",
      "duration": "10minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b8747",
      "summary": "Metallic saucer-like object seen over San Francisco Beach",
      "city": "sanfrancisco",
      "shape": "disk",
      "date": "2008-10-31T00:00:00",
      "story": "Metallic saucer-like object seen over San Francisco Beach I was watching the sunset from Ocean Beach, when I noticed the object just south of and a little above the sun on the horizon line.  I thought at first it was a plane, but there were no lights blinking on it like there were on a plane over the nearby Marin Headlands.  it seemed to be made of metal, or something that reflects, and the bottom of it was like the bottom of a bowl, reflecting the light of the sun beneath it.  The top of it was like a smaller, upside-bowl, and although it appeared to be solid, it seemed to be invisible except where the sunlight was reflecting off of it, like I was seeing the outline of a bubble in the light.  My second thought was that it was a missile, because it moved like a missile, like it was up so high and was far enough away to appear to be moving very slowly, but it was moving towards the beach. I watched it from 7:30 to 8:08 pm, when the fog rolled in, and it disappeared. Several other people on the beach also witnessed it and took pictures with their cell phones.",
      "link": "http://www.nuforc.org/webreports/065/S65343.html",
      "state": "CA",
      "duration": "1/2 hour"
    },
    {
      "_id": "64d005f478aba2ec5a3b8733",
      "summary": "I saw a metallic sphere very bright almost like a star, but it did not pulsate and it was daytime very clear skies.It appeared to be gl",
      "city": "sanfrancisco",
      "shape": "sphere",
      "date": "2009-03-19T00:00:00",
      "story": "I saw a metallic sphere very bright almost like a star, but it did not pulsate and it was daytime very clear skies.  It appeared to be glinting off the sun or reflecting light,similar to the look of a metal ball I was driving south in SF,CA.  It appeared about 35-40 degrees above the horizon straight south guessing about 3 miles near Daly City,about 400' in the air. It was initially stationary,became smaller as if it were moving away south, then darted left and right,and disappeared.  I was able to gauge the lateral movement because I was looking through overhead utility wires. It wasn't a plane a balloon a helicopter or a bird, because the velocity of the movement was too swift.  It made me very nervous. I was about to call out to a pedestrian but by the time I did it was gone. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/068/S68002.html",
      "state": "CA",
      "duration": "2-3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b887a",
      "summary": "White orb turned pink, then red, then faded out as it moved across the sky.",
      "city": "sanfrancisco",
      "shape": "light",
      "date": "2009-03-19T00:00:00",
      "story": "White orb turned pink, then red, then faded out as it moved across the sky. I'm a 31 year old Art Director with a wife and child. I was outside around 6:30-7:00pm on Friday after work playing with my dog, and b/c I live 5 minutes from the airport I happened to be looking up at all the airplanes in the sky. I noted just before the incident about what a clear night it was and how you could see almost all the stars. As I watched one plane that happened to be pretty low probably having just taken off and banking in a southern direction; going just under my clear view of a very bright Venus; I looked down at my dog. When I looked back up to find the plane to see which direction it was heading in, I noticed a single white light moving from the south to the north. It struck me as odd b/c I could see about 7 planes in the sky at one time from my vantage point and I noticed that all the planes in the sky had at a minimum of 2-4 lights on, and at least 1-2 flashing lights. I watched the single white light move north at a somewhat medium pace, wasn't fast, wasn't slow. As it got closer the single light started to turn pink, then changed to red then completely faded out. After I saw that I assumed that the object, presumably a plane, probably banked to the side and the light was hidden by a wing. So I sat outside for 10 minutes and watched the sky in the general area where the object was heading. I never saw a light appear in the area. I still saw several planes in the area, all with multiple light, and flashing lights. I also remembered to recheck the sky conditions for possible clouds... not a single cloud in the sky. I'm a natural born skeptic, so this is strange for me. I was so baffled by this, that I told my wife and of course she laughed and told me I was crazy.",
      "link": "http://www.nuforc.org/webreports/068/S68123.html",
      "state": "CA",
      "duration": "30 sec"
    },
    {
      "_id": "64d005f478aba2ec5a3b8942",
      "summary": "since januany 18, 09 i have been seen ligth in the sky fix and some others that move my video show diferent what my eye see dont know w",
      "city": "sanfrancisco",
      "shape": "light",
      "date": "2009-03-19T00:00:00",
      "story": "since januany 18, 09 i have been seen ligth in the sky fix and some others that move my video show diferent what my eye see dont know what itis but is very rare will like to know what it is got video.",
      "link": "http://www.nuforc.org/webreports/068/S68257.html",
      "state": "CA",
      "duration": "3 hours"
    },
    {
      "_id": "64d005f478aba2ec5a3b8a3a",
      "summary": "1-20-09 Mysterious formation of lights over Pacific Ocean.  ((NUFORC Note:  Venus.  PD))",
      "city": "sanfrancisco",
      "shape": "changing",
      "date": "2009-03-19T00:00:00",
      "story": "1-20-09 Mysterious formation of lights over Pacific ocean. I opened the back door to let the dog out & noticed an extremely bright light.  At first disregarded, but a few minues later I opened it again to let dog in & the light had not appeared to move. For the following hour, we've continued to monitor this light(s). The lights are vaguely moving. The object seems to have grown closer & the light formation has seemed to change several times.  Will update later.... 10 minutes later, object seems to be moving down. ((NUFORC Note:  Venus.  PD))",
      "link": "http://www.nuforc.org/webreports/068/S68153.html",
      "state": "CA",
      "duration": "1 hour and counting"
    },
    {
      "_id": "64d005f478aba2ec5a3b8ac8",
      "summary": "A flying ball of light faster than a comet near Mt. Tamalpais.",
      "city": "sanfrancisco",
      "shape": "fireball",
      "date": "2009-08-05T00:00:00",
      "story": "A flying ball of light faster than a comet near Mt. Tamalpais. I am almost 13, and I was on a Boy Scout Camp Out to Mt. Tamalpais near San Francisco.  3 other scouts and I were sleeping outside on a tent tarp.  Another scout and I was looking up at the stars.  Suddenly, on the western part of the sky, we saw a round ball of light, flash across the sky, about the size of a gumball!  The scout asked me, \"Did you just see that shooting star?\"  I replied saying, \"That's not a shooting star, it was a lot bigger!\"   I know for sure it wasn't a comet because it lasted about a millisecond!",
      "link": "http://www.nuforc.org/webreports/070/S70729.html",
      "state": "CA",
      "duration": "Less than a second"
    },
    {
      "_id": "64d005f478aba2ec5a3b8c10",
      "summary": "It had a TRANGULAR SHAPE, was DARK GRAY (lit by the moon light) with 3 ROUND CIRCLES ON IT'S BOTTOM",
      "city": "sanfrancisco",
      "shape": "triangle",
      "date": "2009-01-10T00:00:00",
      "story": "It had a TRANGULAR SHAPE, was DARK GRAY (lit by the moon light) with 3 ROUND CIRCLES ON IT'S BOTTOM This current sighting, seen Saturday night on 11/15/08 at 7:55pm was a flying object over the moon lit night sky of San Francisco, California’s outer sunset district near my home. ABOUT ME: I am a retired electronics Eng, 59 and working part time. I also have a FAA Private Pilot License and I am a backyard amateur A. I own a 12-inch reflector and a 6-inch refractor. On this night we were experiencing a warm front over the S.F. Bay Area. 20 degrees above normal for this time of year. The moon was ¾ full and just visible over the eastern horizon. Because of the moon lit sky (the suns light reflecting off the moon of course), birds were easily seen flying overhead at higher altitudes. THE SIGHTING: I was sitting on a backyard recliner drinking ice water using a  8 x 40 quality binocular to star qaize. My eyes were night adapted and just a few seconds before seeing the UFO, I was looking at the constellation Pegasus, I drifted my binoculars upward to look at a nebula when I saw what looked like a large black bird or object flying where my binocular was pointing. I thought how strange the shape as it did not have a bird shape. I continued to look into the binocular and followed this dark object heading 180 degrees south in a straight line. It was almost overhead, maybe within a ½ mile east of my home. It was flying with NO LIGHTS and NO SOUND. I live with 15 miles of SFO airport and see many planes turning and overhead for final approach with the red left wing light flashing and the green right wing lit. But this craft had no lights at all, made no sound. It was low enough be heard, but no sound was heard! If it was the size of a 747 jet, then I would say it would have been about 1000 to 1200 feet above SL. What was more unusual to me was its belly. It had 3 round disks shapes connected to it. So in conclusion, It had a TRANGULAR SHAPE, was DARK GRAY (lit by the moon light) with 3 ROUND CIRCLES ON ITS BOTTOM. No airplane wings or rudder or ailerons were seen. It seem to be running in a stealth mode maybe because of its low alitude, but the moon gave it away. I was lucky enough to have my binocular in that direction otherwise I would have never seen it with the eye alone. I followed it for about 7 seconds until my shed blocked further viewing. I ran up to tell my wife and boy but they did not believe me at first but the next day they seemed more convinced by my going on and on about seeing it. PAST SIGHTING: My first was in 1967 over the Pacific Ocean standing on the San Francisco beach and it was at night. I never reported it as I did not think anyone would believe be. But, I did tell friends and family. If you want information on that sighting I would be glad to tell you? I am interested if others had seen it.",
      "link": "http://www.nuforc.org/webreports/066/S66945.html",
      "state": "CA",
      "duration": "7 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b8c14",
      "summary": "black shadowed rectangle bottom object came in from the west made U-turn back out to the west 23:27 11/15/08",
      "city": "sanfrancisco",
      "shape": "rectangle",
      "date": "2009-01-10T00:00:00",
      "story": "black shadowed rectangle bottom object came in from the west made U-turn back out to the west 23:27 11/15/08 On the night of 11/15/2008 between 11:00PM and 11:30PM I was driving to my girlfriend’s home, while getting on the 101 freeway on-ramp from Octavia in San Francisco I looked southwest 10 degrees up into the night sky because something caught my eye and saw a slow moving rectangle shape object with lights on the bottom in the distance as the freeway curved east I didn’t see the object for awhile because it was out of my line of sight till I came to the freeway 101/280 split as I was making the transitioning from the 101 south on to the 280 curve heading southwest I saw what appeared to be a black rectangle object about 20 degrees up coming my direction with lights moving across the bottom that’s when I realized I was not seeing lights from the craft per say but seeing mirrored reflection of home and street lights from the ground off the bottom of this thing at this angle as I got closer to it I tried to see over the top all I could see was a black shadowed object  the top appeared to shape shift reminded me of  circus tint ,batman ears or Disneyland castle at that moment I called my girlfriend on my cell phone to go out and looking in the sky but she couldn’t see anything the call took place at 23;27  11/15/08 I was directly underneath the object at Alemany Blvd., Rousseau St. and  280 freeway the bottom of the object was pulsating in color black, grey, off white it made a U-turn from going east to west direction. P.S. it was a cold clear night could see moon and stars. ((NUFORC Note:  Witness elects to remain totally anonymous; provides little contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/067/S67305.html",
      "state": "CA",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b8eba",
      "summary": "a round spinning object stood in the sky for a minute and took off going up at incredible speed.",
      "city": "sanfrancisco",
      "shape": "circle",
      "date": "2010-02-14T00:00:00",
      "story": "a round spinning object stood in the sky for a minute and took off going up at incredible speed. Driving on the 6th st entrance ramp of highway 280 south in san francisco, right over the bay a big round object spinning, it stood there for a minute and took off going up at a lighting speed.",
      "link": "http://www.nuforc.org/webreports/073/S73755.html",
      "state": "CA",
      "duration": "1 Minute"
    },
    {
      "_id": "64d005f478aba2ec5a3b8f51",
      "summary": "San Francisco October 29th at 4:15am Bright moving white light ball moving left to right then disappeared in 2 seconds.",
      "city": "sanfrancisco",
      "shape": "light",
      "date": "2009-12-12T00:00:00",
      "story": "San Francisco October 29th at 4:15am Bright moving white light ball moving left to right then disappeared in 2 seconds. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/073/S73069.html",
      "state": "CA",
      "duration": "2 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b903a",
      "summary": "flashing light going through the spectrum of colors",
      "city": "sanfrancisco",
      "shape": "light",
      "date": "2009-01-10T00:00:00",
      "story": "flashing light going through the spectrum of colors just below the constellation orion in the night sky, there showed up a flashing light that ran through the colors of the spectrum.  it didn't move faster than any of the other stars, so possibly a weird supernova or something, but the amount of colors it gave off was amazing",
      "link": "http://www.nuforc.org/webreports/067/S67100.html",
      "state": "CA",
      "duration": "??"
    },
    {
      "_id": "64d005f478aba2ec5a3b906f",
      "summary": "15 small white orbs drifting high in formation west Over SF, CA City Hall 9-20-08",
      "city": "sanfrancisco",
      "shape": "circle",
      "date": "2008-10-31T00:00:00",
      "story": "15 small white orbs drifting high in formation west Over SF, CA City Hall 9-20-08 Against a blight blue sky, my wife and I saw a relatively static but drifting formation of 15 roundish white orbs that stayed relatively the same distance from each other while the entire formation moved slowly to the west.   These object were more visible with polarized glasses but not so with the naked eye. We had no binoculars to assist. We took one digital picture (Canon 10 MP camera) which caught it but only shows rounded orbs at extreme magnification. This was over the SF City Hall. These did not look like planes or circling birds. The formation was not a regularly spaced formation. These objects were higher than clouds which drifted beneath them.",
      "link": "http://www.nuforc.org/webreports/065/S65820.html",
      "state": "CA",
      "duration": "20 Minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b9204",
      "summary": "Triangular formation of dim lights spotted moving smoothly across San Francisco night sky.",
      "city": "sanfrancisco",
      "shape": "triangle",
      "date": "2008-10-31T00:00:00",
      "story": "Triangular formation of dim lights spotted moving smoothly across San Francisco night sky. We were walking North on Baker St from our van which was parked on the west side of Baker St, between Fulton and McAllister Streets. The night was a clear night with a good view of the stars. The person I was with was standing near the corner of McAllister and Baker streets and observed what we at first thought was a plane.  She pointed it out to me - I was standing about 15 feet south of her - and I looked up and saw 3 dim points of light (about the brightness of a dim star) that formed an equilateral triangle, moving quickly in smooth, straight line north/northeast.  At first we thought this might be a plane but considering that the craft appeared to be silent, and that the lights were a decent distance from one another it does not match the description of any plane that either of us has ever seen.  the craft moved smoothly out of sight and we ran uphill to try and continue observing it but were unable to.  For what it is worth, I grew up in a town that was home to a Navy Air Station and was within the flight path for a major international airport and did not recognize the lights we saw as being consistent with any plane or helicopter that I've ever seen.",
      "link": "http://www.nuforc.org/webreports/065/S65852.html",
      "state": "CA",
      "duration": "25 Seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b997d",
      "summary": "Objects when passing are very neutral.",
      "city": "sanfrancisco",
      "shape": "disk",
      "date": "2009-06-09T00:00:00",
      "story": "Objects when passing are very neutral. The gateway to personal freedom in many respects is always locomotion. As someone who would like to color and present to you my experience of UFO sightings the above statement probably is most true. It is my sincere belief that the occasions within my scope of vision of flying craft qualify as those with special regard for airspace regulations and relative safety within US. To date every object has been almost like a passing passenger aircraft, marked with regular flashing airplane lights seen by me before. It is my sincere hope that one day we may know the true nature of these Unidentified Flying Craft. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/070/S70052.html",
      "state": "CA",
      "duration": "5 min"
    },
    {
      "_id": "64d005f478aba2ec5a3b9ac0",
      "summary": "Small white dot flying through sky in San Francisco",
      "city": "sanfrancisco",
      "shape": "unknown",
      "date": "2010-04-13T00:00:00",
      "story": "Small white dot flying through sky in San Francisco A friend and I were at Dolores Park in San Francisco yesterday.  The incident occurred somewhere between 5:15 pm and 5:25 pm.  It was a sunny day with a bright blue sky. It was cloudless. We were laying on our backs looking up at the sky.  I noticed a pigeon sitting on top of a lamp post that was in the park.  I noticed a small white object floating down to the earth.  I thought the object was a feather that had fallen from the bird.  For some reason, I was fixated on it and watched it float to the ground. I told my friend to look at the feather and pointed out that it was taking a really long time to hit the ground.  All of a sudden (and I know this sounds strange,) the \"feather\" went up higher in the air instead of coming down.   At first I thought a gust of wind blew it higher. Then, all of a sudden it appeared to shoot through the sky up and over to the right above some houses.  The way it was traveling did not seem plausible by Science.  It shot FAST across the sky as if the sky was sucking it in.  Like it was traveling through another dimension. I don't know if it was actually a feather that we noticed which drew our attention to the small white object or if the feather transformed into the white object.  But it flew SO fast and high and eventually disappeared.  As it got further away it looked less and less like a feather and more like a tiny white dot that was glowing. Like a shooting start that went up instead of down.  I hope this made sense. I looked around to see if anyone else in the park was noticing it but no one was.  My friend that was with me saw the exact same thing.  I had him describe to me in detail what he witnessed to make sure I wasn't seeing things.  He described it accurately.",
      "link": "http://www.nuforc.org/webreports/074/S74806.html",
      "state": "CA",
      "duration": "30 Seconds?"
    },
    {
      "_id": "64d005f478aba2ec5a3b9aab",
      "summary": "bright light shot down toward ground",
      "city": "sanfrancisco",
      "shape": "light",
      "date": "2009-01-10T00:00:00",
      "story": "bright light shot down toward ground On december 13th, 2008 at around 11:15 pm (pacific coast time) in san francisco California, i was drinving with my girlfriend and my two friends sitting in the backseat. i was driving of the freeway and we were all pretty quiet listening to music with low volume. i was driving of the freeway looking at the road ahead of me.  All of a sudden i saw an extremely bright light in the sky ahead of me all of a sudden shooting down diagonally extremely fast. to me it seemed like it was a white dot of light that all of a sudden popped out of the sky and immediately shot down towards the ground. i could not see where excatly it landed or anything because it shot down and went behind this hill hill in the distance. When i first saw it my first insticnt was that it was like maybe  firework but i quickly realized that it could not be because fireworks go up, then i thought maybe it was some sort of missle but i dont think that i would not have seem something as bright as that coming from higher up in the sky because i just saw it pop out of nowhere. then i started to think. after around 30 seconds i said \"wait hold on.. did u guys see that???\" and immediatelly my girlfriend said \"yeah, what was it?\" then i said \"i dont know what did you see\"  and according to her she saw a bright white line coming from the sky diagonally but she says she only saw it with her perifiral vision. i assume that it was a bright dot that was moving so fast that it seemed like a line coming down diaginally in a perfecly straight line. i knew that it could not be lightning because when i got out of the car i looked up at the sky and saw that it was a very clear night without a cloud in sight. also it could not have been lightning becuase it was way to bright. and also lightning comes down straight to the ground  but this came down diagonally  and in a straight line. I know that it was not a shooting star either becuase i have seen many and this was way brighter and bigger than a star and faster. after that we were all pretty s! cared an d confused. ((NUFORC Note:  Witness elects to remain totally anonymous;  provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/067/S67571.html",
      "state": "CA",
      "duration": "1 sec."
    },
    {
      "_id": "64d005f478aba2ec5a3b9afe",
      "summary": "oval gray flying saucer",
      "city": "sanfrancisco",
      "shape": "oval",
      "date": "2010-06-03T00:00:00",
      "story": "oval gray flying saucer An oval flying object (gray, about 10m in diameter) flew over San francisco.  It was traveling from West to East. I started seeing if above UCSF and ended, I guess, somewhere above the Bay.  The flight was not very stable (oscillating on its axis) but was flying very fast.  It was faster than planes taking off from SFO which can be seen from our place.",
      "link": "http://www.nuforc.org/webreports/075/S75523.html",
      "state": "CA",
      "duration": "1min"
    },
    {
      "_id": "64d005f478aba2ec5a3b9b13",
      "summary": "bright white light in sky off Ocean Beach, San Francisco, CA changed color to red and moved slowly North",
      "city": "sanfrancisco",
      "shape": "unknown",
      "date": "2008-10-31T00:00:00",
      "story": "bright white light in sky off Ocean Beach, San Francisco, CA changed color to red and moved slowly North I saw bright light out apt. window in sky off Ocean Beach,in San Francisco, CA betwen Vicente and Wawona St.  I first thought it was a plane but it did not move and stood in same spot for 20 minutes before it changed from a bright white light to red and back again and started to move North before disappering behind a tree. I saw the exact same light two nights ago - but it did not change color but got smaller before disappearing. My apt is aprox. 2 miles from beach.  I observed with naked eye and bicnoculars.  I am a regular civilan with no special expertise.",
      "link": "http://www.nuforc.org/webreports/066/S66108.html",
      "state": "CA",
      "duration": "30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3ba079",
      "summary": "What looked like a star high in the sky over San Francisco slowly moved then stopped then faded away",
      "city": "sanfrancisco",
      "shape": "light",
      "date": "2009-04-14T00:00:00",
      "story": "What looked like a star high in the sky over San Francisco slowly moved then stopped then faded away In San Francisco, CA, on Thursday night, March 20th at around 11:00 pm, I noticed what looked like 2 stars close together at about the same magnitude of light high in the northwest sky.   I guess my peripheral vision detected a slight movement so I continued to look at the 2 stars.  Soon I realized that the right light was actually moving east very slowly.  Its light was a distinct muted red, definitely a different red from Mars.  If I were to measure the distance of travel at arm’s length it moved about 8-9 inches in the night sky.  It moved to the east for about 2 minutes and then stopped, soon after it just stayed in one position and after 30 seconds or so it began to slowly and steadily fade away until it was completely gone as if it were leaving Earth’s atmosphere.  It took about a minute to completely vanish. I know what it wasn’t.  It was not a satellite, airplane, jet, helicopter, weather balloon, Chinese floating lantern or anything else that I have seen before.  I do not know what it was.  I would love to understand what I saw.  I feel very lucky to have witnessed this event.  I keep asking myself, what the hell was it that I saw?!  I am curious to know if any other folks saw what I saw in the San Francisco sky.",
      "link": "http://www.nuforc.org/webreports/069/S69364.html",
      "state": "CA",
      "duration": "3-4 mins"
    },
    {
      "_id": "64d005f478aba2ec5a3ba0f7",
      "summary": "What caught my attention was how close they were together.  I thought it was vapor trials from two planes that was going to land at sfo",
      "city": "sanfrancisco",
      "shape": "circle",
      "date": "2008-10-31T00:00:00",
      "story": "What caught my attention was how close they were together.  I thought it was vapor trials from two planes that was going to land at sfo .  At first it looked like it had a tail, but than it started to appear as a small round cloud. From the time I noticed it until it disappeared on the horizon it was about 15 minutes.  The two maintained the same distance. They were going very slow and would stop-sit and than go.  I was up high and could tell they were not moving by the point from a roof top below them. ((NUFORC Note:  Witness elects to remain totally anonymous;  provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/066/S66209.html",
      "state": "CA",
      "duration": "15m"
    },
    {
      "_id": "64d005f478aba2ec5a3ba29a",
      "summary": "UFO sighting around the SF bay area.",
      "city": "sanfrancisco",
      "shape": "flash",
      "date": "2009-05-12T00:00:00",
      "story": "UFO sighting around the SF bay area. I am on the very top of a six floor building, and I looked outside. That's when i saw an object that looked like a plane. The strange thing about it was that it was not moving at all it just stayed there for about five minutes. It had lights around it and one was flashing,then it jiust dissapear/",
      "link": "http://www.nuforc.org/webreports/069/S69804.html",
      "state": "CA",
      "duration": "7 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3ba4fa",
      "summary": "Two white lights moving together over San Francisco",
      "city": "sanfrancisco",
      "shape": "circle",
      "date": "2008-08-12T00:00:00",
      "story": "Two white lights moving together over San Francisco I was laying in my back yard and looking up at the sky, which was completely clear.  I saw a round, shiny object that appeared to up very high in the sky, too high for a plane.  It was basically a pinpoint of white light, or perhaps reflective material.  I was curious and continued to watch it, and then noticed there was an identical object a short distance behind it.  They moved at a moderate pace in a straight line and did not waver, which confirmed they were not birds.  Then the second object started moving underneath the first one, but stayed the same distance apart and neither changed speed.  It continued rotating around the first object until it was in front.  Then they passed behind a building and from my sight.  It is possible they were satellites, but I have never seen two satellites near each other like that, never during the day, and they also moved slower than other satellites I have seen  Recently someone in the bay area saw something similar: http://www.ktvu.com/news/16548130/detail.html.  But the ones I saw were moving much more slowly.  Their movement was not like anything alive or any other flying object I have seen before.",
      "link": "http://www.nuforc.org/webreports/064/S64922.html",
      "state": "CA",
      "duration": "about 5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3ba546",
      "summary": "Sighting in San Francisco",
      "city": "sanfrancisco",
      "shape": "triangle",
      "date": "2008-07-05T00:00:00",
      "story": "Sighting in San Francisco Sitting in a park in San Francisco, we saw one light show up in the sky. Looked like a yellowish star but more clear. Then two more showed up creating a triangle. It held there for a second then shot across east bound and disappeared. This was much higher then a plane, since we do have an airport near by and we see airplanes all the time. This was NOT a plane. It was dead silent, no other lights were blinking on it, and was much faster then a helicopter or airplane. It was amazing.",
      "link": "http://www.nuforc.org/webreports/064/S64011.html",
      "state": "CA",
      "duration": "6 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bab7f",
      "summary": "Abnormal Movement of Unknown Object",
      "city": "sanfrancisco",
      "shape": "light",
      "date": "2010-11-21T00:00:00",
      "story": "Abnormal Movement of Unknown Object The object approached out to the west the color was red and white; at all times the object color was red and white; the object sort of resembled a star that is how small it was.  After approaching from the west it stopped for a time see ref #1;  The object then proceeded to move south see ref #2 in which it moved right to left and also in a circular motion at all times it should be mentioned the object used the same motions; stop, move either left to right and in a circular motion.  The object was observed against a ship light for reference to make sure the object was moving; also the star before the big dipper juts-up the star which is not part of the big dipper in the handle was also used for reference.  The object proceeded to move north past the ship light see Ref #3 which the ship light for the whole time to this period was fixed; after the object moved to the right of the very bright ship light the ship started moving due south ref #4.  At this time I cut a hole into a piece of paper and secured it placing my face at least 6 inches away from the hole to double check to see again if it was my eyes playing tricks, but the object was moving as mentioned above moving out of the range of the cutout.  One note at no time did the object move north of the last star in the handle of the big dipper as if it was a boundary.  Also the object seemed to move west at one time to chase a very faint light south to north moving like a strobe on a aircraft which one could barely make out the light it was so dim.  You almost had to catch it out of the corner of your eye.  Ref #5 and #6; leaving the coastal position after about a hour or hour and a half I was beyond the tree line when the object came closer and was brighter than before; it moved very rapidly form right to left (north to south) and then back north disappearing behind the trees.  I then spotted somebody with a very bright flashlight as though they were searching for somebody. ! end of encounter.",
      "link": "http://www.nuforc.org/webreports/078/S78064.html",
      "state": "CA",
      "duration": "hour/hour half"
    },
    {
      "_id": "64d005f478aba2ec5a3bac5b",
      "summary": "coming down 24th st looking northwest across the goldengate.orbs in slightly curved line on the westside of the goldengate at approxima",
      "city": "sanfrancisco",
      "shape": "sphere",
      "date": "2010-11-21T00:00:00",
      "story": "coming down 24th st looking northwest across the goldengate.orbs in slightly curved line on the westside of the goldengate at approximatley (guesstimate) 3000 ft. three different sizes all glowing a deep orange.first one broke away and dissapeared,then another took off and one remained and changed its lighting to an occilating trio of colors going from red to yellow to purple.the one remaining then went even higher in the night sky and remained stationary till we left the area.",
      "link": "http://www.nuforc.org/webreports/078/S78348.html",
      "state": "CA",
      "duration": "20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bad7d",
      "summary": "3 UFOs over northern California 4/5/11 at 10pm",
      "city": "sanfrancisco",
      "shape": "light",
      "date": "2011-05-02T00:00:00",
      "story": "3 UFOs over northern California 4/5/11 at 10pm I saw two glowing objects falling toward the ground that I though might be shooting stars. They looked like they were going to collide by the angles they were moving in.  Right before they did, a third glowing object came in from the side.  Right before they all hit each other, all three shot straight upward and disappeared.  The two that were falling together did a close to 180 degree turn and the third glowing object probably turned at a 50-60 degree angle. It's hard to gauge how far away they were so it could have been anywhere over northern California. ((NUFORC Note:  Witness elects to remain totally anonymous; provides little contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/080/S80772.html",
      "state": "CA",
      "duration": "less than 1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3bada0",
      "summary": "Boomerang UFO 500 feet over San Francisco Nov. 12, 2010",
      "city": "sanfrancisco",
      "shape": "other",
      "date": "2011-01-05T00:00:00",
      "story": "Boomerang UFO 500 feet over San Francisco Nov. 12, 2010 Boomerang UFO over house close-up view caught on tape. I was looking through my night vision camera at a distant ball shape UFO East of my home when a boomerang shaped UFO moves over my house.  It was about 500 feet high and heading True South.  I live 10 miles from the San Francisco International Airport and jets pass over head at 1500 to 3000 feet.  This was no jet. It made no noise, no sound and had three bright study lights turned on at the crafts rear section.  They were rectangular in shape. No other lights were visible.  It was an incredible sight, so close.  I have it on video.",
      "link": "http://www.nuforc.org/webreports/079/S79253.html",
      "state": "CA",
      "duration": "20 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bae64",
      "summary": "Thanksgiving Night 2010, Cheveron UFO flew over San Francisco, CA.",
      "city": "sanfrancisco",
      "shape": "chevron",
      "date": "2011-01-05T00:00:00",
      "story": "Thanksgiving Night 2010, Cheveron UFO flew over San Francisco, CA. This Thanksgiving night 2010, I captured on videotape (from my back yard in San Francisco, CA.) a Chevron shaped UFO. It was heading True North and was seen East of my home about 60 degrees up. It looked like a ghost ship because it was a semi-transparent white color but it did have a detailed shape. I do not know the size or altitude of this UFO. If it did make a noise, I did not hear it because I think it was too far away. I also saw and videotaped 2 other different UFO shapes on this night. A seperate file will be sent on these UFOs.",
      "link": "http://www.nuforc.org/webreports/079/S79251.html",
      "state": "CA",
      "duration": "15 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bae65",
      "summary": "Thanksgiving night, 2 UFOS move fast over SF and caught on tape.",
      "city": "sanfrancisco",
      "shape": "disk",
      "date": "2011-01-05T00:00:00",
      "story": "Thanksgiving night, 2 UFOS move fast over SF and caught on tape. I was in my backyard looking at the stars through my video camera when I saw the two UFOs. I was pointing the camera towards the NE about 45 degrees up when I caught the two disk shape UFO moving very, very fast from West to East. The UFOS were near the San Francisco’s Golden Gate Park area about 2000 to 3000 feet high. Without knowing their size, it would be difficult to judge the actual altitude. My home is under the SF bay approach for jets landing at the SF International Airport. I heard no sound from the UFOs and that is strange because it looked like they were moving much faster than the speed of sound and there was no sonic boom.  There has been a lot of  different UFO shapes that I have seen this year over SF. I was lucky to catch a lot of videos also.",
      "link": "http://www.nuforc.org/webreports/079/S79252.html",
      "state": "CA",
      "duration": "3 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bb360",
      "summary": "I was walking east up Steiner st. in the Lower Haight district of San Francisco at about 11:59, when something to my left caught my eye",
      "city": "sanfrancisco",
      "shape": "fireball",
      "date": "2011-01-05T00:00:00",
      "story": "I was walking east up Steiner st. in the Lower Haight district of San Francisco at about 11:59, when something to my left caught my eye. It moved very slowly and smoothly in the sky and made no sound. It was a deep orange color, and looked like it was glowing.  It was the same color as an orange street lamp, or similar to a fireball, but it was pretty stable looking.  It moved from east to west, then somewhat towards me and then it just stopped. It hovered for about a minute.  It was cloudy and drizzling so I assumed it was pretty low in the sky.  At first glance I thought it was a helicopter by the speed and way it was moving, but the fact that it didn't make any sound and there were no blinking lights, had me intrigued.  I watched it for about 2-3 minutes. It hovered in one spot, then appeared to dim, or ascend up into the clouds until it disappeared. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/079/S79299.html",
      "state": "CA",
      "duration": "3-4 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bb671",
      "summary": "Set of Orange Lights in the sky in San Francisco",
      "city": "sanfrancisco",
      "shape": "fireball",
      "date": "2011-01-31T00:00:00",
      "story": "Set of Orange Lights in the sky in San Francisco Looked liked orange lights in the sky, could have been Chinese lanterns but did not move uniformly as I would expect them to if blown by the wind.   After conversing with several people on the street, I watched them fade one by one.   My daughter called later and said she saw 15 lights; I only saw 7. ((NUFORC Note:  We spoke via telephone with this witness, and we found him to be well-spoken, serious-minded, and quite credible.  PD))",
      "link": "http://www.nuforc.org/webreports/079/S79854.html",
      "state": "CA",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bb775",
      "summary": "Black silent triangle hovering over a field.",
      "city": "sanfrancisco",
      "shape": "triangle",
      "date": "2011-01-05T00:00:00",
      "story": "Black silent triangle hovering over a field. I witnessed a black triangle; it has three lights a light on each end of the triangle.  It was silent and stationary in the air.   I was by myself when it happened, I was heading north and stopped my car and witnessed it to the north east hovering over a field, I would say it was 100 yards away and was 200 feet off the ground.   All of my gadgets in my car starting going haywire like the radio turned on and off by itself.   It stayed there for about five minutes before zooming away to the North West. ((NUFORC Note:  We spoke via telephone with this witness, and he sounded to us to be quite credible.  PD))",
      "link": "http://www.nuforc.org/webreports/079/S79542.html",
      "state": "CA",
      "duration": "5 mins"
    },
    {
      "_id": "64d005f478aba2ec5a3bbdda",
      "summary": "White balls and drifting mechanism seen in Pacific Heights San Francisco",
      "city": "sanfrancisco",
      "shape": "other",
      "date": "2011-12-12T00:00:00",
      "story": "White balls and drifting mechanism seen in Pacific Heights San Francisco Weather conditions:  Clear, slightly cloudy, slight breeze. On this particular day I noticed a number of small white ball-like objects floating in the sky. They appeared to be floating adrift with the wind.  During this time I also saw floating about 400-500 feet in the sky what appeared to be a rectangular net-like object which looked like it had 2 balls tethered to each end.  It was drifting westwards from me towards the ocean. These objects may not have been \"ufos\" but weather or atmospheric testing devices. I also noticed what appeared to be a number of military type aircraft flying around at the time.",
      "link": "http://www.nuforc.org/webreports/084/S84938.html",
      "state": "CA",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bbf3f",
      "summary": "Super bright dark blue light in S.F. eastern sky at 1:15ish on Nov 1,2011 Seen by three from Ocean beach",
      "city": "sanfrancisco",
      "shape": "light",
      "date": "2011-12-12T00:00:00",
      "story": "Super bright dark blue light in S.F. eastern sky at 1:15ish on Nov 1,2011 Seen by three from Ocean beach I was with two friends one block from Ocean beach at 1:15 am on Nov 1st 2011 it was a clear night and could see many stars in the nights sky and up in the east to the left of the brightest star in the sky we all saw a Super bright blue light that was moving at a very fast rate of speed towards the ground/earth then made a sharp turn to the left (north) horizontally.  We moved our position to get better views of the deep blue yet bright light and after a minute of us seeing it through holes in the tree line we couldn't see it any more.  Anyone else see this thing or were we smoking way too much kind? ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/085/S85060.html",
      "state": "CA",
      "duration": "2 min."
    },
    {
      "_id": "64d005f478aba2ec5a3bc057",
      "summary": "Flame-like orange light, moved in a straight line, curved slightly, came to a complete stop, and then after a ew seconds, disappeared.",
      "city": "sanfrancisco",
      "shape": "unknown",
      "date": "2012-01-12T00:00:00",
      "story": "Flame-like orange light, moved in a straight line, curved slightly, came to a complete stop, and then after a ew seconds, disappeared. I was out getting my mail and and as I was walking back down my path to my house, I saw a strange orange light in the sky.  It was different, so I stood and watched it.  It flickered a bit and reminded me of a flame, and was colored as a flame also.  It moved different than a plane.  When I first noticed it, it was moving slowly and in a straight line and then curved slightly and came to a stop! Then I knew for sure it wasn't a plane!  It stood still for a while and then was slowly getting dimmer.  Then it finally disappeared completely.  I stood and watched for a while to see if it would come back but it didn't.  It was just the night sky then, and I was in disbelief.  The weather was clear - no clouds at all - only the night sky with the stars (the ones you can see in the City anyway).",
      "link": "http://www.nuforc.org/webreports/085/S85974.html",
      "state": "CA",
      "duration": "4 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bc238",
      "summary": "Red orb light hovers over couple in San Francisco, CA 12/30/2011",
      "city": "sanfrancisco",
      "shape": "sphere",
      "date": "2012-01-12T00:00:00",
      "story": "Red orb light hovers over couple in San Francisco, CA 12/30/2011 At approximately 10:30 pm on the evening of December 30th, 2011, in San Francisco, CA, on a deserted side street near Ghiradelli Square, my boyfriend and I saw a bright red, round light arc through the sky beginning on our right.  We both stood still and followed the light with our eye, when it was directly over our heads it slowed to a stop, hovered absolutely silent, as we were looking up it started to come closer and closer and appeared bigger and the light more diffused.   When my boyfriend quickly grabbed his camera and took its picture, the object took off in the opposite direction from which it came extremely fast.  We barely got any image of it.",
      "link": "http://www.nuforc.org/webreports/086/S86354.html",
      "state": "CA",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3bc2aa",
      "summary": "New years eve UFO sight over San Francisco",
      "city": "sanfrancisco",
      "shape": "light",
      "date": "2012-01-12T00:00:00",
      "story": "New years eve UFO sight over San Francisco When looking at the stars on New Years eve.  A few blocks from San Francisco State University we notice a red light on the comstellation of Orion. The red light moved towards the north (up-down movement) in a very fast speed (lots faster than any airplane could go) and it began to move from left to right and at an instant moving back almost like a u-turn. Then it move faster towards the north and disappeared. ((NUFORC Note:  Witness elects to remain totally anonymous; provides little contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/086/S86267.html",
      "state": "CA",
      "duration": "10-15 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bc2fe",
      "summary": "Multiple lights over Ocean Beach",
      "city": "sanfrancisco",
      "shape": "light",
      "date": "2012-01-24T00:00:00",
      "story": "Multiple lights over Ocean Beach Sorry this is so long- this was such a strange experience and the details remain vivid to this day. Noticed about 3 or 4 spheres, glowing orange, over Ocean Beach.   First thought it was fireworks (a lot of people set them off at this beach), then thought it may have been fishing boats but the orange spheres rose up slightly and hovered for several seconds (felt like minutes) very un-boat-like.  Saw 2 or 3 more orange light spheres rise up in the air.    Third thought was weather balloons, or maybe glowing kites, but then the spheres rose up higher, some faster than the others, all moving up but not in a uniform direction.   The spheres then moved south towards Pacifica and disappeared.  Never seen anything like this and couldn’t find any reference online \"mysterious lights\"; lights over Ocean Beach\" etc, to what I saw.  Finally found these postings and am so glad someone else saw this too.  Overall sighting lasted maybe three or four minutes- a long time. The other post mentions being over by 24th St which is high on a hill but far from Golden Gate Park/Ocean Beach.  They saw three but I think it was due to the distance; I was much closer and the lights were closer to the ground, also lots of tall houses/buildings in that area. No particular background for me, other than I believe in UFOs and that we aren't alone in this universe. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/086/S86770.html",
      "state": "CA",
      "duration": "3-4 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bc3a4",
      "summary": "Yellow aura around bright red center low in sky and lossing the aura to then grow faint and rise up in the sky to vanish completly.",
      "city": "sanfrancisco",
      "shape": "sphere",
      "date": "2011-12-12T00:00:00",
      "story": "Yellow aura around bright red center low in sky and lossing the aura to then grow faint and rise up in the sky to vanish completly. Single Cherry-red glowing center, fairly large for distance of object, not like a planes blinking red lights. Surrounded by a yellow-orange glow. I'm on an outdoor deck looking East in San Francisco in the Marina District. It came slowly through airspace, from NE to SW, pretty low in sky from my stand point. Went behind building for a few seconds still coming toward my general direction, and reappeared as I moved to corner of deck to meet it, sight wise, and watched the yellow glow disappear and the red center part get smaller - it seemed to now be going up into the sky and quickly vanished. I looked hard for a remnant of a faint light but there was nothing. I thought maybe behind a cloud but then realized I could see many and vast stars all in the area it vanished in - so this would rule out cloud cover. Very odd sighting. In summary; it seemed to be fairly low in the sky moving generally toward me. One glowing cherry-red center and an orange-yellow halo which diminished over time to vanish all together, and then the red center grew faint quickly and it vanished from all sight completely; seemingly moving in an upward flight into the atmosphere. No trace of any light could be seen, I could see stars. But nothing at all.",
      "link": "http://www.nuforc.org/webreports/085/S85503.html",
      "state": "CA",
      "duration": "~5 to 10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bc362",
      "summary": "Triangle craft with lights seen over SF",
      "city": "sanfrancisco",
      "shape": "triangle",
      "date": "2011-10-10T00:00:00",
      "story": "Triangle craft with lights seen over SF Approx. 21:40 9-26-11 I see a triangular craft heading East over central San Francisco.  4 lights, dim: one at each corner, one in the middle. If I hold a quarter an arm's length from my face it would appear the same size perspectively. No noise. At least twice the speed of usual commercial aircraft. Seems to be same as this:  http://www.examiner.com/ufo-in-sacramento/ufo-triangle-the-san-francisco-bay-area-reported-january-26th-2010-see-images   Lockheed TR series project?... ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/084/S84163.html",
      "state": "CA",
      "duration": "3 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bc408",
      "summary": "A light in the sky flying in a zigzag formation that disappeared after a minute or so.",
      "city": "sanfrancisco",
      "shape": "unknown",
      "date": "2012-01-12T00:00:00",
      "story": "A light in the sky flying in a zigzag formation that disappeared after a minute or so. Tonight in San Francisco, I saw a bright star in the Southern sky just to the right (west?) of Orion’s belt.  It was too far away to see the shape but it was brighter than most stars in the sky, and it’s a clear night tonight.  It was moving West in a subtle zigzag formation.  After about a minute it slowed and started to get smaller.  It became dimmer and dimmer until it disappeared, all in about 15 seconds. I’m not sure what it was but it did not look like a plane, nor did it move across the sky as a conventional plane would fly, and there are lots of planes in the bay area sky.",
      "link": "http://www.nuforc.org/webreports/086/S86295.html",
      "state": "CA",
      "duration": "75 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bc5f9",
      "summary": "drifting flame colored/shaped light hovering and drifting beneath the overcast sky of SF. disappeared, then reappeared, visible 2 mins.",
      "city": "sanfrancisco",
      "shape": "fireball",
      "date": "2011-10-25T00:00:00",
      "story": "drifting flame colored/shaped light hovering and drifting beneath the overcast sky of SF. disappeared, then reappeared, visible 2 mins. initially, i saw it out of the corner of my eye through the living room window and noticed that my cat was also looking at it. then i called to my husband to also have a look. my binoculars were nearby so we used those. the sky was overcast and it was clearly flying below the clouds.  when we looked at it through the binoculars, we couldn't see a craft silhouette for size or any other lights except the solid orange flame colored one. it hovered, then continued flying at various speeds but usually just a mellow drifting, retaining the same solid golden, flame color and shape. at first when it disappeared, it was gone for maybe 20 seconds, then reappeared where it originally was spotted and was visible for at least a minute until it faded away again. it seemed to ascended through the clouds; it got dim then vanished. both my husband and i felt as though we had gazed upon something that we could not identify.",
      "link": "http://www.nuforc.org/webreports/084/S84631.html",
      "state": "CA",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bc63a",
      "summary": "point of light in sky stopped moving and remained stationary for ~2hr",
      "city": "sanfrancisco",
      "shape": "light",
      "date": "2011-10-25T00:00:00",
      "story": "point of light in sky stopped moving and remained stationary for ~2hr at 7:30 pm i saw one single point of white light moving across the sky like a regular satellite (i originally thought it was a satellite, although moving a little faster than usual).  it appeared way to high to be an airplane and was definitely not a meteor, comet, or helicopter.  it entered my field of view over my apt building from the NE moving SW.  i pointed it out to my girlfriend \"hey, look at that satellite\".   i witnessed it stop mid-way across the sky at due south and 80 degrees up from the horizon.  i then pointed it out to her again and another person nearby.  it appeared to be the one of the brightest visible stars in the sky (comparable to others).  i kept watching for about 10 minutes and it did not move.  i noted the location where it stopped and continued to check back every 30 minutes to see if the object was still there (maybe it was a satellite and i lost track of it near a star).  at 10pm (2.5 hours later) i noticed it was no longer there! .  i did not witness it leave but can confirm there is no star in the location the object appeared to stop before.",
      "link": "http://www.nuforc.org/webreports/084/S84649.html",
      "state": "CA",
      "duration": "2.5 hr"
    },
    {
      "_id": "64d005f478aba2ec5a3bc728",
      "summary": "6-8 pinkish-red starlike objects sighted in San Francisco, California sky",
      "city": "sanfrancisco",
      "shape": "light",
      "date": "2012-01-24T00:00:00",
      "story": "6-8 pinkish-red starlike objects sighted in San Francisco, California sky Just before 7p.m. Pacific Standard Time on January 20, 2012, I witnessed a succession (6-8) of several pinkish-red starlike objects moving steadily through the sky of San Francisco, California.  I was in the middle of the city, walking east, when I glanced north and saw the objects moving from the northwest (seemingly coming from over the Pacific Ocean), and moving to the east (or slightly southeast).  I could not see their full passage through the sky, as part of it was blocked by neighborhood buildings (they were not extremely far above the horizon, and my view of them could be obstructed by three-story building across the street from where I was). The objects were not making any sound that was audible from where I was walking. Relative to a star or planet in the night sky, the objects were about the same size or slightly bigger than the planet Jupiter.  They twinkled slightly, as stars do, and did not emit a pattern of blinks.  The air was steady (no wind) and the sky was clear. As the objects moved inland, they gradually faded into the distance until no longer visible.  They moved at about the speed of a commercial jet through the sky, if not slightly faster.  They did not leave trails, and were distinct objects, moving from left to right, rather than vertically or at an angle, as shooting stars or space debris passing through the Earth’s atmosphere. I did not notice a distinct formation in which they were moving, except that they were all moving in the same direction and disappeared in approximately the same area.  They were not traveling in a line, but were rather staggered in elevation, and moving at the same pace. I pointed the last one I saw out to someone else who was outdoors at the time. I went out twice later in the evening, and did not see similar objects again. ((NUFORC Note:  We spoke via telephone with this witness, and we found her to be exceptionally eloquent, objective, and credible.  We suspect that she is a very capable, and reliable, witness.  Witness corrected the date of sighting, and we have amended the date above.  PD))",
      "link": "http://www.nuforc.org/webreports/086/S86749.html",
      "state": "CA",
      "duration": "4 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bcee2",
      "summary": "Object covered by white and red light observed again",
      "city": "sanfrancisco",
      "shape": "light",
      "date": "2011-05-12T00:00:00",
      "story": "Object covered by white and red light observed again As before with my previous description; Craft surrounded by white and red light does odd maneuvering in the sky off the coast of California.  The craft did very obvious horizontal, vertical and circular movements.  I Didn't watch very long this time since the first time I encountered this object I became sick.  Might of also observed one or two very feint red craft which one craft may of intersected with the main UFO.  As with first sighting commercial aircraft may of been diverted from regular flight patterns when taking off from SFO.",
      "link": "http://www.nuforc.org/webreports/081/S81136.html",
      "state": "CA",
      "duration": "20 min"
    },
    {
      "_id": "64d005f478aba2ec5a3bd4e3",
      "summary": "3 Bright Orange Circle UFOs in the SF night sky & two men in military clothing",
      "city": "sanfrancisco",
      "shape": "circle",
      "date": "2012-10-30T00:00:00",
      "story": "3 Bright Orange Circle UFOs in the SF night sky & two men in military clothing Finished dinner at Basil Canteen on 11th in San Francisco and looked up to see the 4 UFOs.  There were 3 orange lights in the sky and one standard set of lights that looked like it was hovering.  The standard lights held steady while the orange lights flew in all different directions in the sky.  It looked as one orange craft was heading right in my direction, while all orange lights faded out of view.  This lasted under 2 minutes.  As I was watching the sky, I saw 2 military officers in full uniform heading in the direction of Slim's night club on 11th.",
      "link": "http://www.nuforc.org/webreports/093/S93292.html",
      "state": "CA",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bd8c2",
      "summary": "Orange/red pulsing orb seen in overcast SF sky, flying low northbound",
      "city": "sanfrancisco",
      "shape": "other",
      "date": "2012-08-05T00:00:00",
      "story": "orange/red pulsing orb seen in overcast SF sky, flying low northbound at 11:20 PM (pacific standard time), my husband and i witnessed what i'd liken to a de-ja-vu experience of what we saw on october 18th, 2011 at roughly the same hour. an orange/red pulsing orb, flying below the clouds northbound and then turning east as it faded into the overcast sky. altitude, maybe 2000 feet in the air, traveling at a mild pace. this time, it was brighter and seemed to fly lower than the previous sighting and was visible for about half the time.  it is eerie because we saw it in the same position in the overcast SF sky, out the same living room window.  two of our bay windows were open and no sound of any aircraft could be heard.  it was silent out as a matter of fact, no wind or traffic at the moment. our cat was freaking out yet again, although i'm not sure if he saw it like he did last time. we managed to capture two photos, although it came out so blurry!  it disappeared in the same manner as the previous sighting. object dimmed and faded away through the clouds. gone.  i will also add that i've been seeing dull flashes of light in the sky throughout the evening. not sure if this is related to the orb, but i have seen 3 flashes so far that illuminate the sky. definitely not lightning, as it is not bright enough and not accompanied by thunder. no precipitation.",
      "link": "http://www.nuforc.org/webreports/090/S90892.html",
      "state": "CA",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3bdf34",
      "summary": "Recorded a dark disk shaped object fly in between 2 blue angles.",
      "city": "sanfrancisco",
      "shape": "disk",
      "date": "2012-11-04T00:00:00",
      "story": "Recorded a dark disk shaped object fly in between 2 blue angles. I was on the roof recording the blue angles,  An object/disk/saucer.. flew super fast in between 2 of the planes.  I downloaded it to my computer and paused it as it flew in between the 2 planes.  I could tell the shape wasnt like the planes. ((NUFORC Note:  We have written the source of this report, requesting that he send the photo to NUFORC for inspection.  So far, we have not received a reply.  PD))",
      "link": "http://www.nuforc.org/webreports/093/S93994.html",
      "state": "CA",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3be58c",
      "summary": "Large bright green fireball moves slowly in the sky.",
      "city": "sanfrancisco",
      "shape": "fireball",
      "date": "2012-04-18T00:00:00",
      "story": "Large bright green fireball moves slowly in the sky. At the beach when a bright green fireball appeared.  It was very large, perhaps the size of a silver dollar at the end of your outstretched arm.  It seemed like it could have been as close as a few miles off, moving south to north.  I could see the flames burning as if it was a small sun, and moving so slow that the long tail of smoke was rising up into the air.  It never varied its height, just moving silently horizontal to the horizon, then just disappeared in an instant, the smoke still left behind. I noticed some green fireballs in your other data log.  Do you have any idea of what this could have been?  Thanks much, ((name deleted)) ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/088/S88051.html",
      "state": "CA",
      "duration": "60 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3be900",
      "summary": "Fireball type object spotted hovering over San Francisco approx 3mins.",
      "city": "sanfrancisco",
      "shape": "fireball",
      "date": "2012-04-18T00:00:00",
      "story": "Fireball type object spotted hovering over San Francisco approx 3mins. I spotted one fireball type object floating in the sky just below the full moon on April 6, 2012 around 22:48 from my apartment window in San Francisco, CA. The object looked familiar from an instance on a Sunday in January on either the first or the eighth. Once I spotted the object, I ran and grabbed my camera and recorded a 3min 10sec clip of the light. The light floated gently in the sky varying in brightness and direction in a slow but consistent rate of speed. Stopping in one place for only a few times and a short period of time. The flight path appeared to waver slightly left and right from my view point. Not resembling what I have seen from planes or helicopters flying over the same location. In appearance, the light resembled closest what I would consider a fireball. Reddish to orange around a dark core; though at times the core appeared to flicker with a reddish to yellow hue. I have a BS in Business and Technology and am currently earning my Masters of Architecture degree in San Francisco, Ca. I was the only witness present unfortunately but was able to grab a camera and record the sighting. I believe this sighting tonight is related to the sighting in January due to the similar flight patterns, color and scale of the objects in question. The full moon might also be a similarity as there was one around Sunday January 8th when the first sighting occurred and another on April 6th. Overall, it was quite impressive.",
      "link": "http://www.nuforc.org/webreports/088/S88241.html",
      "state": "CA",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bea28",
      "summary": "Soccer Balls over SF",
      "city": "sanfrancisco",
      "shape": "sphere",
      "date": "2012-02-03T00:00:00",
      "story": "Soccer Balls over SF I do not recall the date or even exact time of the year but likely it was Autumn of 1997 or 1998 in San Francisco, California.  At approximately 10 AM I was standing in the redevelopment zone now known as Mission Bay, adjacent to the old Bethlehem Steel Yard just 60 yds north of the restaurant/lounge called Mission Rock Resort.  I was drinking coffee and watching the view across the Bay to the east when I saw two white \"balls\" just feet off of the deck of SF Bay coming towards me from the direction of the Oakland Airport.  I took these to be two Sikorsky S61 helicopters of the USCG and thought that I was about to witness a test exercise.  However as they came closer into view I realized that these objects had no wings or rotors.   They were soon in good view and the day being near perfectly clear, warm and quiet in my location I could see that they would pass me at near ground level.  As they approached at an estimated 30 mph I could plainly see that they were two separate objects of equal size in the shape of soccer balls, that is they were generally round but had a series of flat sides precisely like that of a soccer ball.  As they neared the edge of the shore they, in perfect close formation, began to climb slightly to an altitude that I estimate as 250-300 ft and passed me only about the same distance laterally.  I was simply awestruck.  I witnessed two fisherman on a nearby dock who apparently saw nothing.   As the two objects passed my location (They made no sound, had no aura, lights or haze around them) they increased their altitude dramatically and climbed to an estimated 1000-1500 feet above the skyline of San Francisco.  It was a weekend day, I believe Sunday and when I followed their progress to the north of me I noticed LARGE numbers of similar objects!   I am familiar with the San Francisco skyline and habits of its citizens and could not identify all of these objects.  A few could have been Mylar party balloons that had gotten away from people and some others were definitely real hot-air balloons in the distance up in Sonoma.  I always kept one eye on these two items while making these other observations.   Upon reaching their maximum altitude the two \"craft\" then did a maneuver about each other that I can only describe as a dance, similar to a deux-se-deux of a square dancer.  This was only momentary and then they began, still in formation, to return along the same flight path that they had just traversed.   Since my first sighting of these two vessels perhaps only three minutes had passed.  I knew that they would return my way yet I found it impossible to yell out to the only two others nearby, the fishermen, as I was so transfixed.  I did notice a police squad car approaching at slow speed and briefly thought to hail them down but my astonishment was such that I could not speak a word!  As expected these two objects returned at the same speed, passed me again at the same distance and again dropped down to the deck as they headed back towards the East Bay.  I had no reference to judge their size and can only surmise that they were each about the size of two small autos.  They were Flat (Mat) Hospital White in color and their surface, clearly solid, could have been metal or even fine wood.  There were no windows, lights or protuberances of any kind.  There were no flames, emissions, contrails or noise. As for the great many other objects that I saw over the City skyline that day, some of which I identified as hot air balloons farther away in the distance and others possible Mylar balloons, there were perhaps 100 more objects, most of them shiny metallic.  Most were stationary or nearly so, some actually moved in the opposite direction of the prevailing wind (Which was negligible that day).  I could clearly see that these shiny metallic ones were rotating on their axis in a clockwise direction.  Most made little lateral movement or altitude adjustments.  As I was focused on the two \"soccer balls\" I dismissed these others, though I found them quite dramatic. I spent the rest of the weekend awed by this experience and upon returning to work at the SF Public Library on Monday I immediately discovered a flier in the lobby alerting people to the \"continuing\" UFO sightings on, around and about the Oakland Bay Bridge in the vicinity of it's Eastern terminus, an area now called South Beach. The flier stated that a CHP unit had observed it one night ( I think I have since read that somewhere else.) and that crowds were continuing to gather. The flier was an open invitation to join the crowd, however I did not. The flier further stated that the local media were aware of the ongoing phenomena but would not cover the story. As I have become so deadened to the UFO issue I did not think to report this to anyone. I promised Peter D. that I would write up this report regardless of it's age.  I lived in San Francisco for over twenty years and spent a great deal of time outside. Indeed I drove a taxi full time for about ten years, 50-60 hours per week.  I am quite aware of the comings and goings of aircraft, flying debris, the relative wind, human activity and so forth in the City.  Nothing that I can imagine can explain away the vast number of odd-acting objects that I observed that day other than the two or three that I noted above. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  One of two seemingly credible reports from the same source.  Other sighting occurred near Ocotillo Wells, California, on, or about May 01st, 1994.  PD))",
      "link": "http://www.nuforc.org/webreports/086/S86966.html",
      "state": "CA",
      "duration": "6-7 Minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3beab4",
      "summary": "Rotating dark object that climbed in altitude and traveled southeast",
      "city": "sanfrancisco",
      "shape": "cigar",
      "date": "2012-02-03T00:00:00",
      "story": "Rotating dark object that climbed in altitude and traveled southeast I am a full time student at City College of San Francisco and I also work for a public relations company part-time.  I recently moved to this part of San Francisco.  My house is on a hill and there is a window facing the ocean.  The ocean is about 3 miles away. What I saw was a rising object that looked like a shiny black disc.  When I spotted it, it was a little west of San Francisco State University.  Then the UFO drifted upwards and east.  It revolved horizontally and I was able to see that it was egg or cigar shaped because it would be a small dot and then it would be long and skinny.  When it was long, it was about 3 times the length of when it was a dot.  There was a glare on top of it from the sun. I looked at the UFO more closely with binoculars and it had a black underside and maroon/redish topside. It also appeared to have fins like a fish.  The fins were translucent green and in the same locations as a fish.  A fin on top, a fin on bottom, and a larger \"tail\" fin.  It was as large as a blimp but I didn’t see any entry points on the UFO. I was unable to see it after it climbed in altitude and was in front of the sun.",
      "link": "http://www.nuforc.org/webreports/086/S86833.html",
      "state": "CA",
      "duration": "13:55"
    },
    {
      "_id": "64d005f478aba2ec5a3bed97",
      "summary": "UFO light zooms across san francisco night sky in august 2011.",
      "city": "sanfrancisco",
      "shape": "light",
      "date": "2013-05-15T00:00:00",
      "story": "ufo light zooms across san francisco night sky in august 2011 i had seen a light zoom across the sky so fast that it should have made a sonic boom or something if it was a conventional aircraft.it happened about 3:30 am.the night sky was a kind of light purple with sporadic clouds and the ship or light came from behind one cloud and flew across the sky into another cloud formation.  i was just lucky to happen to be looking up at the sky while walking my dog to have caught a sight of a ufo.  now i'm always looking up at night, so much that i sometimes bring along a green laser pointer that can travel up to 5 miles so i can try and get the craft's attention next time ((NUFORC Noe:  Date may be approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/097/S97060.html",
      "state": "CA",
      "duration": "1-2 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bee26",
      "summary": "Silent, bright blue, reflective orb headed straight to Ocean Beach in SF, CA",
      "city": "sanfrancisco",
      "shape": "sphere",
      "date": "2013-08-30T00:00:00",
      "story": "Silent, bright blue, reflective orb headed straight to Ocean Beach in SF, CA I was walking up the street to my house when I saw a bright blue, reflective orb streaking overhead at (I would guess) about 40 mph, with a west-northwest heading, toward the beach (which is about three miles from my street).  It was small, only about 700 or 800 feet up, and completely silent. I am twenty-five years old and have never seen a UFO before. I live near a large airport, so I’m used to seeing and hearing airplanes, and I live near the beach, so I’m used to seeing a lot of birds and other airborne creatures around, and this was certainly something else.",
      "link": "http://www.nuforc.org/webreports/100/S100707.html",
      "state": "CA",
      "duration": "3 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3beff5",
      "summary": "At the moment i do not view the UFO, when transfer the photos to the computer see it. There are 3 UFOs, are composed by 9 o 10 little b",
      "city": "sanfrancisco",
      "shape": "teardrop",
      "date": "2013-07-03T00:00:00",
      "story": "At the moment i do not view the UFO, when transfer the photos to the computer see it. There are 3 UFOs, are composed by 9 o 10 little burbbles. I hace a dropbox link with the fullsize photos. https://www.dropbox.com/sh/h0dghzezhgyef2c/FL2ZFN-qll",
      "link": "http://www.nuforc.org/webreports/099/S99067.html",
      "state": "CA",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3bf287",
      "summary": "RE: Telephone Contact at 9:00 PM, Friday, 7 June, 2013.",
      "city": "sanfrancisco",
      "shape": "other",
      "date": "2013-07-03T00:00:00",
      "story": "RE: Telephone Contact at 9:00 PM, Friday, 7 June, 2013. This morning at Approx. 10:00 AM, as I entered a Clinic in Downtown San Francisco, I noticed a rather unusual object exit from a area of a Apartment Building at 1394 Market Street, a High Rise Building across from Twitter HQ. I observed  a rather Silver Colored Flying object, which could NOT have been a Bird, in Jerky Motion, fly Out & Away from the Building,  Not Hovering, but seemingly getting ts Bearings\" then, with what appeared to me, [ as a former Model Remotely Controlled Airplane Enthusiast] similar to Radio Remote Controlled Aircraft. I had a Nikon Point & Shoot Camera, but could not have caught the Silver Flying Device, the Sun being contrary & the Rapid Take off. The devise at a point of approx. 15 Yards Out from the Building then Very Rapidly Gained altitude above the Roof of the Building, and orientated itself to a Northern Flight Path and was Quickly beyond vision.  The &quot;Towers&quot; Apartments [I am not naming it] is Quite Tall, and the Area where it departed from, is a Rather Tight enclave on the North Face, which is the Rear of the Building.  I am Former M.A.R.S. Member, Amateur Radio since 1958, and C.A.P. member in High School, have a Broadcast Radio Engineers FCC License, [1974] and worked several years as a &quot;Steeple Jack&quot; in Kansas, Arkansas & Texas, [Climbing TV & Radio Towers to Change FFA Clarence Lights & install Antennas/Hard Line Coax.] I am, at 63 Years, a Constant &quot;Looker-Upper,&quot; to coin a phrase.  I did take .jpg photos of the Building which shows the Enclave from whence came the Device, and exhibits the Height of the Building.  I thought it was perhaps a rather Sophisticated Drone, but I am absolutely certain it was Not a Bird.",
      "link": "http://www.nuforc.org/webreports/098/S98485.html",
      "state": "CA",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bf386",
      "summary": "Huge triangle of lights. Looked like really bright stars till it rotated and flew off almost like it was gliding. It made no noise and.",
      "city": "sanfrancisco",
      "shape": "triangle",
      "date": "2013-05-15T00:00:00",
      "story": "Huge triangle of lights. Looked like really bright stars till it rotated and flew off almost like it was gliding. It made no noise and was gone in about 5 seconds.   Looked to be about 3 football fields in size but was hard to tell since it was so high up. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/097/S97126.html",
      "state": "CA",
      "duration": "8 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bf439",
      "summary": "Two Unidentified Flying Objects.",
      "city": "sanfrancisco",
      "shape": "disk",
      "date": "2012-12-20T00:00:00",
      "story": "Thirty two years ago I reported my UFO incident to AFSCA and kept a copy of my letter.  Here is my verbatim letter dated June 19, 1980. Sunday, June 15, 1980, at approximately 9:45 p.m. I witnessed two unidentified flying objects. First I noticed lightning from my bedroom window.  I did not hear any noise and as I approached the window I realized it was not raining.  The lightning was blinking behind my neighbor’s house.  As I scanned the city from my view I saw a UFO.  It was a weird design as I have illustrated here. These are red lights.  (Drawing)  It flashed one second and then disappeared. I focused my attention on the lightning behind my neighbor’s house and all of a sudden it stopped and a flying saucer ascended high above the neighbor’s roof.  The saucer appeared dark then lights went on.  It’s green and transparent so I could readily see it was occupied by one person.  The lights are brilliant and illuminated around the saucer and below the scene created a beautiful pattern.  It was immobile a few seconds then the lights went out and it disappeared.  For the next two minutes the lightning reappeared while far away in the distance the other UFO flashed once again. This was the last I saw of the two UFO’s.",
      "link": "http://www.nuforc.org/webreports/095/S95154.html",
      "state": "CA",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bf58e",
      "summary": "Whitish/metallic sphere high in the sky over San Francisco CA.",
      "city": "sanfrancisco",
      "shape": "sphere",
      "date": "2013-10-14T00:00:00",
      "story": "Whitish/metallic sphere high in the sky over San Francisco CA. Location: San Francisco, CA  Date: October 2nd, 2013     UFO sighting report  On October 2nd, 201,3 at about 11:45 am, on a cloudless sunny Wednesday morning in San Francisco, I witnessed a round shaped (it could’ve been disc shaped) UFO flying at a very high altitude going from northwest to southeast direction.  The object was white but it could’ve been silver, it was very high in the sky, way higher than altitudes that regular passenger jets usually fly in this area.  It was flying at a slow speed from my perspective and it was not doing any erratic movements.  At one particular point, it sharply turned east positioning itself right above my head and then it stopped moving and just hovered there for a while, which clearly indicated that this thing was under intelligent control. The object stayed semi-stationary, doing side to side and up & down small movements (again from my perspective), and at one point I felt that the object intentionally wanted me to see it...  After about 10 minutes, the object started moving and after another minute or so I lost eye contact with it as it moved away to the southeast, it was very very high up in the sky.  The best part of this sighting was that I was able to capture a 1:36 s video of the object while it was above my head executing side to side up & down small maneuvers.  The white/silver object although small is pretty clear in the video if you know what you’re looking for.  I was filming it with my iphone camera which does not have a zoom feature (which sucks).  I was tempted to go grab my digital camera which has good zoom but I was afraid I was going to lose contact  with the object if I ran inside the house to retrieved the digital cam (which the batteries turned out to be dead I found out later, so it was the right decision). The convincing part of this sighting is that there were absolutely no clouds whatsoever in the clear skies that day and you can clearly see the round shaped object in the video.  Another interesting side of this experience was that, a few minutes before, I was contemplating the sky in a meditative state of mind sending out thoughts of harmony, joy, love and eagerness for knowledge, I made a request that if there were anybody out there intercepting my thoughts at that moment to please manifest itself somehow, then this object appeared out of nowhere flying from the northwest.  It almost looked like it turned off its cloak device to show itself to me. I was amazed, undoubtedly this sighting was real, it wasn’t an airplane (they don’t stop in mid-air), it wasn’t a weather balloon, and it wasn’t an optical illusion either.  This was a metalic/whitish colored structured flying pretty high in the sky under intelligent control.",
      "link": "http://www.nuforc.org/webreports/103/S103026.html",
      "state": "CA",
      "duration": "10-15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bf6c5",
      "summary": "Strange triangular moving lights over San Francisco.",
      "city": "sanfrancisco",
      "shape": "triangle",
      "date": "2013-02-04T00:00:00",
      "story": "Strange triangular moving lights over San Francisco My boyfriend and i were outside smoking some cigarettes and looking at the sky.  In the city there are a lot of lights which contribute to light pollution and not being able to see the sky the way you would in more rural areas.  However looking at the sky you can tell the difference between helicopters, planes, and stars.  The lights we were seeing in the sky were neither a helicopter or a plane because it was too high and moved in strange patters with triangularly faint whitish blue lights, and the movement ruled out stars, as well as the light being perceived acted differently than a star would.  The lights would flicker or get duller and move quickly or slow down in strange patterns.  We perceived maybe around three in the ten or fifteen minutes we were outside.",
      "link": "http://www.nuforc.org/webreports/095/S95628.html",
      "state": "CA",
      "duration": "20"
    },
    {
      "_id": "64d005f478aba2ec5a3bf97b",
      "summary": "Five lights over San Francisco fade away high over head NYE.",
      "city": "sanfrancisco",
      "shape": "oval",
      "date": "2013-02-04T00:00:00",
      "story": "Five lights over San Francisco fade away high over head NYE. I was getting off work a few minutes before the New Year. I walked outside of the station.  The night was cold with some clouds, but clearing.  Three light were high in sky flying north one behind the other about mile.  The lights were white light with a red light in the center.  They were a little brighter than an aircraft that high in the sky, and moving about the same speed as an aircraft that high. (Over 10,000ft.) I noticed two more of the same, but out to the west, like out over the ocean. A co-worker pulled into the station, I pointed out the lights to him. He looked up and said, \"What? That red light?\" As the lights got over head, All five faded off the lights at the same time.",
      "link": "http://www.nuforc.org/webreports/095/S95789.html",
      "state": "CA",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bfabc",
      "summary": "Bright light in the sky then dims out and vanishes as it moves south and east.  ((NUFORC Note:  Possible satellite??  PD))",
      "city": "sanfrancisco",
      "shape": "light",
      "date": "2013-07-03T00:00:00",
      "story": "Bright light in the sky then dims out and vanishes as it moves south and east A very bright light came from West Northwest and as it disappeared towards the East Southeast it quickly diminished in brightness until it could no longer be seen. It had no flashing lights.   Much lower in the sky an airplane was passing simultaneously whose lights and flashing lights could be seen.  The plane could be heard, but was slightly behind the glowing object which had passed first and silently.   It was very large and I suppose it could have been the international Space Station if it was passing over San Francisco at that time, otherwise I cannot image what it could have been.  I just looked at the ISS tracker and it is considerably to the south of our location along the equator and did not pass overhead in San Francisco in this last orbit. ((NUFORC Note:  Possible satellite??  PD))",
      "link": "http://www.nuforc.org/webreports/098/S98788.html",
      "state": "CA",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c0254",
      "summary": "Flashing lights in the sky at night in sf",
      "city": "sanfrancisco",
      "shape": "light",
      "date": "2013-05-15T00:00:00",
      "story": "flashing lights in the sky at night in sf I was in bed on my phone about to sleep with the lights off after a night of writing a paper.  The window shades are wide opened because I like waking up to sunlight.  From my peripheral, I notice lights moving across the sky.  I turn to look at it and thought it was just a plane. It was brightly flashing white, blue and red lights so maybe the police.  Even that would be a first because I've never seen a police helicopter at night in the area of SF I live in.  But then after watching it for literally a second or two the lights just vanish.  I wait and nothing.  Looked at where it is suppose to be based on how fast it was moving but I didnt see it again. I know how planes would usually have flashing lights too but I have  never seen any simply disappear.  It's a fairly cloudy night and I would've seen the intensity of the lights diminish if it went further away or behind clouds.  My skin was covered in goosebumps when it was simply gone.   I dont know what I saw but I ! saw it.",
      "link": "http://www.nuforc.org/webreports/097/S97618.html",
      "state": "CA",
      "duration": "2 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c0279",
      "summary": "High altitude rod or cylinder shaped object with white blinking lights observed in SF.",
      "city": "sanfrancisco",
      "shape": "cylinder",
      "date": "2013-06-02T00:00:00",
      "story": "High altitude rod or cylinder shaped object with white blinking lights observed in SF An object seen heading south east after dusk in San Francisco (8:50 PM Pacific Standard Time) on Thursday, May 30th, 2013:  On a perfectly clear evening sky, I observed what could have been dismissed as a shooting star, except that it was bright white, rod shaped and had blinking white lights.   I happened to be looking out my front window which is a south eastern exposure and saw a blinking series of lights on what appeared to be an elongated craft which seemed to be rod or cylinder shaped.  It traveled about the same speed as you'd observe a fighter jet or shooting star passing through the atmosphere - extremely fast.  What made me consider the very high altitude of the object in the atmosphere was the fact that the lights faded out far above the horizon, as a shooting star would.  It was only visible for what seemed to be a fraction of a second, however long it takes to witness a solid shooting star.   I was stunned!  There was no sound.  I half expected a sonic boom, but there was none.",
      "link": "http://www.nuforc.org/webreports/098/S98249.html",
      "state": "CA",
      "duration": "3 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c03d5",
      "summary": "Two spheres seen near Sutro Tower-Twin Peaks in San Francisco, CA.",
      "city": "sanfrancisco",
      "shape": "sphere",
      "date": "2013-05-15T00:00:00",
      "story": "Two spheres seen near Sutro Tower-Twin Peaks in San Francisco, CA Time & Date: Sunday May 12, 2013, San Francisco, CA approx. 2:25pm Pacific Time Weather: Clear, partly sunny, windy, approx 65 degrees F. Duration of sighting: less than 10 seconds Angle of elevation of sighting: approx. 20 degrees  I was walking westbound on 17th Street in San Francisco, CA approaching the intersection of Castro Street & 17th Street.  I looked up at the large, 300 meter high- communications tower (Sutro Tower) on the hilltop approx. 1.5 miles away from my viewing position and noticed slightly to the north of the tower two spheres. The spheres appeared to be light matte gray in color.  They were both the same size.  No lights, no glowing, no reflection, no shininess.  They did appear to be spinning rapidly, one above the other, very close together.  I would estimate their size to be approx. 25 feet.  The spheres changed position, revolving quickly around the other one to switch position.  The spheres then pulled away from each other (right-to-left) and then quickly moved back together and merged abruptly into one another, became one unified sphere, but still the same 25 foot diameter. As soon as they unified, they instantly disappeared or rather dematerialized.  No smoke, no light, no noise.  Nothing.  Just silently dematerialized. I immediately checked my watch and it was 2:25pm.  I looked around to see if any other bystanders had noticed.  No one on the street at the time was looking up in that direction.  I asked a street vendor if she noticed anything and she said she had not.  I asked another gentleman standing near me (he was focusing on his phone at the time) if he saw or sensed anything and he said he did not. The entire sighting took place in less than 10 seconds.",
      "link": "http://www.nuforc.org/webreports/097/S97714.html",
      "state": "CA",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c054c",
      "summary": "Faster than any aircraft I've seen that is completely silent.",
      "city": "sanfrancisco",
      "shape": "fireball",
      "date": "2013-04-12T00:00:00",
      "story": "Faster than any aircraft I've seen that is completely silent Smoking outside my 6th floor balcony I saw two blinking red lights from one object, moving much much faster than the usual aircrafts flying over the city.  The object flew silently starting from Russian Hill - 346° degrees North traveling NorthEast 24° NorthEast towards they he Lincoln highway then changed direction back 10° North to Russian hill and changed back to it's original course of 24° NorthEast, then disappearing behind the 'One Thousand Green' Apartment building.   This al took place in less than 30 seconds!  The flight speed was very fast, helicopters and airplanes in that distance cannot maneuver changes in opposite directions like that as fast.  Especially with how unbelievably silent it was!  I was approximately 1 mile away from the object, in which that distance I would normally be able to hear any sound coming from any aircraft.",
      "link": "http://www.nuforc.org/webreports/097/S97054.html",
      "state": "CA",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c05f4",
      "summary": "Fireballs over San Francisco.",
      "city": "sanfrancisco",
      "shape": "fireball",
      "date": "2012-12-20T00:00:00",
      "story": "Fireballs over San Francisco Looked up and saw about 6 fireball looking orbs.  They went in and out of distance and continued to hover then eventually disappeared never making any sounds.  Took a photo with my phone but it was blurry because my hands shook.  Very bizarre.",
      "link": "http://www.nuforc.org/webreports/095/S95109.html",
      "state": "CA",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c075e",
      "summary": "Bright Orange round ball, changed shape to elongated  object, then returnes into bright orange ball.",
      "city": "sanfrancisco",
      "shape": "changing",
      "date": "2014-01-10T00:00:00",
      "story": "Bright Orange round ball, changed shape to elongated  object, then returnes into bright orange ball. When leaving a meeting of our church, my husband looked up and asked me, \"Is that a planet or a star?\"  I looked and saw a bright orange round object (about the size of half my thumbnail) and said, \"Planets and stars are not bright orange.\"   It then disappeared and re-appeared to the left (close-by) in the shape of an narrow and long-shaped object.  It disappeared and then immediately re-appeared in the shape of a bright orange circle, exactly where the first round and bright orange object had been.   I told my husband, \"I think it's a UFO.   Haven't seen one in quite a while but now I have again,\" ((NUFORC Note:  The date above is defective.  We have assigned an arbitrary date, until we hear back from the witness.  PD))",
      "link": "http://www.nuforc.org/webreports/106/S106137.html",
      "state": "CA",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c0c0d",
      "summary": "5 pink/orange lights rising over Bernal Hill in San Francisco.",
      "city": "sanfrancisco",
      "shape": "sphere",
      "date": "2014-01-10T00:00:00",
      "story": "5 pink/orange lights rising over Bernal Hill in San Francisco We had a small dinner party of 4 on New Years Eve 2013 in San Francisco.  Every year we decide go up to our deck which overlooks the Bay and Bernal Hill for the fireworks around the city.  We decided to head up to the deck at around 23:50. We were all talking with one another then we noticed the lights coming up over the top of the hill and one of them swooped down in front of the hill and hovered.  The others were moving into diamond and triangular shapes.  They continued to hover when the fireworks around the city were going off as if watching a show. It started to get creepy so we all decided to go inside. I posted what I had saw on Facebook and noticed the next day it wasn't just us that saw them, so did hundreds of others around the state.  I can say for sure that they were not chinese lanterns.  They were wobbling up and down like a dot but stationary at all times.  It seemed like there was a thin transparent layer or curtain between us and them which made them look and feel surreal.  Very strange!",
      "link": "http://www.nuforc.org/webreports/105/S105967.html",
      "state": "CA",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c0c11",
      "summary": "A group of tiny fiery red star-sized lights.",
      "city": "sanfrancisco",
      "shape": "light",
      "date": "2014-01-10T00:00:00",
      "story": "A group of tiny fiery red star-sized lights. I go on nightly walks to look at stars from the top of the hill I live near.  Tonight as I was admiring the clear night and getting ready for NYE cheers echoing the city, I noticed there were 3-4 of these tiny little fireballs that looked the same size as most stars and especially similar in color to the planet Mars but a brighter lumens than the planet.  Their color was flaming and flickering, whilst they glided in a diagonal-like ascension.  One by one they were out of sight, gliding slowly until they disappeared.  It was hard to see how far they were from me, but they looked like they were quite far up in the sky, thus their size was so tiny.  I've never seen anything like them before, and I assume there could have been more before I got to that viewpoint and started my gazing...I skygaze at the night sky quite a bit, and have never seen anything like these before.  It made me feel both calm and curious, I didn't feel a threat just a sort of inner peace and surreal amazement.   Our elevation in San Francisco is at sea level, so not sure what these may have looked like from higher altitudes.",
      "link": "http://www.nuforc.org/webreports/105/S105855.html",
      "state": "CA",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c0cc7",
      "summary": "Red lights in NW San Francisco sky.",
      "city": "sanfrancisco",
      "shape": "light",
      "date": "2014-02-21T00:00:00",
      "story": "Red lights in NW San Francisco sky. I saw red lights that looked like Mars come out of the NW sky 2 at a time.  They flew side by side, very slowly, stringing out into a line of 9, evenly spaced lights.  They headed SE, then disappeared.  There was no sound.  Low, patchy fog, no wind. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/107/S107160.html",
      "state": "CA",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c1087",
      "summary": "Two virtually motionless synchronized lights about 600 feet up 100 Yds apart W. faceted vibrating and pulsating lights. of all colors.",
      "city": "sanfrancisco",
      "shape": "diamond",
      "date": "2013-12-23T00:00:00",
      "story": "Two virtually motionless synchronized lights about 600 feet up 100 Yds apart W. faceted vibrating and pulsating lights. of all colors. From the Bayview District in San Francisco California On Friday December 13th 2013 At approx. 7:45 PM I was observing through binoculars extremely heavy traffic on US Hwy 280 looking northeast from my living room window, lowering the field glasses for a moment I observed one red light.. then two..  moving into my field of view from over the top of my home moving from the South toward the North.  Then looking through my Binoculars I saw they were in formation and each had slowed to a virtual crawl.   I now suddenly realized each had two small but obvious red lights an equal distance horizontally from each other though not apparently supported by any visible structure but in an identical configuration.  I thought it strange the first apparent red light had now become four in the time it took for me to find and view them through my Binoculars - a maximum duration of perhaps three seconds - and all had slowed to a slow crawl seemingly \"floating\"  without collapsing toward each other as objects do when receding into the distance. I further saw they were in an obvious formation across from one another. From my perspective as I experienced this first sighting - I judged them to be at least a half mile away in the vicinity of one another though not apparently connected and obviously not conventional aircraft like Jet or Prop driven aircraft or helicopters. Within one minute they slowly crossed the short distance to the left behind the big cedar tree behind my house and were then totally obscured from view. I thought it quite strange. I continued to view the stalled traffic on the freeways through my binoculars for Approx. five minutes when I suddenly noticed a very bright and rapidly pulsating light directly North of my location which I estimated to be perhaps a mile away and about 5 to 600 feet above the Mission District of San Francisco - Approx. the Area of Potrero Blvd. and the Hwy. 101 and 280 interchange.  Shifting my position I saw a second object identical in appearance to the first vibrating light light as well in an identical, abet bizarre fashion somewhat northeast to the first and partially obscured by the same ceder tree which had shortly prior obscured my initial odd sighting of the four red lights, I watched in amazement and fascination  as they seemingly hovered motionless and in unison.  This continued for Approx four minutes before I quickly went to my computer to contact my online community in the SF area to inquire if they too could see what I was witnessing.  One friend a few miles to the west said she could see a bright stationary light hovering over the area of the Mission Dist. She wrote: \"I saw a VERY bright, large light on the southeastern sky.  At first I thought it was a plane, but it was not moving.  Then I thought perhaps it was a planet, but it was pretty low on the horizon\".  After a few minutes exchanging excited online messages I returned to my position on the couch and again saw the bright light nearly exactly where I had first seen it as a vibrating light in a few minutes prior, the second object wasn't immediately visible but quite quickly I grabbed the binoculars and my camera and ran out of my home and around the block to where I would have an unrestricted view of the entire sky.  This took Approx. 90 seconds but there was nothing unusual visible at that time or location. i observed for ten minutes before returning home and calling the police.",
      "link": "http://www.nuforc.org/webreports/105/S105330.html",
      "state": "CA",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c1355",
      "summary": "Bright orange ball over San Francisco changed shape and repeated.",
      "city": "sanfrancisco",
      "shape": "changing",
      "date": "2014-01-10T00:00:00",
      "story": "Bright orange ball over San Francisco changed shape and repeated. my husband and I were leaving a meeting of our church when he noticed a bright orange bal in the sky over the area of San Francisco State University near-by.  He asked me if it was a star or a planet.  It was approxiamately the size of the first joint of my thumb if I were to make a fist.  It then disappeared and then slightly to the west we saw an elongated, narrow form still bright orange.  Then that disappeared and the bright orange ball reappeared back in its original location.I told my husband it probably was a UFO.",
      "link": "http://www.nuforc.org/webreports/106/S106153.html",
      "state": "CA",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c1447",
      "summary": "Light with (slowly flashing redlight on top) connected with the green light and with the other light  source.",
      "city": "sanfrancisco",
      "shape": "flash",
      "date": "2013-11-11T00:00:00",
      "story": "First the light with (slowly flashing redlight on top) connected with the green light and with the other light  source also and light object followed the bay bridge first and it stays now on the ocean left side of the moon we left to the bay area side i cannot see anymore but we saw the same object 4 times other days around same time it doesnt have any flashing lights its only a light. ((NUFORC Note:  The light in the video provided appears to be the planet, Venus.  PD)) ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/104/S104160.html",
      "state": "CA",
      "duration": "Still continues"
    },
    {
      "_id": "64d005f478aba2ec5a3c1971",
      "summary": "Three dim lights moving linearly in locked, triangle formation, stars seen between them.",
      "city": "sanfrancisco",
      "shape": "formation",
      "date": "2014-07-04T00:00:00",
      "story": "Three dim lights moving linearly in locked, triangle formation, stars seen between them This happened over 10 years ago, probably 1999 or 2000. I was walking south-east on 7th street in San Francisco, about 1 block north of the I-80 overpass.  It was sometime between 1:00 AM and 3:00 AM.  I was returning to my office after spending the evening with some friends (I was not intoxicated). I was looking up to see what stars were visible through the light pollution, as it was a clear night.  I had grown up in more rural areas of the Midwest, and enjoyed stargazing, although I had never taken the time to learn more than a handful of star and constellation names. As I looked south, over a low (2-3-story) building across the street, I noticed very distant/faint light moving at a steady velocity against the stars in the background.  The movement was about two-thirds of the way up from the horizon to the zenith.  It was so faint that I would easily have missed it had I not been looking intently in its general direction. As I focused on this movement, I realized that it was three very faint lights in a triangular shape.  The lights were close together, perhaps one-third to one-half the diameter of a full moon overhead.  These lights were moving from a southerly direction to a northerly direction.  Because of the perceived distance, if it had been a single light, I would have assumed it was a satellite and thought nothing more of it.  I did assume it was a high-altitude aircraft, but I was intrigued by the fact that the lights were solid, when I expected to see flashing lights. As I watched, I realized that the formation of lights passed in front of a star, and I could clearly see the star between the lights.  This happened with other stars, leading me to realize that the lights were not on a solid object, but rather moving together in a formation. I watched more intently to see if the formation shifted.  It seemed to be locked very rigidly, and I saw no evidence of the lights moving relative to one another.  I also realized that there was no sound from the craft(s).  (There was little traffic on the overpass that time of night, so I would have heard a small plane, helicopter or jet.)  I don't recall a rotational motion, but it's possible they were rotating around a central point very slowly.  Otherwise, they moved in a straight line, southerly to northerly, just to the north-west of the zenith.  I do not recall if they moved with one light in the lead. I stopped watching the lights after they moved to the north side of the street.  I do not recall if they were no longer visible, or if I just lost interest (after a few minutes, they exhibited no new behavior). The memory of seeing these lights has stayed with me very clearly for over 13 years, and I have been curious what they were.",
      "link": "http://www.nuforc.org/webreports/110/S110893.html",
      "state": "CA",
      "duration": "2-3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c1c8a",
      "summary": "Small sphere observed over San Francisco Bay.",
      "city": "sanfrancisco",
      "shape": "sphere",
      "date": "2014-06-04T00:00:00",
      "story": "Small sphere observed over San Francisco Bay My wife and I were on a ferry heading from Larkspur, CA, to San Francisco, CA, on the way to the SF Giants game.  We were nearing the Bay Bridge, in the water between Treasure Island and the Ferry Building.   I noticed a commercial aircraft flying high overhead, heading south.  Near that plane I saw what at first appeared to be a smaller plane in the distance, but near the same trajectory of the commercial airline.  I thought it seemed a little close.   The smaller object appeared to be white in color with a non-descript shape.  The commercial plane continued on it's path, and the small object was observed to be higher up and not moving in a direction.   I pointed the object out to my wife and she also observed it.  At that point, I began to question what it was I was seeing.   The object then seemed to be moving very slowly, across the bay (west to east), all the while the ferry was moving south under the bridge and so the precise motion of the object was difficult to dete! rmine.  However, as we continued to watch the object, it seemed to be extremely high up and more overhead (I had to crane my neck in order to continue observing it). The object appeared to be shinny, round; a sphere.  It was small in size, being so high up.  It was not moving position that I could tell, not on a trajectory across the sky. It seemed to be staying directly over the bay.  I continued to observe the object for about 15-20 minutes.  I tried to take photos of it but it was too far away for our 200MM lens to capture it.  The sky was completely clear, bright blue, no clouds, sunshine.   The object eventually just seemed to disappear, and I could not find it in the sky.",
      "link": "http://www.nuforc.org/webreports/109/S109727.html",
      "state": "CA",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c2bce",
      "summary": "I have seen 4 crafts. Two looked like they were going to crash but didn't. One other gave a light show of distraction.",
      "city": "sanfrancisco",
      "shape": "triangle",
      "date": "2014-10-10T00:00:00",
      "story": "I have seen 4 crafts.  Two looked like they were going to crash but didn't.  One other gave a light show of distraction. Standing on a roof garden in on top of a San Francisco apartment complex.  First siting coming from South East area from where I was observing.  Triangular vehicle look like it had just taken off from the top of the hill where there is no airport, no heliport no landing strip in the residential area.   A second vehicle flew out from under the first triangular vehicle.  All I could see is its blinking white light. Vehicles were traveling at different speeds.  That caught my attention. I watched the triangular vehicle and the blinking light vehicle at the same time until they got too far apart.   Then I alternated watching triangular vehicle first then blinking light vehicle second.   I was listening for a recognizable flying vehicle sounds, but heard no sounds like a helicopter or airplane.",
      "link": "http://www.nuforc.org/webreports/114/S114376.html",
      "state": "CA",
      "duration": "30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c2fe6",
      "summary": "Flying/hovering rectangle in San Francisco.",
      "city": "sanfrancisco",
      "shape": "rectangle",
      "date": "2014-08-31T00:00:00",
      "story": "flying/hovering rectangle in San Francisco I submitted something earlier, but typed up more details, since doing some internet research, and now understanding that this is a very REAL thing that people actually know about!   August 30, 2014.    At about 4:15 a.m. sighting I usually wake up once in the wee hours of the mornin, and ritualistically, I then go to the kitchen to get a “swig” of orange juice.  I had just done that and was going to go back to bed, but remembered that the gated parking garage, adjacent to the short “high-rise” condo complex that I live in, was not gated for the past two days.  Since I have a vehicle in that lot, and the vehicle is exposed to the street, I decided to take a look out of my living room window, which overlooks the parking lot, to check on my truck.  I had been a little worried about the truck overnight, because we have a ton of auto burglaries on our street, and in general, a lot of scuzzy people walking around up to no good late at night, early a.m. In order to get a good look at the parking lot, I had to lie down (on my belly), on my carpet.  We have a large window but the shade is always drawn, so I decided to lie down and look out the window.  Truck was fine and I didn’t see anyone around but I noticed some lights on in a dilapidated building kitty corner to ours.  Since I wasn’t feeling sleepy, I went and got my binoculars and took a look.  I was checking out the dilapidated building when it happened. I THINK I heard the low hum first.  The rest, I am absolutely 100% sure about.  I looked to my left, and a GIANT rectangular, flat, object was “floating” slowly in my direction from up high – gliding long side up, and then closer and closer.  It sort of “twisted” slowly, which was a movement that I found incredulous for any manmade air craft.  It made no sense.   It then hovered for a time (maybe 2 minutes?) and it was “facing” me at a diagonal/slanted  angle.  There was a white light (not blinking) on each corner of the craft.  In the first moments of seeing this thing, my brain was trying to categorize it as an airplane or some kind of military jet and I couldn’t understand why there were only white lights as I know that our aircraft use colored lights to indicate port side or starboard.   Then the shape of the object was clear to me.  It was SO CLOSE and SO LOW.  And since it hovered for what seemed like a long time, I had a long time to look at it.  But even so, I feel fuz! zy about what it really looked like with specific details.  I know that at the moment I realized it was absolutely a UFO, I was in absolute shock at what I was witnessing.  Then, it put itself on a more horizontal level, and glided up, and headed in a northern direction. I live in a part of the city that has heavy construction so I speculate that the craft was interested in all of the construction going on, but I also assume it knew I was watching it. My husband was sleeping in the other room.  I didn’t call out for him because I didn’t want to disturb what was happening by making a huge commotion, and even though I wished so badly I could go grab my camera I didn’t want to miss a moment of what I was seeing. Weather:  it was very, very dark out (for an urban city).  Our street actually is not very well lit, which is unusual for the neighborhood.  The sky was dark, but I could tell it was clear overhead and I could see off on the northern horizon that there was a heavy band of low fog.  That was the direction the craft took off for. I could NOT believe what I was seeing.  To say the experience was shocking is an understatement. Conditions:  practically pitch black with some city lights.",
      "link": "http://www.nuforc.org/webreports/113/S113055.html",
      "state": "CA",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c302d",
      "summary": "Unusual object flashing sequencial red lights over Ocean Beach Area in San Francisco.",
      "city": "sanfrancisco",
      "shape": "rectangle",
      "date": "2014-08-29T00:00:00",
      "story": " FranciscoUnusual object flashing sequencial red lights over Ocean Beach Area in San Francisco. August 28th 2014 – Approximately from 7:45pm – 8:00pm. This evening, as I was leaving my house in the outer Parkside district of San Francisco,  (I live on 44th Avenue), I noticed an object in the sky westward with flashing sequencial Red Lights.  The Fog had already began to cover most of my view of the sky, which means I would not be able to see any stars tonight. However, Commercial Planes coming from and leaving San Francisco, Oakland, and San Jose would still be visible by their flashing navigation lights upon departure and approach to their respective airports.  This was not one of them.   My neighbor also noticed the object and we both attempted to try and figure out what it might be.  The object remained fairly stationary for about 15 minutes.  Occasionaly it would appear to drift to the right, then to the left, and then return back to its original position. Both my neighbor and I suggested that it might be someones toy drone that they were flying above the Fog (I would estimate that it would have been at least 5  to 15 feet across to account for the number of lights on the object).  With that said, I still can not ruled out that I was looking at something else, not man-made. After watching it for 15 minutes the object began to move westward towards the Pacific Ocean while also drifting northward and southward in a pattern similar to a sign wave. After It moved far enough away, I lost sight of it due to the roof of my neighbor's house across the street from my house. Red Light Sequence:  &lt;--------------*-&gt; Ooooooooooooooo.oo ^ All Red lights except for the Right most light would sometimes appear to be blue, white, or green in random order.",
      "link": "http://www.nuforc.org/webreports/113/S113007.html",
      "state": "CA",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c3283",
      "summary": "Slowly falling red light with a second smaller white light shooting out of it.",
      "city": "sanfrancisco",
      "shape": "fireball",
      "date": "2015-03-20T00:00:00",
      "story": "Slowly falling red light with a second smaller white light shooting out of it. I was leaving my boat at pier 39 at about 9pm, and walking on the dock towards the pier, when I saw a fairly large red light falling slowly straight down.   At first I thought it was some kind of flare, but then after about 30 seconds of observing I saw a flash and a smaller white light literally shoot (at a very high speed) out of the red light downwards into the ocean.   The larger red light kept falling at the same speed until it went out of view behind the pier.   I still don't know what that was.",
      "link": "http://www.nuforc.org/webreports/117/S117840.html",
      "state": "CA",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c32a3",
      "summary": "Solid unnatural moving light.",
      "city": "sanfrancisco",
      "shape": "circle",
      "date": "2015-04-03T00:00:00",
      "story": "Solid unnatural moving light Solid blue light traveling slow to the west, immediately changed direction and turned into a solid red light.  Again, effortlessly changed direction and slowly faded out.",
      "link": "http://www.nuforc.org/webreports/118/S118072.html",
      "state": "CA",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c33a8",
      "summary": "2 orange orbs at ocean beach, San Francisco",
      "city": "sanfrancisco",
      "shape": "light",
      "date": "2015-03-13T00:00:00",
      "story": "2 orange orbs at ocean beach SF Two very bright orange light orbs on the horizon off the coast of San Francisco.   Both started to rise above the horizon, then touched the water again.   One stayed stationary and became a small white light and the other moved very quickly to the north.   Both are now changing shape and color.",
      "link": "http://www.nuforc.org/webreports/117/S117672.html",
      "state": "CA",
      "duration": "2 hours"
    },
    {
      "_id": "64d005f478aba2ec5a3c33c9",
      "summary": "Two pictures in a 35 second video of a UFO craft over Ocean Beach in San Francisco.",
      "city": "sanfrancisco",
      "shape": "sphere",
      "date": "2015-01-07T00:00:00",
      "story": "Two pictures in a 35 second video of a UFO craft over Ocean Beach in San Francisco. I took two pictures In San Francisco Daly City Ocean Beach of a sphere oval looking object with three lights flashing around it I was able to get underneath it... after time tis it hovering quietly so oddly my way Hovering my way....about 400 yards above my head I filmed lights blinking in the crazy crazy matter and it went south toward the airport that's the video that I have in pictures unbelievably no doubt an extraterrestrial type craft.",
      "link": "http://www.nuforc.org/webreports/116/S116348.html",
      "state": "CA",
      "duration": "35 second video"
    },
    {
      "_id": "64d005f478aba2ec5a3c3430",
      "summary": "Cylinder appeared in cloud formations at 4am in San Franciso",
      "city": "sanfrancisco",
      "shape": "cylinder",
      "date": "2015-04-03T00:00:00",
      "story": "Cylinder appeared in cloud formations at 4am in San Franciso Suddenly woke at 4am and had urge to go outside.  Went into yard and  there was a clear sky with the moon and Saturn very bright.  Then there appeared a cloud formation--big clouds coming toward.  Then a cylinder appeared in the clouds.  It was yellow and moving toward earth.  It changed color to orange red.   After about an hour the cylinder suddenly disappeared and the clouds disappeared afterwards.",
      "link": "http://www.nuforc.org/webreports/118/S118183.html",
      "state": "NY",
      "duration": "1.5 hours"
    },
    {
      "_id": "64d005f478aba2ec5a3c392a",
      "summary": "Giant Orange Orb- Scoop marks - Bright lights in room.",
      "city": "sanfrancisco",
      "shape": "fireball",
      "date": "2014-12-22T00:00:00",
      "story": "Giant Orange Orb- Scoop marks - Bright lights in room I was nine years olds at the time, playing outside on a San Francisco street... we lived at ((XXXX)) Mangels.  I was into bicycle motocross....I had a ramp set-up in the middle of the street. 5 of my friends were there…  I have never spoken to them about it since then.  So a Giant Orange, Red & Yellow fireball came down our street...very slow.  It made NO noise.  It hovered over us going East.... It flew over and passed us then seemed like it took a deep breathe and did the \"Hyperspace\" thing.... Recently, I have had scoop marks on my upper arm & my rear end... My wife and I were sleep- she awoke to our whole room filled with bright light.  She couldn't move or talk.",
      "link": "http://www.nuforc.org/webreports/116/S116100.html",
      "state": "CA",
      "duration": "45-60 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c4cca",
      "summary": "Ufo outside airplane.  ((NUFORC Note:  Photo indicates two bright objects ahead of the a/c wing; possible reflections.  PD))",
      "city": "sanfrancisco",
      "shape": "cylinder",
      "date": "2015-09-02T00:00:00",
      "story": "Ufo outside airplane. Did not see until after I viewed the photo. ((NUFORC Note:  Photo indicates two bright objects ahead of the a/c wing.  May be reflections of bright objects inside the cabin, we suspect.  PD))",
      "link": "http://www.nuforc.org/webreports/121/S121604.html",
      "state": "CA",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3c4ddc",
      "summary": "Portal opening up & a ball of light falling out of it to the ground at night.",
      "city": "sanfrancisco",
      "shape": "other",
      "date": "2015-08-13T00:00:00",
      "story": "portal opening up & a ball of light falling out of it to the ground at night That night I stepped out onto my balcony on the 7th floor (top) in a high part of s.f. & right in front of my eyes, far up in the sky I saw what I can describe as a portal opening up & a kind of sparkling ball of plasma light fell out of the center of this slow motion blast (the portal) & as it fell downward it was leaving a staggered trail of glittering plasma light.  The event didn't light up the night sky or make any noise.It was kind of mellow & magical feeling and I know for sure it was no \"dud\" of a fireworks rocket or something because there would've been some sound & I would've seen the thing being shot up into the sky if it was some 4th of july dud rocket.  Because what I saw happened right before my eyes from start to finish.  And the streams of energy that made up the blast effect looked way different than any of the 4th of July firworks I have ever seen & the slow speed at which it opened up you could tell it was no firework.   The ball of light fell at normal speed & probably over the water but the horizon line of the city was a little foggy so I couldn't tell if it may have landed over land.  There were about 12 to 14 thick streams of light that made up the initial portal opening.they weren't too bright & they just faded away as the ball of light leaving the staggered trail of plasma fell out of it.  I just felt really lucky seing it & it made me a believer of things from other dimensions coming into ours like some of the skinwalker ranch stories.",
      "link": "http://www.nuforc.org/webreports/121/S121020.html",
      "state": "CA",
      "duration": "3-4 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c530a",
      "summary": "A photo showing what appears to be a flying object above a ship in San Francisco.",
      "city": "sanfrancisco",
      "shape": "triangle",
      "date": "2016-01-20T00:00:00",
      "story": "A photo showing what appears to be a flying object above a ship in San Francisco. I took a photo yesterday of a ship in the Mission Bay area of San Francisco.  When I looked at the photo there was an object which appeared like the shape of a plane above the ship.  I did not notice this object when I took the photo. ((NUFORC Note:  We have looked at the photo, which shows a badly blurred object.  Our suspicion is that the object may have been a bird, possibly a seagull, but we can't be certain.  PD))",
      "link": "http://www.nuforc.org/webreports/125/S125333.html",
      "state": "CA",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3c57a2",
      "summary": "One huge cigar and one huge rectangular object floating over S.F. Bay just north of San Francisco..",
      "city": "sanfrancisco",
      "shape": "rectangle",
      "date": "2016-06-16T00:00:00",
      "story": "One huge cigar and one huge rectangular object floating over S.F. Bay just north of San Francisco. One huge rectangular and one huge cigar shaped object seen hovering side by side over S.F. Bay.  Through binoculars I watched a semi-transparent yellow orange rectangle with a huge cigar object on the left manuevering and moving very slowly near it.  This rectangle did not look solid and seemed to fade in and out while changing shape and color.  This object took on the shape of a glowing lampshade at times and at other times it changed shape lengthwise.   Multiple cigar or disc shape objects appeared in a group of 3 at 9:45 P.M. and at 9:52P.M. a second group of 2 cigar objects and the rectangle appeared side by side.  These cigar objects were much smaller than the first object seen hovering near the rectangle.   After about 10 minutes the rectangle basically just faded away. ((NUFORC Note:  We spoke via telephone with the witness, and he sounded to us to be sober-minded and sincere, in describing his sighting.  However, we do not understand why other witnesses have not submitted other reports, given how dramatic an event the witness describes.  PD))",
      "link": "http://www.nuforc.org/webreports/127/S127885.html",
      "state": "CA",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c58d3",
      "summary": "2 cigar/rectangular UFOs floating over San Francisco.",
      "city": "sanfrancisco",
      "shape": "cigar",
      "date": "2016-06-03T00:00:00",
      "story": "2 cigar/rectangular UFOs floating over San Francisco. 2 cigar shaped ufos spotted over san francisco with flashing lights.  They floated slowly over the city covered a large distance but rotated in place as if looking around.  I could clearly see it with my own eyes and captured 2 videos on 2 different devices that shows the blinking lights. Video here:  https://www.youtube.com/watch?v=tYf5a2qUsUw   (look closely for flashing dots after 30 seconds)   Details:  Shape- Long rectangular approx: 6-10 ft long (maybe more ?) x 3 ft high x 1-2 ft thick - almost like an stretched brick with rounded corners, edges didn't appear sharp. Color/Lights Dark matte or metallic color with 2 round lights on either side of the long side.  Lights were mostly green, flashing in a random pulse, occasionally a long stripe of light would flash connecting the dots. Occasionally the lights appeared more red then green.  Flight Pattern: They floated from Buena Vista Hill due east towards Downtown.  They rotated in place, turning along the middle of the long axis in a random \"looking\" around type of pattern both clockwise and counterclockwise.",
      "link": "http://www.nuforc.org/webreports/127/S127637.html",
      "state": "CA",
      "duration": "10 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c5b0a",
      "summary": "Saw red lights in the sky, moving out towards ocean.  They were moving very fast and made sudden up down movement.",
      "city": "sanfrancisco",
      "shape": "",
      "date": "2016-04-15T00:00:00",
      "story": "Walking to bus stop, and saw red lights in the sky moving out towards ocean.  They were moving very fast, and made sudden up down movement, and then hard left turn.  No airplane could have been traveling that fast and made those movements. ((NUFORC Note:  Source elects to remain anonymous; provides no contact information.  We wonder whether the sighting was a morning or evening sighting, and whether the report is a serious one.  It could be a hoax, we suspect.  PD))",
      "link": "http://www.nuforc.org/webreports/126/S126653.html",
      "state": "CA",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c5cc1",
      "summary": "Daytime sighting of saucer from downtown high rise which disappeared. Picture taken after vanishing showing craft form.",
      "city": "sanfrancisco",
      "shape": "circle",
      "date": "2016-12-05T00:00:00",
      "story": "Daytime sighting of saucer from downtown high rise which disappeared.  Picture taken after vanishing showing craft form. Seated at an Easter brunch early afternoon on a cloudless, sunny, mildly warm day.  I noticed circular craft floating in sky, stationary but wobbly. -in my eye line which was on the 25 floor and about three city blocks away.  Truly looked like a badly made stage prop from a \"b\" film from the fifties! I went to window preparing my camera phone.  As I watched in awe it just stayed in one place, half the time wobble, the other half motionless (didn't appear to spin but was a saucer shape, (from the side, oval)--I could just make out that it was a mottled gray.  Not smooth.  As I began to snap pic it disappeared--literally blinked out becoming invisible (with no accompanying light). I sensed that it surely must still be there and thought to take a picture of area of sky where it was, focusing carefully on building it was next (same distance.  I had a strong intuition it was there but just not visible. Sure enough an object appears in pic.  A faint ring with three orbs on ring- two close together and another a bit further along the ring, both on one half of the ring.  In order to see the object (which was the same size in picture as object I saw with my dad eyes.)  I made sure to check out all light figures in room to insure it was not a reflection.  My camera did not have a flash.      I still have picture.",
      "link": "http://www.nuforc.org/webreports/131/S131403.html",
      "state": "CA",
      "duration": "4 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c68cf",
      "summary": "I was lying on our roof getting some sun today.  It's an 8 floor apartment building in downtown SF.  Was there about a half hour lying",
      "city": "sanfrancisco",
      "shape": "sphere",
      "date": "2017-04-07T00:00:00",
      "story": "I was lying on our roof getting some sun today.  It's an 8-floor apartment building in downtown SF.  Was there about a half hour lying on my back.  Decided to open my eyes and looked up to see something like a large bubble about 8 or 9 inches wide float by about 25 feet up and at a 50 degree angle from my horizon.  It had two really bright lights inside of it.  One in front and one in back.  The one in back flickered really fast while the one in front was steady in it's brightness.  Then I saw another about 10 seconds later and it continued to about 6 of them at different distances and different angles.  All of them heading east over my building.  The last one I got a video of was the farthest out at about 50 feet away.  I've seen orbs before but never this close and never was able to make out so much detail inside them.  The spherical outline was like a soap bubble but less reflection.  I could barely make out a front and back outline but the 2 white lights! inside were quite clear.  The video doesn't show any of the detail I was able to see with my eyes.  I'm left wondering why?  It appears as the usual white orb only but that's not what I saw.  Hard to see it in the video but it's there mid way down traveling from right to left of the frame.",
      "link": "http://www.nuforc.org/webreports/133/S133402.html",
      "state": "CA",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c727e",
      "summary": "Chevron shaped object hovering and also slow moving, very high, over San Francisco",
      "city": "sanfrancisco",
      "shape": "chevron",
      "date": "2017-07-07T00:00:00",
      "story": "Chevron shaped object hovering and also slow moving, very high, over San Francisco We (2 adults and a toddler) saw a sparkle shimmering in the sky from our balcony at home. At first glance it appeared like a very high airplane shimmering in the sun but it stayed still.  Though still, it did move very very slowly from the west to the east.  It stayed there hovering or slow moving at least 15 minutes.  It would shimmer, flash light and then disappear, then re-appear within seconds.   I went to get a camera with a 500 ml zoom lens and took some photos.  After downloading to my computer, I zoomed in further.  The object is boomerang shaped and it rotates around.  Sometimes in had red, orange and yellow colors, other times it had green and yellow.  Possibly this is from the rainbow spectrum of light bouncing off of it.  Otherwise it looks metallic, silver.  The sky was clear blue, no clouds.  There was no sound.  We saw an airplane pass by during this sighting and it made a typical noise, but otherwise the object did not have any sound.   This was on Wed July 5th, 2017, at about 5:30 pm.",
      "link": "http://www.nuforc.org/webreports/134/S134958.html",
      "state": "CA",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c74a1",
      "summary": "Ball of light moving east - away from SF - appeared to wobble, made a sudden shift, then disappeared in the still-dark morning sky.",
      "city": "sanfrancisco",
      "shape": "fireball",
      "date": "2017-05-11T00:00:00",
      "story": "Ball of light moving east - away from SF - appeared to wobble, made a sudden shift, then disappeared in the still-dark morning sky. It looked like a star, but then looked like it was moving away from us.  My friend and I were standing on the Embarcadero, looking out toward the Bay Bridge, facing East (toward Oakland).  I rubbed my eyes, I blinked, I asked my friend if he was seeing what I was seeing.   It was definitely moving away from us, but wasn't a plane or a helicopter or a meteor/\"shooting star.\"   As he said, it was a \"wobbler\" - it was moving slowly and appeared to wobble, then it suddenly shifted to the south and went dark.  It was there, then it was gone.   I got a little video, but I couldn't get a steady shot but I do think you can see the ball of light, almost directly above the bridge.  The only \"rational\" explanation we could come up with was a drone, but that doesn't actually make sense.",
      "link": "http://www.nuforc.org/webreports/134/S134036.html",
      "state": "CA",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c785f",
      "summary": "Triangle shaped object in sky with red green and blue lights with sound.  ((anonymous report))",
      "city": "sanfrancisco",
      "shape": "triangle",
      "date": "2017-11-03T00:00:00",
      "story": "Triangle shaped object in sky with red green and blue lights with sound Reporting a neighbor's account - about 1 AM, he noticed strange lights and noise in the sky near his home (NE outer Richmond neighborhood of San Francisco).  He thought he was looking for a helicopter but it was not.  He saw what he called something weird, triangle shaped with green, red, and blue lights.  It continued to fly away and come back, again with noise.  Could this be a helicopter?  The sound he noticed and his best instincts say that it was not. ((NUFORC Note:  Witness provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/136/S136871.html",
      "state": "CA",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3c7b1d",
      "summary": "((HOAX??)) Enveloped by a spherical object with hexagons along the inside that were turning red.",
      "city": "sanfrancisco",
      "shape": "sphere",
      "date": "2017-11-09T00:00:00",
      "story": "Enveloped by a spherical object with hexagons along the inside that were turning red. Spherical shaped craft, seemed to have hexagons all over the inside that seemed to light up red.  There was a feeling of intense gravity, as if I were way heavier than normal, and like something was pushing down on me.   It came down and surrounded my whole location and stayed there for 6 hours or so.  When these navigate around they are blue grey and black in color and seem to be plasma and variable size.   This was near the Eagle's Point Labyrinth along the pacific trail.  Associated with these are smaller triangular craft with three red lights on the bottom that trail two fibers behind them.   This was early Monday morning. ((NUFORC Note:  We attempted to contact the source of the report, but the telephone number is non-functional.  We strongly suspect a hoax, in light of the content of the report.  PD))",
      "link": "http://www.nuforc.org/webreports/137/S137174.html",
      "state": "CA",
      "duration": "6 hours"
    },
    {
      "_id": "64d005f478aba2ec5a3c7d2c",
      "summary": "I have pictures  ((anonymous report))  ((NUFORC Note:  Witness has photos, but provides no contact information.  Hoax??  PD))",
      "city": "sanfrancisco",
      "shape": "circle",
      "date": "2017-09-21T00:00:00",
      "story": "I have pictures. ((NUFORC Note:  Witness may have photos, but provides no contact information, and remains anonymous.  Hoax.  PD))",
      "link": "http://www.nuforc.org/webreports/136/S136262.html",
      "state": "CA",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c7da3",
      "summary": "Formation in western sky, 4 blue lights, San Francisco, Sept 21, 2017 at 20:02pm  ((NUFORC Note:  We suspect a lens flare.  PD))",
      "city": "sanfrancisco",
      "shape": "formation",
      "date": "2018-06-07T00:00:00",
      "story": "Formation in western sky, 4 blue lights, San Francisco, Sept 21, 2017 at 20:02pm I was crossing California street, heading north on Octavia in San Francisco the night of September 21, 2017.  I noticed the crescent moon in the western sky and quickly snapped a walking picture as I crossed the street.   I didn't notice anything in the sky at the time I snapped the picture, nor immediately afterwards.  Once I finished crossing the street, I noticed this strange object in the sky of my photo, but again, nothing was in the sky.  I somehow captured this thing by chance on my phone's camera. Location is California and Octavia Sts in San Francisco, facing west.  Time is 20:02pm. ((NUFORC Note:  We suspect a lens flare.  PD))",
      "link": "http://www.nuforc.org/webreports/141/S141764.html",
      "state": "CA",
      "duration": "seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c9282",
      "summary": "UFO seen on KRON 4 News @ 9 during flight delay report.",
      "city": "sanfrancisco",
      "shape": "sphere",
      "date": "2019-12-01T00:00:00",
      "story": "UFO seen on KRON 4 News @ 9 during flight delay report. I have video of a KRON 4 News @ 9 weather and flight delay report. There was an object in the sky completely still. The object was large and spherical with multiple pulsing lights not in any particular pattern I could identify. I was unable to view any stars in the sky at the time, just a cluster of pulsing lights. The craft seemed rather large considering there were commercial airliners in the forefront of the frame and the object, in the distance was still much larger than them.",
      "link": "http://www.nuforc.org/webreports/149/S149915.html",
      "state": "CA",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c9623",
      "summary": "Mystery Giant White Blimp Like Object Over Oakland",
      "city": "sanfrancisco",
      "shape": "cigar",
      "date": "2019-12-01T00:00:00",
      "story": "Mystery Giant White Blimp Like Object Over Oakland We witnessed a blimp like object that appeared to be circling the Oakland airport area. It was massive. Had some sort of black unknown text writing and possibly had people below. My girlfriend and I observed from our patio overlooking (with binoculars) and have pictures to support. It had a red blinking light on the bottom and looked very strange.  We've lived here for over 3 years and have never seem anything like it. Our view is of the entire east bay and we can see the Oakland airport on a clear day. However, this stood out.  To start, we've never seen anything like such described. It was huge and from first glance all white. It was easy to dismiss as a normal blimp but in retrospect we've had a change of thought.  Like I stated, we've never seen anything like that before. It stood out. And the next day I remembered how strange it was to observe. So I googled every type of search that would pull it up. Found NOTHING. I mean NOTHING. I find it incredibly hard to believe that everyone in SF didn't comment on it and also take pics. If it was just another blimp why would it not be mentioned online somewhere.  Which leads me here. I can't find a single picture online of this.  I believe it was probably an emergency landing and not intended to be seen. It might have been some sort of military craft. Hard to say. Like I stated, it was easy to pass off as a normal blimp. And sadly, we didn't watch longer to see how it landed. I tried to film it but from our distance it only look like a large white spot. The picture are better. But what we saw in the binoculars is the most compelling. The writing was not legible. It looked like symbols. And it was far from what you would think was a promotional blimp.  If was a normal blimp, we would've seen it before. And the black out of it online makes me believe we weren't supposed to see it.  I think it could be a weather modification blimp that malfunctioned and needed to make an emergency landing. Hope you can provide more insight.  I'm not sure how to send the picture but will if your interested.   Thanks for being here. Hope your not the MIB haha",
      "link": "http://www.nuforc.org/webreports/151/S151190.html",
      "state": "CA",
      "duration": "30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c96d5",
      "summary": "Strange types of UFO's over San Francisco",
      "city": "sanfrancisco",
      "shape": "oval",
      "date": "2019-10-04T00:00:00",
      "story": "Strange types of UFO's over San Francisco While walking downtown San Francisco, my wife noticed a bright sphere over a building, after pointing it out, we noticed another sphere over a different building.  My wife had her phone in her hand and took two photos seconds apart the spheres were moving,  After looking at the photo, we were surprised to see three additional oval UFO’s (nearly transparent) near the spheres, one of the oval UFO’s looks like it has landed on top of a building.  Looking back up we were unable to see the transparent UFO’s with our naked eye, but they are visible by photo.  The two spheres moved away and out of our view.  Very strange.",
      "link": "http://www.nuforc.org/webreports/148/S148986.html",
      "state": "CA",
      "duration": "5 minutes"
    }
  ]
}