{
  "city": "sanjose",
  "fetch_timestamp": "2025-07-12T14:18:36.789930",
  "record_count": 189,
  "pages_fetched": 9,
  "api_calls": 10,
  "source": "ufo_aficionado_api",
  "records": [
    {
      "_id": "64d005f478aba2ec5a3b417b",
      "summary": "triangles made of 9 lights--no object seen",
      "city": "sanjose",
      "shape": "triangle",
      "date": "2006-05-15T00:00:00",
      "story": "triangles made of 9 lights--no object seen I submitted an account of this event two or three years ago. It apparently was not received, as it is not in the website database. Since that submission, my recollection of the event has improved and therefore changed somewhat.  This is a recollection of a sighting of unknown lights in an unusual pattern sometime in the early 1970's, perhaps 1973 or 1974. I have tried to remember details and circumstances as accurately as possible. I am no aviation expert but I have grown up around aircraft, living near Reid-Hillview Airport, well before it was purchased by Santa Clara County and became a FSS, and I was acquanted with the former owner, his daughter and her family, as well as others who worked there or had tiedowns or hangars, so I know more than a little bit about aviation. There are some explanations for those who are unfamiliar with aviation as well as to explain why I do not believe that the lights belonged to any ordinary aircraft.  In the early 1970's I was at home during a late spring or summer evening and looked up to see nine orange/amber lights arrayed in three equilateral triangles which were themselves arrayed as one large equilateral triangle. Each orange light was at the point, or vertex, of each small triangle which themselves were at the points of the larger triangle, nine lights in all.  The night was warm and the smog was thick enough that no stars could be seen. There was no moon. Typically, above the smog, I am told there is a strong Westerly wind in the evening and into the night.  The array maintained perfect equilateral triangles as it headed roughly north-northwest in a straight line, It appeared to move slowly, like a light airplane but seemed to be silent. I watched the lights closely for some time, from when it was almost overhead, as it passed overhead and then was lost in the smog and reflected city lights somewhere over the north part of the city, trying to see the outline of some object and watching the lights to see if any moved independently, as well as for any lateral drift. I never could see any object, just the lights, none of the lights moved relative to the others and no lateral drift was observed. I estimated it could be seen for at least fifteen minutes.  The array was unusual as no navigation lights were seen: No red, no green, no white, no strobe or flashing lights of any kind, just steady orange/amber lights, which I realised later had the same color as low-pressure sodium street lights.  I know what aircraft look like in the sky at night, as I lived next to a small civil airport at that time and lived directly under the southbound departure route for the city's major airport and I often watched aircraft go over, trying to guess what kind it was. Sometimes, because of the smog, all that can be seen are the navigation lights. I have never seen such lights on any aircraft before or since. It occurred to me that the aircraft might have been some of the new SR-12's recently made public but the lights never moved relative to each other, they never drifted from course and there were no navigation lights, as would be required near the airports under VFR rules.  There was no engine noise. At the time, jet engines were still quite loud and some DC9's, 727's and 737's, as well as DC8's from Mexico were still using turbojets instead of the quieter fans. Neither turbine nor piston engines were heard.  The array was viewed through smog which reflected the streetlights so there was only a view of the orange/amber lights. No solid object was seen, no reflections. The smog was thick enough that no stars could be seen, neither could any aircraft from either airport. But somehow those lights could be seen.  Because of the smog,  the exceptionally slow speed and the lack of any visible shape I could not determine the altitude or the size of the object or objects attached to the lights.  I asked around to see if anyone else had seen the aray of lights; no one had. The FAA and the local newspaper both pointedly expressed their lack of interest in the event. It remained forgotten until I saw another very unusual sky object while in Monterey. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/050/S50566.html",
      "state": "CA",
      "duration": "15min+"
    },
    {
      "_id": "64d005f478aba2ec5a3b4415",
      "summary": "flasing red orb almost a deep redish purple kinda like the tail lamp on a police bike.  you can get the same effect by taking a clear c",
      "city": "sanjose",
      "shape": "other",
      "date": "2006-05-15T00:00:00",
      "story": "flasing red orb almost a deep redish purple kinda like the tail lamp on a police bike.  you can get the same effect by taking a clear christmas light and coloring it with a black sharpie pen. ((NUFORC Note:  Witness indicates that the date of the event is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/050/S50066.html",
      "state": "CA",
      "duration": "10 to 15 min."
    },
    {
      "_id": "64d005f478aba2ec5a3b448e",
      "summary": "big low flying shadow cover house then strange things started to happen with the power.",
      "city": "sanjose",
      "shape": "other",
      "date": "2006-05-15T00:00:00",
      "story": "big low flying shadow cover house then strange things started to happen with the power. What seemed like a low shadow crossed over the house and made everything dark, I looked around, at time I had computor on and was listening to a talk show. Just as the shadow passed, appr. 3 sec everything in the kitchen started to dim, out the side of my eyes I saw other things that were not in use coming on, makeing noise, you could feel a pressure in the house as power  started to flow up. Then everything in the house went off.  The power was off for about two seconds then it came back on.  My daughter down stairs came running up, talked about the shadow and started telling us that things that were on started making a strange noise and things that were off started coming on and were squealing.  She could feel the power flowing from the house. After an hour I can still feel the pressure of this and had started to get a headache from it. Not a stranger to power cutting out, I have to tell you this was different.  Never have I felt power going straight up.  About two min later you could hear high flying military planes flying in the direction of the shadow out over the ocean.",
      "link": "http://www.nuforc.org/webreports/050/S50011.html",
      "state": "CA",
      "duration": "10 sec."
    },
    {
      "_id": "64d005f478aba2ec5a3b4626",
      "summary": "I saw a bright red VERY LARGE \"star looking\" object that shrunk and grew, Then shrunk to a small white blinking object that flew away.",
      "city": "sanjose",
      "shape": "changing",
      "date": "2006-05-15T00:00:00",
      "story": "I saw a bright red VERY LARGE \"star looking\" object that shrunk and grew, Then shrunk to a small white blinking object that flew away. ((NUFORC Note:  Possible sighting of the \"flare\" from an Iridium satellite, perhaps.  PD))",
      "link": "http://www.nuforc.org/webreports/050/S50388.html",
      "state": "CA",
      "duration": "25min approx."
    },
    {
      "_id": "64d005f478aba2ec5a3b4697",
      "summary": "An artifically created cloud masks a bright light, then light and cloud disappear.",
      "city": "sanjose",
      "shape": "light",
      "date": "2006-05-15T00:00:00",
      "story": "An artifically created cloud masks a bright light, then light and cloud disappear. Myself and a Co-Worker observed a vortex type cloud and then a bright light shining through the east end of the cloud.  The light suddenly disappeared and was never seen again.   The cloud remained for approx. 2 minutes then dissipated.  We never saw any object go out of that cloud.  Sky was clear and no other clouds were in the sky at this time.  Because of the cloud, the estimated distance was about 2 miles out and about 1500 ft. high. The area that this was observed is about 5 miles from the NASA-Ames research center at Moffit Field.  I will contact the local area authorities to see if anybody else reported seeing this. ((NUFORC Note:  We spoke via telephone with this witness, and he seemed to us to be quite credible, and quite willing to share all the information he could about the event.  PD))",
      "link": "http://www.nuforc.org/webreports/050/S50485.html",
      "state": "CA",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b4d74",
      "summary": "Stationary disc shaped with pulsing back and forth multi-colored lights.  ((anonymous report))",
      "city": "sanjose",
      "shape": "disk",
      "date": "2019-06-07T00:00:00",
      "story": "Stationary disc shaped with pulsing back and forth multi-colored lights. A stationary object high in the sky, moved with horizon.  My boyfriend could see it with the naked eye I need my binoculars.  Straight horizontal line of lights, pulsing and moving back and forth, mostly green, red, yellow and white.  Multi-colored lights for sure.  Right.   Looked like 5 of these lights which were square shaped tilted slightly up so it gave the appearance of a saucer.    Could not see the rest of it.  Too dark for my camera to work. ((NUFORC Note:  We have corrected the flawed date indicated by the source.  PD)) ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/146/S146642.html",
      "state": "CA",
      "duration": "1 hour"
    },
    {
      "_id": "64d005f478aba2ec5a3b529f",
      "summary": "shiny metallic saucer shaped.",
      "city": "sanjose",
      "shape": "disk",
      "date": "2008-06-12T00:00:00",
      "story": "shiny metallic saucer shaped. I was leaving work going south on highway 101 looking at montain range of Lick Observatory when I noticed a shiny saucer shaped UFO hovering way above mountain range.  I rolled down my window to see if a reflection was causing this appearance and rubbed my eyes a couple of times and the object was not a blimp or aircraft and I was VERY amazed!  I kept looking back up at it as I was driving and it just sat there in mid air.  After watching it and telling myself this is amazing it suddenly shot off into the atmosphere with incredible speed. I swear I have NEVER seen anything like this in my life.   Sincerely,  ((name deleted)) age 53 ((NUFORC Note:  Witness indicates that the date of the incident is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/062/S62664.html",
      "state": "CA",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b533f",
      "summary": "Triangle shaped 3 red or orange lights in corners",
      "city": "sanjose",
      "shape": "triangle",
      "date": "2008-06-12T00:00:00",
      "story": "Triangle shaped 3 red or orange lights in corners Triangle shaped crafed seenin south san jose by my self and 3 others. black w/3 red or orangish lights in the corners. no noise slow moving. i live in a flight path of san jose airport this was not on the flight path! not sure of size or hight. i belive this is military plane! i displayed heat wave type shimmer",
      "link": "http://www.nuforc.org/webreports/063/S63588.html",
      "state": "CA",
      "duration": "1 min"
    },
    {
      "_id": "64d005f478aba2ec5a3b553f",
      "summary": "real ufo's",
      "city": "sanjose",
      "shape": "changing",
      "date": "2008-06-12T00:00:00",
      "story": "real ufo's on 4/11/08 on a clear and sunny day a friend and i were walking in the back of my grandmothers house to watch my daughter in the back yard. i set my daughter  on the ground to play and my friend looks up and notices a round white orb shaped object in the sky. as it approached above us and it started to shape shifted into a boomerang  shape.  then started  to rotate 360 every angle. i called my other friend that lived across the street on my cell phone to bring some binoculars so we can see better. with the ufo already in eye sight and now i can see even better with the binoculars. as me and my friends watch my friend decides to get a telescope at his house.  as he leaves the ufo shape shifted back into an orb, when it shape shifted  back to an orb it started to light up into a white light. a few moments after that a second orb came and and started to float next to it but this orb was red  then it also started to light up but not white like the other one, red. now two ufos lighting up, a third ufo comes and lines up. the third one was also white but i did not light up like the others. my friend comes back from looking for a telescope and the orbs float away.",
      "link": "http://www.nuforc.org/webreports/063/S63304.html",
      "state": "CA",
      "duration": "15min"
    },
    {
      "_id": "64d005f478aba2ec5a3b5676",
      "summary": "diamond shape transulcent object seen over los gatos, ca, near sr85 and sr 17",
      "city": "sanjose",
      "shape": "diamond",
      "date": "2008-06-12T00:00:00",
      "story": "diamond shape transulcent object seen over los gatos, ca, near sr85 and sr 17 At 20;15 hours, I saw a UFO at extreme speed, estimate 1,000 mph, over SR 85 going W/B towards SR 17 interchange.  The UFO was appro. 200'-300\" feet above ground and made no noise. The vehicle was illuminated but appearded to be made of glass or was translucent or clear thru...however the back of the craft had two white lights or exhaust type engine ports to the back end.  The vehicle appeared to begin the veer or bank down to the right, which I believed that the craft was going to crash. The vehicle then disappeared as if it went into a invisible tunnel.",
      "link": "http://www.nuforc.org/webreports/062/S62808.html",
      "state": "CA",
      "duration": "4 seonds"
    },
    {
      "_id": "64d005f478aba2ec5a3b59a5",
      "summary": "possible  UFO  crash debris discovered in southwest New Mexico  (recent)",
      "city": "sanjose",
      "shape": "oval",
      "date": "2007-02-01T00:00:00",
      "story": "possible  UFO  crash debris discovered in southwest New Mexico  (recent) This is a piece of debris found in southwest New Mexico 1998,1999. This person ((name deleted)) drove upon a 25' x 15' oval dip in the road with melted metal imbedded in the asphalt and debris scattered on both sides of the road,no vehical fire and no vehical was found.  It's as though something came down scrapped the pavement then left.  I traded a small nickel iron meteorite for a couple pieces,then sent them to Linda Moulton Howe to be sent to a lab for analysis, the results were mainly aluminum with other trace elements. I'm trying to have an isotope ratio analysis to be perfomed.  ((name deleted)) ((NUFORC Note:  Date of sighting may be approximate, although the witness does not indicate that fact.  PD))",
      "link": "http://www.nuforc.org/webreports/053/S53991.html",
      "state": "CA",
      "duration": "3 hrs"
    },
    {
      "_id": "64d005f478aba2ec5a3b5a20",
      "summary": "Disk, hovered over shoping center.",
      "city": "sanjose",
      "shape": "circle",
      "date": "",
      "story": "Disk, hovered over shoping center. It was a hot summer night. We were all outside playing with our parrents.  We were kind of having a court party I saw the object first and told my father, he then got the attenshion of the others.  We all watched the object for several min.  One of the neibors was so scared he slid under a car.  Mother called the police and filed a report.   Disk like shape hovered over the shoping center for a clp minutes.  The cars on the street stoped and people got out and watched in amazement.  The cross road is a busy intersection.  The road names are Story and White. ((NUFORC Note:  The date indicated may be an approximation, although the witness does not indicate that fact.  PD))",
      "link": "http://www.nuforc.org/webreports/056/S56212.html",
      "state": "CA",
      "duration": "1-2 hours"
    },
    {
      "_id": "64d005f478aba2ec5a3b5ad0",
      "summary": "i was looking at the stars early this morning when all of the sudden one star starts moving from i would say mid west skies heading eas",
      "city": "sanjose",
      "shape": "triangle",
      "date": "2008-06-12T00:00:00",
      "story": "i was looking at the stars early this morning when all of the sudden one star starts moving from i would say mid west skies heading east at a high speed. about one quarter speed of a shooting star. ((NUFORC Note:  Witness elects to remain totally anonymous;  provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/062/S62739.html",
      "state": "CA",
      "duration": "35 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b5efb",
      "summary": "I have been seeing this star like light for over two years from my kithchen window.  ((NUFORC Note:  Twinkling star?  PD))",
      "city": "sanjose",
      "shape": "changing",
      "date": "2006-10-30T00:00:00",
      "story": "I have been seeing this star like light for over two years from my kithchen window. It has been in the same area of the sky 3 to 7 days a week, mostly in the summer months. I appears from about 12:45 am till about 3 to 4:00 am. With the nakes eye, this object appears to be a flickering white star just over the foothills and appaers to look like all the other stars in the sky. When I look at this object with my Binoculars. This object is a very bright blue and red and white flickering object that seems to move. I have called the San Jose international airport / tower. They sais the tower is closed at this time and told me to call the San Jose police department. ((NUFORC Note:  Twinkling star.  PD))",
      "link": "http://www.nuforc.org/webreports/051/S51510.html",
      "state": "CA",
      "duration": "1:00 TILL 4:00 AM"
    },
    {
      "_id": "64d005f478aba2ec5a3b6060",
      "summary": "Town and Country Shopping Center, dic shaped craft at about 20feet above the ground...around 4:30PM on a Sunday.",
      "city": "sanjose",
      "shape": "disk",
      "date": "2008-02-14T00:00:00",
      "story": "Town and Country Shopping Center, dic shaped craft at about 20feet above the ground...around 4:30PM on a Sunday. For two weeks prior to the sighting, I had experienced telepathic communication with these beings.  I was waiting for the time of their arrival.  I spoke to no one of this at the time, and have only shared my experience witha few extremely close friends since the encounter.  I knew I would be called to the site telepathicly when they would arrive in my area.  It wsa Sunday afternoon around 4PM, when I felt drawn to Stevens Creek Blvd.  I  entered Town and Country Shopping Center's parking lot a \"back way\" and when I pulled in, there was a group of people standing under the craft, which hovered about 20 feet in the air--- just above the rooftop.  It was close to a Tobacco store.  The man who worked in the store was one of hte witnesses.  I walked closer to the group, and had made the decision NOT to go with the beings prior to this physical encounter.  After standing with the  group[ for a ew more minutes---looking up to the bottom of the  craft, the craft raised upward without movement of air, or sound --no heat was felt---nothing.  It increased speed rapidly, and then dissapeared in an instant.  We all looked at each other, and dispersed in silence.  The experience was profound, and even more so because we had witnessed it together.  I have been looking in various places to see if any of the other witnesses have reported it, but I have not seen evidence of the sighting.  It affected me so  intensly, Ihad to report it--even though  it occurred all these years ago.  No one was abducted to my knowledge.  My comunication with them was indicative of a volulnteer scenario, and I was not willing to participate, but have the connection with them telepathicly.  I had a spiritually uplifitng sense, and was not frightened by the beings in the craft.  I never made visual contact. ((NUFORC Note:  Witness indicates that the date of the event is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/060/S60554.html",
      "state": "CA",
      "duration": "7 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b6430",
      "summary": "Irregularly shaped, rotating was observed over busy highway.",
      "city": "sanjose",
      "shape": "other",
      "date": "2006-10-30T00:00:00",
      "story": "Irregularly shaped, rotating was observed over busy highway. An irregularly shaped object was seen south of the intersection of Rte. 101 and Tully Rd. in San Jose, CA as I was driving on Rte. 101 south during heavy traffic. The object appeared to remain in approximately the same area in the sky while slowly rotating on multiple axes. The object was not any recognized propeller aircraft, jet, helicopter, parachute or balloon. The object was too large to be a bird. There were no apparent lights. The object was light in color and readily reflected light from the low-angle sun. There was no trail, aura or haze. There was a single object and it did not make any sound from my vantage point. The were no EMF effect that I detected. While I was driving, I was able to take four digital photos of the object. After exiting Rte. 101 onto eastbound Tully Rd., I was unable to see the object.",
      "link": "http://www.nuforc.org/webreports/052/S52172.html",
      "state": "CA",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b65b9",
      "summary": "Triangular crafts appear nightly in the Almaden Valley of South San Jose CA.",
      "city": "sanjose",
      "shape": "triangle",
      "date": "2008-02-14T00:00:00",
      "story": "Triangular crafts appear nightly in the Almaden Valley of South San Jose CA It was the night my wife went into labor,  My neighbor called me to let me know the the IBM research center and our hill, which borders theirs, was glowing like it was on fire or something.  I went outside and looked up,  the night was crystalclear and since we are out of city limits the stars are always visible.   What I saw blew me away, there were at least 50 but more like hundreds of theses triangular shaped crafts with lights in the corners over our place.  I went in and grabed my gen3 night vision monoculars with 3X zoom and watched them for at least one hour.   Four others, family and friends witnessed this as well. They seem to come back every night since. not in such numbers but at least three per night ((NUFORC Note:  Witness elects to remain totally anonymous;  provides no contact information.  We would like to speak with the source of the report, and we would like the other witnesses to the alleged event to submit reports, as well.  We have no way of contacting the source of the report.  PD))",
      "link": "http://www.nuforc.org/webreports/061/S61346.html",
      "state": "CA",
      "duration": "2 hours"
    },
    {
      "_id": "64d005f478aba2ec5a3b6788",
      "summary": "My surveillance camera took pictures of a \"spook\" on, 3/13/07 and the video is recorded on my DVR.",
      "city": "sanjose",
      "shape": "sphere",
      "date": "2007-04-27T00:00:00",
      "story": "My surveillance camera took pictures of a \"spook\" on, 3/13/07 and the video is recorded on my DVR. My surveillance camera took pictures of a \"spook\" on, 3/13/07!   At 6:19:19 AM a floating softball sized glowing white and green orb with a wispy aura set off my front door camera.  It slowly moved out of the field of view at the top by 6:19:52.  At 6:20:36 it came back down and went back out the bottom at 6:20:42.  It repeated again, the same way, at 6:21:28 and disappearing at 6:23:54.  At 6:28:00 it reappeared at the lower left hand corner of the camera image then disappears only to reappear at 6:29:29 in the same spot, then disappear.  When I told our neighbor about it she had to come and see it.  Neither of us could explain it!  I thought it might be a reflection of the sun coming up, but sunrise was not until an hour later and a reflection of the sun or moon would not reverse itself, repeat, or be three dimensional!  Does anyone know who I should report this to before my DVR writes over it in a few days?  To add more mystery to this, the anniversary of my mother-in-law's death was the previous day and my wife dreamt about her mother that night.  Do..do..do...do.........do...do..do...do.",
      "link": "http://www.nuforc.org/webreports/055/S55747.html",
      "state": "CA",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b689d",
      "summary": "Possible Explanations For Roaring Noises?",
      "city": "sanjose",
      "shape": "unknown",
      "date": "2008-03-04T00:00:00",
      "story": "Possible Explanations For Roaring Noises? I also experienced the intermittent, fairly loud roaring sound that other people reported here around San Jose on the evening of Feb. 6th at approximately 11:00 PM. It seemed to be a deep, low, intense rumbling off in the distance from my southwest San Jose location, that would stop and then start back up again. I could easily hear it while sitting and listening puzzledly at my computer within my enclosed apartment. I soon went outside and scanned the night sky, but couldn't see any aircraft that might be causing it. I even called a friend on the phone who lives a few doors down, but he didn't hear anything because of the volume of his TV.  I have heard something exactly like this several times before over the years in the Santa Clara Valley, and surmised that it could have been the NASA Ames wind tunnel that was producing it. That's what I had read in the newspaper and saw reported on TV previously when I had heard this same kind of sound in years past.  Also, there is/was? a rocket motor test facility south of San Jose that could also be capable of producing this same kind of noise.  I'm not sure if either the wind tunnel or this rocket test facility are still currently in operation, but they both could be possible explanations for these sounds. Also, I thought it might possibly a loud jet engine at the airport, not following anti-noise procedures. Curfew at Mineta San Jose International Airport begins at 11:00 PM, but jets sometimes still do operate after that.",
      "link": "http://www.nuforc.org/webreports/061/S61708.html",
      "state": "CA",
      "duration": "8 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b68b7",
      "summary": "Sphere UFO in high altiude moved slowly and stopped then moved again. I could notice that the movement of the craft was different from",
      "city": "sanjose",
      "shape": "sphere",
      "date": "2008-06-12T00:00:00",
      "story": "Sphere UFO in high altiude moved slowly and stopped then moved again. I could notice that the movement of the craft was different from any humanmade airplane. It also moved to the side so rapidly too.",
      "link": "http://www.nuforc.org/webreports/063/S63597.html",
      "state": "CA",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b69cc",
      "summary": "4 \"little stars\" in the sky: 3 white one red moving then changing directions",
      "city": "sanjose",
      "shape": "sphere",
      "date": "2008-03-31T00:00:00",
      "story": "4 \"little stars\" in the sky: 3 white one red moving then changing directions directly overhead we saw 4 small spherical \"little stars\": 3 white and 1 red moving slowly overhead towards a northerly direction. At one point after about 3 minutes they stopped moving and were stationary for about 2-3 minutes. They then started going back in the opposite direction. The red \"little star\" was less brighter than the other 3 white ones.",
      "link": "http://www.nuforc.org/webreports/062/S62122.html",
      "state": "CA",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b6a44",
      "summary": "strange bright light in north east sky",
      "city": "sanjose",
      "shape": "light",
      "date": "2006-10-30T00:00:00",
      "story": "strange bright light in north east sky i was outside having a smoke and looked up at a bright star or planet,the light just got brighter and then all of a sudden it faded into nothing. i 've never seen that ever happen before. did anyone else happen to see it? it was in the north east sky.",
      "link": "http://www.nuforc.org/webreports/052/S52378.html",
      "state": "CA",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b6c68",
      "summary": "Two Disks or Saucers seen gliding side by side before doing some acrobatic maneuvers.",
      "city": "sanjose",
      "shape": "disk",
      "date": "2007-11-28T00:00:00",
      "story": "Two Disks or Saucers seen gliding side by side before doing some acrobatic maneuvers. It was around 5:20pm when I was leaving work to go home. As I was going around toward the driver's side of my car, I happened to look upward at the sky. It was then that I saw two round disks or saucer shaped objects gliding through the air side by side. They did not move any faster than if you were watching a bird fly against the wind. They appeared to be very dark in color, not reflecting any light from the sun which was now setting at the horizon. The two disks were gliding side by side with only what seemed like a yard or two of space apart. They glided over the two story building that I worked at, traveling west to east making no audible noise that I could hear over the sound of traffic nearby. I was trying hard to make some sense of what I was seeing. Not birds...not balloons...certainly not any conventional airplanes. Perhaps, they were very large round kites that got away from someone who was testing them out. But, there was hardly any wind at all. What is keeping them a float and moving along steady without much wind, I thought.  Satisfied with the idea of some new kite invention that went astray, I unlocked and opened my car door.  Before getting in, I looked upward once more just in time to see the two disk shaped objects begin tumbling through the air and then occasionally spinning around each other at a very rapid rate of acceleration and then in opposite directions. Obviously, this was a complete shock. Despite the crazy tumbling and rapid acceleration of spining around each other, the disks avoided a collision as though there was some kind of invisible force field that kept them from hitting each other. ALL the while, they still maintained a steady course in an easterly direction. This sighting took place in no more than one minute before it passed out of view behind nearby trees. I would put the height of these objects at the same height you would see most small planes fly. I would give my best judgement that the diameter of these twin disk if at ground level could have been between 9 to 11 feet. The last few seconds of this sighting convinced me that these objects were controled by some kind of advanced technology, because of the unusual accelerations and manuvers of the objects. Possibly, a new generation of nerds working on a special project for a start up company may be behind this. Time will tell!",
      "link": "http://www.nuforc.org/webreports/059/S59694.html",
      "state": "CA",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3b6f7c",
      "summary": "Teardrop shaped, gold metallic in color, clear sky, 13:38 afternoon, did not roll, tumble,or change direction",
      "city": "sanjose",
      "shape": "teardrop",
      "date": "2008-03-04T00:00:00",
      "story": "Teardrop shaped, gold metallic in color, clear sky, 13:38 afternoon, did not roll, tumble,or change direction Date of sighting Feb. 21, 2008.   I was standing on a train platform in San Jose California, I had just checked my radio controlled Casio wristwatch watch, it was 1:38 pm, when my coworker our engineer said hey look there, he was pointing up in the sky towards the east by south east. I looked where he was pointing, the sky was very clear there were a lot of clouds as we were having rain showers that day, which made the sky very clear and free of dust and pollutants.  What I saw, at first glance, I and my coworker thought to be a weather balloon moving from east by south east towards north by north west in a straight line, moving at a high rate of speed. However, I quickly realized it was moving against the prevailing winds which were pushing the clouds in a northeasterly direction.  The object I believe to be small about the size of a midsized compact car. The object appeared to have a shape similar to a light bulb. The front was round and it tapered to a small almost pointed tail. The object was brightly polished gold metallic in color as the front bulbous area reflected the sun as it moved away from us.  The object was well above the clouds, its speed did not vary, and the object did not tumble or roll or vary its direction. We are just about one mile from the San Jose International Air Port. The jet planes that were crossing over at this time were moving much slower than the object.  The object did not leave a trail behind it, neither was there a flame coming out its tail end, it did not have wings, and it did not have a tail that would control its movement.  As the object was moving directly over us its bottoms color seemed to very in intensity like waves in a darker shade that moved from the front to the rear.  From the time we started to observe the object the object remained in sight for about 40 to 45 seconds.",
      "link": "http://www.nuforc.org/webreports/061/S61899.html",
      "state": "CA",
      "duration": "40 to 45 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b710e",
      "summary": "Roaring noise over house that started and stopped suddenly four times, appearing to originate from different directions.",
      "city": "sanjose",
      "shape": "unknown",
      "date": "2008-02-14T00:00:00",
      "story": "Roaring noise over house that started and stopped suddenly four times, appearing to originate from different directions. My girlfriend and I were watching TV in our room at around 11:00 PM when we heard a very loud roaring that sounded much like a large rocket booster and seemed to be right above the house. We live very near the San Jose International Airport, so hearing roaring noises in the sky is not unusual. What WAS unusual, however, was the volume, behavior, and the proximity of the sound to our home. \tThe normal flight path of aircraft into San Jose international airport puts them a few miles east of our home. However, whatever was causing the sound seemed to be directly above our house. Furthermore, it didn’t get louder (approaching our home) and then quieter (passing over and leaving our home). Rather, it was a very loud, very steady roaring noise that sounded as if it was directly over our home. \tWe were lying in bed, and we both heard this roaring in the background as we were watching TV. The longer it went on without changing in pitch or volume (which would be an indication of movement towards or away from our home), the more that sort of “there’s something wrong here” alarm was going off in my head. Finally, after about three minutes of this steady roaring, we both looked at each other at the same time and vocalized our mutual curiosity as to the nature of that sound. She said, “what is that noise?”. I jokingly replied that it was probably a UFO, and she should pack her nice clothes because we might be about to take a ride. As soon as I had finished saying that, the sound stopped instantly. There was no winding down, there was no lowing of decibels, it was as if someone had just flicked a switch and turned it off. As if that wasn’t enough, it started up again after a few seconds in what seemed to be a different part of the sky, but still very close. The start of the sound was as instantaneous as the ending. It was just suddenly “on” again. Again, there was an extremely loud, very steady roaring for about a minute, and then it stopped suddenly. \tAt this point my girlfriend was actually getting scared. She had lived in this area all her life and had NEVER heard anything like this before. When the roaring started a third time, I jumped through our window into the back yard (there was no screen) so I could get a better look at the night sky to try and get a visual on whatever was causing this noise. I was able to determine that the roaring seemed to be coming from the South, but was unable to see the source. I ran over to the patio door and knocked on it to get the attention of my roommate who was playing video games at the time, and told him to come out and listen. He did, and said to me, “it’s probably just an airplane.” Then it stopped suddenly, as it had done twice before and his attitude changed. Again, it had lasted about a minute and stopped for a few seconds only to start up again this time on the NORTH side of my home. Now he was clearly as curios as I was about the origin of this sound. The rumbling/roaring sound went on for about thirty seconds or so this time before it again stopped suddenly. It did not start up again.",
      "link": "http://www.nuforc.org/webreports/061/S61469.html",
      "state": "CA",
      "duration": "8 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b743e",
      "summary": "it was a shinny metal,  5 balloon looking object with something protruding from the bottom.",
      "city": "sanjose",
      "shape": "other",
      "date": "2007-08-07T00:00:00",
      "story": "it was a shinny metal,  5 balloon looking object with something protruding from the bottom. I was sitting in my front yard and looked up and saw a shinny metal object.  It seemed to be stationary (not moving).  I was wearing polarized sunglasses.  I took my glasses off and the object disappeared.  I put my glasses back on and it was there again.  I got my camera with a telephoto lens and took a couple of pictures of it.  It had five balloon looking things and an object protruding from the bottom that narrowed down to a point.  I kept watching it and it seemed to go up and out of sight.  My husband came home and I told him about it.  He saw something a ways over from where I had seen it.  It was much higher than when I saw it.  I tried to get another picture, but it was too high.  It then disappeared.  I tried to call your number several time but only got a busy signal.",
      "link": "http://www.nuforc.org/webreports/057/S57829.html",
      "state": "CA",
      "duration": "about an 1 hour"
    },
    {
      "_id": "64d005f478aba2ec5a3b7792",
      "summary": "Between 1973 and 1977 retuning home from dinner with my parents between 8:00pm and 9:00pm. I was lying down in the back seat passenger",
      "city": "sanjose",
      "shape": "flash",
      "date": "2007-03-08T00:00:00",
      "story": "Between 1973 and 1977 retuning home from dinner with my parents between 8:00pm and 9:00pm.  I was lying down in the back seat passenger side gazing out the window at stars when I saw an explosion of light looking like a kaleidoscope in the sky.  It filled the side window which was probably 18\"x20\".  The light from the blast lasted probably near 20 seconds, with lots of color then slowly faded.  We were traveling south on monterey road in san jose ca. This occured nearly overhead yet somewhat off the west. returning home we called the mercury news and moffet naval air station to report. ((NUFORC Note:  Date is approximate.  We have assigned an arbitrary date of June 30, 1977.  We would welcome other reports about the incident.  PD))",
      "link": "http://www.nuforc.org/webreports/055/S55477.html",
      "state": "CA",
      "duration": "10-15secs"
    },
    {
      "_id": "64d005f478aba2ec5a3b7809",
      "summary": "Very bright cobalt blue fireball over highway 101 near Minetta San Jose Airport",
      "city": "sanjose",
      "shape": "fireball",
      "date": "2007-03-08T00:00:00",
      "story": "Very bright cobalt blue fireball over highway 101 near Minetta San Jose Airport January, 2005 at approximately 05:30 AM   Very Bright Cobalt Blue Light   I was southbound on Highway 101 near Minetta San Jose Airport when I saw a very bright, cobalt blue light in the sky.  At first I thought it was a missile (I’ve never seen a missile) and that it was headed for the airport.   I was afraid, and so pulled the car over to the side of the road.  The bright light suddenly leveled out, stopped and made a sharp turn to the left and disappeared.   Its movement was definitely purposeful, it was not a meteor (I have seen many falling stars) nor was it a plane.   Airplanes don’t travel at that speed, nor do they suddenly stop and make abrupt turns in mid air.",
      "link": "http://www.nuforc.org/webreports/055/S55479.html",
      "state": "CA",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b7a6d",
      "summary": "hovering saucer\\cigar shaped object, 4 white lights that changed stationary to sweeping over San Jose for HOURS",
      "city": "sanjose",
      "shape": "cigar",
      "date": "2007-04-27T00:00:00",
      "story": "hovering saucer\\cigar shaped object, 4 white lights that changed stationary to sweeping over San Jose for HOURS There was a cigar shaped aircraft hovering in the northeast sky.  I noticed it about 11 pm while watching for a reported meteor shower expected.  I noticed at first it was entremely bright. Then noticed that an obvious commercial aircraft seemed to be heading for it.  The questioned unidentified aircraft \"flashed\" lights at the commercial aircraft and the commercial aircraft veered away to an entirely different direction of travel. I got out binoculars and looked closer at the unknown \"light\" in the sky and realized it was NOT something normal.  It appeared to be cigar or saucer shaped with 4 very bright lights acroos.  Occasionally the lights would dim to the point of being not visible to the naked eye. While observing thru the binoculars I observed that when this happened, the lights on the craft would change shape becoming shaped like a blackslash which grew more and more narrow, over a period of several seconds.  Then the lights would open fully again becoming very very bright. I watched this aircraft for approximately 2 1/2 hours.  During this time NO airplanes whatsoever flew over, which is quite unusual because this is a normal regularly busy flight path for San Francisco airport as well as San Jose. The craft simply hovered there in place.  There has NEVER been anything shaped even similarly in the sky, there is no way this could have been an airplace, helicopter, nothing commonly known. I called my brother, who lives several miles closer to the approximate estimated spot the craft was hovering.  He went outside and IMMEDIATELY spotted it and said, oh *hit, I think we are in trouble.  He too observed the lights on it changing but described that as a \"sweeping\" function, as tho the craft were searching around it's perimiter, then would return to the simple hovering state. I noticed my cell phone reception was very poor during this time - background noise, static, bleedover noise. I made a point of observing for a long time, so that i would be certain this was not a product of my imagination or blurred vision or misinterpretation.  IT WAS NOT.",
      "link": "http://www.nuforc.org/webreports/056/S56349.html",
      "state": "CA",
      "duration": "hours"
    },
    {
      "_id": "64d005f478aba2ec5a3b7a4b",
      "summary": "green laser into cockpit",
      "city": "sanjose",
      "shape": "",
      "date": "2006-10-30T00:00:00",
      "story": "green laser into cockpit 2 planes had a green laser pointed into their cockpit about 9 miles SSE of san jose",
      "link": "http://www.nuforc.org/webreports/052/S52847.html",
      "state": "CA",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3b7aec",
      "summary": "2nd sighting; Metallic object rotating in the morning sky.",
      "city": "sanjose",
      "shape": "triangle",
      "date": "2006-07-16T00:00:00",
      "story": "2nd sighting; Metallic object rotating in the morning sky. This is the second Sunday morning in  two months that I have stepped unto my balcony, looked to the NW and observed this metallic-like sphere/triangle shaped object in the sky, very high up. Higher than a Skywriiting plane!  Each occurence has been against a crystal-clear bluesky backdrop.  You can make out that the object seems to rotate in place; the sun can been seen glinting off the object as it rotates.  With the naked eye, it appears to be oval; but in the picuture I canptured, zoomed in to 1600%, the object seems to be triangular. Each time I would call out my wife to confirm what I was seeing; she could immediately see the object, on both occasions, and it looked to be the same object, in about the same  location in the sky. I also noted commercial airliners, high flying birds (gulls) and even the Moon; these all  help reference how high the object was.  You would really have to be looking for it with the naked eye or you would simply see a clear blue sky.",
      "link": "http://www.nuforc.org/webreports/050/S50996.html",
      "state": "CA",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b7ba1",
      "summary": "Many objects in the night sky on the Summer Solciest! 6/21/06",
      "city": "sanjose",
      "shape": "triangle",
      "date": "2006-07-16T00:00:00",
      "story": "Many objects in the night sky on the Summer Solciest! 6/21/06 I went out side to the back yard, i pulled a chair onto the deck and sat for a total of 2 hours and 35 mins. During this time I witnessed 10 moving lights. The first I seen one moving light or as i call them Traveling Stars! It was coming from the southeast moving north. It moved slowly, then disappeared. A moment later coming from the west another Traveling Star was going to the east. That as well disappeared. About 5 to 10 mins after that, i seen 3 Traveling Stars in a triangle formation, moving together slowly, then fast then slow again. I called my 22 year old nephew out side he came very fast, by the time he got out there was a 4th, they all moved together in like a alomst box formation, then the 4th disappeared and the 3 continued to move. I asked my nephew if he seen what i had seen and he said yes, and this time i dont know what to say! He was in shock. As we watched them go south, and disappear. 2 more came from the north and south, they were both moving in a slow manner, they were goign straight then the would move to the side. Now the movement goes for all traveling stars. Then when i was about to go into my house, 2 more came from the west and proceded to the east. I have to say this was so crazy.. They seem to come out more if I had my cell phone with me. I have observed this for some time. I think they like the light that flashes on my cell phone. Also there was one traveling star that was flashing it light and then it would disappear, i seen a total of 2 flasher!",
      "link": "http://www.nuforc.org/webreports/051/S51090.html",
      "state": "CA",
      "duration": "Lights"
    },
    {
      "_id": "64d005f478aba2ec5a3b7bd8",
      "summary": "fast moving orange lights",
      "city": "sanjose",
      "shape": "light",
      "date": "2006-10-30T00:00:00",
      "story": "fast moving orange lights saw orange lights 2 together moving very fast north to south,no running lights or sound,was not airplane as it did not blink any lights. it was orange and had 2 lights and was moving fast with no sound.",
      "link": "http://www.nuforc.org/webreports/052/S52970.html",
      "state": "CA",
      "duration": "60 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b7c95",
      "summary": "At approximately 4:50am a lighted circlular object was spotted streaking across the sky traveling from West to Nortwest and entered my",
      "city": "sanjose",
      "shape": "circle",
      "date": "2006-10-30T00:00:00",
      "story": "At approximately 4:50am a lighted circlular object was spotted streaking across the sky traveling from West to Nortwest and entered my field of view for approximately 15 seconds. ((COPIED CORRESPONDENCE WITH WITNESS)) Dear Ms. ((deleted)) Thank you very much for your report!  What was the apparent size of the light, please, relative to the size of a star in the night sky?  Do you think that the object might have been a satellite, by any chance?  How much of the sky, in terms of degrees of arc, did the object cover during the 14, or so, seconds you witnessed it, please? Thank you, again, for sharing the information with our Center!  Cordially,  Peter Davenport, Director NUFORC ((END NOTE)) ((RESPONSE FROM WITNESS)) Mr. Davenport, This object was 1/4  the size of the moon. (Same brightness as a full moon)  Not a satellite as I have seen many satellites and the movement of this,  was, in comparison, similar to that of a shooting star in terms of rapidity.   From my field of view the object covered about  half of the horizon from my bedroom window in those few seconds. It  was traveling at an incredible  rate of speed without sound.     I had, in fact, last year reported something very similar on your network, however the size of this was remarkable today.  Coincidentally, the former sighting occurred at roughly the same time of day, although that object was traveling from North to South. Could it be North Korea? Ha! ((name deleted))",
      "link": "http://www.nuforc.org/webreports/053/S53057.html",
      "state": "CA",
      "duration": "14 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b7e6e",
      "summary": "Grays up in my FACE!",
      "city": "sanjose",
      "shape": "unknown",
      "date": "2009-12-12T00:00:00",
      "story": "Grays up in my FACE! I actually saw a Gray up in my face when I was in high school from 1995 through 1999.  I'm 28 years old now.  They Gray had slanted eyes and words can't describe the skin.  I just know it glowed like the moon times 5.  Well, it showed up right next to my face and I flipped over to look up at the ceiling because my heart was pounding like it was gonna explode out my chest because I was so scared at the time and then it was gone when I looked over.  Don't know what it wanted from me because I ain't got nothing it wants. Never heard or seen from it again.  Didn't know who to report it too at that time so was just a memory. Just watched 4th kind and it sparked answers. That's all I remembered. ((NUFORC Note:  Witness indicates that date is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/073/S73471.html",
      "state": "CA",
      "duration": "1 Sec"
    },
    {
      "_id": "64d005f478aba2ec5a3b7e76",
      "summary": "Small disc hovers over our backyard.",
      "city": "sanjose",
      "shape": "disk",
      "date": "2009-12-12T00:00:00",
      "story": "Small disc hovers over our backyard. It was a beautiful cloudless day and my two kids and I were in the backyard. They were running around playing and I was BBQing.  As I was cooking something caught my eye to the West. At first I thought someone was burning something in there backyard about 3 houses down from me.  Let me give you a perspective:  It looked like a cloud of smoke hanging in the air about 10 feet about the roof line.  It was as big as a small RV.  As I looked at the cloud I thought is was odd. Then the whole thing moved.. it went south and did a small u-turn and stopped right over our backyard.  My kids were very excited and got behind me as I was looking at this cloud that moved as if it were being driven. There were no distant lines to it ..it was cloaked. It was so close I could have picked up a rock and smacked it very easily. There was no sound or lights at this point. It was just hanging in the air over our backyard.  At this point we were all very excited when all of a sudden a portion of the cloud kind of rolled back and we saw a bank of about 7 rectangular lights. Each light was about 8 X 4 inches. I saw the lights as multicolored, my kids saw the lights as all one color; purple.  Then the cloud rolled back over where the lights were and flew to the north faster then anything I’ve every seen and it disappeared very quickly.  After it flew away I told my daughter to go in the house and draw what you saw. She did this before any of us discussed the event. A few minutes later she came back with a drawing of what we all saw except she draw the color of the lights as all purple as where I saw multicolors.",
      "link": "http://www.nuforc.org/webreports/072/S72109.html",
      "state": "CA",
      "duration": "5 mintues"
    },
    {
      "_id": "64d005f478aba2ec5a3b8002",
      "summary": "Do not have time, just need to know if others saw it in San Jose, CA. Bright Red, almost blood red light, moving very very slowly. I ha",
      "city": "sanjose",
      "shape": "light",
      "date": "2009-12-12T00:00:00",
      "story": "Do not have time, just need to know if others saw it in San Jose, CA. Bright Red, almost blood red light, moving very very slowly. I have a great video with a great shot of an airliner flying near object. Thousands of people must have seen this object tonight being that it was over San Jose, California. I have never seen anything like it in my life and I have seen absolutely nothing in the local media. Amazing!  My email is ((e-mail deleted)). I really just want to know how many people saw this tonight. Best Regards, ((name deleted))",
      "link": "http://www.nuforc.org/webreports/072/S72145.html",
      "state": "CA",
      "duration": "45 min"
    },
    {
      "_id": "64d005f478aba2ec5a3b8009",
      "summary": "Bright red light over Northern California.(non aircraft)",
      "city": "sanjose",
      "shape": "light",
      "date": "2009-12-12T00:00:00",
      "story": "Bright red light over Northern California.(non aircraft) Bright light moving on a non-linear course from SE to NW and eventuall stopped. The light began to dim and brighten on about a two second interval and then went dark. Observed with binoculars. No shape could be seen. The light appeared to be a point source.",
      "link": "http://www.nuforc.org/webreports/072/S72142.html",
      "state": "CA",
      "duration": "40 min"
    },
    {
      "_id": "64d005f478aba2ec5a3b800a",
      "summary": "Brilliant red light sighted over San Jose.",
      "city": "sanjose",
      "shape": "light",
      "date": "2009-12-12T00:00:00",
      "story": "Brilliant red light sighted over San Jose. Last night, my son in law, my wife, and I observed a brilliant red light. It was noticed just as we were watching  the ISS fly over our location.  The object was traveling from the northwest to the southeast at around 60 degrees.  We observed it as a solid red light. It’s motion was far slower than the aircraft flying in the area.  It appeared to change its velocity and direction.  It’s magnitude was approximately 1.5 and faded to a yellowish orange before disappearing.  Even while it was fading, it would brighten up at times to about 1.0 magnitude (as compared to the surrounding stars in the southern sky. Possible night balloon?  Satellite would not have altered course and would not have reflected such a brilliant red.  Could be some sort of space junk or object recently sent up.",
      "link": "http://www.nuforc.org/webreports/072/S72148.html",
      "state": "CA",
      "duration": "20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b83c8",
      "summary": "Round black object with rainbow-halo seen in San Jose sky after May 17, 2004",
      "city": "sanjose",
      "shape": "sphere",
      "date": "2009-08-05T00:00:00",
      "story": "Round black object with rainbow-halo seen in San Jose sky after May 17, 2004 On May 17,2004, I was assaulted by a White man who had an Asian Indian companion on Avenida del Roble, a block away from my house on Entrada Cedros while my brother was in the Philippines. A week or so later, I seem to remember reports of thunderstorms in San Francisco, I tried to have my citizenship changed at the Philippine Consulate general.  There were two Caucasian Filipinas at the Consulate who said something about the Embassy of France, and one of them said, “Thank you” to the people at the customer service window. A few days later, I was walking on Velasco Drive, also a block away from my street, when I saw a round black object appear in the western sky.    It was surrounded by a rainbow-colored halo, and it moved slowly through the grey sky until it set behind the Santa Teresa foothills. I saw the Filipinas again in a dream I had in February 2009. I have tried to get out of the assault situation by reporting a dream about my boyfriend Quetzalcoatl from Rolling Thunder, the Cherokee shaman, on May 14, 2009, after which I woke up crying and made some hot chocolate, along with other information, to the Records Office of UC San Francisco Medical Center where my mother drove me on the day I was assaulted . In the first week of June, there were thunderstorms that I did not want throughout the state of California.",
      "link": "http://www.nuforc.org/webreports/071/S71196.html",
      "state": "CA",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3b85d6",
      "summary": "San Jose, CA. Fourth Floor of Valley Fair Mall where the food court doors are.",
      "city": "sanjose",
      "shape": "sphere",
      "date": "2009-03-19T00:00:00",
      "story": "San Jose, CA. Fourth Floor of Valley Fair Mall where the food court doors are. I was on the fourth floor of Valley Fair mall in the early morning and was watching the usual government chemtrail's killing us on a daily basis, that's when I noticed a small orb or sphere that could maybe fit a single person in it. It was about 200 to 300 yards away I have more than perfect 20/20 vision I can see perfect far and close. I noticed the chemtrail coming out of the back of the plane when the orb appeared and did three full circles around the chemtrail itself and then flew to the very end of the chemtrail and back to the very front of the chemtrail right behind the plane. After that it quickly broke away from the chemtrail and flew towards Valley Fair mall about maybe 50 to 100 yards closer. It then did a sudden sharp turn and seemed to slowly and leisurely fly toward the Mount Hamilton area and disappeared. The orb was silver and smooth I could not see any widows, lights, markings, or contrails coming from it.",
      "link": "http://www.nuforc.org/webreports/068/S68014.html",
      "state": "CA",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b8639",
      "summary": "Two diagonal lights flying away in southeastern sky",
      "city": "sanjose",
      "shape": "formation",
      "date": "2009-01-10T00:00:00",
      "story": "Two diagonal lights flying away in southeastern sky My friend and I were sitting in the courtyard of our apartments talking when I looked up into the dark sky behind him and above one of the buildings I saw what appeared to be two white stars that were diagonally opposite of each other, with one being higher on the left, and the right one down below. I thought it was a strange constellation and they weren't blinking and suddenly I realized that they were moving directly away from me flying to the southeast. After about five seconds, they faded away from my view. Conditions were about half an hour or so after sunset, and mostly clear with just a bit of haze. The two lights appeared to be moving away in tandem with what I can only describe as a \"gliding\" motion, not fast, but not really slow, either. The courtyard is lit with orange vapor lanterns. I would describe the brigtness of the object or objects as being of medium intensity, and they were unblinking. My friend was facing toward me, so he didn't observe them. A small plane flew into the immediate area of the sky about a minute or so later, and looked quite different from what I previously saw. I would estimate that the objects were at about a 45 degree angle in the sky from my position and fairly high as I observed them over a two story apartment building. I could not hear any sound from either the objects or from the small plane, as there was traffic noise coming in from the busy street that we reside on.",
      "link": "http://www.nuforc.org/webreports/066/S66625.html",
      "state": "CA",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b876c",
      "summary": "It was Saturday 09/26/2009, apprx 1:05 pm , I saw a bright light in the sky, at first I thought it was a balloon, but then it began t",
      "city": "sanjose",
      "shape": "light",
      "date": "2009-12-12T00:00:00",
      "story": "It was Saturday 09/26/2009, apprx 1:05 pm , I saw a bright light in the sky, at first I thought it was a balloon, but then it began to spin ,emitted a bright blinking light. A few minutes later, two more appeared.They were hovering slowly about the same altitude as a commercial airplane.The whole incident lasted apprx 3 min, until they drifted out of my view.About ten minutes later,three Military Apache type helicopters began circling over the same area. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/072/S72667.html",
      "state": "CA",
      "duration": "3: mins"
    },
    {
      "_id": "64d005f478aba2ec5a3b8a33",
      "summary": "Diamonds are forever!!",
      "city": "sanjose",
      "shape": "light",
      "date": "2009-01-10T00:00:00",
      "story": "Diamonds are forever!! On 11/11/2008 at around 2326 Hours I had exited my residence which is located 800 Feet above the Santa Clara County and was looking east over San Jose when I saw what appeared to be a large cluster of diamonds in the air.  This object was so bright and beautiful I dropped my laptop and ran back inside to get my mother.  I was so excited, I was screaming at her to hurry.  She and I then exited our home and walked to the driveway.   The object was still positioned in the air, displaying a large mass of bright color spectrum.  While I was watching this object, my mother started to get panicked and ran towards the house and stopped.  While I was watching the one object, my mother started screaming at me to look at another one.  The one I was viewing started to dimmer and slowly lifted upwards and left view.  As I was turning down the steps towards our home, my mother said oh my God, Oh my God look...I didn't see the second one.  She states that the second one was just as bright but \"shot\" through the sky from right to left, then stopped on a dime, then again shot across from right to left and disappeared as fast as it had appeared.  This was the most beautiful display I have ever seen in my life!  I have seen other object, lights that appear to be stars...but this was straight out of a movie.  So beautiful!!!!  They are here!",
      "link": "http://www.nuforc.org/webreports/066/S66856.html",
      "state": "CA",
      "duration": "5 Minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b8b87",
      "summary": "BRIGHT LIGHTS IN SKY OVER SAN JOSE CALIF.",
      "city": "sanjose",
      "shape": "light",
      "date": "2009-12-12T00:00:00",
      "story": "BRIGHT LIGHTS IN SKY OVER SAN JOSE CALIF. one huge ufo about 1/4 size of sun flying in the sky over San Jose calif. bright lite like the sun i was up on monument peak working on wireless tower with co worker that witnessed also when we seen the object about 1/4 size of the sun in the sky for about 2;00 min at around 3;30 pm then vanished seen 3 more smaller UFO after big one vanished they were to left of big one was equally spaced apart from one another maybe 1 mile apart it was out of this world crazy",
      "link": "http://www.nuforc.org/webreports/072/S72879.html",
      "state": "CA",
      "duration": "2 min"
    },
    {
      "_id": "64d005f478aba2ec5a3b8bf1",
      "summary": "I was standing on my balcony facing the south east when a lit object caught my attention. I thought it may have been an airplane when i",
      "city": "sanjose",
      "shape": "light",
      "date": "2009-08-05T00:00:00",
      "story": "I was standing on my balcony facing the south east when a lit object caught my attention. I thought it may have been an airplane when it elevated rapidly. I would guess around 10000 feet. It was a dark red and would dim to a white light. I went to get binoculars and 30 seconds later when I returned it was gone ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/070/S70751.html",
      "state": "CA",
      "duration": "0.45"
    },
    {
      "_id": "64d005f478aba2ec5a3b8c33",
      "summary": "1 Main Hovering Bright ORB/Sphere, Emiting Light as bright as the sun, 3 others soon apear in sequence.",
      "city": "sanjose",
      "shape": "sphere",
      "date": "2009-12-12T00:00:00",
      "story": "1 Main Hovering Bright ORB/Sphere, Emiting Light as bright as the sun, 3 others soon apear in sequence. I'm a network admin/wireless technician for a small company in the bay area. We have access points up on monument peak in Milpitas CA. In the San Francisco Bay Area.  I was up on one of our towers on monument peak, swapping out an access point, when the other technician with me. Looked out to the left where our office was in San Jose.  And yelled at me to look.  When I looked out, I saw a gray, sphere object omitting light from it.   I watched it for several seconds.  Just wondering what it was.  And then I could see the omitting light, began to intensify.  till it got to a point where it was close to being as bright as the sun.  Which was over to my right, high up in the sky.  Far away from this object.  One the object got to this point it sustained that level of brightness, and appeared to come towards the Hill we where on.  But then Stopped, omitting such a bright light and resumed its greyish/soft omitting light. Right after that, I kinda sweep the whole bay, from where I was, and now saw 3 identical small objects show up in sequence, and at parallel height. (could draw a straight line through all 4)   At that point, I was panicking, and wanted to get off the 25ft tower I was on, and rush to my truck, just down the hill to grab my camera. (Truck was about 500 ft away from the antenas) So I did and returned with my camera. The first main object was gone, and the other 3 behind it where leaving in sequence as well. I was able to snap off pictures of the 4th orb/sphere/object, which was closer to San Francisco, out over the south Bay. I've been up there 30-40 times this year, I have never seen any lights up there that could compare, ive never seen any reflections that could compare or have ever been 1/10th as bright as these in clear sunny day light conditions. I just cant explain what these where.",
      "link": "http://www.nuforc.org/webreports/072/S72887.html",
      "state": "CA",
      "duration": "5-10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b8c46",
      "summary": "White egg object Hovered then speed off with great speed",
      "city": "sanjose",
      "shape": "egg",
      "date": "2008-10-31T00:00:00",
      "story": "White egg object Hovered then speed off with great speed 1 possibly 2 white egg objects caught by my 13 yr old son. He called me out and I grabbed my binoculars.. Seems to have hovered for 2-3 min above the san jose bay area then picked up speed like Ive never seen befor and headed east till I lost the object.. I called this in to 311 non emergency line and they stated no other calls were called in regarding this sighting.",
      "link": "http://www.nuforc.org/webreports/065/S65587.html",
      "state": "CA",
      "duration": "5 min"
    },
    {
      "_id": "64d005f478aba2ec5a3b8de1",
      "summary": "Facing north, at about 2 o'clock high, I saw a bright ball of light (an electromagnetic spacecraft) make an abrupt turn from NW to NE a",
      "city": "sanjose",
      "shape": "fireball",
      "date": "2008-10-31T00:00:00",
      "story": "Facing north, at about 2 o'clock high, I saw a bright ball of light (an electromagnetic spacecraft) make an abrupt turn from NW to NE and gradually disappear upward out of the atmosphere without a change in vector - approximate speed somewhere between 5-10K MPH - until it became a tiny pinhole of brightness. -US Air Force veteran: I know aircraft and this was not conventional.  This my second UFO sighting in San Jose, CA since 2002. ((NUFORC Note:  Witness elects to remain totally anonymous;  provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/065/S65650.html",
      "state": "CA",
      "duration": "7 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b919c",
      "summary": "Lime green lozenge -shaped light shot across the sky.",
      "city": "sanjose",
      "shape": "light",
      "date": "2009-08-27T00:00:00",
      "story": "Lime green lozenge -shaped light shot across the sky. I was sitting on my back porch with my cat.  At a few minutes after 9pm, a lime green lozenge-shaped light appeared on my right heading toward the Santa Cruz mountains.  There was no sound and no disintegrating effect like a meteor.  The edges of the light were fuzzy.   The light shot over the mountains.  As it did, it illuminated the underside of the clouds.   I ran into my house yelling that I had seen a UFO.  I immediately telephoned Vandenberg Air Force Base to ask if they had launched anything and they said no. ((NUFORC Note:  Date may be approximate, although the witness does not indicate that fact.  PD))",
      "link": "http://www.nuforc.org/webreports/071/S71689.html",
      "state": "CA",
      "duration": "7 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b93f1",
      "summary": "I saw a bright, moving, red light in the sky.",
      "city": "sanjose",
      "shape": "circle",
      "date": "2009-08-27T00:00:00",
      "story": "I saw a bright, moving, red light in the sky. I was walking out from a friend’s house to go home at 23:50 PM on Sunday, July 9th when i looked down the street and saw a red light. It was a bright light in the sky, far away in the distance. It looked like a star, but it was red, and far brighter than any star I have ever seen (besides the sun). It was too bright and did not move like a plane or helicopter, too slow to be a satellite or a shooting star.  Similarly, the red light’s movement was erratic thus eliminating any-other known celestial body following a constant orbital path.  It was just above the trees down the street, in the southwestern sky. I called back to my friend, who was walking back inside, to come look at the light. We watched the light for approximately 20 minutes. Over the course of the 20 minutes the light grew fainter and fainter.  It went higher into the sky for about ten minutes, then started moving further south for about five minutes. It moved very slowly. It moved like it was ! the first stroke of writing a \"Y,\" going up (from the base of the \"Y\"), and to the left.  After about 10 minutes I called another friend with my cell phone and told him to go outside and look at the light. He saw it too. After watching the light for fifteen minutes, it stopped moving. It was dimming faster than it was before. It would flicker, get slightly dimmer, then brighten again. Every time it flickered it would become slightly less bright. Then when it became as dim as the stars around it, it started flashing and falling towards the earth. It moved faster than it did when it was moving in the previous 20 minutes. It appeared to be in a free-fall. It fell for about 30 seconds then stopped flashing and we couldn’t see it anymore. I could still see it for about 3 seconds after the light went out. I could see the object similarly to the way you can still see brightness from dimming embers.  Then we lost track of it and didn’t see it again.",
      "link": "http://www.nuforc.org/webreports/071/S71597.html",
      "state": "CA",
      "duration": "20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b9482",
      "summary": "Spotted 7 total objects in the daylight sky. 2 stayed for over 10 mins before flying away. Polarized sunglasses aided view .",
      "city": "sanjose",
      "shape": "circle",
      "date": "2009-08-05T00:00:00",
      "story": "Spotted 7 total objects in the daylight sky. 2 stayed for over 10 mins before flying away. Polarized sunglasses aided view .",
      "link": "http://www.nuforc.org/webreports/071/S71107.html",
      "state": "CA",
      "duration": "2 hours"
    },
    {
      "_id": "64d005f478aba2ec5a3b94dc",
      "summary": "sun shines of fuselage of very large high altitude object, small stationary light visible afterwards",
      "city": "sanjose",
      "shape": "changing",
      "date": "2010-06-03T00:00:00",
      "story": "sun shines of fuselage of very large high altitude object, small stationary light visible afterwards I was sitting outside looking to the northern sky toward Milpitas.  i saw the sun shine of off an object.  at first i thought it was a high altitude plane with the sun shining off the fuselage.  i usally see the sun flicker off the fuselage of passing commercial jetliners. this is where it gets interesting.  after i see the sun shine off of this object, the object proceeds at a stady pace to the east.  it then stops in the low horizon to the east and i all see is a small red light. the light is hard to see so i grab my binocs.  the light stays motionless for about 2 minutes in the air until it finally moves or dissapears.  i would guess the object was 60-80,000 feet and very large. possibly a football field in length. but this is just a guess.  no sound made.",
      "link": "http://www.nuforc.org/webreports/075/S75485.html",
      "state": "CA",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b990a",
      "summary": "Bright orange-red light seen over San Jose, CA.",
      "city": "sanjose",
      "shape": "chevron",
      "date": "2009-08-27T00:00:00",
      "story": "Bright orange-red light seen over San Jose, CA. A bright orange-red object was seen from a bedroom window.  We went outside to get a closer look.  It was really high up in the sky, and was really bright.  It seemed to be over downtown San Jose and moved toward the Cambrian area of San Jose.  It moved slowly at first and then before it disappeared moved quite rapidly.   At first it moved quite slowly, drifting to the right and then arcing over to the left.  Then it took a straight line to the left and quickly rising and eventually disappearing.  The light was solid and then quickly flickered before it disappeared.  The object looked like it might have been in the shape of a boomerang, but was really high in the sky to confirm. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/071/S71579.html",
      "state": "CA",
      "duration": "12 mins"
    },
    {
      "_id": "64d005f478aba2ec5a3b9903",
      "summary": "Strange bright Red light over San Jose, CA.",
      "city": "sanjose",
      "shape": "light",
      "date": "2009-08-27T00:00:00",
      "story": "Strange bright Red light over San Jose On the night of August 9th 2009 between the hours of 11:30PM and 12:30AM me and my girlfriend observed some sort of U.F.O. It was a red light that did not flash. for about 40 minutes it approached as if a plane would but took way to long to reach us which it never did. it rose upward very slowly glowing brighter and brighter, then very dim for a few minutes then bright again. Then this red light jumped over to our right at the same altitude it was at approx 2 miles from its starting point in the sky. It then began to flash very quickly and got brighter then dimmer flashing, then it decended the distance it traveled over the last 45 minutes or so in about 3 seconds flashing brighter and then slowing down and gettting dimmer, then getting brighter and faster again. at the end of its decent it got dimmer and turned a whitish color and as it was speeding off just disappeared. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/071/S71605.html",
      "state": "CA",
      "duration": "1 hour"
    },
    {
      "_id": "64d005f478aba2ec5a3b9a54",
      "summary": "Light very irregular movement in sky.",
      "city": "sanjose",
      "shape": "light",
      "date": "2010-06-03T00:00:00",
      "story": "Light very irregular movement in sky. watching light move in irregular motion then dissappear.  Watched for about 3min light zig zag then I move to different location light was not visible and moved back about 5meters and back and light still in sky. Irregular movement continued then dissappeared. Very unsual.  I am not a believer in this type of thing but this was very irregular. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/075/S75495.html",
      "state": "CA",
      "duration": "5 min"
    },
    {
      "_id": "64d005f478aba2ec5a3b9ac3",
      "summary": "Two lights dropping vertically in unison; flash of red from top light",
      "city": "sanjose",
      "shape": "light",
      "date": "2010-04-13T00:00:00",
      "story": "Two lights dropping vertically in unison; flash of red from top light My husband and I live in So San Jose and were watching a movie on the computer. Through the window facing west at about 45 degrees in the sky, we saw two bright white lights vertically aligned and moving in unison, from our distant view the lights were about 1\" apart. The top light got brighter and changed colors to an amber red for second. These lights were seen west of San Jose, towards the Pennisula and the Bay. We see many planes and helicopters in this area so we know how they appear in the sky; these lights were much more brilliant - both were as bright as a rising Venus at certain times of the year. I could not detect any sound. As they dropped below our sight, they kept the same vertical alignment, same distance apart, and moved at the same rate of speech.  It was as if an invisible string was attaching the lower light. What is this?  My husband thinks it was helicopter. I am not sure.",
      "link": "http://www.nuforc.org/webreports/074/S74800.html",
      "state": "CA",
      "duration": "A few seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b9c0a",
      "summary": "Two points of light over San Jose, CA seen moving in formation before disappearing.",
      "city": "sanjose",
      "shape": "formation",
      "date": "2009-03-19T00:00:00",
      "story": "Two points of light over San Jose, CA seen moving in formation before disappearing. I looked up into the sky when I walked ouside and saw two bright points of light flying in perfect formation about .25 miles apart (very approximate).  It was about ten 737 aricraft wing to wing.  They were moving at the exact same speed in the same direction. The lights quickly faded for no apparent reason and they were no longer visible.  I only saw them for about 6 seconds.",
      "link": "http://www.nuforc.org/webreports/068/S68831.html",
      "state": "CA",
      "duration": "Brief"
    },
    {
      "_id": "64d005f478aba2ec5a3ba380",
      "summary": "Large, high altitude, oval-shaped object sighted over San Jose, CA",
      "city": "sanjose",
      "shape": "oval",
      "date": "2009-08-27T00:00:00",
      "story": "Large, high altitude, oval-shaped object sighted over San Jose, CA I'm a licensed private pilot (22 years) and avid skywatcher (40 years). I was up late and went outside to check the sky. I was looking at Cassiopeia which was near the mid-heaven. Passing close to the star Segin, I noticed 2 lights moving together in a N-NE direction. The lights were roughly 1/4 degree apart. I noticed the lights appeared to be on the opposite outer edges of an dark oval shape. The oval appeared to have numerous additional lights around the periphery. The object was silent. I saw no sign of navigation lights, flashing lights, or strobes. There was no trail behind the object. I was able to watch the object move in a straight line traveling approximately 20 degrees in about 3 minutes until a tree blocked my line of sight.",
      "link": "http://www.nuforc.org/webreports/071/S71809.html",
      "state": "CA",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3ba67b",
      "summary": "It was 1 : 30 pm  me and my wife where standing outside of our apartment when we see 3 flying object very high in the sky  we stayed wa",
      "city": "sanjose",
      "shape": "circle",
      "date": "2009-01-10T00:00:00",
      "story": "It was 1 : 30 pm  me and my wife where standing outside of our apartment when we see 3 flying object very high in the sky  we stayed watching them for like a minute and a half during that time a guy on his bicycle was passing by and asked what we staring  at so we showed him he was surprised like we were.  We start looking online to see if there was any reports  and we came across this site http://www.ufo-reports.com/ And we seen that on the first there was pictures and reports about  the same objects we seen  and they flying in the same formation .  I don’t know what to think because it is so confusing the speed they were going the height unbelievable.",
      "link": "http://www.nuforc.org/webreports/067/S67849.html",
      "state": "CA",
      "duration": "1m 15 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3ba8b3",
      "summary": "Green FireBall flew across downtown SJ",
      "city": "sanjose",
      "shape": "fireball",
      "date": "2010-11-21T00:00:00",
      "story": "Green FireBall flew across downtown SJ I was driving when I see the UFO, but it was really clear but fast. Fireball like shooting accoring the sku,  The flame and the tail was in green color.  It only appear for about 2-5 sec and it just disapper. It seems to fly across faster than an airplane but slower than the metro shooting star.",
      "link": "http://www.nuforc.org/webreports/078/S78904.html",
      "state": "CA",
      "duration": "2-5 sec"
    },
    {
      "_id": "64d005f478aba2ec5a3ba980",
      "summary": "I was in the back yard with grandkids,saw a bright light in the sky coming towards us,it stopped over my house,then i started taken vid",
      "city": "sanjose",
      "shape": "disk",
      "date": "2010-11-21T00:00:00",
      "story": "I was in the back yard with grandkids,saw a bright light in the sky coming towards us, it stopped over my house,then i started taken video of the ufo,then me & my grandaughter saw three aliens jump off onto my roof, i have clear video pictures of them and there ship over my house,for one year they been taken me, also i have inplants in my body,i know why there here, i was scared at the time and i am still scared till now, from 12:oo am to 5.30 am they fly every night over east san jose.  I want the 3 main guys from the tv show ufo hunters to investigate into this matter if they have the guts to see the real stuff. ((NUFORC Note:  Witness elects to remain totally anonymous.  PD))",
      "link": "http://www.nuforc.org/webreports/078/S78342.html",
      "state": "CA",
      "duration": "1hr"
    },
    {
      "_id": "64d005f478aba2ec5a3bab21",
      "summary": "redish orange fireball in the sky south of san jose",
      "city": "sanjose",
      "shape": "fireball",
      "date": "2010-11-21T00:00:00",
      "story": "redish orange fireball in the sky south of san jose we were driving south bound on capitol expwy passing up senter road. the night was clear and the moon was bright. we looked up towards morgan hill and saw a bright red light. it was approx the same location as the bright star east of the moon but on the opposite side. for about 4 seconds it turned real bright almost white, then orange. we thought it was a low helicopter at first.  then it started moving up and west. it had a sharp tail. i was trying to focus i thought maybe its a red helicopter. but the object seem real far, no way it was a helicopter. we exited capitol onto monterey road and went south. the object was still in view but the tail started breaking off into little pieces, looked somewhat like a missle. then it had no more tail and was just an orange ball. i was starting to think it was a star. but it glowed red. my friend said he saw a haze around it but i didnt see the haze. we got to skyway rd about a mile from capitol. we parked to get a stable look. and as we watched it, it disapeared.",
      "link": "http://www.nuforc.org/webreports/077/S77916.html",
      "state": "CA",
      "duration": "4 min"
    },
    {
      "_id": "64d005f478aba2ec5a3bad75",
      "summary": "UAO over 680 southbound freeway",
      "city": "sanjose",
      "shape": "disk",
      "date": "2010-11-21T00:00:00",
      "story": "UAO over 680 southbound freeway Sighting occurred on 10/21/10, precisely around 23:25 hour. Driving southbound on 680 between Durham Exit and Calaveras/Marsh Road Exit, sighting of UAO, saucer like in shape, was caught floating over the highway, approx hovering around 200-300 ft above. Air density became incredibly heavy for approx 2-3 minutes when passing under saucer. Saucer had no lights or markings that were visible except for shape itself. EMF field was charged, but not alarming. 3 cars southbound + a few cars northbound slowed down to view object, many others did not appear to see it. Situation and effects ended approx 5 minutes after sighting occurred.",
      "link": "http://www.nuforc.org/webreports/078/S78529.html",
      "state": "CA",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3baf2a",
      "summary": "1 orb and two orbs that changed shape into moonlike objects.  ((NUFORC Note:  We believe the objects are clusters of balloons.  PD))",
      "city": "sanjose",
      "shape": "changing",
      "date": "2011-05-02T00:00:00",
      "story": "1 orb and two orbs that changed shape into moonlike objects Picking up my daughter from school i see a white \"star\" in the sky.   Ive been seeing these ufos for over a year now so when i saw it i knew to run to my car and get my camera(that i carry with me all the time now).   On the way to the car i spot another brighter white star below i to the right.  So im looking back and fourth between my daughter(8yrs old) and the two white orbs, when out of thin air a third red orb appears to the right of the white orbs.  They are approaching my location from the east at about the speed of a small plane, at this point im running to my car for camera.  When i get my camera they are just about overhead, the first orb i spotted is quite faint and looks like a small star at a high altitude. The other two however, to my amazement, have changed thier shape.  They appear like two small crescent moons, one bright white the other bright red, and they are slowly spinning.  The spinning motion is not constant, the spinning is fast at times then! slow at other times, going one way then the other.  Both the red and white \"moons\" are spining but independently, at this point even my daughter is kinda freaking out.  The other star like one was still slightly off to the left of the two spinning \"moons\" but kinda just floated along with them from the east to the west.  So now these things are above me and i actually can see them in my cameras view finder.  I do get 8 pictures of the two spinning moon like objects and accidently get a 2sec video. When i got the pics home and inspected them closer i was excited, although the pics don't do the sighting justice some of the detail when zoomed in i could not see with the naked eye.  After seeing the detail ive concluded that they were not only spining they were changing shape. In the pictures you will see the two spining/changing ones, but the third starlike one was there above to the left out of view.  The sighting ended with the object flying over the homes/trees that i was standi! ng next to and out of sight. The only thing i would like to ad! d was as im on the sidewalk next to my daughter,taking pictures and both of us looking up, about a dozen kids with parents also leaving the school walked by me. Almost as amazing as the ufos flying above my head was that NOT ONE person asked me what we were taking pictures of or even bothered to look up to see what i was looking at for almost 5 min. This truly disturbed me, i wanted to scream look up, but it just felt awkward so i didn't. In retrospect i wish i would have tho. ((NUFORC Note:  We believe the objects are clusters of balloons.  PD))",
      "link": "http://www.nuforc.org/webreports/081/S81078.html",
      "state": "CA",
      "duration": "4 min"
    },
    {
      "_id": "64d005f478aba2ec5a3bb1c0",
      "summary": "San Jose - red object in sky heading south.",
      "city": "sanjose",
      "shape": "light",
      "date": "2011-05-02T00:00:00",
      "story": "San Jose - red object in sky heading south 23:10 in the backgarden and I looked up to the west. I noticed a red sphere in the sky, stationary <> 15k ft. My wife saw this and I have a picture (hope its not to blurred)   Object was silent and it traversed from middle of the sky in the west to due south of San Jose towards Santa Cruz mountains.  Luminosity changed as it went south. (its not a plane, not satellite, nor st Elmos fire)",
      "link": "http://www.nuforc.org/webreports/081/S81017.html",
      "state": "CA",
      "duration": "5 mins"
    },
    {
      "_id": "64d005f478aba2ec5a3bb210",
      "summary": "15-20 orange glowing objects travelling across the night sky.",
      "city": "sanjose",
      "shape": "fireball",
      "date": "2011-05-02T00:00:00",
      "story": "15-20 orange glowing objects travelling across the night sky. I reported the following incident via your hotline:  On Friday, April 29, 2011 at 8:45 pm, my husband and I both witnessed 15-20 glowing orange objects in the sky over our house in San Jose, Ca.  The objects were clustered together at first, then separated randomly.  They were visible for about 5-10 minutes. They travelled in a southeast direction. From the ground and at night, it was impossible to tell the altitude, speed, or size of the objects.  It was like watching airplanes in the sky at night. Winds were 28-30 mph, out of the north.",
      "link": "http://www.nuforc.org/webreports/081/S81047.html",
      "state": "CA",
      "duration": "5-10 mins"
    },
    {
      "_id": "64d005f478aba2ec5a3bb2b8",
      "summary": "white/red orb  (photos taken)",
      "city": "sanjose",
      "shape": "sphere",
      "date": "2011-05-02T00:00:00",
      "story": "white/red orb  (photos taken) Witnessed object from front door window.  Going approx. east to west, started 80 deg from horizon.  I saw object as a bright star at first, it then changed to a red star, then to a black sphere in the span of about 15 seconds.  I have witnessed this object multiple times in the past, so i was prepared and grabbed my camera from my desk.  Just seconds later i was outside my front door with the camera, at this point it was almost directly above me.  Again it appered as a white star but changed red, then a few more times from white to red, but not always a complete change sometimes only half way. I do take pictures as it slowly floats over my house.  I go to my backyard to get a better view and it now apperars much higher/smaller and is now just a white dot in the sky, and it is now almost stationary. I observe it for another 10 min, then it slowly faded away, i tried to take more pics but was largely unsuccessful.  It is very difficult to see with the naked eye! so its twice as hard to get on my cameras view finder (cannon 10x optical zoom digital camera).   I do my best and snap pictures anyways most of the time i see this thing, most dont come out and the ones that do usually just show a white or red dot in the sky.   Needless to say disappointing, however this time two of the pictures came out with some good detail if zoomed in.  When i witnessed the object i didnt see the detail that shows in the picture.  I think its because the pictures were shot when the object was changing colors, and in real time it happens almost instantly and the change is self is not really visible.  p.s. I just found out as i was typing this report that Usama bin laden is dead at the hand of US forces. An interesting day for sure",
      "link": "http://www.nuforc.org/webreports/081/S81082.html",
      "state": "CA",
      "duration": "12 min"
    },
    {
      "_id": "64d005f478aba2ec5a3bb2c9",
      "summary": "Cigar shaped object, could be blimp, over east foothills of san jose,( calaveras reservoir area) during afternoon commute.",
      "city": "sanjose",
      "shape": "oval",
      "date": "2011-01-05T00:00:00",
      "story": "Cigar shaped object, could be blimp, over east foothills of san jose,( calaveras reservoir area) during afternoon commute. Seen above east foothills during commute going north on 880. Initially thought it to be a traffic copter given its size. It remained in apporox. the same location while I drove, instead of gaining on it it remained just above the hills and size unchanged. 5 minutes elapsed going 70mph on freeway. assumed it must either be the Goodyear blimp or the 1 zeppelin airship that does bay area tours out of moffet field.   Never witness either of those crafts in that area in the past, it's unlikely airspace for either craft. It finally dipped out of sight behind hills before I could pull over and view it with binoculars.",
      "link": "http://www.nuforc.org/webreports/079/S79281.html",
      "state": "CA",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bb385",
      "summary": "San Jose",
      "city": "sanjose",
      "shape": "other",
      "date": "2011-03-23T00:00:00",
      "story": "San Jose I was doing some work at my dining room table and noticed a big green (turquoise) glow outside of my balcony. I had dismissed this first glow as “I must be crazy”.   When the second glow came, I was really surprised.  I immediately told my girlfriend in the adjacent room. I walked outside thinking that maybe a transformer blew.  There was no noise outside of the whipping wind and rain.  I waited for the familiar “pop” of a transformer while looking at the sky.  Puzzled, I thought that it could have been an airplane or something else that, if the green glow was a catastrophic event, I should be able to see something.. Anything.. I returned to my PC and did a web search for the glow…  strange things.  I read up on this Thundersnow but the web sources pretty much said that the colors were blue and a sound followed.  This did not seem to fit..",
      "link": "http://www.nuforc.org/webreports/080/S80529.html",
      "state": "CA",
      "duration": "2-3 seconds twice about 2"
    },
    {
      "_id": "64d005f478aba2ec5a3bb3b1",
      "summary": "Small white dot high in sky similar to 7/2009 case over San Jose.",
      "city": "sanjose",
      "shape": "light",
      "date": "2010-08-24T00:00:00",
      "story": "Small white dot high in sky similar to 7/2009 case over San Jose. Similar to 7/1/2010 case over San Jose. Small white dot appears over San Jose.  Observed from South San Jose.  The dot was quite small but clearly visible with the eye .  Binocs didn’t help much.  I think the dot disappeared after about 5 minutes.  Too high to be a plane.  Space station moves and this was stationary.  The angle was looking almost at 60 degrees in the sky from my position to the north. Could it have been a star visible during the day time? If so, why would it disappear after five minutes. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/077/S77168.html",
      "state": "CA",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bb3b0",
      "summary": "White dot in sky seen streaking twice in opposite directions over East San Jose foothills.",
      "city": "sanjose",
      "shape": "other",
      "date": "2010-08-24T00:00:00",
      "story": "White dot in sky seen streaking twice in opposite directions over East San Jose foothills. Observed from South San Jose.  The angle in the sky was somewhat shallow, at 20-30 degrees. First object was a small white dot travelling at high rate of speed to the south toward Gilroy.  It could have made the trip from San Jose to Gilroy in 10 to 20 seconds which would make this speed ±6,000 to ±12,000 MPH. A minute or so later, I see what appears to be same object at lower altitude this time (maybe 30,000 feet) travel north along foothills.  Same speed.  Observed both objects for about 3 seconds. Too fast to be a plane.  Highly doubt this was a bird as it was so far away and traveling so fast. I estimate the object was 10-15 miles away from my vantage point. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/077/S77170.html",
      "state": "CA",
      "duration": "5 second"
    },
    {
      "_id": "64d005f478aba2ec5a3bb3b8",
      "summary": "red/gray \"fireball\" in San Jose, Ca  1/12/11",
      "city": "sanjose",
      "shape": "fireball",
      "date": "2011-01-31T00:00:00",
      "story": "red/gray \"fireball\" in San Jose, Ca  1/12/11 Location: San Jose, CA  Evergreen Time: 08:52am Weather:  Clear skies Object: red/gray orb Angle from horizon: Approx. 60-70 deg. Flight path:  Approx: East to West with a slight arc upwards at the end. I observed  red fireball in the sky, that changed size and brightness.  It appeared to “flare up” to a bright reddish ball about twice the size of Jupiter, then would lose luminosity  and size to become a dull red color and about the size of Jupiter.  Even more interesting it would shrink down to about half the size of Jupiter, turn  a dull gray color, and looked almost oval.  It repeated this pattern several times before slightly arching upwards, then it sort of faded out of sight  in approx. 10 sec.   The entire sighting lasted  90 sec.  My mother observed this as well but didn’t want to report this herself  (sorry Mr. davenport).  What appered to be a Southwest passenger jet was in the air at this time.  My phone camera could not pick up the object. I am a father of two kids, a homeowner, and a logical person.  I have no reason to lie, and only reporting this because I’ve seen these \"fireballs\" about 15 times through the summer of 2010.  I just want to know what they are. I doubt I will find out though.",
      "link": "http://www.nuforc.org/webreports/079/S79648.html",
      "state": "CA",
      "duration": "90 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bb878",
      "summary": "Orange/Red light in sky viewed from San Jose",
      "city": "sanjose",
      "shape": "light",
      "date": "2010-08-30T00:00:00",
      "story": "Orange/Red light in sky viewed from San Jose 11:59 looking north outside my house in the backyard i noticed a single red/orange light in the sky just to the left and underneath casiopea, it was like a star, twice the size of Venus and as bright as Venus. It was static for about 60 seconds and then i called my wife outside, just after that a smaller object of the same luminescence seemed to drop off and move lower in the sky. (They both looked liked a military style parachute flares)  My wife moved to the front of the hose and watched it move from right to left and moving downwards (further away) before it became to small to see with here eyes.",
      "link": "http://www.nuforc.org/webreports/077/S77513.html",
      "state": "CA",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bbb90",
      "summary": "Please read these abductions going on with a 41yo male.",
      "city": "sanjose",
      "shape": "",
      "date": "2011-10-10T00:00:00",
      "story": "Please read these abductions going on with a 41yo male. **PLEASE DON'T USE MY REAL NAME**  I will tell you my story. Well, here it goes, I am a 41 yo who had a heart transplant in 2001 and a stroke which left my right side partially limited.  I was living in San Jose and had a fantastic position with an international hi-tech firm doing project management in Palo Alto.  It was a great future in store for me, and I was very excited to be a part of it.  I am living north now in McKinleyville, CA. From what I can remember in the past:  5 years old:  I was climbing on the outer railing when I fell off the second floor and right before I landed on my back on the tiles, I felt my body being set down very slowly.  Being five I thought that was really neat and ran into the kitchen to tell my Grandmother who got angry and scolded me telling my \"You're full of \"cazzata\" which translates to \"Bull S****\" and scolded me to my room. I never forgot that moment even for a second. At the age of 24: I was away at collage and living in an old c.1894 house with four other students.  For about two months at least 2 mornings per week I had a series of waking up and being completely unable to move anything except for my eyes for approx 30 minutes.  Another thing was the \"weight\" that heavily pressed my body into the mattress, it felt like someone was on top of me. That was a disturbing times but it ceased at two months.  Not ever was I into 'ghosts' but that made me serious about wondering if they really exist.  I searched the old house at Humboldt State University's library and found that the 1894 house was built right over the ashes of a previous building.  The wondering about a ghost faded as I was in an intensive program that needed my focus. 2 years ago: I woke up in my bed and looked at my watch seeing that three days had passed with no recollection of anything. I was extremely upset about it and went to my Doctor who took a blood test and everything was normal.  I did not tell him about why I was so frazzled.  In addition I had multiple dreams where I was unable to move except for turning my head.  It was a very strange room with two other tables with people laying on them and again there was a being 8-9 feet tall wearing an outfit with a hood and shielding for the face working on the body to my right.  I can recall turning my head to the left where small rectangle windows looking down at Clam Beach from I guess around 7000 feet, just a guess.  During the two years I had multiple dreams like that. The last week:  The last night for the third time in the past week I dreamt of being in an underground 'lab?' or some kind of very large underground facility 'people' of two types.  One type was 8-9 feet tall and the other was 'human-like' who can communicate using their minds.  (I feel like I'm going crazy.)  They were very calm and 'loving.'  There are dozens of windows in the rock where the 'humans' would live, they would open into the rock.  I would wake up and fall right back into the same dream.  I have noticed new skin-marks and two new tiny scars. I live alone, my family is in So. California. That's my story and you may do what you like with it, but again, PLEASE DO NOT USE MY NAME. Thank you ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/084/S84265.html",
      "state": "CA",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3bbb92",
      "summary": "remembered",
      "city": "sanjose",
      "shape": "sphere",
      "date": "2011-10-10T00:00:00",
      "story": "remembered   I was around 5 years old, My dad, mom and I were going to san Jose , not sure why, think it was for a cusin or dont matter, well fuck you guys better not be crack pot, anyways , while on the high way from colton to jan jose, my dad seen a craft, while my mom and I seen it also, It did some circles and shot a beam then it was gone, but my mom mention what happened to the traffic, and there was none, my dad got off the car to watch, my mom got mad and said get back into the car,then it shot into outerspace, then all the traffic came back and my dad always say we lost hours there, My dad is a retired correctional warreden and my my a correctional officer, I had remembered what had happend at around nine, we were aducted, when my dad went out side the car the craft opened up and a person stood there, my mom scream ((name deleted)) get back into the car, but my dad went into the desert,  what I remembered he talk to who ever it was then, he came back , say there ok they wan! t to show us something, my dad carried me to the caft, there was a lady blond hair see said hi,  listen there is more but are you willing to call me not sure if you are real, my mom and dad remember the craft but do not remember being taking, but willing to talk, can you contact me Im 37 carrying this memory for years, thanks ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/083/S83733.html",
      "state": "CA",
      "duration": "1 hr not sure"
    },
    {
      "_id": "64d005f478aba2ec5a3bbc51",
      "summary": "Highly reflective object moving over homes in a populated area",
      "city": "sanjose",
      "shape": "other",
      "date": "2011-10-10T00:00:00",
      "story": "Highly reflective object moving over homes in a populated area I was in my car driving north down Santa Teresa Blvd when I noticed a chrome/nickel (highly reflective) craft flying between the hills and the road that I was on.  The craft was approximately 150 Ft. off of the ground.  It was approximately 60 feet long and nickel with a blue tint on the bottom. It was moving at approximately 100 MPH. It made no noise and had no visible means of propulsion. It was completely bare, just solid chrome/nickel with the blue tint on the bottom.  I know this is going to sound strange, but it looked like it was just floating there, except for the fact that it was moving fast through the air.  This was in a heavily populated area in the middle of the day right over homes. I pulled my car over to get a better look.  As I got out of my car, the craft was now about a half of a mile behind me.  By the time my eyes found the craft (it was so low that it didn't take long for it to leave my field of view) it just faded away into nothing.  It just ! disappeared.  This thing flew right over some friends of mine that were eating their lunch, and none of them noticed it or heard a thing.  It had to go right over their heads.",
      "link": "http://www.nuforc.org/webreports/083/S83762.html",
      "state": "CA",
      "duration": "4 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bc310",
      "summary": "Burning spheres over San Jose, California, and fighter jets after.",
      "city": "sanjose",
      "shape": "sphere",
      "date": "2011-12-12T00:00:00",
      "story": "Burning spheres over San Jose, California, and fighter jets after. Thanksgiving evening around 18:30 my cousin text me & says did you see that! Informs through text of a number of burning looking balloons and then fighter jets later.   Weird because last Thanksgiving 3 relatives a similar incident of witnessing something in the sky ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/085/S85481.html",
      "state": "CA",
      "duration": "unknown"
    },
    {
      "_id": "64d005f478aba2ec5a3bca96",
      "summary": "2 High Altitude Craft over San Jose, CA.",
      "city": "sanjose",
      "shape": "light",
      "date": "2011-08-21T00:00:00",
      "story": "2 High Altitude Craft over San Jose, CA. 2 Lights flying very high altitude, similar to the eye as satellite movement, but with 2 distinct craft. I had a near full horizon view from south to north to view the lights.  The 2 lights were flying south to north approximately.  No blinking lights were visible and no sound of audible, only solid white lights of similar brightness of a satellite or medium bright star.   At approximately 10 seconds into the sighting, the lead craft accelerated and separated at a high rate of speed.  The trailing craft light became less visible then invisible to the eye at about 15-20 seconds into the sighting, the lead craft which had accelerated away was visible until it disappeared into the horizon.  Judging from the angle, I would have to guess the craft were flying at 60,000 - 70,000 feet.    The amount of time to cross the entire horizon from first sighting was roughly 35 seconds maximum.   Could they have been fighter aircraft?  Possibly, but are fighter aircraft emitting solid white light at high altitude flight?  Weather - 100% clear no clouds, 63 F.",
      "link": "http://www.nuforc.org/webreports/083/S83283.html",
      "state": "CA",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bcc6f",
      "summary": "Two Oval Shaped Craft Flying Low and Extremely Fast in Tandem Formation Over San Jose California!",
      "city": "sanjose",
      "shape": "oval",
      "date": "2011-06-20T00:00:00",
      "story": "Two Oval Shaped Craft Flying Low and Extremely Fast in Tandem Formation Over San Jose California! I was released from the San Jose hospital on December 9th in the afternoon and it was a very nice sunny day with no clouds in the sky and shortly after arriving to my home I was resting in a chair in my back yard facing to the South at around 4pm when all of the sudden I noticed two oval shaped objects come into my vision from deep in the Western sky.  They were traveling together and within very close proximity of each other just as two side by side blue angel jets do when they fly in tandem formation during air shows. After they had caught my eyes attention, I focused directly on them for approximately 7 seconds as they went from the far right hand side of the Western sky all the way to the left of the Eastern sky.  I tried to get my friend’s attention who was standing to my left and facing me to turn around and look at the two fast flying ufo’s.   As he had turned to face them, they were already two thirds the way across the sky which caused me to get up out of my chair and walk forward passing by my friend to catch the last glimpse of them as they went over the far Eastern hills. The two ufo’s were traveling at approximately 4,000 feet above the ground and were about 3 miles or so out away from my home and seemed to be traveling at a speed of at least 1,000 plus miles per hour as it appeared from the distance that they had covered in such a quick time. The way I figured their speed at about 1,000 plus miles an hour is because I lived near the San Jose airport which is about 2 miles North West of the home that I was living in at the time and I use to watch the incoming and out going planes flying overhead all of the time in the sky at about the same distance that I had watched the two oval shaped ufo’s flying and they don’t cover anywhere near the distance of skyline in such a short period of time that the two ufo’s did in that day of December!   Everything that I have mentioned in this statement is 100% true and as accurate as I can remember.  My eyesight is 20 20 in my right eye and 10 20 in my left eye which is much better than average, so, what I was looking  at was very clear to my eyesight!",
      "link": "http://www.nuforc.org/webreports/081/S81828.html",
      "state": "CA",
      "duration": "7 Seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bce9d",
      "summary": "UFO orb seen over san jose ca.",
      "city": "sanjose",
      "shape": "circle",
      "date": "2011-05-12T00:00:00",
      "story": "UFO orb seen over san jose ca. My neighbor came by to say hi but said what the hell is that?  It was around 8:40ish while I was watching the SJ Sharks Hockey game in my garage.   I looked over my roof line and towards Morgan Hill area were about 8 glowing orageish balls.  This was 8:40ish pm and at first I thought they were flares but they were moving erratically.   At first staying still then moving rapidly.  This was Cambrian area facing Morgan Hill.  I saw them for several minutes.  I googled the sighting and it looked very similar to other sightings shown; multiple round objects moving unnaturally.  I am not saying they are not from this world but it was highly unnatural.",
      "link": "http://www.nuforc.org/webreports/081/S81095.html",
      "state": "CA",
      "duration": "5 mintues"
    },
    {
      "_id": "64d005f478aba2ec5a3bcec6",
      "summary": "Bright light traveled at a great rate in the upper atmosphere above Santa Cruz mountains CA",
      "city": "sanjose",
      "shape": "light",
      "date": "2011-05-12T00:00:00",
      "story": "Bright light traveled at a great rate in the upper atmosphere above Santa Cruz mountains CA We were on our balcony looking to the northwest towards say Camden and highway 17 junction when in the uppermost portion in the sky about 70 degree angle a very bright light appeared and traveled at a very fast rate towards the southwest.  It was very bright with maybe a small tail but too far to see clearly.  It was not a shooting star nor space debris, it's light was too bright and how it dimmed as it got further was to real.",
      "link": "http://www.nuforc.org/webreports/081/S81106.html",
      "state": "CA",
      "duration": "1 min"
    },
    {
      "_id": "64d005f478aba2ec5a3bd023",
      "summary": "Green fireball in southern night sky",
      "city": "sanjose",
      "shape": "fireball",
      "date": "2012-09-24T00:00:00",
      "story": "Green fireball in southern night sky I was standing on a 7th floor balcony of the hospital I work at looking in a southwesterly direction. I saw a green fireball approximately the color and size of a traffic signal light suddenly flash and disappear. I didn't see a tail or hear any noise as the object appeared to be at least a few miles away over southbound Hwy 101 toward Morgan Hill.  I knew that night was the peak night for the Perseid meteor shower, but those were supposed to be in the northwest sky, and I saw several of those early the next morning and they didn't look like that.  A bottle rocket?  Maybe, but I doubt it.",
      "link": "http://www.nuforc.org/webreports/092/S92464.html",
      "state": "CA",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bd2ae",
      "summary": "3 fireball objects in San Jose/Campbell",
      "city": "sanjose",
      "shape": "fireball",
      "date": "2012-10-30T00:00:00",
      "story": "3 fireball objects in San Jose/Campbell 3 fireball objects seen in a floating pattern just past the downtown Campbell/San Jose border. Was driving home from a store and noticed the three distinct objects upon looking up at the sky while stopped at an intersection.  It was immediately obvious that they were not aircraft as they seemed to hang up in the air, and the red/orange glow they gave off was very bright and luminous, making their distance close enough to rule out any stars. They hung in the air and upon closer inspection I could see them moving across the sky in a relatively equidistant triangular pattern.   After about three minutes they seemed to get very far away or dim quickly (it was hard to tell) and winked out. This is driving me crazy because I am skeptical about these things and my first instinct was that these were some type of weather balloons or chinese lanterns due to the appearance of them floating and being a fire-y red/orange but there was something very strange about them that I couldn't put my finger on that made me continue to watch until they disappeared.  Anyways, I'm just very curious to see when the new batch of reports come out if anyone in my area saw these as well! ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/093/S93122.html",
      "state": "CA",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bd4ea",
      "summary": "Bright object over mt umunhum, vertically rises, saucer shaped object over san jose.",
      "city": "sanjose",
      "shape": "circle",
      "date": "2012-10-30T00:00:00",
      "story": "Bright object over mt umunhum, vertically rises, saucer shaped object over san jose. Its barely night and Mt umunhum has a height of about 3400 feet, and I saw a bright object flying from the south toward/over Mt umunhum at about 1/2 distance higher than the moutnain or about 5500ft. The reason I noticed this was odd is because it did not fly on the standard flight paths used by military or commercial planes following over and into San Jose International Airport.  The military craft fly over south-west San Jose at about 30-40000 feet, nightly every 15 minutes or so. I noticed this object-light was different so I ran in the house to get a camera. Within the 15 or 20 seconds of getting the camera and getting back outside, the object-light was gone...I could not believe it.  I know spaceships exist, and have no doubt, so I started looking for it directly above the earth. Behold, about 30 to 40,000 feet I saw a saucer shaped object flying over ahead continuing toward San Francisco. I was facinated on how fast this object was able to vertically rise from about 5500 feet to 30-40,000 feet in about 15 to 20 seconds.  Unfortunately I was not able to see the vertical rise while I was getting the camera.",
      "link": "http://www.nuforc.org/webreports/093/S93586.html",
      "state": "CA",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bd555",
      "summary": "Yellow-green-white lighted objects flying over mt umunhum mountain range.",
      "city": "sanjose",
      "shape": "circle",
      "date": "2012-10-30T00:00:00",
      "story": "yellow-green-white lighted objects flying over mt umunhum mountain range A strange streak of yellow-green-white light falls from the sky, falls behind or toward Mt umunhum in the horizon.  I lost sight when it hit the earth due to the roof tops of houses.  The interesting thing about this light and tail was it did not appear falling from outer space as though it was coming through the atmosphere. It only seemed to leave a tail in the lower half of the sky.  Normally when an object falls from space you see a tail in the top half of the sky which burns out in the lower half.  This was opposite, the tail dropped from half-way up in the sky into the earth horizon of Mt umunhum. Coincidentally about an half-hour later I was walking and noticed two lights flying low over the Mt umunhum mountain range.  At first look it seemed like one object, but later after they turned south I noticed the lights were independent.  It was two separate objects, presenting a flight path similar to a military excerise flying over mountains.  Very unusual to see in a very populated San Jose Bay Area.  They were not flying the usual flight paths. The fascinating thing about the ojects was that they had a glow of green-yellow-white lights similar to the object that fell vertical out of the sky about 30 minutes eariler. These are just two of the six incidents of UFO objects I have seen around Mt umunhum in the past 6 weeks.  These objects or events seem to occur around 8:15 to 9:30 pm when I noticed them...just after dark.",
      "link": "http://www.nuforc.org/webreports/093/S93587.html",
      "state": "CA",
      "duration": "20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bd640",
      "summary": "2 orange balls of light/fire hovering over east hills area",
      "city": "sanjose",
      "shape": "fireball",
      "date": "2012-09-24T00:00:00",
      "story": "2 orange balls of light/fire hovering over east hills area Appeared, at first, to be common airplanes but were emitting a bright orange light and flew slowly and in total silence; the second orb following the first.  Afterwards began hovering and flickering (a little like how when a lightbulb is about to burn out) - first orb hovered upward and completely disappeared. Second orb followed suit after a few seconds.",
      "link": "http://www.nuforc.org/webreports/092/S92412.html",
      "state": "CA",
      "duration": "5-10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bd800",
      "summary": "POSSIBLE ALIEN/HUMANOID SEEN RUNNING INTO HILLS",
      "city": "sanjose",
      "shape": "other",
      "date": "2012-10-30T00:00:00",
      "story": "POSSIBLE ALIEN/HUMANOID SEEN RUNNING INTO HILLS Driving through upper Story Road and White by Alum Rock Area and through the hills to pick up my friend from her house.  Going through a certain winding road with houses on left side and pure hills/wilderness on right. following the final curve of road (note: no cars other than mine and no light source other than reflectors on hillside) when suddenly I see this dark bluish-gray humanoid figure walking briskly across street!!!  I brake in surprise and put on high beams and the creature reacts quickly and turns head away so I am unable to see its face.  Goes into a full on sprint of amazing speed and dashes up moderately steep hills, kicking up dirt and presumably over fence (too dark and too fast to see if jumped or anything).   Texting my boyfriend but phone mysteriously has lost network!  Rush to friend's house, tell her and go back to spot.  She gets off to examine if the thing left a trail while I stay in the car.  Nothing.  Gets back in and we are both equally creeped out.   I still am!!!!! THIS IS REAL AND I AM SO SCARED THAT I AM MAKING MYSELF NAUSEOUS.  There goes my sleep.........!",
      "link": "http://www.nuforc.org/webreports/093/S93469.html",
      "state": "CA",
      "duration": "5-6 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bda53",
      "summary": "Three orange/red orbs in form of a triangle in the night sky.",
      "city": "sanjose",
      "shape": "fireball",
      "date": "2012-07-04T00:00:00",
      "story": "Three orange/red orbs in form of a triangle in the night sky. I was waiting for a friend to pick me up for a night in the town.  I looked up at the stars as I always do, and i see a orange/red orb.  I pull out my phone to record it. I look to make sure it was recording, my phone showed that it was.  As I am recording I look at my phone screen and notice the there are two more smaller orange/red orbs that could not be seen with the naked eye.  All three obs formed a triangle together.  They were floating there was no noticeable movement.  My friend pulled up so I stopped recording. Later that evening I pulled my phone out to show what I had recorded and the video wasn't there anymore.",
      "link": "http://www.nuforc.org/webreports/090/S90070.html",
      "state": "CA",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bddd3",
      "summary": "2 orange lights moving in the sky non typically in San Jose CA",
      "city": "sanjose",
      "shape": "sphere",
      "date": "2012-08-19T00:00:00",
      "story": "2 orange lights moving in the sky non typically in San Jose CA 9:50 PM Aug 10th, Friday night in San Jose CA, intersection of Camden Ave and Crystal Springs, my daughter and her friend (They are 13) and I (I am 43) were taking a walk around the block like I’ve done many times before.  The sky was very clear, as we walked up Crystal Springs away from Camden Ave about ½ way up the street I looked up to the left ( about 60-70% up in height in the sky) and there were 2 orange, what looked like bright stars, amongst the stars. These stood out because they were about 2-3X the size of others and were bright orange amongst all the other white stars. I pointed them out to the two girls with me and we watched them for about 5-10 min. At first they were stationary, then one started to move down and at an angle.  After moving a distance, in terms of the size of the light, about 20-30 times it size down,  it turned at a sharp right angle and traveled about 10-20 times it’s size to the right and stopped. Then it started up toward the ! other to a point that I thought it was going to go right into the other, then about 2-3 times it size away from the other, it stopped. From there in descended again, this time its light starting to flicker  and reduce in its brilliance, several times it almost went out but then lit up again, all the while it was descending, then it faded one last time and was gone. The other remained there and then it too descended and flickered and then at last it was gone entirely.  All 3 of us were watching the whole time and the kids were asking me what I thought it was, all I could say was that it was not an airplane, not a satellite, not a star, I’d never seen anything that color in the sky move in those directions and then disappear, so I said it must be a UFO. When we retuned to the house, I sat in my back yard hoping to see something else looking up in the sky. While I did not see any more orange lights moving about, at 10:10PM my entire peripheral vision saw what looked like a meteorite streak across the sky with its tail in full view the entire time even after passing for a moment, it was lower than any shooting star I’ve ever seen, I would have thought it was the height of a high flying airplane. In the morning I looked hoping to see something in the local news paper but here was nothing so I Googled “strange lights in the sky” and saw clip after clip about just such orange lights. Then I Googled “Strange lights in the sky last night” and did see a post about someone in another state and possibly another county on the same Friday night, same time frame, seeing the same thing. Looking up now more often than even before….",
      "link": "http://www.nuforc.org/webreports/091/S91709.html",
      "state": "CA",
      "duration": "5-10 min"
    },
    {
      "_id": "64d005f478aba2ec5a3bde31",
      "summary": "Silent craft moving south from San Jose to Gilroy at an estimated 3,000 MPH",
      "city": "sanjose",
      "shape": "disk",
      "date": "2012-09-24T00:00:00",
      "story": "Silent craft moving south from San Jose to Gilroy at an estimated 3,000 MPH I looked to the sky, which was clear blue and saw a white craft travelling in a straight line at a high rate of speed to the south.  I estimated the speed at 3,000 MPH based on the time it would reach Gilroy from San Jose.  It was hard to tell the height or size. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/092/S92811.html",
      "state": "CA",
      "duration": "4 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bdf58",
      "summary": "Two elongated diamond shaped crafts, no sound, high rate of speed",
      "city": "sanjose",
      "shape": "diamond",
      "date": "2012-08-19T00:00:00",
      "story": "two elongated diamond shaped crafts, no sound, high rate of speed Aug. 11, 2012         Second try to send this report UFO REPORT SAN JOSE, CA. Approximately   10:30 p.m. my wife and I were in our back yard hot tub sitting and waiting to see the meteor shower that was to take place from the  northeast of San Jose, Ca..  I was staring up at a star formation that looks like a W.   At that time the two objects that were elongated diamond shaped, flew in front of the stars that I was looking at.  They were black, the same color as the night sky, the only reason that I could see the outline of the crafts was the light from the city was reflecting on the outer edges of each craft.  There was no sound when they passed, nor was there any sound barrier noise. My eyes then followed them, looking up at about a 45 degree angle and told my wife to quickly look the direction that they were flying.   They were in formation, side by side.  From our backyard they flew from the north, (from the direction of San Francisco towards the south, Monterey, ca.).  It only took 4-5 seconds for them to pass at high speed.  We don’t know what we saw? UfO? Or Black Ops?   Did anyone else see these objects? There is an International airport near us and planes fly in and out all the time, these were not planes.",
      "link": "http://www.nuforc.org/webreports/091/S91849.html",
      "state": "CA",
      "duration": "4-5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3be0e4",
      "summary": "Two bright silent red lights coming in from west to east, ascending, light intensity increasing, headed west - and then disappeared.",
      "city": "sanjose",
      "shape": "unknown",
      "date": "2012-08-19T00:00:00",
      "story": "Two bright silent red lights coming in from west to east, ascending, light intensity increasing, headed west - and then disappeared. This description was reported in an earlier report – this is what we saw – with the exception there were 2 separate red steady lights – (similar report) Bright light high in sky that went out to a very dim red light traveling north to southwest just west of the dipper.   First one spotted was heading west to east – then started to ascend  - there was no noise.   The intensity of the light increased before ascension.  The second craft was coming in eastbound on apparently the same path – followed the first – and ascended.   Once high(er) – the light grew very dim.  There was no sound.  It moved in a way that seemed to be controlled but was curious.  The speed heading west seemed to be very fast after apparently not moving real fast.  The other witness and I couldn't really describe what we saw as relating to any modern aircraft that we are aware of.",
      "link": "http://www.nuforc.org/webreports/091/S91808.html",
      "state": "CA",
      "duration": "6 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3be300",
      "summary": "Either a ground or sea vessel based launch of missiles viewed from a substantial distance.",
      "city": "sanjose",
      "shape": "fireball",
      "date": "2012-05-29T00:00:00",
      "story": "Either a ground or sea vessel based launch of missiles viewed from a substantial distance. In the Northwestern sky, I saw what I thought was an aircraft coming over the horizon.  Based upon the location, I assumed it was military as the coloration was different and appeared in the same vicinity from my vantage point as Moffett Field in Mountain View, California. Upon assent, it was apparent that the object was a missile of sorts as it had a distinct amber trail.  As it climbed in elevation, the relative perceived speed provided a clue the object was much further away that originally thought. It appear to reach the upper atmosphere and the object's propulsion begin to lighten in intensity and then disappear.  I then asked two family members to witness the remaining two launches.  I believe this was probably launched from a vessel at sea given the distance. It appears the path was due South from a launch point somewhere near the Farallon Islands. I don't believe this was extra terrestrial, just some sort of military testing however I can't believe I would have been the only one seeing this as there was plenty of commercial and private aircraft traffic airborne at the time. Now at least there is one documented sighting.",
      "link": "http://www.nuforc.org/webreports/088/S88981.html",
      "state": "CA",
      "duration": "10 min"
    },
    {
      "_id": "64d005f478aba2ec5a3be3ee",
      "summary": "Cluster/gathering of reddish-orange lights in the sky.",
      "city": "sanjose",
      "shape": "fireball",
      "date": "2012-09-24T00:00:00",
      "story": "Cluster/gathering of reddish-orange lights in the sky. I was with my father in a mall parking lot when I noticed a couple pointing at the sky. that's when I saw a cluster of reddish-orange lights in the sky, about six, they were flying around each other forming different shapes in the sky and then some would randomly start to fade and disappear in the night sky. While these lights were gathering other lights started to come fly over from another location and join this group of lights.  They all flew over from the same location and joined in the same location. This occurred until all the lights had faded into the sky. We saw at least 20 lights, if not more. They were pretty high up in the sky and didn't resemble any kind of aircraft we've seen.",
      "link": "http://www.nuforc.org/webreports/093/S93034.html",
      "state": "CA",
      "duration": "About 5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3be3fd",
      "summary": "Bright lights in the sky taking on a V shape formation",
      "city": "sanjose",
      "shape": "light",
      "date": "2012-03-13T00:00:00",
      "story": "Bright lights in the sky taking on a V shape formation Myself and 2 other people were in the car driving to pick up dinner when the person in the front passenger seat pointed out a long string of lights in the sky.  The lights were moving in a straight line almost like cars then began shaping into what appeared to be buildings, meaning they looked like long horizontal rectangles.   Then the lights started to scatter around, then start to go into a V formation which started flying over to our direction and it was HUGE!  Once it got just about over the car to the right it totally disappeared. There was plenty of traffic so im sure the cars around us noticed it as well. there were so many lights moving around and once it took on that V formation theres no way anyone could miss it, even if they werent looking up it was that big.   Hopefully more people can make a report to verify what we saw. ((NUFORC Note:  Witness does not indicate a time for the sighting, so we have assigned an arbitrary time above.  PD)) ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/087/S87138.html",
      "state": "CA",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3be65e",
      "summary": "South San Jose, bright orb flying over mountains near Almaden Valley.",
      "city": "sanjose",
      "shape": "oval",
      "date": "2012-06-20T00:00:00",
      "story": "South San Jose, bright orb flying over mountains near Almaden Valley. I live in South San Jose (Almaden) and first spotted UFOs over the Sierra Azul Open Space Preserve on 16th June at 8.50 pm - my wife saw them too.  I took this video (on my phone) the next night when just one UFO appeared at the same time, and hung around for 15 minutes.  On both occasions, the objects emitted white, green and red slow pulsing light.  They object in this video moves from side to side across the sky and at times soars high above the mountains in the distance.  It's hard to see just how bright the light is from this video, but the objects really shone when at their brightest then fade to almost disappear before glowing again.  I estimate the UFO is about a mile away from where I filmed this, which should be close enough to hear some sound from a conventional aircraft, but there was complete silence.  This is the video link on YouTube:  http://www.youtube.com/watch?v=7ozPrVqc4dc.",
      "link": "http://www.nuforc.org/webreports/089/S89688.html",
      "state": "CA",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3be6e4",
      "summary": "I observed an obj. in the sky aprox.4am, black oyster shell shaped .it woke me up .",
      "city": "sanjose",
      "shape": "other",
      "date": "2012-06-08T00:00:00",
      "story": "i observed an objectin the sky aprox.4am, black oyster shell shaped .it woke me up .as i focused in on it,it slowly moved out of sight.it sceard me ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/089/S89395.html",
      "state": "CA",
      "duration": "500-1000 ft"
    },
    {
      "_id": "64d005f478aba2ec5a3be8b2",
      "summary": "Two oblong flying objects changing shapes, flying from West to East over Santa Cruz mountains. Spotted them with bare eyes, then follow",
      "city": "sanjose",
      "shape": "changing",
      "date": "2012-05-13T00:00:00",
      "story": "Two oblong flying objects changing shapes, flying from West to East over Santa Cruz mountains. Spotted them with bare eyes, then followed them using binoculars for 5-7 miuntes.  Thought they were paragliders but no ropes, no people. They suddenly disappeard.",
      "link": "http://www.nuforc.org/webreports/088/S88906.html",
      "state": "CA",
      "duration": "5-7 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3be8fc",
      "summary": "Brillant blue oval botton red dome top bright white light back soundless going slowly",
      "city": "sanjose",
      "shape": "oval",
      "date": "2012-04-18T00:00:00",
      "story": "brillant blue oval botton red dome top bright white light back soundless going slowly My husband and I left our house east of San Jose to go to a small minimart in town.  On the right is an animal clinic in the field to the left of their building above a small field was a oval light bright blue with a red dome. Husband turned around I saw it above some trees bottom was bright white tipped slightly so I could see abit of red and blue lights. We stopped we got out looked south and the back end was a large white light.  When I first saw it it was beautiful full color, but there was a small white flash I wonder if it had trouble.  Hovering.It took us 20 seconds to turn around and it had just made it to the tree line of this small railroad ravine.20 mph? After stopping and watching the white light go south we feel it kicked it up to maybe 45mph still low just above tree height. Full moon, wind out of North East. Radio station in Springfield had no reports, Channel 20 Springfield had no reports and I think they were abit amused. Went and scouted area this morning and it amazed me just how close it really was.  After went to minimart and asked if any one had seen it but no luck. Learned a valuable lesson always have my phone with camera with me because you never know.  Plan on being near tonight just in case a return. and one more thing.  The UFO was so colorful and bright you could not see any structure non at all no sound absolutely amazing.  I've always thought they live by 3 rules number 1 don't get caught 2 they are big showoffs and 3 let's mess with the humans and see if we can't get get them good and rattled..Going to make some phone calls to see if farther north anything was reported.",
      "link": "http://www.nuforc.org/webreports/088/S88340.html",
      "state": "IL",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3beb44",
      "summary": "Solid white sphere/light",
      "city": "sanjose",
      "shape": "light",
      "date": "2012-02-03T00:00:00",
      "story": "Solid white sphere/light I saw what I first thought to be a star moving roughly south across the sky.  Definitely not a plane at 30,000 ft.  A solid white light moving slowly for a total of about 10 seconds then it disappeared.",
      "link": "http://www.nuforc.org/webreports/086/S86920.html",
      "state": "CA",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bedbe",
      "summary": "Yellow orange ball light  20 seconds then gone 10pm pac time  no sound traveling plane speed height in sky.",
      "city": "sanjose",
      "shape": "light",
      "date": "2013-05-15T00:00:00",
      "story": "yellow orange ball light  20 seconds then gone 10pm pac time  no sound traveling plane speed height in sky I was listening to coast to coast march 3rd  and heard you describe  exactly what I seen and have been thinking about ever since,   I’m a huge ufo’s and ghost fan my whole life,   I’m 35 years old,  I’m just interested in both but I’ve never seen either one until April 27th 2012.  10pm Pac time my friend pointed it out, was about 20  seconds in sky that we noticed it, traveling left of us, right in front of us, like plane or helicopter height no sound at all.   First thought bright light from a plane heading toward us in sky, then noticed not plane its ball light traveling left of us not straight at us, as it passed us was just bright ball light, yellow light orange that suddenly got even brighter bigger light of like white with yellow orange glow for say 3 seconds then back to glow it was giving off then gone in about 5 seconds.   I live in area planes helicopters everyday i hear them i see them this thing was neither one, it was close enough to make a sound if it was either one.   It looked like a ball light going plane speed in sky then was just gone.   It wasn’t meteor had no tail and was traveling in a straight line in sky for miles. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/096/S96533.html",
      "state": "CA",
      "duration": "15 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3beec2",
      "summary": "Orange red fireball seen 4 times above San Jose, Ca.  8/3/13",
      "city": "sanjose",
      "shape": "fireball",
      "date": "2013-08-30T00:00:00",
      "story": "Orange red fireball seen 4 times above San Jose, Ca.  8/3/13 8/4/13--  I was sitting in my back yard last night with 2 friends discussing a upcoming vacation.   It was about 11:30pm pst.   I was facing directly East,  and was looking up at the stars ( because normally you can't see them...). It was slightly cloudy,  kind of hazy out and in the mid 60's.   The eastern sky was the only area of the sky that had visible stars.   At some point around 11:30ish I noticed a bright orangish red ball flying above the the hills,  right above Mt. Hamilton.   I stared at it for almost a minute before I knew for sure that what I was looking at was something I could not understand.   It looked like a ball of light and it moved like an airplane at first.  I then pointed it out to my 2 friends,  and let them know that I had been staring at this and can't figure it out.  They immediately thought it was an airplane,  due to the size and speed.  But then it seemed to stop in mid air,  not to mention it wasn't really moving in a straight ! line.  So then we thought it was a helicopter.  This also was disproved by the size and speed.   I would say it was the size of a 3-4 bedroom house or slightly bigger.   So it moved toward us, and seemed pretty low, but then moved away,  then North,  then back to the West,  back North again before it looked to be moving away from us upward!  When it moved it was either really slow or extremely fast.  It shot up into space and disappeared within about 10 seconds!  This ball thing also seemed to be changing color from red to orange,  and I think I could see the colors moving all around the ball.  At a certain point I could see light radiating from the ball in all directions.  It looked like seeing a red light through a wet window,  or like how a bright star looks in the distance.   This lasted at least 2 minutes.   I was then walking around my yard going through every possible explanation,  and one of my friends was also doing this.  The 3rd friend was in denial and kept maki! ng up excuses as to what it was,  but non of them made sense a! nd I cou ld disprove all of them.   After a few minutes we sat back down and attempted to restart our conversation.  I however couldn't stop staring East.  Then, after about 2-3 minutes from the last occurrence,  I saw it again!  Except this time I saw it immediately,  as it rose above the East hills.   I started yelling for everyone to look at it,  and scared them because it made me jump up.  This time we all 3 saw it from start to finish.   The weird thing was that it took what seemed to be the same path as the 1st fire balls we saw.  A lot of discussion went on during this second one,  and all possible explanations were thrown out the door.  It was official,  what we were seeing defied all logic based on our knowledge and the available technology.   It was gone again,  after it shot off into space,  and we were all left staring up into the eastern sky wondering what the f@*k just happened.  Once again after a few minutes I spotted it again in almost the same spot.  The 3rd time we! were very big eyed and quiet just observing and inside freaking out.  After the 3rd occurrence I went inside the house and told my girlfriend to wake up and put her jacket on.  I had to have another witness, and someone to explain to me what was going on.   She came outside and we all told her what we saw.  By this time we were all climbing things to get a higher view,  and she thought we were nuts!  But just my luck it happened one last time.  The 4th time we saw it,  it seemed to get closer to us before it shot off into the horizon.  Also,  during the whole thing all of us saw several shooting stars each.  All of also can't remember ever seeing more than one shooting star ever in our lives,  from San Jose that is.   I got my 6ft. ladder out to get a better view,  thinking it would happen again.  What I saw over the top of my very tall fence,  on the very tops of the hills,  was some odd lights.  It looked like street lights but all the way on the top of the hills.  I've ! lived here 32 years,  and I consider myself a very observant p! erson. I've never in my life seen lights on top of these hills.  I pointed them out to everyone and mentioned they were not normally there.   Everyone thought they were lights from someone's house on the mountain,  but I knew there are no homes there.   No more strange balls of fire showed up so we went and sat back down.  About 5 minutes later,  I got up and climbed up my ladder again.  When I looked to the top of the mountains,  the lights we saw were gone!  Also,  today with the sun up I used my binoculars to get a good view of that area,  and there is nothing there...  I don't know what we saw.  But it wasn't an airplane,  helicopter, remotely operated device, wasn't a meteor, missile, rocket, weather balloon,  and took off into space.  WTF?",
      "link": "http://www.nuforc.org/webreports/100/S100750.html",
      "state": "CA",
      "duration": "30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bf16a",
      "summary": "Triangle shape red and white lights and Laser beamed across the whole city",
      "city": "sanjose",
      "shape": "diamond",
      "date": "2013-05-15T00:00:00",
      "story": "Triangle shape red and white lights and Laser beamed across the whole city This craft came from south to nortwest fo san jose. I was star gazing when this object came from the south san jose curbing towards west san jose.  Very high altitude.  Suddenly a beam of very bright light. lazer type very big wide lazer.  The beam went across all san jose to the south east. Maybe medcaf rd.. simply amazing!  As it flew over my home in west san jose the beam stop as it went towards saratoga.  It left a wide jet like stream all the way from n.w san jose to S.E. the material was over the ski for Alomost 1 hour. I will never forget this",
      "link": "http://www.nuforc.org/webreports/097/S97475.html",
      "state": "CA",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bf1ff",
      "summary": "3 lights in the sky over San Jose, CA on 04/01/2013 - 20:31 / 8:31pm.",
      "city": "sanjose",
      "shape": "light",
      "date": "2013-05-15T00:00:00",
      "story": "3 lights in the sky over San Jose, CA on 04/01/2013 - 20:31 / 8:31pm April 1, 2013 8:31pm PST San Jose, CA 95128  Facing South by South East Angle of Elevation   &#8776; 50 degrees  Weather Conditions:  Momentarily clear with rolling blanket of clouds coming in from southwest-to-east  Report:  --  For a period of approximately 20-30 seconds I witnessed 3 moving lights.  They were 2 to 3 times the size of the reference stars visible that evening, and about twice as bright, coloring in, like stars, white/blue.  The 3 lights were moving independent of each other, though retaining a general left-to-right margin distance of approximately 3 1/2 to 4 inches thumb-to-finger distance at arms length (I’m 5’10 1/2”).  Each light &quot;moved quickly”, which is to say that within this margin, these lights traveled the full distance in slightly-curved lines with tight, elevated/declined curves at the margins in about 1/2 second.  They did this sporadically about 5 times within the 30 seconds.  When not “moving quickly”, they seemed to stay still, though there was some “drifting away” in what appeared to be the same south by southeast direction. After witnessing this event, I rushed into the house to get the kids and the camera; by the time I returned (1 to 1-1/2 minutes later), the thick-blanket cloud cover moving in from the southwest had obscured the lights",
      "link": "http://www.nuforc.org/webreports/096/S96957.html",
      "state": "CA",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bf1fe",
      "summary": "5-6 bright lights traveling southeast in a vertical formation, above three bright lights moving independently, and sporadically.",
      "city": "sanjose",
      "shape": "formation",
      "date": "2013-05-15T00:00:00",
      "story": "5-6 bright lights traveling southeast in a vertical formation, above three bright lights moving independently, and sporadically. April 1, 2013 8:30 pm PST San Jose, CA 95128  Facing South by South East Angle of Elevation  ; 50 degrees   Weather Conditions:  Momentarily clear with rolling blanket of clouds coming in from the west. Report:  Standing on my second floor balcony, I noticed what at first appeared to be a flock of seagulls, flying in formation. Upon further study I realized they were not birds, but rather a group of bright lights.  They were bigger and brighter than the stars that were in the sky.  There were approximately 5-6 of these lights in a vertical line, moving toward the southeast.  Below the line of lights were 3 individual lights, traveling in the same direction, but moving independently  of the others.  These individual lights were moving in curving, back-and-forth patterns, sporadically.  I continued to observe them for about 2-3 minutes, until they became obscured by the clouds that were rolling in.",
      "link": "http://www.nuforc.org/webreports/096/S96970.html",
      "state": "CA",
      "duration": "2-3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bf2e8",
      "summary": "Six bright orange glowing objects seen floating from west to east.",
      "city": "sanjose",
      "shape": "other",
      "date": "2013-08-30T00:00:00",
      "story": "Six bright orange glowing objects seen floating from west to east. I was out looking for the meteors (Persiids) and I saw 5 floating objects coming towards me from the northwest heading east.  They were glowing orange and were larger on top so they looked like the silhouettes of large floating parachutes and they were bobbing up and down and towards each other then away.   As they were moving to the east, they got smaller and smaller until they disappeared and looked like the stars.   Then before they go tiny, a single one came up from behind as to join them then it disappeared too.   There was no noise from them.   I am a registered nurse and my husband is a retired VP of sales.",
      "link": "http://www.nuforc.org/webreports/101/S101092.html",
      "state": "CA",
      "duration": "8 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bf356",
      "summary": "A bright red oranged diamond light figure with green flares in the bottom passing by quitly moneuvering as it took off",
      "city": "sanjose",
      "shape": "diamond",
      "date": "2013-07-03T00:00:00",
      "story": "A bright red oranged diamond light figure with green flares in the bottom passing by quitly moneuvering as it took off Object description was a bright red, (little orange blended in the center with white) diamond shaped, with 4 green little flares at each corner located at the bottom of the craft. It was traveling from south to north.   When it passed over our us, it started heading towards up, maneuvering as it went higher, turning up sharply at an certain degree rapidly, turned all it's lights off.  Then it just looked liked a white ball getting smaller, and smaller like a star, and then it was outta our views? Wow!  It's very trippy to see something like that in the night sky with 2 other witnesses including my self which makes 3 of us total!",
      "link": "http://www.nuforc.org/webreports/098/S98535.html",
      "state": "CA",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bf5ce",
      "summary": "1979 ufo  and entities sighting up close",
      "city": "sanjose",
      "shape": "disk",
      "date": "2013-06-02T00:00:00",
      "story": "1979 ufo  and entities sighting up close Walking home from my grandmas house with my father.  Seen a bright star and pointed it out  to my father.  It got his attention and we stopped and stared.  My father said it was too close to be a star.  I said then its an airplane.  My father said no its moving too slow to be an airplane. So we stared as it slowly approached us.  As it got closer it looked like two stars connected then it disappeared,invisible.  It appeared to us within seconds a saucer right above the telephone pole on a residential street!  The bottom was spinning fast with bright blinking lights there was a huge window with a bright white light and two silhouettes with oval shaped heads one taller than the other the four of us staring at each other.  Then the window was gone and it began moving slowly up higher and higher then it moved in a zig zag the last move it sped off so fast faster than anything on earth and it was gone",
      "link": "http://www.nuforc.org/webreports/097/S97799.html",
      "state": "CA",
      "duration": "30-40 min"
    },
    {
      "_id": "64d005f478aba2ec5a3bf979",
      "summary": "Witnessed 2 orange lights in the sky.",
      "city": "sanjose",
      "shape": "light",
      "date": "2013-02-04T00:00:00",
      "story": "witnessed 2 orange lights in the sky Witnessed 2 lights hovering the sky near Hellyer Park in San Jose Ca.  The lights were in the sky for a little over 30 seconds.  Both bright orange light turned off almost like a flame would and 2 grey objects appeared.   One of the objects hovered towards downtown and then the secon object followed.   Weird never seen anything like this.   Note no noises were witnessed during this time. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/095/S95675.html",
      "state": "CA",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bfc87",
      "summary": "Two objects that appeared star-like, but were moving quite slowly in a northerly path and had blinking red-orange lights",
      "city": "sanjose",
      "shape": "circle",
      "date": "2013-02-04T00:00:00",
      "story": "Shortly after midnight, we went outside to see the fireworks in our neighborhood.  In addition to the fireworks, the usual commercial airliners were visible (our house is under flight paths for SJO, Moffet Air Field, and several local airports).   When we looked out to the area of sky above the house across the street (300deg NW), we saw two objects that appeared star-like, but were moving quite slowly in a northerly path and had blinking red-orange lights.  There were two commercial airplanes in the vicinity that were travelling at much faster speeds and were audible.   The two lights suddenly disappeared and within 10 seconds a single similar light appeared in the direction of magnetic north, slowly ascended in altitude before suddenly vanishing.  We were unable to see any further similar objects, though we continued searching the sky for approximately 30 minutes after we lost sight of the object. This is our secong New Year's experience, though the last year's experience was with a differnet light pattern and possible craft outline.   While my aunt and I are always excited to see unidentified lights and keep binoculars and cameras at the ready, our neighbors are quite frightened of the lights, often wanting to return to the perceived safety of the indoors.",
      "link": "http://www.nuforc.org/webreports/095/S95677.html",
      "state": "CA",
      "duration": "00:30"
    },
    {
      "_id": "64d005f478aba2ec5a3bfddb",
      "summary": "Sighting of 5 or 6 orange lights in the sky.",
      "city": "sanjose",
      "shape": "light",
      "date": "2013-10-03T00:00:00",
      "story": "Sighting of 5 or 6 orange lights in the sky I was listening to an ex cop describing seeing around 150 orange lights in the sky on Rense from a few nights ago. The size, color and movement of them is exactly what my wife and I saw when we came home from the election polls in Nov.1992.   Only, we only saw 5 or 6 of them.   Duration of several minutes. At the time I called area airports and they had no idea what we saw so they gave me a UFO reporting number to call. I did.  The next night they called me back and said they usually don't follow up on each report, but an hour after I reported it they had nearly 100 reports from the Chicago area. They asked if I held a dime at arms length if it would cover them.  I said yes they were quite a bit smaller than that. They told me someone from the Peoria, IL office would be calling me too.  But they never did. Only UFO sighting I've ever had but there was no mistaking it.",
      "link": "http://www.nuforc.org/webreports/102/S102892.html",
      "state": "IL",
      "duration": "3-4 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c05ce",
      "summary": "Two bright orange lights drifting in formation over San Jose foothills, one breaking off in a tight maneuver.",
      "city": "sanjose",
      "shape": "fireball",
      "date": "2013-03-03T00:00:00",
      "story": "Two bright orange lights drifting in formation over San Jose foothills, one breaking off in a tight maneuver. I was walking down the slope from our house (suburban, well lit area) when my daughter started chasing after me.   I turned around to stop her from reaching the street, and I immediately noticed two bright orange lights above the foothills that rise behind the neighborhood.  They were moving slowly west, silently, one slightly behind the other.   The trailing light broke off and made a tight, slow  U-turn and disappeared, while the other stayed, continuing to drift west for a good minute before fading from view.   Never seen anything like it, and its coloration was nothing like I've seen on any aircraft (and they weren't on a commercial flight path).",
      "link": "http://www.nuforc.org/webreports/096/S96493.html",
      "state": "CA",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c064a",
      "summary": "Strange increasingly loud noise over East San Jose that is indescribable.",
      "city": "sanjose",
      "shape": "unknown",
      "date": "2013-02-04T00:00:00",
      "story": "Strange increasingly loud noise over East San Jose that is indescribable I was walking my dog in East San Jose, just off Berryessa Road.  The night was clear, with moon out.  Suddenly this sound started quietly at first and it got progressively louder.  I looked up and saw nothing except these three red and white blinking lights too far away so I dismissed them as being the source of this sound.  It grew louder and louder and I thought a plane was going to crash.  It was that sort of sound although I must say I've never heard a sound like this before.  After about 5 minutes it began to fade and dissappear.  I suddenly noticed this man walking across the street, in a dark hooded shirt, black pants.  He looked at me, several times, even turned around twice. I can't say I saw his facial features, just that he looked like a man.  He walked swiftly and then when I passed a tree near me and looked again he was gone.  Wish I could tell you more.  I did not see any craft just the loud roaring noise.",
      "link": "http://www.nuforc.org/webreports/096/S96148.html",
      "state": "CA",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c083b",
      "summary": "White point of light.",
      "city": "sanjose",
      "shape": "light",
      "date": "2014-01-10T00:00:00",
      "story": "White point of light My brother and I were outside in front of our house on Christmas day.  He noticed what he described as a \"star\", but with the sun still out I told him it was probably Jupiter.  I ran into the house quickly for about a minute and then came back out.  He was still fixated on this object, so I looked up and found it difficult to locate.  When I did see it, I noticed a small, rather unremarkable point of light just lingering there so I thought nothing of it.  It was almost directly overhead, the light was constant, and the weather was clear. After another minute or perhaps less, my brother said it was moving so he ran to grab his binoculars.  I found it harder to locate this time as indeed it had changed its location.  It was moving approximately ENE across the sky, but not particularly quickly, more like drifting across.  Now I knew it wasn't Jupiter so I went to grab my spyglass.  I asked him if it might be the ISS or a satellite but he said no as he was looking through his binoculars.  He couldn't make out the actual details of the object as it was difficult to focus on it with cheap binoculars, much less the fact that it was drifting across the sky.  It appeared to be slowly drifting faster until it was no longer there!  It was still overhead at the moment of last sighting and then we couldn't locate it any more. I'm not sure what this could be, and I'm pretty sure there's an explanation.  I'm sort of a skeptic when it comes to UFO sightings but am open to the idea of government/military experiments or atmospheric phenomena as explanations for most of them.  For this particular sighting, neither of those make sense to me.  If anyone has more information, I'd love to know.",
      "link": "http://www.nuforc.org/webreports/105/S105730.html",
      "state": "CA",
      "duration": "~5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c0cff",
      "summary": "Bright triangle formation fading away slowly in day light.",
      "city": "sanjose",
      "shape": "formation",
      "date": "2014-01-30T00:00:00",
      "story": "Bright triangle formation fading away slowly in day light. A cluster of 3 orange to bright red (similar to laser) circular objects in a triangle formation moving slowly up into clouds.  Fading quickly & moving quite rapidly.",
      "link": "http://www.nuforc.org/webreports/106/S106748.html",
      "state": "CA",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c0f92",
      "summary": "((HOAX??))  Bright white light flew south and dimmed until it disappeared.",
      "city": "sanjose",
      "shape": "light",
      "date": "2014-02-27T00:00:00",
      "story": "Bright white light flew south and dimmed until it disappeared. A bright object flew faster than any planes, was a single bright white light that dimmed as it flew up and south, until it disappeared entirely. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/107/S107438.html",
      "state": "CA",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c1014",
      "summary": "Unknown object high in the sky.",
      "city": "sanjose",
      "shape": "other",
      "date": "2013-12-02T00:00:00",
      "story": "Unknown object high in the sky. Saw jet pass high in western sky leaving a contrail it passed a dot in the sky    Got field glasses and looked at dot which looked like and early star.   Minute later dot was gone. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/104/S104748.html",
      "state": "CA",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c114e",
      "summary": "Triangular bodies with flashing lights midway between downtown and south San Jose on highway 87",
      "city": "sanjose",
      "shape": "triangle",
      "date": "2014-02-07T00:00:00",
      "story": "Triangular bodies with flashing lights midway between downtown and south San Jose on highway 87 Was driving down highway 87 southbound when from far away my friend and I saw a really bright light.  At first we figured it was a plane, but we realised it was stationary.  Once we got closer, right by the hills halfway between downtown and the intersection with highway 85, we observed the craft from about 500 ft, and saw it was triangular in shape, probably about the size of a car itself.  We saw a second one later on down the road, and maybe a third one but it was too far to tell.  They were both with the same characteristics though, stationary and the same lights.",
      "link": "http://www.nuforc.org/webreports/106/S106918.html",
      "state": "CA",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c1300",
      "summary": "2 orange lights moving slowly/oddly fading out one at a time.",
      "city": "sanjose",
      "shape": "light",
      "date": "2013-12-23T00:00:00",
      "story": "2 orange lights moving slowly/oddly fading out one at a time. 2 lights orange in color, changing distance from each other back and forth while rotating  around each other.   One light faded then 5 to 10 seconds later the second one faded at one point i could just make out a line/something connecting the lights ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/105/S105420.html",
      "state": "CA",
      "duration": "45 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c14b7",
      "summary": "Helicopter pursues/escorts ufo.",
      "city": "sanjose",
      "shape": "light",
      "date": "2013-12-23T00:00:00",
      "story": "Helicopter pursues/escorts ufo A helicopter was hovering over a 1 mile radius for approximately 25 minutes. After that time I suddenly noticed a white light hovering closely to the helicopter that was not present minutes before.  The helicopter immediately followed the solid light about five miles into the distance.  The white light was not visible after the helicopter traveled 3 or so miles alongside away from my ground position.  Then the helicopter returned and left. The white light was easily distinguishable from the helicopter and hovered closely.  This caught my eye being there were no running or hazard lights on the vehicle the helicopter was running aside and appeared to be persuing.  It largely appeared the helicopter was present for another reason and happened to come across this vehicle.  It appeared to either be a police or traffic monitoring helicopter and then changed its course once the light appeared.",
      "link": "http://www.nuforc.org/webreports/105/S105518.html",
      "state": "CA",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c1658",
      "summary": "Object, large in nature, with a bright white light tail entering the atmosphere in California.",
      "city": "sanjose",
      "shape": "other",
      "date": "2013-10-23T00:00:00",
      "story": "Object, large in nature, with a bright white light tail entering the atmosphere in California. While driving along north bound US Highway 85 in San Jose, CA around 7:00 am, I noticed a flash of bright white light streaking from right to left. The object looked like a cluster of objects, probably round in nature with the middle object being the largest and at least two smaller objects very close to it.  Of the two smaller object one was towards the top and the other was at the bottom of the larger one.  The flash it made in the morning sky, made it look like these were either very close together or one object that had an odd shape. I first noticed a very bright white light in the sky and when I looked up I saw a white steak, going right to left (so in the direction I was going, the object traveled from North/Northeast to South/Southwest).  The trail and object were the same color from what I could tell but you could see it was an odd shape or three separate objects (see above).  The object(s) was pretty big in size and the tail was fairly long. The location where I noticed it was around the border of the cities San Jose, Los Gatos, Campbell.  On US Highway 85 I was traveling on the north bound side of 85 but was actually going from Southeast to Northwest.  I first noticed the light either above or just to the left of highway 85.  I watched for as long as I could, glancing at traffic (making sure I don't get in a wreck).  I lost it before it could travel over the hills in Los Gatos/Saratoga.  Total time I saw it was probably around 5 seconds, maybe less. The object was high enough in the sky/atmosphere that if it were to land it would have done so in the Pacific Ocean.",
      "link": "http://www.nuforc.org/webreports/103/S103319.html",
      "state": "CA",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c17e3",
      "summary": "Lights Over San Diego.",
      "city": "sanjose",
      "shape": "diamond",
      "date": "2014-06-04T00:00:00",
      "story": "Lights Over San Diego Wednesday, May 14, 2014  Around 9pm.  I was called by my girlfriend to go to the balcony facing North, she said that there were some strange aircraft hovering in the sky east of downtown. I head out to the balcony to see what she was talking about and yes in fact there were 3 white lights in a triangle formation hovering in the sky, motionless,   The sky was very clear absolutely no clouds very calm wind and there was some air traffic but more than usual for the airport nearby you could clearly see what were clearly planes or a helicopter these lights were not a conventional aircraft.  Of the three the one in the center was the largest and had the most distinct shape, that of a diamond.   At first it appeared to be one large craft but after looking at it for about 3-4 minutes the lights began to separate and move away from each other slowly at first, then in a blink of an eye they seemed to have traveled a good distance from each other.  They stayed at a relatively far distance from each other at this time and stayed in position from what seemed to be an expanded triangular formation.  At this point the lights went from whitish blue to flashing red, green, and blue.   Sometime after watching the lights sit in place for a while I heard a jet fly by south of the house I looked and did in fact see a jet, what was odd Is that this aircraft was at around the same distance away but I could hear it where as I could not hear the 3 strange objects when they moved.  Two more lights appeared after a while but these stayed closely together one was hovering over the other and to the side at a small distance almost like it was supervising over the object below it.  Some pictures and video was taken but the quality is not good the lights I observed can be seen but the shape is a bit distorted.  All the lights eventually began rising slowly straight up into the atmosphere and eventually disappeared. On a side note I did observe the house pets (cat and dog) acting very erratic, running around and specifically the dog running up my leg,  2 more dogs from some neighbors also began barking.",
      "link": "http://www.nuforc.org/webreports/109/S109832.html",
      "state": "CA",
      "duration": "2.5 hours"
    },
    {
      "_id": "64d005f478aba2ec5a3c17bd",
      "summary": "White, semi translucent orb moving in erratic directions, hovering and then leaving at immense speed.",
      "city": "sanjose",
      "shape": "sphere",
      "date": "2014-06-04T00:00:00",
      "story": "White, semi translucent orb moving in erratic directions, hovering and then leaving at immense speed. On 5/13/14 at approximately 1600 hours I observed an object in San Jose, Ca, near highway 237.  The object was a sphere or orb, white and semi translucent. The object appeared no bigger than a soccer ball.  The shape was very clean, not distorted, a perfect orb or spherical shape. I first assumed the object to be a plastic bag or seagull but the object stopped in midair in what appeared to be 15 – 25 mph winds heading South by South East.  The object was at an altitude higher than a six story building but lower than the aircraft taking off at the nearby San Jose Airport.  Several commercial aircraft, 2 or 3 mostly 737s were visible during this time. The object moved in an erratic behavior dropping 50 – 60 ft and then climbing vertical another 50 – 60 ft.  The object moved right to left in a 50 yard area and then suddenly headed south and vertical in an upward motion at a speed much faster than the surrounding aircraft, birds, or insects that I observed.  Another way to characterize the speed, I have worked closely with F-18 Hornets and have never seen them capable of travelling at this speed. I doubted my observation several times thinking it could be a plastic bag, a bird, a drone, an insect, or even a piece of flying pollen.  None of the above items match the flight characteristics that this odd craft showed as it seemed intelligently controlled, capable of stopping and moving about in any direction, at any speed despite the winds. There were no visible clouds, no light shining on the windows of the building that I observed the object through.  I have never seen anything like it. There was no visible propulsion system, jet intake, propellers, or anything that would indicate the power source this craft used to move about.  If I had not been staring where I was at that exact moment I never would have seen it. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/109/S109608.html",
      "state": "CA",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c1b55",
      "summary": "Observed 2 spherical unknown airborne objects moving in sync.",
      "city": "sanjose",
      "shape": "sphere",
      "date": "2014-06-20T00:00:00",
      "story": "Observed 2 spherical unknown airborne objects moving in sync. June 14th, 2014, 7:10 PM PST  Odd sighting of unknown airborne objects.   My family with, my kids and their kids were out on our deck in East Hills, San Jose, CA (just below Mt. Hamilton).  My daughter was pointing out a large jet airliner traveling South from the North to our grandson, and she noticed way above the jet two objects traveling West from East that were moving very slowly together much that appeared to be much higher than the jetliner.   We all then looked from her pointing them out.  My first thought was balloons, but because they were moving so perfectly together (in sync) slowly and going against the wind and clouds.   The clouds were coming in from the North West going east.  Not sure if it was light reflecting off of them, but they appeared to have small arced wings, again most likely spheres?   We watched for about 15 minutes and then it just disappeared in some clouds.    My whole family saw them, and we can only say there were like nothing we've seen before in our area.    We do have a lot of jetliner activity over our area going from SF to LA (North to South). Spheres, commercial sub-orbitals, balloons, or small drones?  I do know that NORAD had two Russian jets that flew 50 miles outside CA coast, not long ago.    http://www.freerepublic.com/focus/f-news/3166571/posts",
      "link": "http://www.nuforc.org/webreports/110/S110243.html",
      "state": "CA",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c1c1e",
      "summary": "Four Red Light over Los Gatos, CA.",
      "city": "sanjose",
      "shape": "light",
      "date": "2014-07-05T00:00:00",
      "story": "Four Red Light over Los Gatos Ca. I saw two red lights fly. from left to right ... Then stop.  Hold position and then begin moving toward my direction.  Then back light blinked out and one minute later leading light blinked out.   Then two minutes later a single red light appeared from same direction and moved right to left.  Stopped and began moving my direction and blinked out.   Same with fourth light.   These were not chinese lanterns.  Not standard aircraft ... I didn't see green or white lights to go with red light of craft.",
      "link": "http://www.nuforc.org/webreports/110/S110995.html",
      "state": "CA",
      "duration": "5:00"
    },
    {
      "_id": "64d005f478aba2ec5a3c1e06",
      "summary": "2 bright flashes, blue/green in color.  About 5-10 seconds apart.  Filled a big part of the sky.",
      "city": "sanjose",
      "shape": "",
      "date": "2014-06-13T00:00:00",
      "story": "2 bright flashes, blue/green in color.  About 5-10 seconds apart.  Filled a big part of the sky. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/110/S110028.html",
      "state": "CA",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c1ed3",
      "summary": "Blue/purple light glowing brightly.",
      "city": "sanjose",
      "shape": "light",
      "date": "2014-06-04T00:00:00",
      "story": "Driving home from work, We saw a large bright blue/purple light glowing brightly in the sky, then it changed to white, yellow, green then back to the Blue/purple. It was truly beautiful.  My daughter was very frighted.   As we got home I noticed it was still hovering moving slowly northbound to Hwy 101.  I wanted to take a video but my daughter told me to get inside and lock the door.  This is not the first time we had seen this light nor will it be the last.",
      "link": "http://www.nuforc.org/webreports/109/S109831.html",
      "state": "CA",
      "duration": "20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c2044",
      "summary": "Ghost-like orange orb was seen in Alum Rock, California, on June 4, 2014.",
      "city": "sanjose",
      "shape": "changing",
      "date": "2014-06-06T00:00:00",
      "story": "ghost-like orange orb was seen in Alum Rock, California on June 4, 2014 Between the time of 10:30PM-11:05PM PST a strange ghost-like orb was sighted by me.  It was seen 310° NW in Alum Rock, California. I looked up above my neighbors house, and this ghostly orange orb was seen floating vertically at an 80° slant.  This orb can barely be seen with the naked eye, but was an obvious object that had a ghost like appearance.  It was not glowing, let's make that clear;  it was a light orange color that blended into the dark sky..   As it moved it was like an upside down flame, floating ever so slightly leaving a ghost-like trail behind it..  It would stop a couple of times and would revert back to its original form; a sphere.  Gazing upon it, for about 3-5 minutes, it disappeared blending into the night sky, I tried to keep motionless and staring at it, but soon it vanished without a trace.  It was an eerie heart-beating event, I've never seen anything so astonishing in my life. I also want to point out, there were many aircraft in the sky, less than a dozen had been spotted during the time of 10:30PM-11:05PM.  They could have been military, but as it was a moon lit night so I couldn't be certain.",
      "link": "http://www.nuforc.org/webreports/109/S109961.html",
      "state": "CA",
      "duration": "3-5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c2091",
      "summary": "4/18/14 two fire ball objects that changed to pink clouds.",
      "city": "sanjose",
      "shape": "fireball",
      "date": "2014-04-24T00:00:00",
      "story": "4/18/14 two fire ball objects that changed to pink clouds. LAST NIGHT, 4/18/14, AT ABOUT 9:00 PM, TWO RED LIGHTS IN THE SKY THAT MOVED VERY SLOW LIKE HELICOPTERS.  THESE OBECTS CHANGED SHAPES FROM A BRIGHT RED BALLS TO A PINK GLOWING CLOUDS. AND THEN ONE OF THESE OBJECTS SHOT STRAIGHT UP THEN HOVERED AND THE OTHER OBJECT STAYED LOW AND MOVED SOUTH TILL IT WAS OUT OF SIGHT.  THE OBJECT THAT WAS HOVERING CAME DOWN AND TOOK THE SAME PATH OF THE OJECT THAT FEW SOUTH.",
      "link": "http://www.nuforc.org/webreports/108/S108749.html",
      "state": "CA",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c2132",
      "summary": "Diamond shaped object with white lights rotating in the middle as well as red,yellow,blue,orange lights flashing all over the object.",
      "city": "sanjose",
      "shape": "diamond",
      "date": "2014-04-11T00:00:00",
      "story": "Diamond shaped object with white lights rotating in the middle as well as red, yellow, blue, orange lights flashing all over the object. In the mid-evening to late evening hours of July 5th, 2001, I witnessed an unconventional flying object defy the laws of gravity while parked on a private road located in San Jose, CA.  I was accompanied by a young adult female and as we conversed I observed a bright light, (flying in the sky) resembling a star moving from left to right.  I had witnessed this type of movement from these bright lights within the same vicinity before, and I started to turn my high beam lights on the object as I had done previously.   As the object moved to the left I would briefly turn the high beams on in my vehicle once, and when it would move to the right I would I would briefly turn the high beams on and off twice (or vice versa).  During this flight pattern, my companion was not happy about me showing attention to anything besides her, and was discouraging me from shining the lights towards the object.  This went on for a few moments when the bright lit object began to fly up and down as well as left to right.  When the object flew up (moved up or ascended) I would briefly turn my high beams on and off 3 times, when it flew down (moved down or descended) I would briefly turn my high beams on and off 4 times (or vice versa).  Also during this time, I observed a red light in the distance flying to left of my vehicle. I did not pay it too much attention as it could have been a plane.  Either before or after the lit object began to fly up and fly down my companion observed it as well and said “Okay, now that thing is moving”. I decided that we should get out of the vehicle to witness this bizarre flight pattern. As we stood at the front end of the vehicle, the lit object began to fly towards us at a high rate of speed. At this point the objects light must have reached us, (just like a mirror would reflect sunlight on a person’s face in the daytime) because without saying a word to each other, we simultaneously took a few stuttering steps towards the veh! icle doors in a hurried manner. We looked at each other briefl! y and I mentioned to her “Let’s get the F—k out of here”! We entered into the vehicle and I drove us out of there in an extreme hurry at high rate of speed. On our way out I had calmed down realizing that whatever we witnessed was not in pursuit of our vehicle. Being a young adult male, I decided that it was safe for us to pull over and continue what we set out to do when we parked in this area. At that time, my companion reclined her seat so that she could not look out the front passenger window. I was leaning over the middle console conversing with her when I observed another object (possibly the same object I shined my light at) appear just over the hillside approximately 50 yards away. If I had to estimate I would say it was  100 yards above ground. At this moment, numerous yellow, red, white and green lights appeared on the object and were flashing on and off with a row of white lights spinning around the middle of the object. I could hear rapid clicking sounds as well. At this! point the object ascended  approximately 50 yards higher (its highest point was approximately 150 yard above ground) than its original position and then descended approximately 100 yards down to a position of approximately 50 yards above ground. It flew up and down twice before going back to its original position at a 100 yards. It did this in approximately 1 second and proceeded to fly to the right at a slow pace. I could not believe my eyes. I felt as though this was something I should not be witnessing, the equivalence of taking a man before the wheel was invented, and placing him in the middle of a highway with nothing but 18-wheel rigs driving by him with lights all over each rig!  We would experience the same feelings with the same expression on our face! I find it ironic that I was not terrified at what I was witnessing, just shocked and amazed. The object repeated the flight pattern three times, but with the last it ascended once and descended once. Just before the! 3rd pattern my companion said to me “Oh god, not this again”.! I repli ed for her to ”Look”, (I was in such shock I could not speak at first), she answered “Oh god”. I got frustrated and impatient and yelled “F----ing Look”! Just as she began sitting to an upright position and looking to her right, the object flew out of view behind a hillside. I witnessed an object in flight that I will forever question and she missed it! I didn’t even have a witness although I was with another person. Sometimes I wonder why didn’t she hear the initial clicking from the lights, or maybe a reflection of the object anywhere. Now, whenever I am outside at night I will look to the sky’s for anything unusual. I often think about that object, what was it, who flew it, where did it come from, who owns it because something has to, where was it manufactured, does it have a monetary value like a car, and where is it now? Is it in a hangar somewhere, a garage or is it destroyed on some desolate planet?  Or maybe, it’s occupants are awaiting the rapture so that they can re! veal their role in Human history with lie’s spewing from their mouth. Whatever the case, there is definitely a higher intelligence far beyond our own and our government must have some kind of information that could shed some light on this controversial topic. It is even possible government officials were piloting the object and had a great laugh at my expense. This account is real and there is definitely something of another intelligence other than ourselves in this universe. I have never heard of any other accounts similar to mine and the only thing close to it is from a John Lennon song of a UFO he witnessed while in a NY hotel room. If needed I could provide pictures of the vicinity where the second encounter took place. Also I would be willing to make a composite drawing of the object if needed. I am very interested in knowning of any other accounts such as mine and hope I am not disregarded.",
      "link": "http://www.nuforc.org/webreports/108/S108451.html",
      "state": "CA",
      "duration": "20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c219e",
      "summary": "Black huge wobbling object disk shape going across sky in clouds",
      "city": "sanjose",
      "shape": "disk",
      "date": "2014-05-08T00:00:00",
      "story": "Black huge wobbling object disk shape going across sky in clouds. looked like huge black balloon disk shape  wobbling in sky very high up traveling across sky with clouds was strange looking my mom came out seen it as well just kept going into clouds n gone.  im reporting hoping some others seen it as well many had to of seen it ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/109/S109241.html",
      "state": "CA",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c2340",
      "summary": "Circular object flying at night it was red and disappeared out of nowhere in a few minutes.",
      "city": "sanjose",
      "shape": "fireball",
      "date": "2014-04-11T00:00:00",
      "story": "circular object flying at night it was red and disappeared out of nowhere in a few minutes. At around 21:00 i looked outside my window and noticed a red circular object flying coming closer to my house.  I didn't think it was a plane because there were a number of regular planes flying nearby and they didn't look like this.  It was not blinking any lights it was plain red and it seemed to be flying closer to me.  I took a picture but it didn't turn out good.  After about a minute or two of it flying it just disappeared it was an open space so it didn't go behind a tree it was just flying and then it was gone.  I wouldn't report it otherwise but i thought it was really weird that it just vanished out of nowhere.  It did seem to look similar to a fireball. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/108/S108498.html",
      "state": "CA",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c24ea",
      "summary": "Formation of red blinking light coming from stars in the sky....",
      "city": "sanjose",
      "shape": "formation",
      "date": "2014-11-06T00:00:00",
      "story": "Formation of red blinking light coming from stars in the sky.... My sister and I took our dogs out one last time for the night and while we were sitting there, I told her to look up at that bright stars...At that time (one am in the am) there were 3 far apart from each other almost triangle appearance.  Then I noticed two of them were blinking red lights.  I would say near and way high above the east hills in San Jose, CA.  About 2 mins of watching these lights, I went and got the binoculars and I watched one of them and it was jumping around, moving high and coming back down.  Then all of a sudden we hear coming up from behind us (right about where San Jose Airport is) a helicopter.  He went over our heads and straight for the middle of the two bright lights. To our disbelief, he took his place in between these two bright red blinking lights and now there are 4 perfectly spaced bright stars blinking red.  Right now as I'm writing this, a helicopter just flew over the house back towards San Jose Airport.  All I can say is they must be doing some kind of training or exercise .... I saw on this site others from San Jose saying some of what I'm saying, so I think it might just be routine ... Thanks",
      "link": "http://www.nuforc.org/webreports/114/S114495.html",
      "state": "CA",
      "duration": "20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c2646",
      "summary": "Orange in color, teetered like a ballon, demateralized or increased altitude till unobservable, backround night sky from northwest.",
      "city": "sanjose",
      "shape": "circle",
      "date": "2014-12-05T00:00:00",
      "story": "Orange in color, teetered like a balloon, demateralized or increased altitude till unobservable, backround night sky from Northwest.",
      "link": "http://www.nuforc.org/webreports/115/S115777.html",
      "state": "CA",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c26ac",
      "summary": "6 Red Oval UFO flying over my house.",
      "city": "sanjose",
      "shape": "oval",
      "date": "2014-11-06T00:00:00",
      "story": "6 Red Oval UFO flying over my house Around 7:05 PM I noticed 2 red oval lights moving from N.West to S. East almost directly over my house.  Height about 3,000  feet.  Moving fast at steady pace... saw a total of 6 and I was able to get my neighbor to see too.  Video and pictures but didn't show Red color.  total of 3 videos  They were solid bright red.  to fast for laterns. No sound. https://www.youtube.com/watch?v=9e7VhWR1--U",
      "link": "http://www.nuforc.org/webreports/114/S114747.html",
      "state": "CA",
      "duration": "8 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c295e",
      "summary": "East San Jose - Large metallic object with lights hovering and moving slow across East foothills",
      "city": "sanjose",
      "shape": "teardrop",
      "date": "2014-10-10T00:00:00",
      "story": "East San Jose - Large metallic object with lights hovering and moving slow across East foothills The large object appeared from behind trees in the distance (approx. over Eastside San Jose) and hovered for about a minute.  It was moving  South to North along the East foothills.  It moved extremely slow and would stop and hover from 30 seconds to a couple minutes each time. Looking through binoculars -  It was a teardrop on its side – round at front and pointed in back.  It was illuminated in front half – I could see metallic reflection. The back end had red, blue/green, and white lights.  There were other aircraft in the area that were clearly smaller as if they could fit inside this huge object.  When they looked like they might be going towards it the large object would brighten and flash 3 large red lights in triangle formation.  It travelled into my site and travelled out behind trees, poles and houses.  It had to have come from Gilroy area (South) going North towards Oakland/San Francisco.",
      "link": "http://www.nuforc.org/webreports/114/S114276.html",
      "state": "CA",
      "duration": "20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c2cb1",
      "summary": "Multiple variations of blinking and or fluttering objects that hover up higher or fly lower inbetween trees and buildings at night.",
      "city": "sanjose",
      "shape": "formation",
      "date": "2014-10-03T00:00:00",
      "story": "Multiple variations of blinking and or fluttering objects that hover up higher or fly lower in between trees and buildings at night. I have been seeing these for weeks now and I know they are not stars, planes or satellites. They hover around in the night skies and some are higher up an some come as close to the ground as flying in between taller trees.  Most of them kind of flash a color that looks likes red, white, and blue at the same time (instantaneously) some of them are a lot more active, almost as if they are patrolling areas.  I can't describe the shape because they seem to shift and some of them blink just red.  As weird as it sounds, I feel like they can tell when you stare at them and when you pay attention to one or two for a long enough time and then turn around there is almost always another new one that pops up in sight that you can tell was observing you when you were paying attention to the other one(s).  There are also more circularish ones and square ones too with multiple lights.  These are the ones that cruise closer to the ground in an almost sneaky manor.  The ones highe! r up almost look like a fleet. As hard as it may be for some to believe, these things are really out there and if they were something easily explainable like planes or satellites believe me I would not keep ending up trying to follow them around and observing them with such interest.  I don't know about you but I grew up on one twinkle little star that stayed put and not tens and tens of them that move around and react to my actions.  My stars never hid hovering behind big trees and buildings in different colors, fly to different  locations, and react to some of my movements(chasing or walking away).  These objects seen to be very small by the way too.  Can anyone else relate to anything I just said in this giant paragraph?? ((NUFORC Note:  We spoke via telephone with the witness, and we were not convinced that he was looking at anything but stars.  However, we cannot be certain.  PD))",
      "link": "http://www.nuforc.org/webreports/114/S114104.html",
      "state": "CA",
      "duration": "Present"
    },
    {
      "_id": "64d005f478aba2ec5a3c2df5",
      "summary": "Ufo sighting in San Jose, calif around 7:47 pm",
      "city": "sanjose",
      "shape": "sphere",
      "date": "2014-09-10T00:00:00",
      "story": "Ufo sighting in San Jose, calif around 7:47 pm I saw a tube shaped  ufo with a bright orange light coming off of it.  I got it on camera too!",
      "link": "http://www.nuforc.org/webreports/113/S113338.html",
      "state": "CA",
      "duration": "4 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c2e38",
      "summary": "Orange fireball.",
      "city": "sanjose",
      "shape": "fireball",
      "date": "2014-09-18T00:00:00",
      "story": "Orange fireball. At about 6am, before the sun started to come up, I noticed a very bright orange light, like a fireball, traveling a different path from what airplanes usually take over my home.  It traveled in a crooked line which made me think it may have been a military aircraft but suddenly the light just hovered in one spot, then retreated so quickly the light almost immediately faded.   It actually began fading as I grabbed my phone to record it.   While at its brightest, it looked like a beautiful star with spikes.",
      "link": "http://www.nuforc.org/webreports/113/S113627.html",
      "state": "CA",
      "duration": "45 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c2e4d",
      "summary": "Clip I filmed near sun an object its not lens flare camera moving all over place and it never moves-planet? ufo? drone?",
      "city": "sanjose",
      "shape": "sphere",
      "date": "2014-08-15T00:00:00",
      "story": "Clip i filmed near sun an object its not lens flare camera moving all over place and it never moves-planet? ufo? drone? i never seen this while filming btw---debunkers wanted on this clip i filmed near sun an object its not lens flare camera moving all over place and it never moves  https://www.youtube.com/watch?v=qqf7hQWIMRA   Here's link on topic aready started  http://www.abovetopsecret.com/forum/thread1025477/pg#pid18240824   im not giving contact info mufon if you want contact me you can through either link. ((NUFORC Note:  We attempted briefly to locate the witness through the links above, but were unsuccessful in doing so.  PD)) ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/112/S112306.html",
      "state": "CA",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c2f76",
      "summary": "My brother his wife and I were in the garage smoking when the house bagan to Shakes. i looked north, up and out the side door to the ga",
      "city": "sanjose",
      "shape": "light",
      "date": "2014-08-08T00:00:00",
      "story": "my brother his wife and i were in the garage smoking when the house bagan to Shakes.  i looked north, up and out the side door to the garage and above my neighbors house was a white ball of light (about the size of the moon being persued by two military helicopters (i assume based on their size).  they were traveling very slow until the white ball sped up a little at which the hélicoptères did the sage in the persuit.   it seemed the ball of light and the helicopters were about 30\" in the air because the were almost touching the trees and how much it made the house shake and how loud the helicopters were. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/112/S112154.html",
      "state": "CA",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c321f",
      "summary": "Multiple glowing objects in the sky photographed within two minutes.",
      "city": "sanjose",
      "shape": "disk",
      "date": "2015-04-03T00:00:00",
      "story": "Multiple glowing objects in the sky photographed within two minutes. I was at the Diridon transit station in San Jose, California, waiting for my train on my way to work.  Diridon station is a busy station, in an urban setting with lots of city noise and bustle.  I decided to take some pictures of cheery tree blossoms.  The time was 12:13 p.m.  I took two photographs of the blossoms and then noticed a security mirror on a pole that was reflecting the trees and the rail tracks and I thought it would make a nice picture so I positioned myself to photograph that as well.  I snapped one photo, glanced at it and decided to take another.  The second one is slightly closer to the mirror and more centered.  The two photos were taken at 12:14 and 12:15, respectively.  Both photos show three lamp posts on the right. I sat down on a bench in the shade to review the photos.  In the one taken at 12:15 I noticed a white shape above the lamp post in the foreground.  Wondering what it was, I zoomed in and was amazed to find I had captured an object in the sky that was the shape of a flat half-circle and appeared to have a light emission or vapor trail surrounding it.  I'm convinced I managed to photograph a UFO. I did not actually see the craft in real time, as I was focusing on photographing the mirror.  I did not hear anything that led me to look at it, either.  There are airplane flying in the area as this transit station is not far from the airport; however, the flight path is in the opposite direction of the photographed object. This morning I was reviewing the photos and zooming on each of them and have seen in both photos of the cherry blossoms that there are glowing objects, lines and discs in the sky.  In total there are 5-7 between the three photos. I am a 42-year-old female, mother of two and I work at the public library as a circulation clerk.  I have also sent a photo via email.",
      "link": "http://www.nuforc.org/webreports/118/S118044.html",
      "state": "CA",
      "duration": "unknown"
    },
    {
      "_id": "64d005f478aba2ec5a3c3360",
      "summary": "((HOAX??))  Massive spaceship spotted above San Jose....",
      "city": "sanjose",
      "shape": "other",
      "date": "2015-03-26T00:00:00",
      "story": "Massive spaceship spotted above sn jose.... While traveling north on 680 highway by story and alumn rock, something rather bigger than a plane and weird shape appearing behind and within a cloud caught my eye enough for me to look back at it again but by seconds came right into clear observation out of the cloud for about 3 to 4 seconds incredible amazing clarity appeared by the perspective of the distance and heights  this spacecraft must have been about at least of a small size town block ship resembling district 9 movie spaceship model but with an round structure   On top and two dark columns  resembling two big buildings  protruding from the center down but underneath the massive and tall circling round structure was cluttered with other cluttered substructures.  With an amazing short view clearance even saw the sun hitting the upper side which appeared to have supper heavy darkish iron like color massive structure with fringes for reenforcement.  The sight Fractional short before cloaking as if it ! started make a cloud  then absorbing the cloud  into it self black spot complete cloaked. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/118/S118002.html",
      "state": "CA",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c34c5",
      "summary": "Bright orange dot of light hovering and moving  slowly in the sky.",
      "city": "sanjose",
      "shape": "triangle",
      "date": "2015-03-06T00:00:00",
      "story": "Bright orange dot of light hovering and moving  slowly in the sky. On February 26th, 2015, at 12:30 AM, my friend accompanies me on a dog walk, as I get out of late.  I noticed a bright orange light, too orange to be a planet, in the sky.  Because it was moving slowly we agreed it was not a planet or meteorite.   I asked him, is that an airplane?  He answered no, if it was an airplane it appears it would be falling. It began to get slightly brighter and continued moving slowly.  Too slow to be an airplane, or helicopter, completely silent and nothing like we've both ever seen before.   My friend noted a triangular shape.   This  lasted a total of maybe three minutes.  Then, it began to get dimmer in brightness.  Then within a 5-10 second time span, it began to appear to blink, getting smaller and then completely disappeared.   We both do not take drugs, I am college educated and hold a Bachelor's degree, and have up until this point been very skeptical.  My friend is healthy, intelligent and well-read and reasonable and both of us do not have mental illness(s).",
      "link": "http://www.nuforc.org/webreports/117/S117496.html",
      "state": "CA",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c358b",
      "summary": "((HOAX??))  MASSIVE UFO SIZE OF TWO SKYSCRAPERS APPEARS!!",
      "city": "sanjose",
      "shape": "changing",
      "date": "2015-03-13T00:00:00",
      "story": "MASSIVE UFO  SIZE OF TWO SKYSCRAPERS APPEARS!! I was on the freeway when I saw a Huge Spaceship hovering above.  It looked like it was trying to hide in the clouds, which were extremely out of the ordinary dark, but not rain clouds.  The ship popped into view suddenly and disappeared along with the dark cloud. I swear it was there!  I didn't get a chance to catch it on my phone, but my girlfriend and I both saw it.  It was the size of two skyscrapers surrounded by a massive disk like structure, with a crown like top structure.  It Resembled district 9 movie spaceship!!  The craft disappeared in a flash... getting smaller like as if a vortex had sucked it back in.  The White clouds around the object that disappeared the clouds were streaking to one point    After I pulled over I saw several small dark clouds hovering low in the atmosphere, these clouds were like nothing I've ever seen ... these clouds were traveling at an unusual rate across the cities and they started to vanish very quickly into thin air.  Within a matter of seconds they disappeared. Latter I traveled to Liver-more where i was surprised to find several of the same dark clouds scattered around town... that were dissipating just like the ones I saw in San Jose. ((NUFORC Note:  We suspect that the report is a hoax.  The witness has provided invalid contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/117/S117780.html",
      "state": "CA",
      "duration": "60 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c35a4",
      "summary": "We saw red flaming objects in the night sky over San Jose and they appeared to be traveling West to East.",
      "city": "sanjose",
      "shape": "fireball",
      "date": "2015-02-12T00:00:00",
      "story": "We saw red flaming objects in the night sky over San Jose and they appeared to be traveling West to East. On Sunday night, my husband called me outside to see something in the sky.  When I got out there I saw 2 red objects heading into the Eastern sky.  As we were talking and facing South, several more appeared to the West and went up and over our house to the East and disappeared.   I ran inside to get my camera and the binoculars.  It was hard to tell if they were in any organized pattern.  Two of them went East and it seemed one almost caught up with the other, they moved around a bit, and then disappeared.   It was also hard to tell the shape even looking through the binoculars.   One of my pictures shows a perfectly round orb and yet they also seemed to be on fire.  As one would disappear, we'd look right (West) and others would show up.   My husband saw several more than I did.   What was odd is that they seemed close and far at the same time.",
      "link": "http://www.nuforc.org/webreports/117/S117210.html",
      "state": "CA",
      "duration": "30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c36da",
      "summary": "10 Red-Fiery Lights with Red flame-like-flares coming from the sides flew over San Jose, California 95111",
      "city": "sanjose",
      "shape": "sphere",
      "date": "2015-02-06T00:00:00",
      "story": "10 Red-Fiery Lights with Red flame-like-flares coming from the sides flew over San Jose, California 95111 The moon was bright and it was a cloudless night.  I was in my hot tub just looking at the stars and there appeared a round red fiery light with red flame-like flares coming from the sides of the UFO.  It was traveling in a straight line from the West going East.  It was the most spectacular thing I have ever seen in the sky.  As I watched it travel across the sky, I was wishing I had my camera. To my great surprise, right before the UFO disappeared, another UFO came into view following the same path as the first one.  It was exactly the same, flying the same speed and everything.  I yelled louder and louder for my wife to come outside.  She came outside half dressed to see what I was yelling about.  She saw the UFO and was greatly amazed also. She went back into the house and got her camera and started taking shots of the UFO’s.  I went into the house also and got my camera so I could try and get some shots.  I was able to shoot about 50 shots but only some came out.  I do have some interesting shots even if they are not great.  My wife took about 10 shots and some of hers came out good also. It was very amazing because the UFO’s kept on coming out of the West.  As soon as one got about three-quarter of the way across the sky another one would show up.  There were a total of 9 or 10 UFO’s that flew over my house.  At one point it appeared that one of the UFO’s stopped and the other one that was following started catching up.  One of the craft appeared to be higher in the sky as they got closer to each other.  The closes they got together was about the distance of two moons apart, then they move on and disappeared.  At one time I could see three UFO’s all in a row traveling the same path then one would wink out and the the next one would disappear and so on.  It seems some of the craft had different spacing that others.  They were not all the same distance apart as they traveled across the sky. This happened between 8:30 PM and 9:00 PM on Sunday February 1, 2015, above San Jose, California 95111 USA.  In general the UFO’s were a round shape.  The craft was round and the red fiery like flames were toward the front on both sides and also toward the rear on both sides.   The UFO’s came out of the West (Pacific Ocean), they were traveling almost due East (East Coast)  The first 5 or 6 UFO’s all had a “halo” of red-flame-like-flares coming from the front sides of and the rear sides of the round body of the craft.  All craft followed the same course West to East and also about the same path (a straight line across the sky)  There were no commercial planes in the sky that I could see during this time  The moon was very bright it seemed I almost needed sunglasses  The red glow of the craft got brighter as they came from the West and when they were three-quarters of the way across the sky they were the brightest. When they passed the three-quarters mark they started losing their glow and soon winked out and were gone. It seem they all disappeared in about the same part of the sky My photos were taken with a Nikon D800 with AF-S Nikkor 23-120 mm 1:4 G ED lens about 50 photos  My wife’s photos were taken with a Nikon Coolpix P510 Nikkor 42X Wide Optical Zoom ED V 4.3 - 180mm 1:3-5.9 lens   The craft had different distances between them  As I looked to the South the crafts were traveling West to East below Orion’s Belt and below the moon’s position in the sky I will submit Photos as soon as I figure out how (on February 4th, 2015)",
      "link": "http://www.nuforc.org/webreports/117/S117149.html",
      "state": "CA",
      "duration": "30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c376e",
      "summary": "Bright blur light dropped about 400' straight down.  Then shot off into distance out of sight.  It was a large blue light & bright.",
      "city": "sanjose",
      "shape": "teardrop",
      "date": "2015-02-06T00:00:00",
      "story": "Bright blur light dropped about 400 ft straight down.   Then shot off into distance out of sight.  It was a large blue light and pretty bright. ((NUFORC Note:  We have corrected the date above.  PD))",
      "link": "http://www.nuforc.org/webreports/117/S117142.html",
      "state": "CA",
      "duration": "15 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c38a5",
      "summary": "Red bright light fading away appearing again  in great distances before slowly fading away. As it moves away in the hills",
      "city": "sanjose",
      "shape": "circle",
      "date": "2015-01-07T00:00:00",
      "story": "Red bright light fading away appearing again  in great distances before slowly fading away.  As it moves away in the hills Red bright object  following straight pattern.... Stops in middle of trajectory ..  Than it fades out, re-appears ahead in the sky by a huge distance before fading out completely ((NUFORC Note:  Witness provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/116/S116380.html",
      "state": "CA",
      "duration": "0:00:17 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c3f05",
      "summary": "It silently flew towards us from the west.",
      "city": "sanjose",
      "shape": "light",
      "date": "2015-06-19T00:00:00",
      "story": "It silently flew towards us from the west. We were sitting outside in our backyard, with the lights off, when we saw a very bright golden-like light coming towards us from W, going towards to E.  It made no sound at all.   It was glowing when all of a sudden it quietly and QUICKLY took off towards space.  It was amazing.   I felt uneasy about going out into the open to observe it, so I watched it from a place that kind of hid my body.  There were no green or red lights, and the only thing I know of that can move that fast is a rocket.   This craft made absolutely no noise at all.  Nothing.  Absolutely amazing! ((NUFORC Note:  Not the ISS, which was visible from San Jose at 21:37 hrs..  PD))",
      "link": "http://www.nuforc.org/webreports/119/S119589.html",
      "state": "CA",
      "duration": "4.5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c4365",
      "summary": "We noticed a bright light in the sky. ((NUFORC Note:  US Navy missile launch.  PD))",
      "city": "sanjose",
      "shape": "other",
      "date": "2015-11-19T00:00:00",
      "story": "My family and I were leaving to eat dinner when we noticed a bright light in the sky.  It seemed to be traveling from the east towards the west heading down towards land then the light faded out after a awhile and seemed to take a turn heading back up out to space leaving a blue/green trail of smoke/vapor.  The trail of blue/green smoke seemed to stop for a bit and started up again out in the far distance where the flying object was heading up and out far into the space.  We also seen planes and helicopters flying by at that moment so we know it was NOT a plane or helicopter.  This was like no object I have ever seen in my entire life. ((NUFORC Note:  US Navy missile launch.  PD))",
      "link": "http://www.nuforc.org/webreports/123/S123660.html",
      "state": "CA",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c439a",
      "summary": "White ball of light emits white cone of light with a green stripe inside of it. ((NUFORC Note:  U. S. Navy missile launch.  PD))",
      "city": "sanjose",
      "shape": "light",
      "date": "2015-11-19T00:00:00",
      "story": "White ball of light emits white cone of light with a green stripe inside of it that glowed. We stepped outside to look at the Christmas Lights we just strung up. In the sky to the south west we saw this amazingly white light shining down towards the earth from a ball of white light in the sky. It was traveling at jet aircraft speeds towards the north. The white light shining down went out from the point of light at an angle towards the ground and it expanded out in a very distinct come shape that had very clear edges to it. In the center of the cone of white light was a green stripe of light that glowed like radium and nearly the same color. The point of light emitted no sound and was traveling upwards from the earth. The cone of light itself began to come apart like a fog. The point of light was going higher and higher and made a turn to the west northwest. You could see the point of light for a very long time after..probably 5 minutes or more. The cone dissipated but the green light in the center faded much slower. ((NUFORC Note:  U. S. Navy missile launch.  PD)) ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/123/S123757.html",
      "state": "CA",
      "duration": "11 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c4393",
      "summary": "High altitude light with plume changes direction and is viewed for 10 minutes.  ((NUFORC Note:  U. S. Navy missile launch.  PD))",
      "city": "sanjose",
      "shape": "light",
      "date": "2015-11-19T00:00:00",
      "story": "high altitude light with plume changes direction and is viewed for 10 minutes I am a licensed private pilot and amateur astronomer. At 18:01 I and 2 other witnesses viewed an object from outside our garage in San Jose. We were all looking toward the southeast watching the object together for several minutes. My son originally spotted the object. My wife got a couple of good photos. The object appeared to e emit a cone-shaped plume of white illuminated material. There also appeared to be a lingering green beam of light behind the object. The green beam appeared to be about as wide as the full moon and very straight and consistent in its pale green color. The green beam persisted for several minutes and appeared to stretch toward the horizon behind the object. The white plume appeared to be illuminated and appeared to grow as the object proceeded toward the west/northwest in a straight line. After watching the objects and plume for more about a minute the plume suddenly cut off and the object continued to move ahead in a straight line. The plume expanded behind the object and appeared to be approximately 5+ degrees in width. One other witness and I continued to watch the object move toward the western horizon. After approximately 4 minutes the object appeared to brighten and become stationary. As we continued to watch, the object appeared to change directions, turning about 90 degrees to the left heading toward the southwest. iPhone photos will be submitted via email. ((NUFORC Note:  U. S. Navy missile launch.  PD))",
      "link": "http://www.nuforc.org/webreports/123/S123665.html",
      "state": "CA",
      "duration": "10+ minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c438d",
      "summary": "low flying craft emitting a triangle shape of lighted blue haze.  ((NUFORC Note:  U. S. Navy missile launch.  PD))",
      "city": "sanjose",
      "shape": "",
      "date": "2015-11-19T00:00:00",
      "story": "low flying craft emitting a triangle shape of lighted blue haze with a long tail of haze behind. I was entering the hills of Evergreen and a craft traveling low was emitting a blueish cloud of light leaving a triangular shape behind with a long tail of blueish lighted smoke like stuff.  I took a picture but did not get a picture of the craft just the long lighted area of blueish haze.  The haze didn't dissipate quickly it hung in the sky and was filled with light.  VERY STRANGE.  When I got home I went out back and a trace of the blue haze was still there. ((NUFORC Note:  U. S. Navy missile launch.  PD))",
      "link": "http://www.nuforc.org/webreports/123/S123553.html",
      "state": "CA",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c477b",
      "summary": "Slow-moving light with smoky trail lasting about 15-20 minutes.  ((NUFORC Note:  US Navy missile launch.  PD))",
      "city": "sanjose",
      "shape": "light",
      "date": "2015-11-12T00:00:00",
      "story": "Slow-moving light with smoky trail lasting about 15-20 minutes At approximately 1800, looking south about 25-30º above the horizon, I observed what looked like a plane coming through the clouds or fog, heading in a north-westerly direction.  As planes do use that corridor fairly regularly, I paused to watch as it was very bright.  There were no flashing lights or sounds of an aircraft.  It appeared that there were two white lights in close proximity to each other, such as would be found on an airliner.  The object moved somewhat slowly and I guessed it was about 4-6 miles away.  After about 20 seconds, what looked like a spotlight from the object aimed at an approx. 200º down and to my left.  I then thought that it must be SJPD’s helicopter.  The “spotlight” continued for about 30 seconds and I wonder why it remained in the clouds/fog instead of dropping to get a clearer view of the subject.  It was not a helicopter as far as I could tell.  I then looked around the sky and realized there were no other clouds or any fog.! The “spotlight” was in fact a trail of smoke/vapor, etc., and it was about 20º long and continued into a much larger marshmallow-shaped cloud.  I could still see the light as it continued on and seemed to curve slightly upward to the west and away from me before disappearing.  The event lasted about 2 minutes.  The “spotlight” part of the cloud remained for about 15 minutes, glowing bluish-white.  The moving light itself faded after about 7 minutes.  The cloud formation stretched about 60º across the sky. ((NUFORC Note:  US Navy missile launch.  PD))",
      "link": "http://www.nuforc.org/webreports/123/S123625.html",
      "state": "CA",
      "duration": "20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c49bc",
      "summary": "Globe-shaped object brilliantly lite, switching colors, hovering high in the sky over Mt. View/Sunnyvale.  ((NUFORC Note:  Venus.  PD))",
      "city": "sanjose",
      "shape": "changing",
      "date": "2015-09-25T00:00:00",
      "story": "Globe-shaped object brilliantly lite, switching colors, hovering high in the sky over Mt. View/Sunnyvale, CA. I noticed an object moving unlike an airplane or helicopter so i went to get my binoculars and set them on top of my handrail so they would be stationary and i saw a globe shaped object whose lights resembled lasers switching bluish hues and orange and seemed to be transparent where there was no color and it was brilliantly lite up I can't understand how nobody else couldn't see this object. ((NUFORC Note:  Venus or stars? PD))",
      "link": "http://www.nuforc.org/webreports/122/S122141.html",
      "state": "CA",
      "duration": "Still up there hovering"
    },
    {
      "_id": "64d005f478aba2ec5a3c4c4d",
      "summary": "As I walked to meet my sister i noticed a huge light, brighter then any star.  ((NUFORC Note:  Venus in the eastern sky.  PD))",
      "city": "sanjose",
      "shape": "light",
      "date": "2015-09-25T00:00:00",
      "story": "I walked out to get my niece so i can babysitter.  As i walked to meet my sister, i noticed a huge light, brighter then any star out there.  I figured it was a plane because they frequently pass ecxept this light wasnt moving at all . It just stood there in the air and would lean as if it was coming forward and sideways. I managed to get two pics and zooming in there are bout three objects of bright light and it makes an L shape of some kind. I know that wasnt a plane.  I have a telescope and i have never seen a star or light, that bright in the sky. No noise so it was not a helicopter.  Made me get the chills honestly and i dont freak out easily.  Well hope someone else saw somethin.  Wish i could post the pics.  It was crazy to say the least.",
      "link": "http://www.nuforc.org/webreports/122/S122231.html",
      "state": "CA",
      "duration": "Unknown"
    },
    {
      "_id": "64d005f478aba2ec5a3c4d53",
      "summary": "Chevron and small sphere craft going south over 95128 area. Amazing to see.",
      "city": "sanjose",
      "shape": "chevron",
      "date": "2015-09-11T00:00:00",
      "story": "Chevron and small sphere craft going south over 95128 area. Amazing to see. We looked up and saw a chevron shaped craft headed South towards the Santa Cruz Mt. range.  It moved quite quickly.  It had seven oval shaped dim lights on it that we could both see clearly.  It was dark in color and after about 5 seconds it slowly dimmed its lights and vanished. Then, about 5 seconds later, there was an extremely BRIGHT, small  round craft that flashed and then shot off towards the same direction as the first draft and vanished. It was amazing.  Amazing. ((ADDENDUM FROM SOURCE)) Peter, Our sighting actually occurred at 21:30 on 9/9/15. That's 9:30pm PST. Thanks for checking.  Best, ((name deleted)) ((END ADDENDUM))",
      "link": "http://www.nuforc.org/webreports/121/S121859.html",
      "state": "CA",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c5444",
      "summary": "This event was actually two related sightings on the same night at locations that were within 10 minutes of each other.",
      "city": "sanjose",
      "shape": "unknown",
      "date": "2015-12-21T00:00:00",
      "story": "This event was actually two related sightings on the same night at locations that were within 10 minutes of each other. The first sighting occurred at approximately 10:35 pm on Monday, 12/14/2015.  I was driving my car, turning right onto Cropley Ave. from Conifer Ln. in San Jose, CA.  As I looked left to make sure there was no oncoming traffic, I noticed quite a bright \"star\" streaking toward the easterly direction.  It lasted less than two seconds, tracing across perhaps a fifth of the sky. My first reaction was that I had seen a meteor.  But the object wasdefinitely a small round disc (like a golf ball seen at about 30 feet away).  The luminosity was similar to that of an LED light and, although moving rather fast, it did not exhibit a \"tail\" as the natural light from a meteor would do.  As I made the turn and continued to drive, I really didn't think anything more about it. My drive proceeded southwesterly along Cropley to Morrill Ave., turning right on Morrill to get to Landess Ave., where I then turned left.  Landess heads roughly westward and turns into Montague Expressway after the Highway 680 overcrossing.  I proceded southwestward down Montague, crossing over Highway 880, until I stopped at a red light at either Zanker Rd. or N. 1st St. (I'm not sure which one.)  The time was approximately 10:45 pm and it was here that I saw the golf-ball object again while looking up to the left through the windshield at about a 40 to 45 degree angle.  Instead of streaking as it did before, it made a sort of randomly \"hilly\" curve in the sky that lasted about as long as the first sighting. I was rather surprised, however, to see that (in the background sky of the golf-ball object) there were (I believe) eight lights of much lesser intensity than the golf-ball.  Each light was (as best I can describe it) shaped kind of like a flattened diamond. The most noticeable feature of these lights, to me, was that they were divided into two rows of four lights each, one row below the other by perhaps 5 to 10 degrees, from my vantage point.  Each row's lights were evenly spaced, and the bottom row's lights were aligned directly below the top row's.  The lights alternately dimmed and intensified, in unison, with a period of perhaps two to three seconds. As I stared at the configuration, I thought it might be due to an optical artifact of the area's street lights reflecting on my windshield.  But I rolled down my window and stuck my head outside to look; they were still there. It also occurred to me that there could be Christmas lights on the top edge of a nearby building.  I wouldn't be able to see the building because it was night and the brighter street lights would interfere with any ambient backlighting behind the dark building.  However, at the angle and direction I was looking (~ 45 degrees up, southward), no buildings are that tall when one takes into account the distance between my stopped car at the intersection, and any building to the south. Finally, the lights could not lie on a possible power line because both rows were arranged absolutely ruler straight, whereas there would likely be a slight bow in the arrangement if attached to a power line (due to line sag). The whole sighting at the stopped light on Montague probably lasted about 15 to 20 seconds.  Just before my traffic light turned green, there were (I believe) three other cars at the intersection: one next to me on the right, one in the opposite direction that was beginning a turn northward onto the cross street, and one waiting on my left on the cross street, at his red light.  I looked to see if I could detect any awareness of the unidentified lights by the person on my right, but it was difficult to see the driver inside the car.  It seemed as if no one else noticed. The sighting was over when each row of lights split in half, two lights accelerating to the right, two accelerating to the left.  The intensity of the lights quickly dimmed to zero as their speed increased, and they never deviated from their ruler straight horizontal paths. BACKGROUND OF WITNESS: ---------- -- -------  A.B., Physics, U.C. Berkeley; M.S., Mathematics, San Jose State University.  Former scientific software engineer.  Lived in area since mid 1970's.",
      "link": "http://www.nuforc.org/webreports/124/S124731.html",
      "state": "CA",
      "duration": "20 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c59d6",
      "summary": "UFO flies over city before flashing, witnessed on a mountain.",
      "city": "sanjose",
      "shape": "diamond",
      "date": "2016-05-20T00:00:00",
      "story": "UFO flies over city before flashing, witnessed on a mountain. I was sitting on top of Mt. Umunhum with two of my friends.  We were smoking a cigarette when I noticed that slightly over a mountain to my left there was a red orbish looking craft moving similarly to a bumblebee, jolting back as it moved left.  After about 30 seconds of this the craft paused, then started slightly ascending and moving to the right.  It was still redish orange at this point.  About this time the people I was with saw how oddly it was moving.  It started ascending higher and higher before moving to where it was centered from out perspective to the city.   At this point it had gone from more red to slightly more orange and had quick flashes of blue. As it moved over the city the flight patterned changed from a jolty flowing pattern to soaring through the sky above the city until it just stopped.  Once it stopped it alternated between red, orange, blue, and white before flashing what I could describe as an almost yellow light.  The shape seemed to have! changed as well going from a distinct orb to a diamond.  The light being emitted was the shape of a diamond with a gap through the center of the diamond.  It did this for about 30 second or so before going back to a red orb and flying west away.  Being terrified me and my 2 friends were trying to figure out what we just saw for about 10 minutes.  Then around 1 AM, the craft hovers over the mountain northwest from us and starts flying distinctly in our direction, very confidently.  As it got closer I looked away for a second before I hear \"it disappeared\".  At this point we said 'we have to leave now', and as we drive down the mountain I see it once more just floating in the sky.  It was white with an orange tint around the edge of emitted light.  I've never been more terrified or more interested in something in my life.",
      "link": "http://www.nuforc.org/webreports/127/S127291.html",
      "state": "CA",
      "duration": "~45 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c5c4d",
      "summary": "Here has been a bright light object above my apartment for three hours now.",
      "city": "sanjose",
      "shape": "light",
      "date": "2016-04-01T00:00:00",
      "story": "there has been a bright light object above my apartment for three hours now. At around 2:30 am 04/01/2016, I looked up in the sky because I thought I heard a plane. When I spotted this thing I knew it was not a plane I am the manager at the apartments I live at and have access to all the lighting so I went around and shut off all the lights on the grounds to see this thing better when I looked up it had barely moved.  Then I flipped it off and began flashing my led flashlight at it thinking it was a drone that the county uses.   At around 3 am a tenant came and asked what is going on I told him and he grabbed a pair of binoculars remembering that I had a pair too I did the same  He said he had seen this before, and it was a satellite.  When looking at it through the lenses it moved up and down and side to side quickly it was hard to keep it in the lenses when looking at it with the naked eye it just seems to hover in one place when I told this guy that he laughed and said yea they are a trip and he left.   Well, I just looked out my front door and it is still there at 4:36 am pst it is not saucer shape it is more oblong when looking at it through the lenses it changes it is a ball of fire then just a light that seems to have two parts at times.  Anyway, I'm off to see if I can get more people to see it so there is better proof if you need it.  I called the news room at ktvu and have not heard anything so maybe its nothing.  Oh, I got four other people to look they said it was unusual too.  thank you",
      "link": "http://www.nuforc.org/webreports/126/S126642.html",
      "state": "CA",
      "duration": "2:30 am to now"
    },
    {
      "_id": "64d005f478aba2ec5a3c5d9d",
      "summary": "FIREBALL COMES OUT THE SKY, WHILE THE CLOUDS TAKE SHAPE IN FORM..",
      "city": "sanjose",
      "shape": "fireball",
      "date": "2016-12-05T00:00:00",
      "story": "FIREBALL COMES OUT THE SKY, WHILE THE CLOUDS TAKE SHAPE IN FORM.. i just finish smoking on the pizzo, went outside with the fellas, in all of sudden the clouds started a forming weriod shapes, in out of no were a fireball or metor came out the sky with a flashing light, a few minutes after we seen the clouds form paramid type shapes, second time in seeing usual ufo acctivity in my city NOR-CALI TO BE EXACT.. ((NUFORC Note:  Witness elects to remain totally anonymous; provides little contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/131/S131308.html",
      "state": "CA",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3c5f52",
      "summary": "Bright greenish orb with reddish tail fell at 45 degree angle over West San Jose.",
      "city": "sanjose",
      "shape": "teardrop",
      "date": "2016-10-11T00:00:00",
      "story": "Bright greenish orb with reddish tail fell at 45 degree angle over West San Jose. We were driving South on 880 (Nimitz Freeway) and we saw a large bright greenish circle with a tail--sort of tear-drop shaped-- with a bright reddish back edge falling at a 45 degree angle from left to right towards the ground in West San Jose.  We were South of the San Jose Airport's usual landing pattern and this object appeared to fall/descend too quickly to be a safe conventional aircraft landing. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/130/S130381.html",
      "state": "CA",
      "duration": "15 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c5f98",
      "summary": "3 objects moving across the sky, until 1 leaves the group.",
      "city": "sanjose",
      "shape": "formation",
      "date": "2016-11-11T00:00:00",
      "story": "3 objects moving across the sky, until 1 leaves the group. Shortly after getting home, I saw something odd in the South-West (~230 deg) sky while taking the trash out.  I’m a star gazer.  So I can tell the difference between stars, planets, satellites and so forth.  I saw what looked to be one of the closer planets, but the light was not right.  It kind of looked like multiple lights clustered closely together.  That is what caught my eye initially. While looking at that, I noticed 2 fainter lights (about as bright as a far away star) appeared to be moving relative to the bright light.  Meaning the spacing between the 3 was varying.  The 3 lights were slowly moving from the South-West sky to the North-West.  All the while the 2 fainter lights kept changing their proximity to the bright light. At this point I went inside to grab my binoculars to get a better look. It was obvious their altitude was very high.  I actually thought this might be the International Space Station, but the other 2 lights made that not likely, and they were moving to slow.  While viewing the 3 lights thru the binoculars, one of the 2 fainter lights, started moving straight down at a much faster rate than they were moving across.  I lost sight of it as it moved below the roof line of my house. The other 2 continued on their original path and I lost them in the clouds a minute later.  Speaking of clouds, there was a scattering of clouds.  The 2 remaining lights were at about 310 deg NW, when I lost them.",
      "link": "http://www.nuforc.org/webreports/131/S131162.html",
      "state": "CA",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c6111",
      "summary": "Greenish, circular light fly across sky and slightly turn.  Pretty close and all of a sudden, just vanished.",
      "city": "sanjose",
      "shape": "circle",
      "date": "2016-10-27T00:00:00",
      "story": "Greenish, circular light fly across sky and slightly turn.  Pretty close and all of a sudden just vanished. ((NUFORC Note:  We have amended the time above, believing that the sighting probably occurred at nighttime.  PD))",
      "link": "http://www.nuforc.org/webreports/130/S130853.html",
      "state": "CA",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c60e5",
      "summary": "Lights in the sky look like stars but move around and fade in and out and turn off and on",
      "city": "sanjose",
      "shape": "light",
      "date": "2016-10-21T00:00:00",
      "story": "Lights in the sky look like stars but move around and fade in and out and turn off and on Have been seeing strange lights every night now for the last 2 weeks. I was trying to convince myself that I was crazy or my eyes were playing games on me but no , tonight I got my confirmation that I am not crazy and that what I have been seeing is not stars . Tonight I saw what looks just like a bright star sitting in the sky then all the sudden fades out and is gone so I thought well maybe I'm seeing things and there was no star there . Then all the sudden its as if a volume knob got turned all the way up then back down again . So basicly the thing goes from pitch black to bright as heck and then fades out again . But then a few moments later it comes back on in the same exact spot . All the while other lights are fading on and off much dimmer around the object , I'm thinking they were more far away but these lights were actually moving then would stop move some more stop fade in fade out . And then in another part of the sky I see a what looks like a br! ight star but is turning green red and bright white and staying in one spot and there are just some things where in the pit of your stomach you know what the truth is and whatever this is I don't believe its part of this world .",
      "link": "http://www.nuforc.org/webreports/130/S130710.html",
      "state": "CA",
      "duration": "1 minute +"
    },
    {
      "_id": "64d005f478aba2ec5a3c6195",
      "summary": "I was on my balcony around 22:15 this evening when looked up at the sky and saw this rectangular shaped object with bright red lights a",
      "city": "sanjose",
      "shape": "rectangle",
      "date": "2016-09-30T00:00:00",
      "story": "I was on my balcony around 22:15 this evening when looked up at the sky and saw this rectangular shaped object with bright red lights and flashing green lights.  It did not look like an aeroplane or a helicopter.  It stood still in the sky for about less than a minute.  It was amazing because it moved so swiftly for something so big (even from such great distance I could see it was big).  And it rotated around for a bit and seemed to glide effortlessly with only the red lights still shining brightly.",
      "link": "http://www.nuforc.org/webreports/130/S130222.html",
      "state": "CA",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c62ef",
      "summary": "Glowing Amber Floating barrel size object.",
      "city": "sanjose",
      "shape": "cylinder",
      "date": "2016-08-16T00:00:00",
      "story": "Glowing Amber Floating barrel size object. I saw an object about the size of a 55 gallon drum, glowing amber, without bright lights, floating over the top of the houses in my neighborhood, while I was walking my dog.   I observed that it flowed over the top of the houses, then floating between two street lights, then up past some trees at the end of the street and then it faded from vision as it moved out into space.   I drew pictures of it when I got home.  It was glowing amber; it was not bright light and seem to be glowing from the inside.  It was the shape of a cylinder or a 55 gallon drum.  The barrel type of object floated quietly.   I asked someone who I saw on the street about 5 minutes later if they had seen it and they said no.   I'd really like to know what it was.",
      "link": "http://www.nuforc.org/webreports/129/S129227.html",
      "state": "CA",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c65fd",
      "summary": "Long observation of a spectacular orange fireball with massively long trail. ((NUFORC Note:  Space debris.  PD))",
      "city": "sanjose",
      "shape": "",
      "date": "2016-08-02T00:00:00",
      "story": "Long observation of a spectacular orange fireball with massively long trail, medium speed, split apart. Bright orange fireball with very, very long orange/yellow fire trail.  Low altitude, descending slowly from South to North direction.  Too fast for a small plane.  Too slow for a meteorite. Not big enough for an airliner.  Split into 2 pieces before it disappeared in the trees/horizon, and then heard a soft distance.  Boom ...  Boom (1 sec apart). ((NUFORC Note:  Space debris.  PD))",
      "link": "http://www.nuforc.org/webreports/128/S128818.html",
      "state": "CA",
      "duration": "40 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c6604",
      "summary": "My friend and I saw a fireball moving across the sky.  ((anonymous report))  ((NUFORC Note:  Space debris?  PD))",
      "city": "sanjose",
      "shape": "fireball",
      "date": "2016-08-02T00:00:00",
      "story": "My friend and I saw a fireball moving across the sky. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD)) ((NUFORC Note:  Chinese rocket re-entry.  PD))",
      "link": "http://www.nuforc.org/webreports/128/S128777.html",
      "state": "CA",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c6c85",
      "summary": "Midnight struck on new years and I walked outside to celebrate with my son and girlfriend. We see 3 orange/red globes hovering in an of",
      "city": "sanjose",
      "shape": "triangle",
      "date": "2017-01-06T00:00:00",
      "story": "Midnight struck on new years and I walked outside to celebrate with my son and girlfriend. We see 3 orange/red globes hovering in an off shape triangle. They all slowly faded away without moving. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/131/S131965.html",
      "state": "CA",
      "duration": "20 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c728a",
      "summary": "Separated twin lights with \"cigar\" shape.  Both ships moved N to NW.  One stopped above flight path of SJC Airport.((anonymous report))",
      "city": "sanjose",
      "shape": "other",
      "date": "2017-06-02T00:00:00",
      "story": "Separated twin lights with Cigar shape. Both ships moved  N TO NW One ship stopped above flight path of SJC Airport... The other traveling back and forth N to NW...  Have not been drinking ! Very clear night !  One more thing I noticed.  The ship going back and forth The lights wiuld dissapear, and come back..  Cloaking?  I swear as to what I am seeing",
      "link": "http://www.nuforc.org/webreports/134/S134276.html",
      "state": "CA",
      "duration": "Currently still going"
    },
    {
      "_id": "64d005f478aba2ec5a3c72e4",
      "summary": "Red lighted object hovering for extended time, made fast moves then changed into a slightly transparent large saucer and flew upwards a",
      "city": "sanjose",
      "shape": "disk",
      "date": "2017-06-02T00:00:00",
      "story": "Red lighted object hovering for extended time, made fast moves then changed into a slightly transparent large saucer and flew upwards a On may 18, 2017, at about 8:55 PM, i saw an object in the sky over the east foothills.  It was red and shaped like an upside down \"U\".  The red was very bright and it looked as if there were red dots (or lights) under each of the sides a bit less luminous.  The object moved from a stationary position (hovering) to a straight down and out of my sight then returned to the same hovering position location.  I first saw it at after several seconds.   The object then made a fast move directly west (to my left) and the hovered..dropped down out of sight, then back up and a fast move back to the east to the original place I first saw it.   I attempted to call my son at that time to get him to acknowledge I was not crazy but he did not answer.  So I went back outside and it was still in the same place.  I continued to watch it hover for at least 5 more minutes then it disappeared and I saw a huge circular object (that was at least 10 times the size of the original red object) glide up and out of the sky...the thing was dark but more like a shadow or almost invisible or like you could see through it and observe it at the same time.  I am still in shock!",
      "link": "http://www.nuforc.org/webreports/134/S134273.html",
      "state": "CA",
      "duration": "20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c7683",
      "summary": "I was looking towards South San Jose mountain line where many flight paths travel into S.J.C. airport.  I saw a red ball travel vertica",
      "city": "sanjose",
      "shape": "light",
      "date": "2018-01-12T00:00:00",
      "story": "I was looking towards South San Jose mountain line where many flight paths travel into S.J.C. airport.  I saw a red ball travel vertical,  stop and rich back towards the ground and change color to blue. Then at a high rate of speed travel up and down in a wave pattern. No human made craft can perform the maneuver I witnessed.",
      "link": "http://www.nuforc.org/webreports/138/S138099.html",
      "state": "CA",
      "duration": "7 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c767d",
      "summary": "White triangular plume against a blue sky ascending.",
      "city": "sanjose",
      "shape": "unknown",
      "date": "2018-01-12T00:00:00",
      "story": "White triangular plume against a blue sky ascending. While driving for a ride share company, two passengers and I witnessed what may have been a rock launch.  I was in San Jose on Capitol Expressway at the intersection of Marten/Ocala facing South.  My two passengers and I saw a white plume shaped as a triangular trajectory as if an upward bound craft was making its ascent.  I turned East onto Marten Avenue and could no longer see the unidentified object.",
      "link": "http://www.nuforc.org/webreports/138/S138101.html",
      "state": "CA",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3c7762",
      "summary": "A small blinking object in the sky flying at unusually high speed.  After 10-15 seconds, it disappeared.",
      "city": "sanjose",
      "shape": "flash",
      "date": "2018-01-12T00:00:00",
      "story": "A small blinking object in the sky flying at unusually high speed.  After 10-15 seconds, it disappeared. I was sitting on the right back side of a car.  The sightseeing happened approximately at 7 - 7:05 PM, somewhere on Camden Ave and S Bascom Ave./Union Ave in San Jose, CA 95124.  A small blinking object was seen in the sky, flying at unusually high speed.  I first thought it was an aircraft, but again, but I never saw an airplane flying that fast.  I don't know how to describe the speed, but it flew faster in the sky than the driving car.   After 10-15 seconds, it disappeared.  I still cannot give a direct answer what that really was.  Maybe it really was a UFO, or just an aircraft flying at very high speed and then hiding through the clouds.",
      "link": "http://www.nuforc.org/webreports/138/S138232.html",
      "state": "CA",
      "duration": "15 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c78d8",
      "summary": "Oval Red/Orange  object flying in straight line.  Stopped at times and pulsating in random flashes",
      "city": "sanjose",
      "shape": "oval",
      "date": "2017-10-19T00:00:00",
      "story": "Oval Red /Orange object flying in straight line.  Stopped at times and pulsating in random flashes Kevin Batt kbatt1961@yahoo.com  Watch 3 newest videos  https://www.youtube.com/channel/UCxRBbb8ikj1bvZ-o5G0LpjA?view_as=subscriber",
      "link": "http://www.nuforc.org/webreports/136/S136572.html",
      "state": "CA",
      "duration": "8 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c80a7",
      "summary": "On march 26, 2018, @ approximately  0:01 PMT, a single object crosses sky in San Jose, CA, USA, then explodes.",
      "city": "sanjose",
      "shape": "sphere",
      "date": "2018-03-29T00:00:00",
      "story": "on march 26, 2018 @ approximately  0:01 PMT, a single object crosses sky in san jose, ca, usa,  then explodes. On March 26, 2018, about 1 minute after midnight a very loud explosion was heard & felt in the southern portion of san jose, ca  (Robertsville area ).  Video was taken by a Nest camera.  An object crosses the sky from left and then ~ 1 minute later explodes and appears to fall.  The explosion/report was heard and felt by many neightborhoods on the NextDoor App.",
      "link": "http://www.nuforc.org/webreports/139/S139284.html",
      "state": "CA",
      "duration": "95 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c8221",
      "summary": "Triangular shaped craft with three lights.  ((anonymous report))",
      "city": "sanjose",
      "shape": "triangle",
      "date": "2018-01-25T00:00:00",
      "story": "Driving to work on highway 85 Northbound, between Los Gatos and Saratoga, when I saw I bright light in front of and above my truck.  I assumed it was a police helicopter at first but  when I looked up, I could see a triangular shaped craft with three lights in each corner.  It was shooting a triangular beam of light down.  The strangest thing I have ever seen. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/138/S138565.html",
      "state": "CA",
      "duration": "4 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c83c1",
      "summary": "Fast moving black triangle with no lights and emitting no sound heading northward.",
      "city": "sanjose",
      "shape": "triangle",
      "date": "2018-10-18T00:00:00",
      "story": "Fast moving black triangle with no lights and emitting no sound heading northward. I was taking my dog out for the night and looked up as I usually do.  Some movement in the sky caught my eye and upon focusing I found I was watching an unlit object cruising through the sky northward. The object banked slightly and I was able to make out a triangular shape.  The object made no noise that I noticed and had no lighting on the bottom or sides. (or at all)  The light pollution in the sky provided decent contrast with which to view the object.  It moved quickly through the sky and was only visible for approximately 10 seconds.  The object was moving substantially faster than any other aircraft I've seen to date.  It appeared to be much higher in altitude than most other aircraft as well.  (my viewing position was nearby an airport)  Being close to the airport, I commonly see all manner of aircraft which is precisely why this one stood out enough to make this report.  The speed of the object could be likened to a satellite transiting overhead.",
      "link": "http://www.nuforc.org/webreports/143/S143498.html",
      "state": "CA",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c890f",
      "summary": "Extremely slow large flying object San Jose California",
      "city": "sanjose",
      "shape": "oval",
      "date": "2019-01-04T00:00:00",
      "story": "Extremely slow large flying object San Jose California Viewed from Calero Lake on McKean Road.  Very slow flying object.  Size very large, approx 2-3x an airplane — appeared pale in color but hard to distinguish details.  Very, very slow.  Wondered how it stayed in the air at that slow speed.  It was headed north toward San Jose.",
      "link": "http://www.nuforc.org/webreports/144/S144286.html",
      "state": "CA",
      "duration": "30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c8aa1",
      "summary": "Large triangle over San jose",
      "city": "sanjose",
      "shape": "triangle",
      "date": "2019-09-06T00:00:00",
      "story": "Large triangle over San jose Large triangle with 6 faint white lights under it traveling at a faster pace with no sound.. dead silence...  Headed East from the coast",
      "link": "http://www.nuforc.org/webreports/148/S148610.html",
      "state": "CA",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c8edc",
      "summary": "((HOAX??)) It had 2 main spotlights  the 2 spotlights would die down with the rest of the object then they would get bright.",
      "city": "sanjose",
      "shape": "",
      "date": "2018-12-14T00:00:00",
      "story": "It had 2 main spotlights  the 2 spotlights  would die down with the rest of the object then they would get bright it was moving close to me.  i Thought maybe it was a large drone but it was way to big to be one the lights were super bright white.  I gotta spooked and ran around 350am ((NUFORC Note:  Source of report indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/143/S143982.html",
      "state": "GA",
      "duration": "140 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c91a8",
      "summary": "Round objects flashing, hovering over playground at school",
      "city": "sanjose",
      "shape": "light",
      "date": "2019-12-01T00:00:00",
      "story": "Round objects flashing, hovering over playground at school At approximately 10:20 AM Christopher Elementary School.  The head custodian notice two objects in the sky flashing and hovering above the playground both objects hovered for approximately half an hour, both objects were caught on camera both objects move swiftly out of the atmosphere. Each at different times.  They were not Man-made toy drones.",
      "link": "http://www.nuforc.org/webreports/149/S149662.html",
      "state": "CA",
      "duration": "30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c919c",
      "summary": "10/07/19  22:15  San Jose, Calif.  Triangle  3 minutes  I saw 3 red small lights in a fixed triangular formation traveling very slow.",
      "city": "sanjose",
      "shape": "triangle",
      "date": "2019-12-01T00:00:00",
      "story": "10/07/19  22:15  San Jose, Calif.  Triangle  3 minutes  I saw 3 red small lights in a fixed triangular formation traveling very slow. I was visiting McDonald's restaurant last night on Blossom Hill Rd. and Kooser Ave. while sitting in my car in the parking lot with the window open I started hearing a noise that sounded like someone dragging a big bag of rocks across the sidewalk very slowly. as I exited my vehicle I looked up above my head into the night sky.  I saw 3 distinct small red lights in triangular formation that were blinking together but not always consistent.  This area above my head in the sky always has heavy commercial airline traffic.  The lights traveled in such a consistent orientation that it led me to believe that this was 1 craft, and not 3 separate crafts.  The speed of this craft was very slow.  I observed that this craft was also well under the elevation of the airport traffic itself.  I have seen planes land and take off at night and day and am familiar with the mass silhouette of area that the wings and fuselage cover. this craft by comparison was maybe 9 to 10 times the size of a full moon in the night sky. as it passed over my head I was trying to determine the shape of this craft.  I did not see any defining edges to this craft no matter where I looked for it.  It is as if the lights were visible but not the craft.  The best way to describe what I saw while looking for defining edges was that this craft appeared to me to be cloaked. showing 3 lights in triangular formation that were on a craft that was cloaked from my view.",
      "link": "http://www.nuforc.org/webreports/149/S149664.html",
      "state": "CA",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c9434",
      "summary": "Shinny multiple objects",
      "city": "sanjose",
      "shape": "formation",
      "date": "2019-12-01T00:00:00",
      "story": "Shinny multiple objects About 50 object flying in a scattered line almost moving like an inch worm across the sky. Then disappeared",
      "link": "http://www.nuforc.org/webreports/150/S150562.html",
      "state": "CA",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c9491",
      "summary": "string of lights very long and very high.",
      "city": "sanjose",
      "shape": "formation",
      "date": "2019-12-01T00:00:00",
      "story": "string of lights very long and very high. Saw very large and long array of lights in a string formation heading south from San Jose California that appeared to be in orbit or higher or higher.",
      "link": "http://www.nuforc.org/webreports/150/S150563.html",
      "state": "CA",
      "duration": "4 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c94bf",
      "summary": "6-7 star like lights traveling north to south in a straight line.  ((NUFORC Note:  Cluster of \"Starlink\" satellites.  PD))",
      "city": "sanjose",
      "shape": "",
      "date": "2019-12-01T00:00:00",
      "story": "6-7 star like lights traveling north to south in a straight line 6-7 star like lights in a single file row traveling north to south in straight line disappearing when reaching the horizon",
      "link": "http://www.nuforc.org/webreports/150/S150531.html",
      "state": "",
      "duration": "5 minutes"
    }
  ]
}