{
  "city": "santaana",
  "fetch_timestamp": "2025-07-12T14:33:24.100689",
  "record_count": 41,
  "pages_fetched": 2,
  "api_calls": 3,
  "source": "ufo_aficionado_api",
  "records": [
    {
      "_id": "64d005f478aba2ec5a3b60b7",
      "summary": "Birght light being followed by helicopter slowly.",
      "city": "santaana",
      "shape": "light",
      "date": "2008-03-04T00:00:00",
      "story": "Birght light being followed by helicopter slowly My wife and I were unloading groceries, we were both facing south south east. mostly clear sky some drifting clouds winds about 15 mph coming from the east. We heard a helicopter, we both looked up and witnessed a helicopter as well as a bright light at 11:00 to the helicopter coming somewhat slowly from our right. They were both headed northeast. The helicopter sounded military not civilian (We live in a city that has has regular flyovers from police and military helicopters and the sound of the two are quite distinct) The bright lit object was silent. No sounds other than the helicopter. The pair continued on making a slight turn to the east and flew thru some clouds. the bright lit object disappeared completley while the helicopter was still visible. we then lost sight of the pair due to trees and the growing distance. The objects seemed to be about 500-750 ft up. No jets were in the sky during this event which i found unusual due to John Wany airport being so close and the fact that jets are a regular sight in the skies above my home. My wife is not a believer in thing slike this but her first words when we saw the objects were \"what the blank is that?\"",
      "link": "http://www.nuforc.org/webreports/060/S60317.html",
      "state": "CA",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b6b87",
      "summary": "2 flying disks over Santa Ana.",
      "city": "santaana",
      "shape": "disk",
      "date": "2008-03-31T00:00:00",
      "story": "2 flying disks over Santa Ana. I know that you will most likely not believe a 13 year old boy, but I do not lie when talking about serious stuff like this.   I was in my room, watching T.V. when I look outside of the window, and 2 UFOs flew by.  It was far away, so I can't really describe the size, but I'm pretty sure it's smaller than an airplane, and a little bit smaller than a jet.   First, it was only one, then the second one caught up in no time.  The bottom part...or body, was gray, while the top part is black.  It flew pretty fast, considering the distance.",
      "link": "http://www.nuforc.org/webreports/062/S62190.html",
      "state": "CA",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b73a3",
      "summary": "lights over Santa Ana , CA, were about to collide when both lights disappeared in front of each other",
      "city": "santaana",
      "shape": "light",
      "date": "2007-06-12T00:00:00",
      "story": "lights over Santa Ana , CA, were about to collide when both lights disappeared in front of each other My wife and I were sitting in lawn chairs in our back yard.  I was looking up at the sky trying to catch a  shooting star when I noticed a faint light coming from the northwest making a turn going south. Then all of a sudden the light turned off and re-appeared moments later in the same position where it originally disappeared and started to move again. That's when another light appeared even brighter heading towards the faint object,We thought they were going to collide with each other, when both stopped and flickered off, and that was it. We spent another 2-3 hours trying to locate both objects but to no luck.",
      "link": "http://www.nuforc.org/webreports/056/S56761.html",
      "state": "CA",
      "duration": "15 min"
    },
    {
      "_id": "64d005f478aba2ec5a3b7706",
      "summary": "Rectangular light turning into a star, comming back, and disappearing.",
      "city": "santaana",
      "shape": "rectangle",
      "date": "2007-06-12T00:00:00",
      "story": "Rectangular light turning into a star, comming back, and disappearing. There was a object from my point of view that was in the middle of the big dippers ladle. A bright light caught my eye in the sky looked almost as if an airplanes headlights where rectangle it then started to go further and further until it looked like a star. I shook my head as if I was saying to myself \"I didn't just see that\" then suddenly if came back shot to the left and slowly faded away as if it was going further and further away from Earth became a star and eventually disappeared. I'm a 22 year old college student that works as a technician for a wireless corporation. I'm a believer in spiritualism and peace. I've always been open to UFO's and the idea that we are no alone but never dwelled on it. I've heard some stories of people who have seen things in the sky I have never seen a \"UFO\" prior to this. I can even hear my inner thought trying to deny what I saw. ((NUFORC Note:  Witness elects to remain totally anonymous;  provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/056/S56884.html",
      "state": "CA",
      "duration": "20 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b76cb",
      "summary": "Multiple White Flying Objects Appearing From Behind the Moon",
      "city": "santaana",
      "shape": "formation",
      "date": "2006-07-16T00:00:00",
      "story": "Multiple White Flying Objects Appearing From Behind the Moon I was outside looking at the moon with my binoculars when I saw an object appear from behind the moon.  My binoculars aren't that powerful but it looked like some type of flying object.  The object was heading Northeast.  All of a sudden more of these strange objects appeared from behing the moon and started a formation heading Northeast.  This continued for about 15 minutes and then they all dissapeared.  I believe they went higher into the sky so they were no longer visible.  Each of the objects looked the same.  They were about twice the size of a star and appeared to have lights.  At one point, my boyfriend which witnesses this as well, thought that they might be balloons.  But they were so high in the sky that I don't think that is possible.  Also because of the fact that they appeared to come from behind the moon.",
      "link": "http://www.nuforc.org/webreports/050/S50824.html",
      "state": "CA",
      "duration": "20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b84f6",
      "summary": "UFO Santa Ana ,CA 01/11/09",
      "city": "santaana",
      "shape": "oval",
      "date": "2009-08-05T00:00:00",
      "story": "UFO Santa Ana ,CA 01/11/09 On January 11,2009 I went to throw the trash when a bright object caught my attention,look like a big star in the sky but not until it moved very fast across the sky like a comet with a small glowing tail and then stopped. At this time I started yelling to my wife to come outside and then my folks woke up thinking something had happened ,when they came outside my reaction and there reaction was shock. It looked like one of the brightest star in the sky moving vary odd and very fast from one angle to another. When I called my older brother and told him I am seeing a UFO he told me I was on drugs but I just had to convince him to come see it for them self, meanwhile my folks were very nervous and exited at what they were witnessing.The object looked oval and very bright but when my brother arrived he was wordless he then immediately took his camera and we stared filming the objects they were moving so fast that it was hard for us to zoom in so we had to go on ! top of the roof were we can get a better view,we filmed it about 35min but whats weired was that when we filmed it there was two oval objects that you can clearly see in the video and they seemed to be following each other, after some attempts to call local news we saw and heard helicopters and or local helicopters. When the helicopters got close to the objects they seem to dive down and never came up again.But they showed up almost at the end of the video witch we later posted a 3min video of the UFO objects .To this day it was a unfortgatable occurrence.",
      "link": "http://www.nuforc.org/webreports/071/S71416.html",
      "state": "CA",
      "duration": "1hour"
    },
    {
      "_id": "64d005f478aba2ec5a3b8d25",
      "summary": "several objects seen over Central Orange County  (Santa Ana College Area)",
      "city": "santaana",
      "shape": "light",
      "date": "2009-03-19T00:00:00",
      "story": "several objects seen over Central Orange County  (Santa Ana College Area) I reported something similar on 01-05-2006. This afternoon I was at lunch and about 12:15 I happened to look up and saw it again, at very high altitude this bright white object hovering for several minutes right at the top of the sky (90 degrees)  it hovered in place for about 15 minutes then suddenly it released some smaller objects, (about fifteen in total) and as they started to drop, they formed a  V formation and began to move at high speed towards northern orange county.  The original object started to move in a north-east direction.  It took fifteen to 20 minutes to slowly move about 2-3 miles in that northeasterly direction. During this time at a much higher altitude there was another object that had a very reflective surface as it would shimmer with the sunlight (it was not white like the first one, but actually reflected the sunlight).  This object was way much higher than the first one ( it was barely visible to the naked eye), and it stayed in place throughout all the time that the other object did its maneuvers. eventually after 20 minutes or so, I lost track of those two bright objects.  I am going to take my digital camera tomorrow to see if I can catch them again and see If I can take some pictures of them.  I am a county employee and I am college educated. I have studied astronomy and I can tell a star from a planet from an airplane at high altitude.  these were not planes or a mickey mouse balloon, and not seagulls either. ((NUFORC Note:  Witness elects to remain totally anonymous; provides little contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/068/S68278.html",
      "state": "CA",
      "duration": "30 min."
    },
    {
      "_id": "64d005f478aba2ec5a3b9d56",
      "summary": "i was walking to my car to check my tire because i got a slow leak. anyhow, on the way back to the house i notice some flashing in one",
      "city": "santaana",
      "shape": "triangle",
      "date": "2010-04-13T00:00:00",
      "story": "i was walking to my car to check my tire because i got a slow leak. anyhow, on the way back to the house i notice some flashing in one of the clouds, i thought it was lightning, because there was a lot of clouds out this morning, overcast. then the cloud fully lit up for a couple of seconds. then it began to flash again. then it started to flash again but a different flash. it looked like someone was inside the cloud with a spot light looking around from the inside of the cloud. thats the best way to discribe it. i ran to get my chick but by the time she got up ther was nothing to see. i remained out side and it happened again, then a last flash of red.and that was it. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/074/S74864.html",
      "state": "CA",
      "duration": "10 min"
    },
    {
      "_id": "64d005f478aba2ec5a3b9e74",
      "summary": "Two white spheres flying over an orange county freeway",
      "city": "santaana",
      "shape": "sphere",
      "date": "2010-02-14T00:00:00",
      "story": "Two white spheres flying over anorange county freeway While at work as a receptionist in the lobby, I was admiring the blueness of the sky, when two very quickly  moving spheres caught my eye. I work one block away from the freeway; they would have been right over the freeway. They looked too spherical to be any other aircraft I know of. The UFOs were also moving with uncanny maneuverability and it was a weird mélange of white, and a clear metalic sheen. One was flying more erraticly with sharp quick turns as the ortherone was keeping pace but flying more smoothly. The crafts were too small to be helicopters and far too symetrical. Theydissapeared for about half second and reapeared for about 3 seconds and dissapeared compleatly. One last remark, the crafts were flying pretty low and wereclearly visible... If you happenned to be looking at the clear bluesky during those 5 seconds, I suppose.",
      "link": "http://www.nuforc.org/webreports/074/S74222.html",
      "state": "CA",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3ba370",
      "summary": "2 UFOs sighted flying together over Santa Ana, California and photographed.",
      "city": "santaana",
      "shape": "disk",
      "date": "2008-10-31T00:00:00",
      "story": "2 UFOs sighted flying together over Santa Ana, California and photographed. I was sitting in watching TV when my mother in law came in and told me she wanted to show me something outside. I reluctantly followed her outside and she proceeded to try and show me two things or objects flying way up in the sky one after the other. It was difficult to see them as she told me that they weren't any sort of known aircraft. I was finally after a couple of minutes able to see them and instructed her to continue watching them as to I was going to get my camera. I ran back into our apartment and got my Canon 5D camera and switched lenses to a 70 to 200mm zoom to attempt to get a shot of them. I used the automatic settings on the camera to insure I did get some quick results if possible. Once back outside I did see them for a second time and proceeded to take a few photographs of each object. The first photograph was taken at 17:47. Neighbors of ours saw me run outside of our apartment with my camera and decided to follow me to see what was going on. They too saw the objects. Our position here in Santa Ana California was on Main St between Mac Arthur and Dyer Road just south of Alton Drive. We were facing due north looking up at about 60 degrees. The two objects flew from east to west across the sky until they disappeared. They each passed behind a high overhead cloud and then came back into view before disappearing.",
      "link": "http://www.nuforc.org/webreports/066/S66286.html",
      "state": "CA",
      "duration": "15minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bacf9",
      "summary": "Green and Blue lights in the sky followed by total darkness",
      "city": "santaana",
      "shape": "light",
      "date": "2010-11-21T00:00:00",
      "story": "Green and Blue lights in the sky followed by total darkness Last night on 10/17/10 at about 4:30am in Santa Ana Ca, on Fairview i notice the entire sky turn green like if the world was ending but no noise came from the lights because i thought it was thunder but the colors were green and blue and shortly after this came total blackout for about a min when the lights came back on.  This was very scary",
      "link": "http://www.nuforc.org/webreports/078/S78440.html",
      "state": "CA",
      "duration": "2 min"
    },
    {
      "_id": "64d005f478aba2ec5a3bad37",
      "summary": "Rectangular slinky which had the appearance of being made of flat black ribbon dangling from clouds for 10 miles definitely not smoke,",
      "city": "santaana",
      "shape": "",
      "date": "2011-01-05T00:00:00",
      "story": "Rectangular slinky which had the appearance of being made of flat black ribbon dangling from clouds for 10 miles definitely not smoke, Santa Ana, California, a Friend and I were driving down a busy street westbound (roughly) or facing the ocean side of the state.  It was clouded with a solid cover behind some darker cummulus clouds medium altitude and different shades of gray.  Over the treetops to our left, out of the corner of my eyes I saw what I thought to be smoke from a rather intense fire.  Being curious, I slowed down, no traffic behind me, just to look over.  When I managed to fully stop to view what this stream was, it did not originate from the earth.  It was dangling from the clouds in the western skies from over the Pacific Ocean.  The only way to describe it is :  imagine a  slinky made of a flat black ribbon.  Pull it open, attach one end to the clouds and let the other end dangle for 10 miles downward and inland for 10 miles.    Then, as I was pointing the thing out to my friend, I noticed a shorter version hanging from the clouds over Los Angeles County.  We were in disbelief! because the last time I saw something big in the UFO arena, it was with the same friend in Lauderdale by the Sea, Florida a few years ago.   We do not drink, smoke nor do we take any medication.  It was a shame that we were on our way to her job and couldn't take more time to go home for cameras and so on.  They were rectangular coils of something which was solid black and didn't dissipate like smoke would. Absolutely not smoke. It was a perfectly delineated rectangular slinky made of wide flat black ribbon being pulled open and dangling from the clouds downwards towards the earth. Very wierd!",
      "link": "http://www.nuforc.org/webreports/079/S79297.html",
      "state": "CA",
      "duration": ">20 min"
    },
    {
      "_id": "64d005f478aba2ec5a3bb6f9",
      "summary": "((HOAX??))  Grey Alien Being",
      "city": "santaana",
      "shape": "unknown",
      "date": "2010-07-19T00:00:00",
      "story": "Grey Alien Being I was in bed..and I saw an Alien out the window..  I was afraid of telling anyone.  No aircraft just an actual being.  He was just running against the window...this was a rehabilitation facility.. after I was in the Santa Ana Jail. ((NUFORC Note:  Witness indicates that the date of the event is approximate.  PD)) ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  Possible hoax??  PD))",
      "link": "http://www.nuforc.org/webreports/076/S76595.html",
      "state": "CA",
      "duration": "1 hr"
    },
    {
      "_id": "64d005f478aba2ec5a3bbff4",
      "summary": "Blinkings lights with no structure or purpose, with little to no movement.",
      "city": "santaana",
      "shape": "triangle",
      "date": "2011-12-12T00:00:00",
      "story": "Blinkings lights with no structure or purpose, with little to no movement. I looked up at the moon in the Eastern sky and saw three blinking lights in a triangle formation.  They appeared to move slightly to the North and then the were just gone.",
      "link": "http://www.nuforc.org/webreports/085/S85161.html",
      "state": "CA",
      "duration": "2 min"
    },
    {
      "_id": "64d005f478aba2ec5a3bca95",
      "summary": "One object changing lights sorting from red to blue and finally to purple.",
      "city": "santaana",
      "shape": "flash",
      "date": "2011-08-21T00:00:00",
      "story": "One object changing lights sorting from red to blue and finally to purple. One object in the sky.  Changing lights from red to blue to purple then black.  Then it would start again. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/083/S83274.html",
      "state": "CA",
      "duration": "10"
    },
    {
      "_id": "64d005f478aba2ec5a3bd5ea",
      "summary": "Floating oval aircraft with red lights, moderate to fast smooth movement",
      "city": "santaana",
      "shape": "oval",
      "date": "2012-05-13T00:00:00",
      "story": "Floating oval aircraft with red lights, moderate to fast smooth movement It was an oval aircraft hovering over the area. With Red lights.  First it was just hovering, than it moved at a moderate speed somewherelse at that point I tried to follow it with my car, but could not catch up.  I took some photos.",
      "link": "http://www.nuforc.org/webreports/088/S88205.html",
      "state": "CA",
      "duration": "1 hour"
    },
    {
      "_id": "64d005f478aba2ec5a3bda70",
      "summary": "Triangle formation of lights over orange county CA.",
      "city": "santaana",
      "shape": "formation",
      "date": "2012-10-30T00:00:00",
      "story": "Triangle formation of lights over orange county CA On Sunday night, around 7:29 PM, my boyfriend and I entered onto the 22 east Garden Grove freeway to take a friend of ours home. At 8:06 PM, while still on that freeway, I noticed three bright lights steady in the sky up ahead of me. I pointed them out to my boyfriend, who suggested that they were planes putting on a show or perhaps may have had something to do with the space shuttle Endeavor finally reaching its destination. As I was beginning to mention that Los Angeles was in the opposite direction, the lights began, in unison, to move in a non aggressive manner and seemed to &quot;softly tumble&quot; lower in the sky. It was then that the three lights stood out as not being three individual objects (which explains my confusion behind the number of air craft I had seen), but that the three lights may actually have been part of a large triangular shaped aircraft, because as it was rolling &quot;out of the sky&quot;, in the same fashion as something would when tumbling or falling into water.  I could almost see the outline of the craft, an accurate way to describe the actual view of it would be as if a triangle made entirely of glass with an LED light on each corner of its shape were dropped into water.  And finally, the person watching this occur is viewing it all from outside of the water, and from a much lower level, with only the lights actually visible in the darkness. The lights then spread out to form a horizontal line and with smooth effort, picked up  speed and glided quickly away as different helicopters and airplanes came nearer to. These lights continued to show up over the next hour or so, and I did not give them much thought until after my boyfriend and I were home and nothing about the incident was mentioned on the news or anywhere online for that matter. I am filling out this report with the hopes that an explanation exists somewhere that won't be along the lines of being a natural phenomena. The three lights in formation of a triangle craft was significantly larger than average passenger or commercial airplanes, I realized, after a helicopter passed my window and made its way toward the lights. Although the lights did not &quot;allow&quot; for any thing in the sky to approach it, it was very obvious that if it were one craft, it was similar to comparing the size of a cat to the size of an elephant.",
      "link": "http://www.nuforc.org/webreports/093/S93578.html",
      "state": "CA",
      "duration": "+2 hours"
    },
    {
      "_id": "64d005f478aba2ec5a3bdf10",
      "summary": "Fire ball/object slow moving west to east.  ((NUFORC Note:  Sighting of the ISS??  PD))",
      "city": "santaana",
      "shape": "fireball",
      "date": "2012-10-30T00:00:00",
      "story": "Fire ball/object slow moving west to east Fire ball slowly moving across west to east like airplane.   Appeared to be about 1k feet when overhead but appeared to be higher as it moved east.",
      "link": "http://www.nuforc.org/webreports/093/S93787.html",
      "state": "CA",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3be5ca",
      "summary": "Yellowish/orange spheres they were more than 10",
      "city": "santaana",
      "shape": "light",
      "date": "2012-06-20T00:00:00",
      "story": "Yellowish/orange spheres they were more than 10 well i was outside my house when i looked up the sky and i saw more than 10 strange orange lights they looked like stars but closer they were formed as a constellation but all of the sudden they started to move up and down not to slow not to fast....  they disappeared one by one i tried to take pictures but it was too dark but in one of my pictures i captured the biggest one...",
      "link": "http://www.nuforc.org/webreports/089/S89648.html",
      "state": "CA",
      "duration": "3-4 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bea36",
      "summary": "Red and blue but at 8pm it was red  and like around 9 pm was blue.  ((NUFORC Note:  Possible sighting of Sirius??  PD))",
      "city": "santaana",
      "shape": "oval",
      "date": "2012-03-13T00:00:00",
      "story": "red and blue but at 8 pm it was red  and like around 9pm was blue i saw it at like on the freeway next to the in and out burgers first it was red and then at 9pm i saw it again but this time i saw it blue [i was scared] ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD)) ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD)) ((NUFORC Note:  Possible sighting of Sirius??  PD))",
      "link": "http://www.nuforc.org/webreports/087/S87608.html",
      "state": "CA",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3bf008",
      "summary": "3 extremely fast moving lights, in a delta formation, moving from N/W to S/E over southern California.",
      "city": "santaana",
      "shape": "light",
      "date": "2013-09-30T00:00:00",
      "story": "3 extremely fast moving lights, in a delta formation, moving from N/W to S/E over southern California. My wife and I were outside in our spa.  I am an active satellite and ISS observer and am always scanning the sky for activity.  On this night, three fast moving lights in a delta formation appeared suddenly from the North West and were traveling South East at a rate of speed I've never seen before.  They appeared to be satellite-like objects in brightness and appearance (somewhere above the mesosphere) but  were less bright than the space station.  Three things caught my attention that made me think they were extraordinary; #1- their formation #2- their speed, which was approximately 4-5 time faster than anything I’ve ever seen in space and #3- their trajectory was not straight.  As they streaked across the sky they made a slow turn to East and their formation slightly changed.  It remained a delta, but their proximity to each other loosened up slightly. When I first noticed them, I immediately brought my wife’s attention to it and we both observed the entire incident together, and afterward shared the same view of what we had just witnessed.",
      "link": "http://www.nuforc.org/webreports/102/S102300.html",
      "state": "CA",
      "duration": "8-10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bfc67",
      "summary": "Lights, dripping metal then gone in the flash of a shooting star.",
      "city": "santaana",
      "shape": "light",
      "date": "2013-08-30T00:00:00",
      "story": "Lights, dripping metal then gone in the flash of a shooting star. Me and the other witness were driving home from dinner when we realized there were 4 lights, it seemed like they were seperate objects and they were not moving like any type of jet, helicopter or any craft I had ever seen.  We decided to park the car and go look at these lights which were so intriguing. We got out and walked to the end of the street, there we saw the lights, they were normal, white lights, they were stacked vertically but not in a tight way, it was slanted and it didn't look aligned. They moved from what seemed so far away to closer in what seemed like no time at all. They just sort of, hovered over.  The light became a little bit bigger and we tried to figure out what it was.  Then the other witness cried out \"there's something between them\"  I didn't understand what she meant.  I looked and the light closest to the ground was now dripping, like a hot metal or something.  It didn't seem like a beam or anything but it was kind of illuminated.   At this point the witness was hysterical and went inside and was almost begging me to.  I eventually got the witness out again, where the light looked like they had faded a little, possibly getting farther away again. Then we just observed the lights, it didn't last long, the wits was texting and took her eyes off of the lights, I saw a shooting star that was so close, we mever ever see ones this close it was amazing.  It took all of my attention away from the light for a quick second.  And that's all they needed.  I instantly looked back and they were gone.  Completely gone.  I was freaking out.  I stayed out there to make sure they didn't just fade away and come back.  They didn't.  I had never believed in UFOs or anything but I am in tears anytime I explain this story to anyone. It was so surreal and scary.",
      "link": "http://www.nuforc.org/webreports/101/S101546.html",
      "state": "CA",
      "duration": "20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c0606",
      "summary": "Red light viewed in Orange County.",
      "city": "santaana",
      "shape": "light",
      "date": "2013-02-28T00:00:00",
      "story": "Red light viewed in Orange County. Was walking outside of my grandparent's house (I live next door to my grandparents) and I heard a siren.  I quickly looked around to see if anything was happening nearby.  I looked up at the sky and saw a bright, red light which seemed to be traveling upward.   At first I thought it was some sort of flare, but the light quickly became brighter and traveled in my direction.  I quickly went to get my grandmother to show her the UFO.  She briskly walked outside and looked at where I pointed, and she stood there staring with intense curiosity at the object.   At this point, the object seemed to be almost directly above us, but it seemed to be going higher and higher.   Then, wanting even more witnesses, I ran to my house to get my mother.  I excitedly told her there was a UFO outside, and she followed me back outside. The object was now farther away, more towards the south.   My mother ran inside to get a pair of binoculars, but by the time she returned, the object had almost completely faded away.  This all happened throughout the course of approximately three minutes. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/096/S96457.html",
      "state": "CA",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c0b15",
      "summary": "Orange glowing egg in the sky over Orange County.",
      "city": "santaana",
      "shape": "egg",
      "date": "2014-02-27T00:00:00",
      "story": "Orange glowing egg in the sky over Orange County. February 15th, 2014. At approximately 0130, my son called me to come out and look to the north sky from the front of our home. In the distance was a small oval or egg shaped orange light.  As I watched it move slowly across the sky, it seemed to be move closer and then away from us.   This object was at a distance of 4 miles give or take and appeared to be over the city of Garden Grove or Anaheim, Ca., both these cities are directly North of my position as indicated here:  (https://www.google.com/maps/@33.XXX,-117.XXX)   My son managed to view the object through binoculars while I ran in to retrieve my telescope. Through the telescope I noticed that it was defiantly orange and egg shaped. Not to mention still moving very slowly. Far slower than an airplane and just hovering like a helicopter at one point. The orange glow was constant, but as I looked through the telescope I noticed that the object had what appeared to be windows. I was not able to see inside of the windows, but they were defiantly windows. After a few min of observing its movement it disappeared right out of the night sky. Leaving only the night sky and nothing more. The whole time it never made any audible sound at tall. Duration 4 – 6 min",
      "link": "http://www.nuforc.org/webreports/107/S107483.html",
      "state": "CA",
      "duration": "4-6 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c0e84",
      "summary": "Yellow light in the flight path of a 747 that quickly vanished as the plane got it it's sight  over garden grove ca.",
      "city": "santaana",
      "shape": "light",
      "date": "2014-01-24T00:00:00",
      "story": "Yellow light in the flight path of a 747 that quickly vanished as the plane got it it's sight  over garden grove ca. My dogs were barking non stop for 5min and went in the back yard to see what was bothering them, that's when I noticed a yellowish light seem to vanish when a 747 jet turned in its direction to make its approach to John Wayne airport, but it vanished in a strange way....   It seen to vanish from the left to the right as if it was being covered by something,  I was looking west as it vanished, it was stationary and was so hi it probably was just a few feet below the 747 flight path, I was approximately 2-3miles away from me..  From the looks of it, it was probably over (cross streets) Euclid and trask in the city of garden grove, we seem to see a lot of these lights in the area but this one got in the way of a plane and quickly disapeard.",
      "link": "http://www.nuforc.org/webreports/106/S106434.html",
      "state": "CA",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c198e",
      "summary": "The orange fireball was high in the sky as it appeared.",
      "city": "santaana",
      "shape": "fireball",
      "date": "2014-07-05T00:00:00",
      "story": "The orange fireball was high in the sky as it appeared. A orange round fireball high in the sky went across the sky, it stopped at one point but the continues traveling and the 2nd one o was looking up anticipating the fireworks when  the orange ball lit up as it was high in the sky that's when I began recording it ....  Incidentally last year on the fourth of July we saw the same exact orange ball in the exact same position  and travel in the same path I was also sitting in the same position of the driveway last year I didn't get it on cam but this time I got both of them on cam  also we saw it at the same time as last year. ...  It was seen all over Orange County  last year and was reported in the media.",
      "link": "http://www.nuforc.org/webreports/111/S111004.html",
      "state": "CA",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c199a",
      "summary": "Saucer shaped aircraft levitates over witnesses and reveals it's definite shape while speeding off afterwards.",
      "city": "santaana",
      "shape": "disk",
      "date": "2014-07-26T00:00:00",
      "story": "Saucer shaped aircraft levitates over witnesses and reveals it's definite shape while speeding off afterwards Dawn had been breaking and I had been looking over to the horizon only to notice an aircraft roaming around.  I believed that it was a mere helicopter in patrol but it begun to elevate and move towards our general direction. The Lights emitted were Red and Blue, which did not flash simultaneously in accordance to the common pattern regular to military/Police patrol aircrafts. The red lights flashed three times and then the blue light in the center flashes along with it.  Then it changed to multiple red flashes and some minimal blue flashing. I called my neighbor over to look and we immediately pause. The Aircraft flew above us. My neighbor and I were perplexed because it was above us and it became clear to us what it is.  I would say it was a couple hundred feet or less, but then the most astonishing event occurs. The lights emitted from the aircraft revealed its definite shape, which appeared to look like a saucer with an extruded block in the center of it. The sides of the saucer had strips of red lights. Three of them exactly in both sides with one blue strip of light mixed with white in the center of the extruded block. The sound of the turbulence had affected the neighborhood dogs which caused them to bark loudly. As it sped to the other end of the street it made a sharp turn back and I immediately grabbed my ladder and I recorded the aircraft returning.  From the distance the sound of the turbulence had been very loud for the distance. Luckily I managed to record enough to approve of sighting. My witness is my neighbor and he had been surprised as well, unfortunately the focus on my camera had been lacking, explaining the difficulty in keeping range and quality. I apologize if the video had been shaking around, I was nervous about the situation and I was not sure how to adapt to it. I then called the hotline and I had been advised to write a report as shown, and to attach a video along with it.",
      "link": "http://www.nuforc.org/webreports/111/S111837.html",
      "state": "CA",
      "duration": "30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c1ba2",
      "summary": "UFO Santa Ana California 9:25 PM PST 6/28/2014",
      "city": "santaana",
      "shape": "triangle",
      "date": "2014-07-04T00:00:00",
      "story": "UFO Santa Ana California 9:25 PM PST 6/28/2014 Description of craft- When it appeared over the horizon it was just a red and white blinking light.  As it peered closer, the object turned off the red and white lights, and on went blue lights.  Keep in mind that the sky was about 65% clouds so it was out of sight here and there.  As the craft came closer it had a boomerang shape, and the blue lights were on, it looked like this. (sorry I’m a very bad drawer)     http://puu.sh/9P5h6/7bf8839289.png  After it was there for less than 30 seconds, it shot off, over 1000 mph.  The craft was not as large as seen in the picture; it was at the cloud line. This object was not right above me, it was about 3 miles away, but it was large. What the craft did- All they did was hover in and out of the clouds before shooting off into the distance.  It stopped after less than ten seconds of flying and lowered. It was over 2 miles away at this time.  At this time I had returned with my phone, and recorded a video of it. I cut out the time in the video when the craft had disappeared.  Shortly after the craft left for the last time I heard a faint boom, I presume a sonic boom from the craft leaving the atmosphere. Shape and Color of Craft- Triangle with blue lights Backgrounds-I myself am a straight A student, that looks at everything.  I want to know how stuff works. I love looking at the sky, with my mom’s boyfriend.  Were interested in aliens and stuff like that.  Our family is super poor, so we wished we had a 30 mm camera to snap good photos of the craft. At the moment he is a restoration worker, he fixes stuff. THIS IS THE VIDEO I TOOK AS THE CRAFT WAS GOING AWAY-  https://www.youtube.com/watch?v=jVwMgWsNdr4",
      "link": "http://www.nuforc.org/webreports/110/S110815.html",
      "state": "CA",
      "duration": "~5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c37c2",
      "summary": "Glimmering object moved slowly in one direction, while second glimmering reddish object moved in other direction.",
      "city": "santaana",
      "shape": "diamond",
      "date": "2015-02-06T00:00:00",
      "story": "Glimmering object moved slowly in one direction, while second glimmering reddish object moved in other direction. I was walking outside of my building at work this afternoon and I heard some birds making noises overhead.  I looked up to see what they were and when I did, I saw this small, shiny object in the sky that caught my attention.  I stopped to watch it.  It was similar to what a bright star would look like at night, only this was during the day time.  It was about 1:45 PM, and it was sunny and clear, no clouds. I sat down at a picnic table and watched this “star” looking object.  After a few seconds, it started to glimmer so I figured it must be something metallic.  Since I had no idea what it was and what the size of it was, it was hard for me to judge the altitude of this object.  But if I had to guess, I would say it was between 5 -8,000 feet high.  I started thinking to myself what it could be.  It wasn’t a star because it was moving but it wasn’t moving fast enough to be a satellite.  It was glimmering when the sun would catch it.  It would go from a dull white color to a bright silver color at random intervals.  At one point when it was nearest to my location (it moved away slowly over time) the sun caught it and this silver object appeared to have a silver appendage below it that was shaped like a stubby pencil.  This appendage was also metallic as the sun lit it up and it was pointed straight down from the object.  At this point I started to think it was a weather balloon.  But then I was thinking that most weather balloons are non-metallic and the payload is usually wrapped in Styrofoam or some material that would cushion the instruments during a fall.  The wind was blowing in its normal direction, from the southwest to the northeast which is the typical wind direction for our area.  This object, however, was moving from east to west and eventually headed towards the north.  It was moving very slow.  (In total, I watched the object for at least 45 minutes and it moved only what would be about 10-12 degrees from east to west.)  After about 15 minutes of watching this object, the security guard for our business came along and we started watching it together.  Then a few of our employees came outside to see what we were looking at and they saw it too. After a few minutes, one of the other employees said, “Oh look, there is a second object now…it’s above the other one.”  So I looked up about 5-7 degrees above the initial object and I saw a second object that was very similar.  This second object was also glimmering in the sunlight, except this one had an obvious reddish color to it.  The second object was moving away from the first object in a completely different direction, in a northwest to southeast direction in almost a perfect arc.  It was glimmering pretty regularly almost like it was tumbling and the sun was catching it.  I started to think that maybe this was a satellite but after about 2 minutes, it slowed down.  It had been moving laterally at a pretty good speed and now it was almost stationary.  Like the first object, this second object would also glimmer in the sunlight occasionally with its reddish hue. I stayed there looking at both objects for a few more minutes and I ultimately said to our security guard that I had to get back inside and go back to work.  About three minutes later, the security guard called me to tell me that he could now see what looked like a “tail” on the initial object.  What he described to me sounded like the “appendage” that I had seen earlier.   I had taken a video of the initial object with my phone.  When I got back to my desk, I looked at the video.  Of course the video is blurry and the object has no edge definition since the camera was trying to focus on infinity.  As I write this narrative, the security guard is still outside watching the objects.",
      "link": "http://www.nuforc.org/webreports/117/S117174.html",
      "state": "CA",
      "duration": "45 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c411b",
      "summary": "White L-shaped lights in Santa Ana, CA.",
      "city": "santaana",
      "shape": "formation",
      "date": "2015-05-22T00:00:00",
      "story": "White L shaped lights in Santa Ana, CA. Looked like an L shaped lights at least 5 of them disappearing downward into a v shape and gone.  After about a 1 min or 2 it appeared againg straight from where they were first seen at. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/118/S118963.html",
      "state": "CA",
      "duration": "30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c477d",
      "summary": "Bright green/blue gas in the the dark night sky.  ((NUFORC Note:  US Navy missile launch.  PD))",
      "city": "santaana",
      "shape": "other",
      "date": "2015-11-12T00:00:00",
      "story": "Bright green/ blue gas in the the dark night sky. Traveling north on the 5 south of Santa Ana.  Small craft looked like a plane or helicopter traveling north with a white light. followed by bright green/ blue light trailing behind. with a giant orb or fog.  The green/ blue light grew and faded. ((NUFORC Note:  US Navy missile launch.  PD)) ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/123/S123746.html",
      "state": "CA",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c49df",
      "summary": "Color-changing UFO shaped like an thin oval.",
      "city": "santaana",
      "shape": "oval",
      "date": "2015-10-16T00:00:00",
      "story": "Color-changing UFO shaped like an thin oval. It was a squished oval shape that kind of looked like a blimp but much more thinner.  It emitted a flash then changed color from blue to red to green then to red and disappeared was close and in 1 min it was farther.  Used binoculars like a flat football.  It couldn't be a blimp because there isn't a stadium, arena, amphitheater, etc.. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/122/S122815.html",
      "state": "CA",
      "duration": "1-2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c5f27",
      "summary": "Orange light in Orange County.",
      "city": "santaana",
      "shape": "unknown",
      "date": "2016-11-11T00:00:00",
      "story": "Orange light in Orange County. Saw a big orange glow just at a standstill then the light slowly dimmed and it was gone!",
      "link": "http://www.nuforc.org/webreports/131/S131131.html",
      "state": "CA",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c647b",
      "summary": "Shape of a saucer.  Moved quickly.  Was only 1; grey.  I'm a 29 yr old college-educated female. ((anonymous report))",
      "city": "santaana",
      "shape": "disk",
      "date": "2016-08-25T00:00:00",
      "story": "It was the shape of a saucer.  It moved quite quickly .  There was only 1 it was grey.  I am a 29 year old college-educated female. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/129/S129444.html",
      "state": "CA",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c6606",
      "summary": "This flaming ball was falling at an extremely fast speed from the sky. ((NUFORC Note:  Chinese rocket re-entry.  PD))",
      "city": "santaana",
      "shape": "circle",
      "date": "2016-08-02T00:00:00",
      "story": "I was driving home around 9:30-9:45 pm. All of a sudden this flaming ball was falling at an extremely fast speed from the sky. I thought maybe a meteor or something, then it split into 2 flaming balls. They had a tail from the flames. They were headed towards an airport tower near John Wayne airport. I wondered if maybe a plane exploded and was crashing. But then when they got near the tower the flames went away and they slowed then came to a stop. I was still driving so I couldn't get a photo, then as I got around a building that blocked them they were gone. ((NUFORC Note:  Chinese rocket re-entry.  PD))",
      "link": "http://www.nuforc.org/webreports/128/S128809.html",
      "state": "CA",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c66ea",
      "summary": "I am not sure if my original entry got sent,  here is a duplicate. If you read this already you can ignore this one  One thing I forgot",
      "city": "santaana",
      "shape": "other",
      "date": "2017-04-07T00:00:00",
      "story": "I am not sure if my original entry got sent, here is a duplicate.  If you read this already you can ignore this one.  One thing I forgot to mention, is I saw the ufo in the unincorporated area of Santa Ana, zip code 92705, but, the ufo itself was in zip code 92707. Was driving 2 friends in the hills of Tustin, CA, which overlook John Wayne Airport, and can see the Pacific Ocean and the Island of Catalina as well.  It was passed midnight and a warm night.  At this time, there were no night flights at John Wayne Airport (but I believe there are now).  It was a warm January night, no clouds, a clear, all the stars (as much as can be seen on a clear night) were visible kind of night. We just turned right on to newport Blvd from Crawford Canyon.  The airport is to our left, and we can't see it yet.  But directly in front of us was the treeline my neighborhood, which was the street of Marcy Ranch, in Santa Ana. I  saw a coyote in front of us, and I'm about to say, \"Coyote!\" to my friends...  But before I do, I notice the a bright flash of light above the treeline in front of us, and am now about to say \"lightning???\"  (I was Shocked because there was no clouds in the sky, it was not lighthing weather)...BUT... (At this point, Newport curves to the left, and at the turn, you can see ahead to John Wayne Airport, then the Pacific Ocean, and Catalina, all in one view.  The airport is roughly 5 miles away, in a direct straight line).  Above the runwsy was GIANT blue orb, surrounded by what looked like tangled blue lasers, like a tangled ball of yarn.  The rays looked like those plasma balls' rays, the kinds they have at childrens museums and such that when you touch the ball the plasma lasers gravitate towards your hand.  The lasers were were all were balled up around an orb in the middle.  This thing was huge, maybe as big as the room in the runways control tower, which was right next to each other, so I can decently estimate the size.  It was not much higher than the control tower. A similar smaller orb surrounded by lasers also appeared directly below it.  The smaller ball had to be no more than 5 to 10 feet off the ground.  It was some type of mass, because as it was under the bigger, brighter ball, it cast a shadow directly underneath it on the runway. If you Google Image search \"terminator time travel ball\" and look at the pictures of the time travel ball as it apears throughout the movies, it is kind of a good idea of what it looked like, but this ball had alot more lasers around it.  It was the kind of blue that solar powered LED gardenlights are. It had a HUGE flash, so it lasted a second or 2.  I saw the 2 orbs surrounded by lasers, the smaller orbs shadow on the runway, then looked in the hills in Irvine behind it, which was around the Turtle Rock Neighborhood (I know this because ironically enough, one of the passengers in my car lived in that neighborhood at the time)  It was so bright, it lit up EVERYTHING IN THE ENTIRE HORIZON.  EVERYTHING.  In the next second or 2, I saw:  - The hills of Irvine, behind the airport.  It was so bright, that I Could make out the green from the grass and the brown from the dirt in the hills. I Glanced at the ocean, and the blue reflected off the ENTIRE pacific ocean.  It was beautiful-I glance up and at last moment, and saw the Island of Catalina, and again, the flash was was so bright I saw the green from the grass in the hills and the brown from the earth in Catalina. Where we are, having turned right onto Newport blvd from Crawford Canyon, is just 15 seconds away from my house, which is off Marcy and Newport.  We were silent the whole way, stunned. I pull in front of my house, all of us are stunned, and my buddy in the back says, \"Please tell me you guys just saw that!\" and we all freak out, and everyone shares everything they saw... ONE friend saw just the hills in Irvine, which ironically is where he lived at the time.  He said it was bright as day and could even see a red street light in the hills. The other friend saw the flash reflecting off the ocean and he saw Catalina. On the other hand, as I was driving, I saw the orb laserball, the airport, the hills of Irvine, the ocean, and just barely got a glimpse of Catalina. Eventually they leave and I walk inside home.  My dad is inside, in the dark, playing solitaire on the computer.  I was hoping he saw the flash, but he didnt. I tell him about what we saw, and he shugged and said \"probaby a transformer explosion.\"  I laughed because there is NO way it was. I checked the news, called the sheriff to see if anyone called in anything.  Turn on the TV and check the news,  Nothing.  I thought it would be all over myspace,  Nothing. Woke up the next day, nothing on the news or newspapers. The airport runs RIGHT NEXT TO THE 405 freeway, people had to be driving along the 405 and see it.  People on the 55 freeway had to see it. People at the airport had to see it. People at the bars across the street from the airport had to see it,  Bouncers, people outside smoving cigarettes had to see it.  The bellboys and valet at the hotel had to see it.  If people were nightfishing on the ocean, they had to see it.  I'm guessing hundreds, maybe thousands saw this. Anyhow, me and my friends have never met anyone who has seen it, until... 11 years later, I'm at work.  Some friends of my parents walk in.  They have kids my age that I went to school with since 4th grade till all the way to high school, and have older kids that went to high school around the time  my older brother and sister did.  A little disclosure, we went to St Jeanne de Lestonnac in Tustin, then graduated and went to Mater Dei high. St Jeanne's is a small school, and my parents came to be friends with these 2 parents.  This family are good people, all kids are smart, successful and none were ever trouble makers or had a bad bone in their body.  The family and parents are as straight laced and good people as it gets. I see the parents, and ask them how they are.  We shoot the shit, and he mentions he retired and sold his electrician business.  He says he has contracts out with a few cities in south orange county, and from 12 pm to 8 am, he repairs transformers if they explode. That reminds me of the night, as my dad saying it was a possible transformer explosion. I ask him what the biggest transformer explosion he has seen, and if they can light up the whole horizon (I knew full well what I saw wasn't a transformer bc it appeared out of thin air)  He laughs and says no, and asks why.  Seeing as how they are a straight laced, catholic family, I almost didn't say anything, but I told him the story, and left out some details.  When we were talking, it was 2014 and the ufo sighting happened 11 years before, but I started the story off \"about ten years ago. ..\" and I begin my story. I finish, and with a serious look on his face,  He looks at me, and asks me, \"Did it take place in 2003?\"  I say yes, it did.  He named the correct year.  Mind blown. \"Did it happen during the month of January?\"  He names the correct month.  Then he names the specific time. He tells me \"I saw it too,\" then I hear his story.... It was a night he got a call to repair a transformer.  He went to Aliso Viejo or Niguel or wherever, did his job, and came home.  On his way home he decided to stop by his office and put his tools away because some colleagues of his had their tools stolen from the trucks overnight.  His office is a 3 minute drive from the airport off Redhill and Macarthur. He goes, locks his tools up, and walking back his car (his back is to the airport) sees everything light up.  He sees the shadows of the trees and trucks up on the building with a blue light.  Looks behind him and but it was so bright he was afraid he'd go blind if he did,  so he turned back around.  He pointed out it was silent, which when I heard him say, realized I never thought about the sound. His wife is staring at him with her mouth wide open, wondering why he never told her.  He said it was bc he told some work friends and they laughed at him, and he was scared she'd think he was crazy. AND that's it. I swear on my life, this is what I saw. The crazy thing is as child I saw a UFO on the same newport/ Crawford Canyon intersection.  During El Nino, I saw a metallic orb in the sky.  At first, Not sure what I was looking at, a low flying, fast moving cloud flew in between me and the orb, and  I saw the clouds reflection moving off the orb.  The reflection matched the speed of the cloud as it was moving, and when it passed, I finally got a clear view and grasped what I was looking at. This sighting was in the opposite direction of the other sighting. Those are two out of three of my sightings.  3 sightings in one lifetime, two if which, took place at the same intersection. ((NUFORC Note:  Source of report indicates that the date is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/133/S133349.html",
      "state": "CA",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c6a41",
      "summary": "I notice there was a blue dot circle flying in my video for about 2 seconds.  ((NUFORC Note:  Lens flare.  PD))",
      "city": "santaana",
      "shape": "",
      "date": "2017-02-17T00:00:00",
      "story": "Good afternoon.  I was feeding the bird today and while recording  it, i notice there was a blue dot circle flying in my video for about 2 second before it disappear.  Can you help me identify what that blue circle is before it fly away?  Please let me know where to send my video to.  This is real.  Thank you",
      "link": "http://www.nuforc.org/webreports/132/S132592.html",
      "state": "CA",
      "duration": "2 second"
    },
    {
      "_id": "64d005f478aba2ec5a3c75b7",
      "summary": "Bright light flew over 55 freeway in California, slowing traffic.  ((anonymous report))",
      "city": "santaana",
      "shape": "light",
      "date": "2018-01-12T00:00:00",
      "story": "Bright light flew over 55 freeway in California, slowing traffic Was driving south on the 55 freeway near the 17th street exit, traffic slowed significantly as a large bright orange and white light passed over the freeway. When I returned home I checked online to see if there had been any planned rocket launches by Space X, or any reported sightings, but haven’t found anything, not even on social media.",
      "link": "http://www.nuforc.org/webreports/138/S138158.html",
      "state": "CA",
      "duration": "unknown"
    },
    {
      "_id": "64d005f478aba2ec5a3c7620",
      "summary": "UFO over Santa Ana 12/2217 5:40pm  ((NUFORC Note:  Missile launch from Vandenberg AFB.  PD))",
      "city": "santaana",
      "shape": "other",
      "date": "2018-01-12T00:00:00",
      "story": "UFO over Santa Ana 12/2217 5:40pm I have a video.  It looks like 3 massive lights with a huge streak/clouds smoke, I don't know what was in between but in the Video you can clearly see little fast blinking somethings moving back to the opposite side of the 3 lights like if they were either leaving the massive ship from the 3 lights and moving fast and soundless to the opposite side where it was a huge mass/cloud (my instinct is telling me invisible shit but who knows) all I have to say that the video speak for itself.  I also emailed it so hopefully it can be posted. they are real people! all you got to do is take the time and look UP! ((NUFORC Note:  Missile launch from Vandenberg AFB.  PD))",
      "link": "http://www.nuforc.org/webreports/138/S138022.html",
      "state": "CA",
      "duration": "1-2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c7621",
      "summary": "Cloud emitting bright aurora like light beams.  ((NUFORC Note:  Missile launch from Vandenberg AFB.  PD))",
      "city": "santaana",
      "shape": "unknown",
      "date": "2018-01-12T00:00:00",
      "story": "Cloud emitting bright aurora like light beams Smoke like cloud in sky emitting bright light beams in southern direction. Seems to have been left by some type of propulsion system from an object traveling at low altitude. Looked like aurora lights. ((NUFORC Note:  Missile launch from Vandenberg AFB.  PD))",
      "link": "http://www.nuforc.org/webreports/137/S137982.html",
      "state": "CA",
      "duration": "20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c846e",
      "summary": "Have a bit of dashcam footage",
      "city": "santaana",
      "shape": "fireball",
      "date": "2018-10-12T00:00:00",
      "story": "Have a bit of dashcam footage. Saw a fast moving object in the sky over Santa Ana, appeared at first as a single object, but broke off into three about 2 minutes later.",
      "link": "http://www.nuforc.org/webreports/143/S143460.html",
      "state": "CA",
      "duration": "2 minutes"
    }
  ]
}