{
  "city": "scottsdale",
  "fetch_timestamp": "2025-07-12T14:36:15.866005",
  "record_count": 106,
  "pages_fetched": 5,
  "api_calls": 6,
  "source": "ufo_aficionado_api",
  "records": [
    {
      "_id": "64d005f478aba2ec5a3b41c1",
      "summary": "PHOENIX LIGHT OVER SCOTTSDALE IN 1991",
      "city": "scottsdale",
      "shape": "triangle",
      "date": "2006-05-15T00:00:00",
      "story": "PHOENIX LIGHT OVER SCOTTSDALE IN 1991 I HAVE WITHOUT A DOUBT & SWEAR ON MY LIFE & THE LIFE OF MY FAMILY, THAT I TOO HAVE SEEN THESE LIGHTS AND IT CHILLS ME EVERYTIME I SEE A REPORTING ABOUT THEM.  THE ONLY DIFFERENCE TO MY STORY IS THAT THE DATE THAT I HAVE SEEN THEM IS ABOUT 4 YEARS PRIOR TO YOUR SIGHTING.  I HAVE SEARCHED FOR DATES ONLINE BUT HAVE SEEN NOTHING DURING THIS TIME.  NOW AS A RESULT OF MY FINDINGS, I FEEL LIKE I NEED TO TELL SOMEBODY.  I JUST CANT BELIEVE NOBODY ELSE HAS REPORTED THESE LIGHTS DURING THAT TIME PERIOD BECAUSE WHAT I SAW WAS ENORMOUS! HOW COULD ANYBODY MISS IT?  CURRENTLY, I RESIDE IN SARASOTA, FLORIDA, BUT FOR A BRIEF TIME, FROM 1990-1991, I LIVED IN SCOTTSDALE, AZ.  AND FROM 1992 TO 2004 I LIVED IN THE FAR NORTH SUBURBS OF CHICAGO.  I WAS AT THE CORNER OF SCOTTSDALE ROAD AND E. SHEA BLVD. AT THE NE CORNER OF THE INTERSECTION IS/WAS A \"MOBILE\"  ((sic.  Mobil)) GAS STATION.  WHILE I WAS FILLING UP MY CAR WITH GAS, I SAW THESE RED LIGHTS IN A SOUTHERLY DIRECTION FROM WHERE I WAS STANDING IN A \"V\" SHAPE IN WHAT LOOKED VERY CLOSE AND MOVING VERY SLOWLY!!! BECAUSE THE AREA SITS AT SORT OF A HIGHER ELEVATION OVERLOOKING THE PHOENIX, TEMPE & MESA AREAS, THE LIGHTS SEEMED ALMOST EYE LEVEL.  YOU DID LOOK UP SLIGHTLY BUT THESE LIGHTS SEEMED NO MORE THAN ABOUT 1 MILE AWAY IN DISTANCE AND WHAT SEEMED TO BE ABOUT A HALF A MILE LONG OR LONGER IN SIZE.  THE OBJECT MOVED IN AN EASTERLY DIRECTION AND MADE ABSOLUTELY NO SOUND WHAT-SO-EVER. THE FACT THAT IT HAD NO SOUND IS WHAT CAUGHT MY ATTENTION.  I HAVE HEARD THE MENTION OF AMBER LIGHTS, WHICH I DON’T BELIEVE IS WHAT I SAW.  I BELIEVE I SAW RED LIGHTS.  ALSO, I HAVE HEARD THE MENTION OF FLARES. THAT IS ABSOLUTELY NOT WHAT I SAW.  THIS MAINTAINED A CONSTANT ELEVATION IN A VERY SLOW EASTERLY DIRECTION.  I WAS IN SO MUCH DISBELIEF THAT I DIDN’T HEAR ANYBODY ELSE AROUND ME MAKING COMMENTS THAT I HAD TO ASK AN OLDER GENTLEMAN, WHOME WAS WALKING OUT OF THE GAS STATION AFTER PAYING I ASSUME, IF HE KNEW WHAT THOSE LIGHTS WERE.  HE DID SORT OF A DOUBLE TAKE, ANSWERED, \"I DON’T KNOW,\" PROCEEDED TO GET IN HIS CAR STARING AT THE LIGHTS AND DROVE OFF. I WAS ABOUT 23 YEARS OLD AT THE TIME, AND I REMEMBER THINKING, \"WELL IF HE DIDN’T THINK IT WAS ANY BIG DEAL, THEN IT MUST NOT BE,\" SO I PROCEEDED TO GET IN MY CAR AND LEAVE TO GO TO MY GIRLFRIENDS HOUSE AT THE TIME IN MCCORMICK RANCH.  I THINK I KEPT AN EYE ON THE LIGHTS FOR A WHILE AS I WAS DRIVING BUT AFTER THAT I CAN’T REMEMBER WHEN I STOPPED LOOKING.  I REMEMBER TELLING MY GIRLFRIEND ABOUT IT WHEN I WALKED IN HER HOUSE AND SHE CHANGED THE SUBJECT AND I NEVER SEEN ANYTHING ON THE NEWS THAT EVENING ABOUT IT, SO IT WAS FORGOTTEN UNTIL ABOUT 1997 WHEN I SAW THE FIRST REPORTS OF THE LIGHTS ON TELEVISION.  I REMEMBER SEEING THE REPORTS FOR THE FIRST TIME AND FEELING THE HAIR STAND UP ON THE BACK OF MY NECK. I WONDERED, \"NOW HOW DO I TELL SOMEBODY MY STORY WITHOUT THEM THINKING THAT I AM NUTS?\"  WELL, I NEVER TALKED ABOUT IT MUCH BUT, I TOLD MY FUTURE WIFE AND I RECEIVED THE TYPICAL RESPONSE I GUESS ANY CRACK POT MIGHT GET, \"OH, COOL OR THAT’S NICE.\"  SO AGAIN, I PUSHED IT ASIDE.  BUT IT IS REALLY EATING AT ME NOW TO TELL SOMEBODY.  SO HERE I AM.  I AM NOT LOOKING FOR ANY FINANCIAL GAIN OR RECOGNITION.  I JUST WANTED AN EAR TO HEAR MY SIDE. ((NUFORC Note:  Witness indicates that the date of the event is approximate.  We have assigned an artificial date above.  PD))",
      "link": "http://www.nuforc.org/webreports/049/S49840.html",
      "state": "AZ",
      "duration": "10 MINUTES"
    },
    {
      "_id": "64d005f478aba2ec5a3b42e2",
      "summary": "Well Trick or treating with my 2 daughters 13 and 11, I looked up to the sky as I often do.  My eye's fixed on what looked like 3 stars",
      "city": "scottsdale",
      "shape": "triangle",
      "date": "2006-05-15T00:00:00",
      "story": "Well Trick or treating with my 2 daughters 13 and 11, I looked up to the sky as I often do.  My eye's fixed on what looked like 3 stars, and I realized they were moving, and they were moving towards us.  The neighborhood that we live in is thickly populated but there were no other people near by at the moment.  We were at the corner of Granite reef and heatherbree in Scottsdale, AZ.  I was looking west, when I first noticed these lgihts(stars),  As they got closer, they must of been part of one craft, because thier movements seemed to be dependent upon each other.  I told the kids to look and they saw it too.  just about as it got over our heads it started turning towards the south, and elevating.  at what seemed like the point were it started elevating it wobbled for a sec or two, and then shot off and up to the south.  I never mentioned it to any one except my wife, and nothing was mentioned on the TV or Radio that I heard of.",
      "link": "http://www.nuforc.org/webreports/049/S49625.html",
      "state": "AZ",
      "duration": "02:00mins"
    },
    {
      "_id": "64d005f478aba2ec5a3b42e3",
      "summary": "On Halloween Night 2005, 3 Lights in shape of a triangle moving over Scottsdale, AZ.",
      "city": "scottsdale",
      "shape": "triangle",
      "date": "2006-05-15T00:00:00",
      "story": "On Halloween Night 2005, 3 Lights in shape of a triangle moving over Scottsdale, AZ. Well walking up Granite Reef, about 1/4 mile north of Indian School, with my 2 youngest daughters I saw what I thought was 3 stars in the shape of a triangle far off in the western sky.  Something about them caught my attention, and then I realized it was that they were moving towards us, all at once, together, as one it seemed.  I watched them for a few mins until I was sure of what I was seeing, then I told my daughters to look up and they saw them/it too.  They slowly came almost directly over our heads, and as they got near to us they started to bank and turn towards the south.  I didn't realize it at first but as they got closer to us they were also descending. I could see any edge or shape to this craft, but it was blocking out the view of the sky and stars behind it as it moved...  As it straightened out towards the south after making the turn, it wobbled once or twice and then shot off to the south 3 to 5 miles (estimate), also elevating as it moved, and then just stopped.  It covered this distance in the blink of an eye, but it also seemed like maybe who ever or what ever was controlling this thing, wasn't having the results they wanted.  The Movement was somewhat erratic and unstable.  Changing elevation and direction and stopping and going, and that wobble before it moved quickly to the south, just didn't seem as controlled as something that could move that fast and that quite should be.  I don't know what it was, but I have never seen a plane or helicopter that could move like that and not make a sound.",
      "link": "http://www.nuforc.org/webreports/049/S49911.html",
      "state": "AZ",
      "duration": "2:00min"
    },
    {
      "_id": "64d005f478aba2ec5a3b43b7",
      "summary": "silent, no lighting, a Y shape centered within the disk, cruised by at a medium speed and low altitude.",
      "city": "scottsdale",
      "shape": "disk",
      "date": "2006-05-15T00:00:00",
      "story": "silent, no lighting, a Y shape centered within the disk, cruised by at a medium speed and low altitude. Disk like craft, fairly low flying, silent, no lights.  A Y shape was centered in the disk and I could see what looked like holes where lights would be. It just cruised on past, and I was left speechless.",
      "link": "http://www.nuforc.org/webreports/049/S49790.html",
      "state": "AZ",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b446a",
      "summary": "Black triangle seen flying silently in the night sky.",
      "city": "scottsdale",
      "shape": "triangle",
      "date": "2006-05-15T00:00:00",
      "story": "Black triangle seen flying silently in the night sky. I saw what looked like the Stealth Bomber tonight, but with a lot of leading edge lights (7 to 10 total) the rest of the craft was pitch black, blacker than the sky. The sky is absolutely clear (it just happened about an hour ago). It was perfectly silent. I could not tell whether it was a small object close to me, or a large object far away. I was in a parking lot of apartments, so only the sky above me was in view. It was heading Northwest, in a perfectly straight line, at a slow to medium pace. The lights never blinked, and were not very bright. First time I have seen anything unexplained.",
      "link": "http://www.nuforc.org/webreports/049/S49985.html",
      "state": "AZ",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b463d",
      "summary": "Phoenix Lights (Again)",
      "city": "scottsdale",
      "shape": "light",
      "date": "2006-05-15T00:00:00",
      "story": "Phoenix Lights (Again) At 20:52 Me and two co-workers witnessed again, the Phoenix Lights.   We were in North Scottsdale, and the lights were south-southwest in what appeared to be hovering around the Mcdowell Mountain Range.  I would say there were South West of South Mountain.   There were two luminous orange lights that suddenly appeared in the sky and hovered motionless for 3 minutes and then slowly faded out.   My co-workers tell me they happen quite frequently, but nothing is said on the local news about it, at least not lately that I know of.   I will try to get some video of the Phoenix Lights. ((NUFORC Note:  The witnesses apparently witnessed unusual, and apparently unidentified lights, but the \"Phoenix Lights\" event of March 13, 1997, has no relationship to this event, we suspect.  PD))",
      "link": "http://www.nuforc.org/webreports/050/S50424.html",
      "state": "AZ",
      "duration": "Minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b4822",
      "summary": "It was about 2:15am to 2:30am I look up in the skies over Scottsdale there was this glowing white ball of light that stay stationary..F",
      "city": "scottsdale",
      "shape": "circle",
      "date": "2019-07-25T00:00:00",
      "story": "It was about 2:15am to 2:30am I look up in the skies over Scottsdale there was this glowing white ball of light that stay stationary.. For approximately 15 min.. It was not a star,plane because I keep looking at it didn't move..I went inside and when I came out it had completely disappeared..I did take pictures of the object.",
      "link": "http://www.nuforc.org/webreports/147/S147749.html",
      "state": "AZ",
      "duration": "15 min"
    },
    {
      "_id": "64d005f478aba2ec5a3b4823",
      "summary": "It was about 2:15am to 2:30am I look up in the skies over Scottsdale there was this glowing white ball of light that stay stationary..F",
      "city": "scottsdale",
      "shape": "circle",
      "date": "2019-07-25T00:00:00",
      "story": "It was about 2:15am to 2:30am I look up in the skies over Scottsdale there was this glowing white ball of light that stay stationary. .For approximately 15 min.. It was not a star,plane because I keep looking at it didn't move. .I went inside and when I came out it had completely disappeared.. I did take pictures of the object.",
      "link": "http://www.nuforc.org/webreports/147/S147747.html",
      "state": "AZ",
      "duration": "15 min"
    },
    {
      "_id": "64d005f478aba2ec5a3b4c15",
      "summary": "Light in formation over Scottsdale, AZ.  ((anonymous source))",
      "city": "scottsdale",
      "shape": "light",
      "date": "2019-06-20T00:00:00",
      "story": "Light in formation over Scottsdale,  AZ. At 14:30, out of the east by the face moon in the sky, 7 objects appeared in formation.  Just north of these objects, three more lights were in the sky.  All the same light.  It did last long but they were bright and in formation.  The former various shapes: squares, rectangles and the Orion's Belt.  They broke off and proceeded overhead until no longer visible. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/146/S146726.html",
      "state": "AZ",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b4caf",
      "summary": "Three bright orbs dancing in Scottsdale sky",
      "city": "scottsdale",
      "shape": "circle",
      "date": "2019-07-05T00:00:00",
      "story": "Three bright orbs dancing in Scottsdale sky I walked outside of my shed in my back yard only to look up and north to see what looked like a shooting star.  It was a round bright ball with a trailing effect behind it.  I then saw two more appear.  They began dancing around the sky in this one area I first saw them.  Moving sporadically and they would disappear and come back.  They appeared to be in a triangle formation moving around from side to side.  They looked to be dancing all with this trail following them across the sky. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/147/S147309.html",
      "state": "AZ",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b4f26",
      "summary": "Two stationary, bright lights in the sky, before sunset, remained for over 25 minutes with no apparent motion",
      "city": "scottsdale",
      "shape": "circle",
      "date": "2019-04-18T00:00:00",
      "story": "Two stationary, bright lights in the sky, before sunset, remained for over 25 minutes with no apparent motion I noticed 2 stationary lights in the sky, larger than a star, at around 6:50 pm, before the sun was fully down.  One was to the east and one towards the north.  Lights were bright enough to shine through scattered passing clouds.  I took pictures and video of lights with a cellphone and then with a cellphone through a telescope.  Lights did not appear to move at all (motion in video is from trying to film through the telescope eyepiece)  Watched the lights for over 20 minutes.  As the sun continued to set, they dimmed as if they had been reflecting sunlight.  Lights appeared as seen in the images, round, and with something protruding from the center.  The picture showing a dime, white spiral is how the northern light appeared before fading as the sun set.",
      "link": "http://www.nuforc.org/webreports/145/S145653.html",
      "state": "AZ",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3b527a",
      "summary": "Daughter and I saw two round craft forming triangle with North Star, then dancing around eachother and then zoomed off into deep space",
      "city": "scottsdale",
      "shape": "circle",
      "date": "2008-06-12T00:00:00",
      "story": "Daughter and I saw two round craft forming triangle with North Star, then dancing around eachother and then zoomed off into deep space My daughter and I were picking up our mail at the mailbox and I noticed that the North Star was very bright and beautiful. I told my daughter to look at the North Star and how low in the sky and beautiful it was. Then out of nowhere, two circular lights formed a perfect isocoles triangle with the North Star and just froze there and held that beautiful formation. Then suddenly they began to dance around eachother with amazing speed and eventually they zoomed off into deep space so fast it was incredible. Then they came back and danced again and then zoomed off into space and were gone. We were stunned. We stopped a jogger to ask him if he saw what we saw and what he thought it was. He said it had to be a UFO of some sort.",
      "link": "http://www.nuforc.org/webreports/063/S63193.html",
      "state": "AZ",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b533a",
      "summary": "Cigar shaped object over the McDowell Mountains",
      "city": "scottsdale",
      "shape": "cigar",
      "date": "2006-10-30T00:00:00",
      "story": "Cigar shaped object over the McDowell Mountains On the morning of May 26th 2006 my 16 year old son and I were headed to my mom's house to give her a ride to the airport, it was 5:00 AM barely getting day light still dark enough that I had my headlights on, we were going east on Cactus Road just west of Tatum Blvd. when my son noticed a strange light in the eastern sky I looked out and saw that it was just over the McDowell Mountains and appeared to be the shape of an L and was a bright orange, there was not a cloud in the sky and I was trying to see if it was something that the sun might be reflecting on but other than the object itself the skies were clear, we watched it as it seemed to remain stationary for about 2 minutes then just disappeared, well I continued East bound when just slightly to the North of the first sighting was a very long cigar shaped object same color bright orange lights as the first object again appearing to be stationary then suddenly started moving slowly east toward the valley in  between the peaks of the mountain. Well by now I had pulled over and we had gotten out of the car when remembering that I had a camera on my cell phone and it was better than nothing I was scrambling to find it in the bottom of my purse, but it was too late as the object started to really move rapidly and just as I raised the phone to take a picture of it  the tail end of it disappeared behind the peak of the mountain. I called a couple of news stations to see if it may have been reported by anyone else and apparently it had not, I also got on the internet to look up photos of other sightings around the world and I did find a couple that look exactly like the one we saw. I'm just happy I wasn't alone and had another witness with me.",
      "link": "http://www.nuforc.org/webreports/051/S51426.html",
      "state": "AZ",
      "duration": "20 min"
    },
    {
      "_id": "64d005f478aba2ec5a3b5510",
      "summary": "a squarish formation of dancing red/amber lights appeared in the distance. The twinkled for a very long time, over 1 hour. Formation wa",
      "city": "scottsdale",
      "shape": "formation",
      "date": "2006-10-30T00:00:00",
      "story": "a squarish formation of dancing red/amber lights appeared in the distance. The twinkled for a very long time, over 1 hour. Formation was in the South West of the valley and no mountains could be seen aroiund the object. Very strange and unlike anything we have seen before. ((NUFORC Note:  Witness elects to remain semi-anonymous;  provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/051/S51465.html",
      "state": "AZ",
      "duration": "several minutes,"
    },
    {
      "_id": "64d005f478aba2ec5a3b5579",
      "summary": "my brother, several neighbors and I were playing outside when we all noticed a fast light streak really high up on the sky,  near the s",
      "city": "scottsdale",
      "shape": "",
      "date": "2007-02-01T00:00:00",
      "story": "my brother, several neighbors and I were playing outside when we all noticed a fast light streak really high up on the sky,  near the sun.  It was going really fast and it was a color ( don't remember what color) but I remember that it looked like it was going toward the sun, then it made like a 120 degree turn and changed color, then it completely disappeared.  We all were amazed and ran into the house to tell my mom.  We weren't scared but really excited and yelling at her to call my dad (divorced) she did.  He said that some people saw it too and he reported it, not sure to who, but my mom told us that there had been lots of reports according to my dad ( a school principal in Phoenix Az).  I assumed he called some authority but not sure who.  It was really amazing and I just remember thinking what was it??? ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/054/S54151.html",
      "state": "AZ",
      "duration": "1 to 2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b5aab",
      "summary": "Yellow jellyfish shaped light bouncing around in the sky during the day, when the sun was out.",
      "city": "scottsdale",
      "shape": "light",
      "date": "2006-10-30T00:00:00",
      "story": "Yellow jellyfish shaped light bouncing around in the sky during the day, when the sun was out. There were 3 people staring into the sky, pointing, and taking digital pictures, at a local hotel pool that I was at.  Some of us ran over, and the object that they were looking at had disappeared by the time we got there, but one of the guys had taken a small video of it, and some pictures on his digital camera.  It was yellow, like a light, and seemed to jump around in the sky.  Up, down, to the left, right, diagonal, etc.  This was during the day, and the sun was out.  Then it just disappeared, as if someone just turned off a light.  It sort of resembled the shape of a jellyfish.  Two of the people said that they had seen it earlier in the day.  I was waiting to hear about it on the news, but I never heard a thing.  I've never seen anything like it before.  Of course, a few of the people thought it was a reflection of something, or a military something or other.  I just don't know.  It also looked like there were little lights on the light itself.",
      "link": "http://www.nuforc.org/webreports/052/S52313.html",
      "state": "AZ",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3b5d01",
      "summary": "3 Blinking Lights in Loose Formation over Camelback Mountain, Phoenix",
      "city": "scottsdale",
      "shape": "formation",
      "date": "2008-06-12T00:00:00",
      "story": "3 Blinking Lights in Loose Formation over Camelback Mountain, Phoenix I was sitting on the porch having a smoke when I noticed two twinkling lights off to the west. They had to be over Camelback Mountain (8 miles away), or maybe further west towards Glendale, it all depended on their altitude. They were in an area of the night sky that was void of stars, probably due to pollution. This is why I knew they did not belong there.  Upon further visual exploration of the scene, I noticed a third twinkling light at a lower altitude. The three would get brighter and move around a bit, but they would stay in the same general area. Sometimes they would dim to the point that they were impossible to see, only to brighten and twinkle once more. They did not move for nearly an hour, after which time tiredness dectated that I go to sleep.  Forty five minutes into watching these lights, or around 12:45, there was what I deemed to be an aircraft with a bright red flashing light, maybe a helicopter, that flew past all three of these objects. It should also be noted that these objects were present before I noticed them, and they probably lasted after I went to bed. I am writing this report after having come inside from watching the event.  I am visiting family for the week, and am leaving tomorrow. I did hear of a 'second round' of Phoenix Lights that took place a week ago (4/21/08)on the news last week. I think these lights behaved similarly to the ones I saw on many local news stations, however, they did not change positions such as the ones from a week ago, the lights tonight were relatively stationary. ((NUFORC Note:  Witness elects to remain totally anonymous;  provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/062/S62702.html",
      "state": "AZ",
      "duration": "1 hour"
    },
    {
      "_id": "64d005f478aba2ec5a3b5d24",
      "summary": "A small white star next to the sun in Scottsdale, Arizona.",
      "city": "scottsdale",
      "shape": "other",
      "date": "2007-08-07T00:00:00",
      "story": "A small white star next to the sun in Scottsdale, Arizona. Me and my dad were hitting fly balls at a school across the street from us. I am interested in airplanes, and we live about 40 minutes away from Sky Harbor International Airport. I like to look at the different planes flying over our heads when I hear them, but when I was looking at a plane, I saw a white speck about an inch away from the sun according to me standing on the ground. It looked like a star and was really high. It didn't seem to move at all for about 30 minutes. I showed my dad, and he didn't know what it was. When we got home, I found a pair of binoculars and tried to observe the object from our backyard. I couldn't make out what it totally looked like because the binoculars kept moving a little. But I could tell it didn't look like a weather balloon or an aircraft. By then, it actually was moving but at a very very slow pace. It now seemed about 3-4 inches away from the sun. I then got our telescope out and tried to focus on it. When I got it, the image was really blurry but now up close it had a goldish shade to it. I picked up my binoculars again and looked at it, and it looked the same as before. Then when I tried to focus the telescope on it again, I couldn't find it again, but it was still in the sky. Me and my dad have witnessed a similar object about a year ago, but was in a different part of the sky. Who knows, maybe it was the same UFO revisiting.",
      "link": "http://www.nuforc.org/webreports/057/S57233.html",
      "state": "AZ",
      "duration": "At leats 2 and a half hou"
    },
    {
      "_id": "64d005f478aba2ec5a3b6379",
      "summary": "Friday at  around 4:30 pm I saw a dark blue sphere shaped object that flew from the northwest to southeast  in under 10 seconds.",
      "city": "scottsdale",
      "shape": "sphere",
      "date": "2007-06-12T00:00:00",
      "story": "Friday at  around 4:30 pm I saw a dark blue sphere shaped object that flew from the northwest to southeast  in under 10 seconds. It was about four thirty pm and i was on vacation laying on a wicker couch outdoors. i was facing north west and i saw a sphere shaped object appear. It was in my direct line of sight and flew toward the southeast. it only took about five to seven seconds to pass. it was large compared to other objects that had been in the area. It looked to be the size of a eraser head and dark blue, almost a grey color; much darker than the light sky. what was interesting to me was that it was so large , but so high in the sky and it flew past much faster than the planes i had been observering earlier. I was alone and called to my friend inside the house, by the time they came outdoors it had already moved from my view and out of sight. I thought it was strange and questioned my friend , since he is from the area.",
      "link": "http://www.nuforc.org/webreports/056/S56472.html",
      "state": "AZ",
      "duration": "5-7 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b6d71",
      "summary": "Triangular shaped craft hovering over a desert /mountain area of  N. E. Scottsdale",
      "city": "scottsdale",
      "shape": "triangle",
      "date": "2008-03-31T00:00:00",
      "story": "Triangular shaped craft hovering over a desert /mountain area of  N. E. Scottsdale On March 19, 2008, I was leaving my gated neighborhood by car to teach a spinning class.   I noticed one bright light in the air about 4-500 feet above the road I was appproaching to make a turn on. I thought, \"What is that?\"  I looked out the window and then noticed there were 2 bright lights, like the headlights of a car.  I was frightened as I was the only car around...and this THING in the air right above me.  I kept thinking \"What in the H--- is that?\"  Then I noticed 3 lights,2 in the front again like car headlights and one in the back of them, the craft shaped like a triangle.  I had the windows down, there was no sound.   It seemed to hover for awhile then started to gain speed and disappeared over the mountains in our area.  As it left the area, I noticed some twinkling lights, muted colors, behind the back light. It did not look like an airplane or helicopter.",
      "link": "http://www.nuforc.org/webreports/062/S62280.html",
      "state": "AZ",
      "duration": "1-2 min"
    },
    {
      "_id": "64d005f478aba2ec5a3b7020",
      "summary": "Soundless high speed craft with lights",
      "city": "scottsdale",
      "shape": "light",
      "date": "2008-03-31T00:00:00",
      "story": "Soundless high speed craft with lights Looking at night sky to  southeast just 10 mins prior to moon rise. Dragonfly flight characteristics at very high speed, almost un-stable. Star like white light that soundlessly covered approx. 1/3 of visible sky in under 1 second.. Each time flight direction changed (5 times), it came to very abrupt stops, flashed a bright unusual color red light 1 time (which over powered the white light) while making a 170 degree direction changes. About half the altitude of 8 to 10 airliners in sky at time of event on easterly take off. No discernible shape to far away. Disappeared to east at very high speed, straight stable line of flight.",
      "link": "http://www.nuforc.org/webreports/062/S62316.html",
      "state": "AZ",
      "duration": "1.5 mins"
    },
    {
      "_id": "64d005f478aba2ec5a3b7412",
      "summary": "I saw what appeared to be a star that blew up and faded away in seconds",
      "city": "scottsdale",
      "shape": "unknown",
      "date": "2008-02-14T00:00:00",
      "story": "I saw what appeared to be a star that blew up and faded away in seconds I was walking in the dark, early in the morning of 12 Feb 2008 in Scottsdale (northeast Phoenix), Arizona.  At around 5:20 AM MST (give or take a few minutes) I looked up in the clear sky and saw a very brite “star”.  At first I thought it was Venus, but immediately realized it was in the northern sky, and could not be Venus.  Besides, it appeared brighter than Venus.  I immediately assumed it was an airplane and looked down as I continued walking.  After a few steps, I looked up again.  Instead of an airplane, I saw what appeared to be a star where I had seen the “airplane”.  Not a bright star, just an average star.  I then watched it as it quickly faded away, in a matter of 10 seconds or so, until nothing was there.  It did not appear to be moving, just fading away.  In complete silence.  I have never seen an airplane look like that.  First of all, when an airplane is that bright, it is coming toward you.  Second of all, it takes longer to fade out of sight when it is flying away.  And you usually see a flashing strobe light or the red and green wing lights.  But this just looked like a normal star that was fading away.  Rather than a UFO, I’d say this looked more like a star had just blown up and disappeared.  It was located in the northern sky to the left and below Polaris, forming an equilateral triangle with another star below  and to the right of Polaris.",
      "link": "http://www.nuforc.org/webreports/061/S61561.html",
      "state": "AZ",
      "duration": "20 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b7461",
      "summary": "Four lights - looked like the sun.",
      "city": "scottsdale",
      "shape": "circle",
      "date": "2006-07-16T00:00:00",
      "story": "Four lights - looked like the sun. Four of us were sitting on our patio at 3 AM when 4 large circular lights appeared and hovered in the Northwest sky.  All four were in a square formation. 2 flickered on and off, disappeared then reappeared.  Then one by one they slowly faded.  Almost immediately after they faded an airplane flew right through the path.  Most bizarre experience of our lives.",
      "link": "http://www.nuforc.org/webreports/050/S50842.html",
      "state": "AZ",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b79f4",
      "summary": "Four strange lights sighted over Scottsdale, Arizona  ((NUFORC Note:  Possibly flares over Gila Bend Firing Range.  PD))",
      "city": "scottsdale",
      "shape": "other",
      "date": "2007-02-24T00:00:00",
      "story": "Four strange lights sighted over Scottsdale, Arizona We witnessed four objects that hovered over Scottsdale.  They were not helicopters and did not follow any flight pattern. The four objects were equidistant from each other. After about 4 minutes one of the objects faded out, and the others followed suit. These were not flares.  These were stationary objects. ((NUFORC Note:  Because of both the location, and nature, of the bright objects, we strongly suspect that the bright objects may have been aerial flares, launched from aircraft over the Barry M. Goldwater Firing Range, located near Gila Bend, AZ.  That is what official military sources apparently reported, shortly after the event had occurred, and we have no reason to doubt that claim.  PD))",
      "link": "http://www.nuforc.org/webreports/055/S55167.html",
      "state": "AZ",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b7d54",
      "summary": "2 BRIGHT LIGHTS AND ONE WAS STATIONARY WHILE THE OTHER WAS MOVING ALL OVER.",
      "city": "scottsdale",
      "shape": "light",
      "date": "2006-07-16T00:00:00",
      "story": "2 BRIGHT LIGHTS AND ONE WAS STATIONARY WHILE THE OTHER WAS MOVING ALL OVER. WE JUST SAW TWO BRIGHT LIGHTS TO THE SOUTH EAST. ONE WAS STATIONARY AND WAS STILL WHILE ANOTHER LIGHT OBJECT MOVED ALL OVER THE PLACE BESIDE THE OTHER. IN A FORM OF A TEARDROP.. THEN BACK AND FORTH VERY FAST FOR APROX 2 MIN. THEY WOULD GET BRIGHTER THEN DIM. THEN THEY BOTH LEFT EXTREMELY FAST HEADING WEST.",
      "link": "http://www.nuforc.org/webreports/051/S51247.html",
      "state": "AZ",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b8182",
      "summary": "Bright light takes off into the skys over Scottsdale, AZ in 1987",
      "city": "scottsdale",
      "shape": "light",
      "date": "2009-01-10T00:00:00",
      "story": "Bright light takes off into the skys over Scottsdale, AZ in 1987 My brother and I were on the way to go bass-fishing early in the morning to Bartlett Lake.  Just outside Scottsdale, AZ we seen a light, VERY BRIGHT, behind a desert mountain, and it lit up the background of the mountain so bright it lit up the entire area.  We both said, Holly ****, and tried to say that is MUST be just a helicopter taking off behind the mountain, and there MUST be an airport there, so we hit the odometer on the truck and continued to drive slowly down the road.  The light started to get brighter, and brighter, and in an INSTANT the light (WHITE IN COLOR) shot straight up into the sky, and defied all laws of gravity as it streaked across the sky as fast as a shooting star, but it went UP, and after a ways, then turned right (horizontal). My brother and I couldn't believe our eyes?  We did continue on the the lake. (Bartlett Lake, AZ), near Horseshoe Lake, and fished the morning and afternoon.  On the way home we decided to stop and get out where we set the odometer, and we were still MILES FROM TOWN!  As we noticed in the daylight the mountain that was lit up earlier that morning could be seen as we drove back to Scottsdale. There was NO AIRPORT, and there was NO Buildings, or houses for MILES.  We decided NOT to tell anyone as we feared we would be called CRAZY or that we MADE IT UP?  I only now tell this to whoever reads this, so maybe SOMEONE ELSE seen the same thing back then?  Maybe this happened and was REPORTED BACK THEN? The date is approximate, as years have gone by, but I am sure it was the spring time, and I am SURE of the time in the morning!  We never saw a SHAPE of a craft, but the size of light was beyond belief!  We both had been in helicopters and airplanes, and had seen them in the air at night MANY TIMES BEFORE? This was something else?  I hope this may be confirmed by other witnesses?  We would like to KNOW if what we saw was truly a UFO?  We both know it was NOT FROM THIS EARTH? Thank you for listening. OH, it made NO SOUND. ((NUFORC Note:  Witness indicates that date of incident is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/066/S66599.html",
      "state": "AZ",
      "duration": "three minuets"
    },
    {
      "_id": "64d005f478aba2ec5a3b8d74",
      "summary": "Scottsdale sighting against air traffic",
      "city": "scottsdale",
      "shape": "formation",
      "date": "2009-01-10T00:00:00",
      "story": "Scottsdale sighting against air traffic We were sitting on our outside porch when we saw it come from the horizon moving rapidly. One circle of light broke formation flying irradically while the others stayed in perfect formation. Thee objects broke from straight path and darted to our left the irradic circle rejoined formaion than it just dissappeared. The objects were flying against air traffic from the scottsdale airport as well. Theres was no sound. My father worked for TWA for 37 years, and I have my private pilots license; also I was in the military I know what planes look like and that was nothing i have ever seen in the sky before.",
      "link": "http://www.nuforc.org/webreports/067/S67016.html",
      "state": "AZ",
      "duration": "25 sec"
    },
    {
      "_id": "64d005f478aba2ec5a3b8e12",
      "summary": "Unfamilar orange lights in North Scottsdale",
      "city": "scottsdale",
      "shape": "formation",
      "date": "2009-01-10T00:00:00",
      "story": "Unfamilar orange lights in North Scottsdale I was sitting on the balcony when a seven lighted object came from the north west. It was in an arrow formation and it flew directly at us.  One broke formation on the bottom right, it veared off in a different path to the right.  The formation then turned to the left heading south.  The stray light rejoined formation again and then they all disappeared.  In all it took less than 30 secs.",
      "link": "http://www.nuforc.org/webreports/067/S67018.html",
      "state": "AZ",
      "duration": "20 secs"
    },
    {
      "_id": "64d005f478aba2ec5a3b8efe",
      "summary": "Object morphed after descent",
      "city": "scottsdale",
      "shape": "changing",
      "date": "2008-10-31T00:00:00",
      "story": "Object morphed after descent Myself and co-worker stepped outside at approximately 2:25 p.m on a smoking break.Above Scottsdale airport we had noticed what looked like a square reflective piece of paper descending slowly in a falling leaf motion.At roughly 1500 to 1800 ft. the object changed into a classic oblong \"cigar shaped\" object and slowly departed to the North towards Cave Creek.At first we thought it was a piece of paper and immediately due to the charactaristics assumed that it might be an aluminum part that may have falling off of an aircraft.We abandoned that idea once the object \"stopped falling.\" About 3 of the 10 minutes we thought that there was a conventional explanation but as ourr minds were processing the info we quickly realized something much weirder was going on.I have never seen anything like this in my life before and am a slight bit shaken up as I type this.I came across this website while doing a Google search.",
      "link": "http://www.nuforc.org/webreports/065/S65727.html",
      "state": "AZ",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b97eb",
      "summary": "A gigantic red cloud with an inner flickering light was seen hovering over the Scottsdale/Tempe area at 2 am on July 14th, 2008",
      "city": "scottsdale",
      "shape": "circle",
      "date": "2008-08-12T00:00:00",
      "story": "A gigantic red cloud with an inner flickering light was seen hovering over the Scottsdale/Tempe area at 2 am on July 14th, 2008 I am writing this report at 2:47 am to report a UFO that i saw over Scottsdale possibly as far south as Tempe.  I live in north Scottsdale and the window where i saw the UFO was facing south.  At about 2 am earlier tonight on July 14th 2008, i went to close my window and i saw what appeared to be a red cloud in the sky hovering over Scottsdale.  Upon closer examination i saw what appeared to be a red inner glowing light and there reddish-orange cloud that surrounded it.  The shape of the cloud was a circle and it flickered with the inner light.  The feeling of seeing that is one that i will never forget.  My heart started to beat rapidly and my mind started racing.   I didn't know whether to wake up my parents or call my friends to check it out. I tried to call a friend of mine, but he did not answer.  I decided not to wake up my parents, because they would have just said i was crazy and told me to go back to sleep.   I didn't want to lose sight of the object either.  Anyway this object just stayed in one spot the whole time, i did not see it fly vertically. The only movement that could have happened was for it to move south, The cloud was strongest in the sky for about 5 minutes and than progressively got less bright over the few minutes. The weird thing was the shape of the cloud didn't get smaller.  It was still huge and it just seemed to get less bright until it vanished. The size was huge, it looked almost as big as a full moon does. In conclusion i want to say that i saw something tonight that i have never seen before in my life.   I am convinced that the object in the sky that i saw was way too big and way too bright to be anything that our military has disclosed.",
      "link": "http://www.nuforc.org/webreports/064/S64534.html",
      "state": "AZ",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b9ef1",
      "summary": "100's of star like objects move in a synchronized way across a night sky and slowly disappear, Arizona.",
      "city": "scottsdale",
      "shape": "circle",
      "date": "2010-06-10T00:00:00",
      "story": "100's of star like objects move in a synchronized way across a night sky and slowly disappear, Arizona. A large fleet of star like objects, no flickering, were moving at the same speed (VERY SYNCHRONIZED-MOVING AS ONE MASS, this was what astonished me the most)  in a north east direction without formation, some were higher some were lower in the sky.   As we watched it move across the sky they seemed to hit a wall or stop all at the same place in the sky (may have moved away from us) and slowly started to vanish.   Looking through binoculars they seemed to disappear and then above the area where they stop about 10 of the star like objects were left, formed  line in an upward angle.  One of the objects in the middle of the line was brighter and then they slowly disappeared.",
      "link": "http://www.nuforc.org/webreports/075/S75694.html",
      "state": "AZ",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3badd5",
      "summary": "I was at home on the patio that was facing south, I looked up and saw a dark object in the sky. I thought it was a helicopter but it wa",
      "city": "scottsdale",
      "shape": "disk",
      "date": "2011-01-05T00:00:00",
      "story": "I was at home on the patio that was facing south, I looked up and saw a dark object in the sky. I thought it was a helicopter but it wasn't making any sound. As the object was floating towards me going North I saw that it was a copper, rusty looking saucer flying at a low altitude. It floated right over my head above the condo and flipped on it's side as it flew over. It looked like an old rusty disk. I tried to call my boyfriend whom was at the store about 1/2 a mile away and his phone was fully charged and his cell phone just stopped working. His screen was white, and his cell phone was fully charged. His computer froze also. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/079/S79013.html",
      "state": "AZ",
      "duration": "15 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bb455",
      "summary": "A glowing green circle gliding acoss the sky",
      "city": "scottsdale",
      "shape": "circle",
      "date": "2011-01-31T00:00:00",
      "story": "A glowing green circle gliding acoss the sky As me and my friend were driving home around 12:35 last night , i was in the passenger seat and a green light gained my attention.  I looked up in the sky and saw a green glowing light that was very bright. It looked as if it was a frisbee  gliding across the sky. My reaction was stunned.  I was so freaked out i didnt know what to do,  As it passed over our car i turned around to see it and looked threw the back window and saw it still gliding at high speeds and then it dissapeared.",
      "link": "http://www.nuforc.org/webreports/079/S79691.html",
      "state": "AZ",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bb585",
      "summary": "Slow moving, red pulsing light in the sky",
      "city": "scottsdale",
      "shape": "light",
      "date": "2011-01-31T00:00:00",
      "story": "Slow moving, red pulsing light in the sky Moon was approximately 30 degrees above the horizon this morning and to the north of the moon was a brilliant red, pulsing light.  It seemed like it was pretty distant and it didn't look like a normal flickering light from an airplane. I couldn't see any discernable form, only a light with a fairly consistent pulse to it. At first I thought it was stationary but realized it was moving, but not what I perceived to be in any one direction, like a plane does.  I was driving in a car so it may have been moving in one direction. It was hard to tell. It also wasn't traveling quickly across the sky like a plane would. It was slow moving. I lost sight of it after a few minutes.  It just disappeared. I searched and searched the skies but did not find it again. It was weird.",
      "link": "http://www.nuforc.org/webreports/079/S79779.html",
      "state": "AZ",
      "duration": "~15 min"
    },
    {
      "_id": "64d005f478aba2ec5a3bb6f0",
      "summary": "A small, low gliding disc shaped with a tail ufo was seen over Scottsdale.",
      "city": "scottsdale",
      "shape": "teardrop",
      "date": "2010-08-24T00:00:00",
      "story": "A small, low gliding disc shaped with a tail ufo was seen over Scottsdale. Driving on 56th street towards Shea, saw in the sky a very slow moving and seemingly low to the ground object, which look like a metallic disc with a tail.  Not very big, maybe as big as a swimming pool.  Had 3 lights, I think, which were fading in and out.  I had seen a massive shooting star fall towards the ground barely 2 minutes before.  The lights were whitish-blue and not like bright and starry shaped like lights in the sky can be but softer and blurrier.  It was moving too slowly to be anything else, and it was so close to the ground, I think the depth perception was hard. Nothing on the ufo was moving, it was just simply gliding across the air.  Then I turned left onto shea blvd and it was gone.",
      "link": "http://www.nuforc.org/webreports/077/S77198.html",
      "state": "AZ",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bb8dc",
      "summary": "Emerging, pivoting array of lighted objects.",
      "city": "scottsdale",
      "shape": "light",
      "date": "2010-07-06T00:00:00",
      "story": "Emerging, pivoting array of lighted objects. I am filing this report on behalf of my son who witnessed the event.  At about 20:30 on January 4, 2000, (est.), my son was in the vicinity of Jomax Rd. and 62nd St. looking toward the south at the lights of Phoenix in the distance.  The day had been overcast with some rain, which had stopped in the evening.   A light at the extreme right side of his field of view caused him to look in that direction, west.  He witnessed a vivid green circular object descending at about a 30 degree angle, the object was the size of a dime at arms length.   At a height of about 200 feet above the ground the object stopped and a second identical object then appeared as if out of the first and proceeded on the same path and speed until it was about 12 diameters from the first, then it too stopped.   A third identical object immediately appeared, traveled the same distance, stopped, and a fourth identical object repeated the process until it reached the 12 diameter distance.  The moment the fourth object stopped the entire string of four objects then pivoted on the central axis of their array with the last object appearing closest to my son with the original object the most distant.  The array swung in such a fashion that it became parallel to the ground, forming an east-west line.   At this point my son was able to see that there were still four objects even though they overlapped each other from his vantage point.  Within a second or two all the objects simply vanished, followed a few seconds later by two loud \"sonic booms\".   At this point my son, then 16, made a hasty retreat to our home. He described the objects as having even illumination across the entire surface with distinct edges.  He described the green as similar to the green in a traffic signal.  The movement of the objects was very smooth as each emerged from the previous one.  His estimate was that the objects were about 1/4 mile from his location.  A set of electrical transmission towers runs on a southeast to northwest line, about 1/2 mile west of this location.   When I questioned him about the possibility of some sort of ball lightning or electrical plasma, he dismissed this possibility stating that the objects were never in the vicinity of the transmission lines.  He stated that the objects somewhat reminded him of the warning balls attached to power lines in the vicinity of airports.   Since the objects retained their circular shape as they pivoted, he made the assumption that they were spheres. ((NUFORC Note:  Witness indicates that the date of the event is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/075/S75985.html",
      "state": "AZ",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bbca4",
      "summary": "Gilbert",
      "city": "scottsdale",
      "shape": "triangle",
      "date": "2011-12-12T00:00:00",
      "story": "Gilbert Craft came from the west I was on the corner of McKenzie and Granite Reef with my two girls.  Craft came from the west and first appeared as 1 star, then 2 & 3.  Some how I focused on it and realized all three stars were moving in unison and coming right at me?    Eventually it was right over head, and turned 90* to the south.  As it was approaching me it was dropping in elevation, until it seemed like it was relatively very low and over head.  Then as it turned south, it seemed to try to elevate again?  As it tried to elevate it wobbled.  Finally it shot off at a high rate of speed, but seemed to stop about 15 - 20 miles to the south at that point it seemed to drop out of sight. One of my girls didn't bring her glasses, so she couldn't see it, my other daughter ((name deleted)) saw it rise and go to the south.  It was silent and seemed to have definition but I really couldn't make out anything but the 3 lights.  It did black out the sky I think, but it was impossible to see where its edge stopped and started?  It went both slow and fast, but the wobble tells me it's human made, Alien craft would be flawless... I have also seen other UFO type objects, both at night and in the day in AZ..  I filmed a UFO 05-06-2011 seen in Surprise and Gold Canyon AZ.  This seen twice that day with a witness also.  I saw what I think was the Superstition Lights on a day a few weeks back, but not sure it was a craft and not just a light. http://youtu.be/UgAVCwmB7qE  --((name deleted))",
      "link": "http://www.nuforc.org/webreports/085/S85199.html",
      "state": "AZ",
      "duration": "10 mins"
    },
    {
      "_id": "64d005f478aba2ec5a3bbe6e",
      "summary": "Three to Five comet-like objects seen descending in the sky east of Scottsdale AZ, directional changes and reigniting flames.",
      "city": "scottsdale",
      "shape": "unknown",
      "date": "2011-12-12T00:00:00",
      "story": "Three to Five comet-like objects seen descending in the sky east of Scottsdale, AZ, directional changes and reigniting flames. Three to Five flaming, descending objects seen two consecutive nights with consistent, peculiar behavior. They appeared on 10/28/2011 and 10/29/2011 between 8:00 and 9:00 both nights, in the sky east of Scottsdale, Arizona.  On 10/28/2011 they were further north than on 10/29/2011. Specific times of sight were 8:39pm on 10/28, and 8:15pm on 10/29. Flight behavior shows descent, but with sudden, curving and complete shifts in directional movement. There is no organized formation. They initially appear with long streaks of flame, already in a steep descent. The relation between the ‘flames’ and objects are like that of a comet- so judging from the flames, which seem to only come from one side of these objects, I could determine a curved silhouette. Full shapes, however, were not seen. The flame will go out on one at a time, leaving a small white light, then spontaneously reignite with an equal amount of fervor. Each flame and object seem uniform in size. The colors of the flame range from white, yellow, and orange. No other lights on the objects were seen, other than the single light when the flame temporarily extinguishes. Both nights these objects descend into darkness, or have fallen from view, just before they drop below the horizon line.",
      "link": "http://www.nuforc.org/webreports/084/S84995.html",
      "state": "AZ",
      "duration": "5min or less"
    },
    {
      "_id": "64d005f478aba2ec5a3bc0ef",
      "summary": "6 glowing objects in the sky that were moving in ways that we have never seen",
      "city": "scottsdale",
      "shape": "unknown",
      "date": "2011-12-12T00:00:00",
      "story": "6 glowing objects in the sky that were moving in ways that we have never seen",
      "link": "http://www.nuforc.org/webreports/085/S85267.html",
      "state": "AZ",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bc26b",
      "summary": "Scottsdale",
      "city": "scottsdale",
      "shape": "disk",
      "date": "2012-01-12T00:00:00",
      "story": "My husband and I were driving back from dinner (we were traveling east on Westland in North Scottsdale, AZ) and as we were driving we saw a bluish circular craft flying in the sky in front of us.  We at first thought it was a shooting star as it was traveling quicker than a plane would.   We both realized, simultaneously, that is was not a plane.  It kept traveling at a fast rate and the blue light seemed to have some green to the tint of its light.  It made an arched turn near and above Desert Mountain and than disappeared from sight.",
      "link": "http://www.nuforc.org/webreports/086/S86243.html",
      "state": "AZ",
      "duration": "45 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bc889",
      "summary": "Objects in the skies of Scottsdale.",
      "city": "scottsdale",
      "shape": "triangle",
      "date": "2011-10-19T00:00:00",
      "story": "Objects in the skies of Scottsdale. It was about 5:30 AM there seemed to be an object with three lights in a form of a triangle. The lights changed color into Blue and White.   The other object looked like a sphere and was spinning but stayed in place the color of the sphere was Blue.  Another was just lights, about 2 they were White and Blue & another flashing red light appeared to the side.   The other sighting was a straight line with lights on the end Red and White, this appearence did make a sound.  Last sighting was just a white sphere. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/084/S84531.html",
      "state": "AZ",
      "duration": "Hours"
    },
    {
      "_id": "64d005f478aba2ec5a3bc950",
      "summary": "A bright red object was seen traveling from west Phoenix to east TempeSpeed was slow (probably too slow for most aircraft), it also app",
      "city": "scottsdale",
      "shape": "",
      "date": "2011-07-17T00:00:00",
      "story": "Summary : A bright red object was seen traveling from west Phoenix to east Tempe  Speed was slow (probably too slow for most aircraft), it also appeared to climb gradually until it reached the east side of Tempe (from approx 8000' to approx. 12000') at this point it appeared to stop and slowly turn white and climbed to a vanishing point. Object was viewed from a roof top close to Camelback and Scottsdale Rd.  My son ((name deleted)) and I were on the roof viewing the various firework shows going on around the area.    At 2113 my wife had gone into the house andwithin a couple of minutes the bright red object grabbed my attention because it wasn't strobing like regular red lights on the other aircraftin the area (viewed through the binoculars no other lights or any form wasvisible).   We then watched it as it traveled from west to east very slowly for probably 15 minutes before it slowed to what appeared to bea complete stop.   It then slowly turned to more of a whitish color andslowly ascended out of sight.",
      "link": "http://www.nuforc.org/webreports/002/S02344.html",
      "state": "AZ",
      "duration": "~15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bd368",
      "summary": "Seven Orange \"Fireball\" Objects Dance in the Arizona Moonlight",
      "city": "scottsdale",
      "shape": "fireball",
      "date": "2012-09-24T00:00:00",
      "story": "Seven Orange \"Fireball\" Objects Dance in the Arizona Moonlight While walking down deserted road on Indian reservation at 2:30 am, was looking at the moon and noticed 7 or so orange \"fireball\" type objects.  They appeared kind of slowly, like when you light a candle and the flame is faint at first then becomes stronger.  While observing this (with much excitement), noticed that two of the orange balls began to move.  They started doing sort of a figure eight around each other, clearly an impossibility for today's aircraft.  They did this for several seconds ( i would say the whole incident was about 10-15 seconds) and then all 7 objects vanished. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/092/S92246.html",
      "state": "AZ",
      "duration": "10-15 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bd4c0",
      "summary": "Strange, but peacefull object  fly follow my car ..",
      "city": "scottsdale",
      "shape": "changing",
      "date": "2012-09-24T00:00:00",
      "story": "Strange, but peacefull object  fly follow my car .. I saw big ball white or silver.. Stay at the same place for almost an hour. After 30 min. Over this ball flash 4 extremely bright small balls of light.. After 10 min, small balls vanish.. I went into my car and start driving my car.. Big object was flying with me over 40 miles into my appartment. For all way home this object was visible across my sunroof.. I stop my car front of my gate. Object syart changing shape and turn into 3 small objects. One was shoot into the grand. All this happen between d:30 pm and 6:30 pm.. This object for sure was fallow me..",
      "link": "http://www.nuforc.org/webreports/092/S92392.html",
      "state": "AZ",
      "duration": "120 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bdad4",
      "summary": "3 bright red lights in formation over Scottsdale Arizona March 24 2012 at 9:30 PM.",
      "city": "scottsdale",
      "shape": "light",
      "date": "2012-05-13T00:00:00",
      "story": "3 bright red lights in formation over Scottsdale Arizona March 24 2012 at 9:30 PM. We had finished working in downtown Scottsdale, Arizona and were loading up our equipment into our vehicle before we noticed the event that took place in the sky above.  It was around 9:30PM.  We got in our vehicle and noticed 3 bright red lights in the clear sky, moving slowly toward us from far away in the West.  Friends were outside our vehicle in the parking lot and we mentioned the lights to them.  One of our friends took a picture with her cell phone.  The lights were equal-distant apart from each other as if in formation.  They were steady and not flashing during the whole sighting.  They then turned to the South and looped back in a Southwesterly direction and upward until they disappeared.  They stayed in formation the entire time.",
      "link": "http://www.nuforc.org/webreports/088/S88067.html",
      "state": "AZ",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bdd59",
      "summary": "2nd Sighting, Orange UFO East of Scottsdale Arizona 10/19/2012",
      "city": "scottsdale",
      "shape": "light",
      "date": "2012-10-30T00:00:00",
      "story": "2nd Sighting, Orange UFO East of Scottsdale Arizona 10/19/2012 As before, the UFO glowed a bright orange and entered the Phoenix area from the East over the Superstition Mountains and stopped over the Native American reservation which is East of Scottsdale Arizona.  This second time, the UFO was a little North of where it appeared the first time tonight.  As before, the UFO stopped in mid-air for some time and moved around slightly before performing an impossible 180 degree turn and quickly returning East from where it came. I was able to call nearby family this time, whereas last time they didn't pick up the phone in time. They were able to see the UFO before it left this time, so I increased the number of witnesses to three. If you can gain access to any weather, visibility, &quot;sunrise&quot;, or traffic cameras that point toward the Superstition Mountains and look out across the reservation - you will find footage. It glowed brighter than any stars, and brighter than any aircraft. Specific times were 11:05pm and 11:25pm. Additionally, the last plane to leave Sky Harbor International Airport in this direction was at 11:05pm.  The pilot, seemingly upon seeing the craft, executed a tight turn South. I did not see another plane or helicopter in the air until about 11:45pm.  Not even police, and not a single aircraft flew in from the area of the UFO - which was in a flight-lane used as an approach for Sky Harbor.",
      "link": "http://www.nuforc.org/webreports/093/S93720.html",
      "state": "AZ",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bdde9",
      "summary": "13 orange lighted craft in line formation moving to the North in Northwest Scottsdale Az",
      "city": "scottsdale",
      "shape": "unknown",
      "date": "2012-10-30T00:00:00",
      "story": "13 orange lighted craft in line formation moving to the North in Northwest Scottsdale Az Between 2225 and 2235 in North Scottsdale Arizona (Shea blvd & 92nd street) I observed 13 slow moving craft heading from the south East over what looks to be the south Fountain Hills area to the North.  I heard no sound and these crafts were not like the other planes I observed in the sky.  At first I saw 3 and took a video and some pictures on my iPhone however they are very dark.  I could see a whole line of the coming up over the horizon tree tops about a quarter of a mile out from my position in a second story balcony.  I had no other witnesses with me at this time.  I lost site of the craft as they moved into light cloud cover and direction changed from heading directly toward me (from the south east to the north west) and began moving North.  The lights became very faint until I could not see them any longer.  I counted 13 to 15 of these objects.",
      "link": "http://www.nuforc.org/webreports/093/S93731.html",
      "state": "AZ",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3be01d",
      "summary": "Red and White light seen flying low and fast from East to West disapears instantly in Phoenix area.",
      "city": "scottsdale",
      "shape": "light",
      "date": "2012-08-19T00:00:00",
      "story": "Red and White light seen flying low and fast from East to West disapears instantly in Phoenix area. Looking North from South Scottsdale just South East of Camelback Mountain and saw a red and white light going from east to west and going very fast then disappeared.  It was very low and went in front of the mountain.  There was no tail and it disappeared instantly after about 3 seconds.",
      "link": "http://www.nuforc.org/webreports/091/S91791.html",
      "state": "AZ",
      "duration": "3 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3be352",
      "summary": "Brilliant undulating light hung motionless in the horizon, eventually dimmed, came back, and then disappeared",
      "city": "scottsdale",
      "shape": "sphere",
      "date": "2012-05-13T00:00:00",
      "story": "Brilliant undulating light hung motionless in the horizon, eventually dimmed, came back, and then disappeared I stepped outside on my front porch and noticed a brilliant white sphere shaped light near the Northwest Horizon, just to the right and above the setting moon.  It appeared to undulate slightly but was not blinking. It was brighter than any planet I had ever seen.  I heard no noise.  Thinking it was an airplane, I watched for it to move, but over a 10 minute period it remained largely stationary.  I went to get my wife to show her. When I came back out with my wife, it had dimmed slightly but was still very bright.  We watched it for another 5 minutes.  I then went to get my binoculars to get a better look.  Just as I went into the house, my wife yelled for me to return because it had dimmed.  I came back to see the light fade out and go completely dark for a few seconds.  Then it returned briefly for a few seconds and then disappeared completely.  After it disappeared, we noticed a much dimmer light in the general vicinity that also faded to nothing after a few seconds.  About 10 minutes afterwards, a helicopter flew over the house very fast and low, but it was headed from east to west rather than northwest.",
      "link": "http://www.nuforc.org/webreports/088/S88663.html",
      "state": "AZ",
      "duration": "20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bec28",
      "summary": "I have seen this odd light formation on several occasions (times seen;  about, 6 times over 15 years)the first time was back in 1990 tr",
      "city": "scottsdale",
      "shape": "unknown",
      "date": "2013-08-30T00:00:00",
      "story": "I have seen this odd light formation on several occasions (times seen;  about, 6 times over 15 years) the first time was back in 1990 traveling over the Salt River Indian wash coming from Mesa, my daughter keeps telling me about the lights she see's out the back window of our car, I look and was shocked at what I saw; there were 5 lights all white and all rotating independently, all 5 lights were in one giant circle, as they swirled independently and at the same time came in towards the center once and then came back out to make a circle and during this time the whole circle is moving clockwise in step with the timing of the in and out movement, there is no sound. Several Months pass and I see the lights again, this time just above my house, then I see them again, several more times over the years and now again in March, always over my house except that first time.  I realized that the only time I ever see this is when there is a thick cloud cover, after noticing this the last time in March of 2013, I went into the house for only about 10 minutes (it was still going on) when I came out the sky had cleared up except for one cloud and in that cloud was a small version of what I saw still moving around, when I saw that, I figured to myself; it's time to write to the National UFO hotline and see if I'm all alone on this thing or have others seen it?  No one I ask has ever seen anything like that or they give me a funny look.  I can say with all honesty, this is real but have no clue to what it is or wants. It was one large circular craft with five giant lights all circling independently and then coming into the center and then back out again! , all the time moving  clockwise. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/100/S100411.html",
      "state": "AZ",
      "duration": "<1 hour"
    },
    {
      "_id": "64d005f478aba2ec5a3bf129",
      "summary": "I saw a cluster of white lights from 11:30pm-1:00am slowly moving across the sky.",
      "city": "scottsdale",
      "shape": "other",
      "date": "2013-09-30T00:00:00",
      "story": "I saw a cluster of white lights from 11:30pm-1:00am slowly moving across the sky. At around 11:30pm on September 11, 2013, I saw an unfamiliar cluster of white lights in the sky.  They looked like stars, so I just assumed I hadn't noticed them before.  But around midnight I noticed that the cluster seemed to have moved slightly from where it was earlier.  I paid close attention to it from midnight until almost 1:00am, and it was moving very slowly across the sky.  From 11:30pm-1:00am, it moved about 5-6 inches in the sky. I spent about an hour on the internet trying to find what this could be - satellites, weather balloon, - but I couldn't find anything.  However, I noticed that the lights were in a similar formation to the Pleiades star cluster.  But I did research on that and I didn't find anything that mentioned the Pleiades star cluster moving. I left around 1:00am, so it could have been there much longer.  I'm going to go out tonight and see if it's there again.",
      "link": "http://www.nuforc.org/webreports/102/S102264.html",
      "state": "AZ",
      "duration": "hour and a half+"
    },
    {
      "_id": "64d005f478aba2ec5a3c029a",
      "summary": "Wispy white presence that jetted off after it perceived me to be watching.",
      "city": "scottsdale",
      "shape": "unknown",
      "date": "2013-05-15T00:00:00",
      "story": "Wispy white presence that jetted off after it perceived me to be watching. Hi, I do not know what I saw last night, but it made the hair on the back of my neck stand up.  It was something unnatural, not of this world. I went out with my dog on a leash to wait for my boyfriend in  his driveway, which is relatively long.   We live in an area of rattlesnakes, so I did not want to venture into the area of the driveway that was not illuminated by the yard lights.   At the end of the driveway, I saw I could only make out was a person wearing a white shirt, yet this “person” lacked 3d perspective.  It was sort of a flat presence, sort of like a big plastic bag being flung into the air and blowing in the wind, yet it was not moving, it was still. I still could not figure out what this was.  Happened very quickly – maybe a one-minute time span.  My dog also alerted, and he was also aware there was something at the end of the driveway.  Well, whatever it was appeared to sort of bend over and though I could see now eyes or anything, I got the distinct impression that it was at that time this object became aware of me.  There was no mistaken that it had “seen” me, perceived me, it knew of my presence.   Again, not through any senses that such as we have here on earth. I am getting chills just retelling it, it was so eerie.  I was moving a bit closer and sort of trying to adjust my eyes to focus, when all of a sudden, it jetted off.  I use the term “jetted” because that is what it did.  From a standstill position to what seemed the speed of a car racing by at 100 mph.  It was gone, across the street and into the brush. When my boyfriend got home, I explained to him what I had seen. Well, he offered explanations, but none was satisfactory as I experienced it and I felt in my core it was something unnatural.  Well, unnatural to this earth.  Since last night, I have been second-guessing myself, but the point remains, I saw what I saw.  It is the nature of whatever beast this is to make you thing you were being delusional, imagining things, etc. At any rate, do you have any insight into what this could have been and perhaps tell me if other people have had similar experiences?   Thanks",
      "link": "http://www.nuforc.org/webreports/097/S97662.html",
      "state": "AZ",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c03cf",
      "summary": "Reddish/orangish lights blinking turning off and reappearing at a modest altitude for an hour.",
      "city": "scottsdale",
      "shape": "fireball",
      "date": "2013-02-04T00:00:00",
      "story": "Reddish organish lights blinking turning off and reappearing at a modest altitude for an hour. at about 6 o'clock at work some co workers told me about lights in the sky. intrigued i saw flashing reddish organish lights that were hovering above the ground at an estimated altitude of 3000 feet. they did not move but blinked continuously at a rapid pace, then dim and reappear in a different location. there would be new ones appearing and dimming at different altitudes and close to each other and some spaced. counted 6 at one point.  there were two aircraft nearing the location but still far off and when they got closer at the end they simply turned off one by one til there was nothing. I grew up in as a child of the air force as my father was active duty.   i myself spent 4 yrs in the air force.  I've never seen anything like this. i thought maybe helicopters but no indicator lights flashing green red white. i thought hot air balloons. not sure what it was got some bad pictures on my iPhone... just baffling.",
      "link": "http://www.nuforc.org/webreports/095/S95961.html",
      "state": "AZ",
      "duration": "1 hour"
    },
    {
      "_id": "64d005f478aba2ec5a3c099a",
      "summary": "Irregular hexagon with 3 big bright lights emitting beams",
      "city": "scottsdale",
      "shape": "other",
      "date": "2013-11-11T00:00:00",
      "story": "Irregular hexagon with 3 big bright lights emitting beams I was outside my home smoking a cigarette at approximately 11:38 three very big bright white lights appeared out of the northern sky moving south east not more then 3 miles from where I was standing.  It came out of no where, flying at no more then an altitude of about 3000 feet.  Each light had about 15 foot beams trailing from each one it appeared to be some mechanism of propulsion; every time the it turned they leaned the opposite direction of the turn.  It made an air blowing like noise it came within 1/4 mile of me and my house.  I got a very good look at it once the beams were facing westward when it turned.  The object was flat it was sort of pentagon in shape but not equal lengths, the front where the lights were; was a very wide broad point the sides towards the back were at a much narrower angle and much shorte, then a straight line connecting those for the very back.   The object was black except for on the back it was grey- silver like a vent type thing on that straight line back, it moved quite slow actually but in no way resembled a stealth bomber other then the nose of it and its flatness but had no defined wings and a very funky back end.   After passing by my house it proceeded west for about another mile before completely vanishing into thin air.  I searched the sky and could see no other aircraft of any kind in the sky. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/103/S103535.html",
      "state": "AZ",
      "duration": "2-3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c0f49",
      "summary": "Three bright, large, orange orbs over Scottsdale.",
      "city": "scottsdale",
      "shape": "light",
      "date": "2014-01-16T00:00:00",
      "story": "Three bright, large, orange orbs over Scottsdale I was walking down my driveway looking to the south east (I was north of the lights), and I witnessed three orange lights in the sky.   They were larger and brighter than aircraft lights.  They were quite a distance away, yet they were as large as the light on a helicopter that flew over my head at around the same time (the helicopter had nothing to do with the sighting, its just a size comparison).  The lights were a minimum of 10 miles away, so they were large and bright enough to clearly see.  They were mostly stationary and they formed a non-equilateral triangle.   The right-most light then started to head to the right (west) and it went out after about 10 seconds.  The middle light did the same thing about 30 seconds later.  The third light remained stationary in the sky for about 2 minutes, and then it faded out, but as it did, another bright orange light appeared to the left of it.  The fourth and final light remained stationary in the sky for another f! ew minutes, and then it faded out. I have an iPhone 5 video of the event that I'd like to upload, but it may take me a few days.",
      "link": "http://www.nuforc.org/webreports/106/S106227.html",
      "state": "AZ",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c1094",
      "summary": "Three bright orange low object under the monsoon clouds witnessed by two people.",
      "city": "scottsdale",
      "shape": "cylinder",
      "date": "2013-11-20T00:00:00",
      "story": "Three bright orange low object under the monsoon clouds witnessed by two people My friend and I observed 2 bright orange objects flying towards us very low in the sky as it was monsoon season and we had been having rain.  The two orange objects flew silently at a diagonal toward us under the clouds, so they were pretty low, like low flying aircraft would be.  No sound.   I got my binoculars and we both saw the same things:  Cylinder shape objects with bright orange fire burning inside, then another bright orange light of same color up to the right in the cylinder, but round shape. The 2 objects flew to a point over us.  They hesitated for a few moments, than one flew straight behind us out of sight while the second one flew away at approximately a 45 degree angle to our right.  Again, they were completely silent. We both looked at each other in amazement wondering aloud and comparing our sighting with each other.   While comparing out sighting I looked up at the direction the two objects had come from and there was a third identical object.  This one was much lower and couldn’t have been more than 500 feet over us.  It flew directly towards us and then hovered directly overhead.  A few moments later it also flew off silently at a 45 angle to our right.  We were both to slow in thinking to record this event. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD)) ((NUFORC Note:  Witness indicates that the date of the incident is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/104/S104480.html",
      "state": "AZ",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c12cd",
      "summary": "Orange glowing light over Scottsdale, AZ.",
      "city": "scottsdale",
      "shape": "chevron",
      "date": "2014-01-10T00:00:00",
      "story": "Orange glowing light over Scottsdale, AZ. From my backyard, I noticed what looked like an orange ball of fire moving east to west.  As it got closer, the object appeared to be a flaming chevron or bow shape that was glowing and smoldering like a fire.  The object appeared to completely stop when it was directly south of my backyard, then change direction, moving north toward my home, then stopped again, turning 180 degrees in a half circle motion back to the southern horizon until my view was obstructed by a home.  The object did not make any engine or propeller noise while I observed it and also seemed to change direction in a controlled and deliberate manner.  Visibility was clear and moon, stars and constellations could be clearly seen.",
      "link": "http://www.nuforc.org/webreports/106/S106011.html",
      "state": "AZ",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c12f1",
      "summary": "2 Red Orbs hovering over Scottsdale.",
      "city": "scottsdale",
      "shape": "light",
      "date": "2014-01-24T00:00:00",
      "story": "2 Red Orbs hovering over Scottsdale 2 orange orbs hovering over South Scottsdale as seen from North Scottsdale.  Would blink off and then back on.  Not moving .... Just hovering.  When observed through a spotting scope they appeared as reddish orange light.",
      "link": "http://www.nuforc.org/webreports/106/S106567.html",
      "state": "AZ",
      "duration": "30+ minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c14a0",
      "summary": "Looked like a silver of a moon, or circular in shape. Very low and gliding.",
      "city": "scottsdale",
      "shape": "other",
      "date": "2013-11-11T00:00:00",
      "story": "Looked like a sliver of a moon, or circular in shape. Very low and gliding One object, flying East, to Southeast.  Looked like a sliver of a moon, or circular in shape.  Glided along at slow speed and was very low.",
      "link": "http://www.nuforc.org/webreports/104/S104164.html",
      "state": "AZ",
      "duration": "15 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c1782",
      "summary": "Bright blue and red lights shifting position as object reoriented before changing direction; hovered, rose, dropped 100' to 1000'; move",
      "city": "scottsdale",
      "shape": "light",
      "date": "2014-06-04T00:00:00",
      "story": "Bright blue and red lights shifting position as object re-oriented before changing direction; hovered, rose, dropped 100' to 1000'; moved suddenly in all directions; no sounds of rotors or other propulsion; went back and forth over approx 1/2 mile around 90th & Via Linda.",
      "link": "http://www.nuforc.org/webreports/109/S109341.html",
      "state": "AZ",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c1ac7",
      "summary": "1 object seen from car. Bright fire orange in color..When first seen it seemed to be lower towards the ground maybe 100 ft.",
      "city": "scottsdale",
      "shape": "fireball",
      "date": "2014-07-11T00:00:00",
      "story": "1 object seen from car. Bright fire orange in color..  When first seen it seemed to be lower towards the ground mabey 100 ft.  I pulled over to watch and record with my phone and it slowly moved higher and began to move north/west.  Not in a straight direction either.  Moved off in the distance and continued to seemingly burn bright orange.  Simply faded. Not because of distance away but the light slowly dimmed and disappeared.  Just gone.  It was substantial in size when first observed. Crazy..",
      "link": "http://www.nuforc.org/webreports/111/S111164.html",
      "state": "AZ",
      "duration": "4 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c1ccc",
      "summary": "Large bright lights are hovering in sw sky. they fade out and reappear iu diffrent part of sky. you can see aircraft lights flying.",
      "city": "scottsdale",
      "shape": "light",
      "date": "2014-06-27T00:00:00",
      "story": "Large bright lights are hovering in sw sky.  They fade out and reappear in diffrent part of sky.  You can see aircraft lights flying m abo See video..  Had tripod set up.  Was third night in a row these lights appeared.",
      "link": "http://www.nuforc.org/webreports/110/S110594.html",
      "state": "AZ",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c1f56",
      "summary": "Bright orange marble sized fireball/orb.",
      "city": "scottsdale",
      "shape": "egg",
      "date": "2014-06-13T00:00:00",
      "story": "Bright orange marble sized fireball/orb At precisely 7:34 pm, I left my home, and began to walk to a nearby convenient store.  The second I turned, and began to walk down the street, (was walking east), I saw a large fire orange colored object, it basically looked like a giant fireball, or a miniature sun, but was slightly off from a perfect sphere.   I knew immediately it wasn't a plane, a star, or a planet, because of its size and distinct orange hue.  It was about the size of a marble.  I couldn't tell exactly how far away it was, but it appeared to be inside the atmosphere at least, not in space.  It was moving very very slowly, straight down.   I did manage to capture about a minute and a half of it, but on my cellphone the quality isn't great.   I thought it might had been a missile of some sort at the time so I was kind of panicked, and since it was moving down, my camera is shaky for some of the footage because I am walking, so I don't lose sight of it.   The sky wasn't even fully dark at the time so you can tell even in this bad footage that this object shouldn't be there, its just too bright, even on my cellphone camera.   At the end of the footage you can see it begin to blink, it did this several times before shrinking into a much much smaller, yellow sphere.   It still followed its path straight down, until it passed the tree and building line, and I lost sight of it. I wish I had better footage, or more information, but...   That's all I've got.  Oh I also forgot to add the object was dead silent.  Shortly after the event, I saw multiple unmarked planes fly in that direction, not all together, but one at a time, about every 30 seconds to a minute apart.",
      "link": "http://www.nuforc.org/webreports/110/S110090.html",
      "state": "AZ",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c200b",
      "summary": "Orange fireball-glow, North Scottsdale night sky moving in various directions.Bright ball, radiatiing fingers of light, dimmed to dark",
      "city": "scottsdale",
      "shape": "fireball",
      "date": "2014-05-08T00:00:00",
      "story": "Orange fireball-glow, North Scottsdale night sky moving in various directions.  Bright ball, radiatiing fingers of light, dimmed to dark Deep, orange fireball-like glow in sky over North Scottsdale wasn’t a plane and didn’t follow a natural arc or line but rather hovered, then moved south to north, then circled back around and as I pulled over the car and tried to focus and discern what it was it then dimmed substantially, seemingly moved quickly to the north, then circled around and down very quickly as if coming down about 50 feet from me, then up behind my car in a small, dark form.   Scared me so I rolled up my windows, closed my sunroof and drove off.   I sensed something coming down out of the sky and moving toward me.   Very unnerving.- educator, mother, business-owner, alone in car",
      "link": "http://www.nuforc.org/webreports/109/S109122.html",
      "state": "AZ",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c2190",
      "summary": "Bluish/purple light moving horizontally and vertically over East Scottsdale.",
      "city": "scottsdale",
      "shape": "light",
      "date": "2014-04-24T00:00:00",
      "story": "Bluish/purple light moving horizontally and vertically over East Scottsdale. From Scottsdale (Shea and 101 area) facing east-a bluish / light purple light was hovering in the sky about 3 miles out - the light did not flicker, did not blink, did not get brighter or dimmer. The light was moving in a right to left and left to right direction, occasionally moving up and down.  This movement CANNOT be created by an airplane, helicopter, a balloon or even a flare burning out.  This was moving at a casual pace which never really moved more than 5 degrees from my plane of sight. It took about 45 seconds to finally fall behind a tree and then came out of the left side of the tree and started heading down again.  There was a plane heading towards it and you can see the planes lights flashing while the other light did not change. It fell behind the treeline and disappeared.",
      "link": "http://www.nuforc.org/webreports/108/S108818.html",
      "state": "AZ",
      "duration": "45 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c230b",
      "summary": "Crazy bright blue light.",
      "city": "scottsdale",
      "shape": "unknown",
      "date": "2014-04-11T00:00:00",
      "story": "Crazy bright blue light. Bright blue dot flying overhead at shea and 96th st.   Then stopped suddenly and  changed directions and flew erratically overhead before flying away... pretty fun to watch",
      "link": "http://www.nuforc.org/webreports/108/S108455.html",
      "state": "AZ",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c2573",
      "summary": "Large orange glowing ball falls to earth.",
      "city": "scottsdale",
      "shape": "circle",
      "date": "2014-11-06T00:00:00",
      "story": "Large orange glowing ball falls to earth. Large orange glowing ball fell to land.  Three witnesses, none of us have seen anything like this before.",
      "link": "http://www.nuforc.org/webreports/114/S114669.html",
      "state": "AZ",
      "duration": "4 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c25d3",
      "summary": "FAST MOVING MIRRORED GLASS LIKE ORB RIGHT UNDER THE SUN",
      "city": "scottsdale",
      "shape": "circle",
      "date": "2014-11-06T00:00:00",
      "story": "FAST MOVING MIRRORED GLASS LIKE ORB RIGHT UNDER THE SUN. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/114/S114862.html",
      "state": "AZ",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3c2663",
      "summary": "UFOs over Scottsdale, Arizona.",
      "city": "scottsdale",
      "shape": "disk",
      "date": "2014-12-05T00:00:00",
      "story": "UFOs over Scottsdale, Arizona. Every night and early morning there have been ufos ranging from 2-20 over the past four months.  Two neighbors joked saying I was looking at stars until they looked through the binoculars I was using.  A distinct saucer shape with \"knobs\" both on top and bottom can clearly be seen with red, blue and green rotating lights. Also noticable were little white lights darting around the object.",
      "link": "http://www.nuforc.org/webreports/115/S115802.html",
      "state": "AZ",
      "duration": "So far Four Months"
    },
    {
      "_id": "64d005f478aba2ec5a3c2939",
      "summary": "Lights in formation seen over freeway.",
      "city": "scottsdale",
      "shape": "formation",
      "date": "2014-12-05T00:00:00",
      "story": "Lights in formation seen over freeway. I saw 4-5 lights in a straight line hovering over the 101 freeway in Scottsdale.  At first I thought it was helicopters, but then I realized there were no flashing lights.  Then one by one they went straight up into the sky and disappeared.",
      "link": "http://www.nuforc.org/webreports/115/S115760.html",
      "state": "AZ",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c2eac",
      "summary": "Two Orange Balls of Light Over Scottsdale, AZ.",
      "city": "scottsdale",
      "shape": "fireball",
      "date": "2014-08-15T00:00:00",
      "story": "Two Orange Balls of Light Over Scottsdale, AZ My son and his two friends called me excitedly to come look.  We saw two big orange orbs - almost looked like Chinese lanterns, lit up - moving in a Southeasterly direction at a fairly rapid clip -  I went to get my camera and husband, which took me about 15 seconds and by the time I got back, they were almost out of sight, probably over East Mesa.   They were moving side by side and, to me, looked too close together to be aircraft - besides, they were close enough to clearly distinguish that they were round in shape.   Have never seen anything like it!",
      "link": "http://www.nuforc.org/webreports/112/S112317.html",
      "state": "AZ",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c321b",
      "summary": "Seen in Scottsdale Arizona, 3 Bright Yellow Lights in Triangle Formation Hover Low to Ground then fly off together",
      "city": "scottsdale",
      "shape": "light",
      "date": "2015-04-03T00:00:00",
      "story": "Seen in Scottsdale Arizona, 3 Bright Yellow Lights in Triangle Formation Hover Low to Ground then fly off together I observed 3 big bright round lights flying overhead completely silently, hovering in place very low to the ground in a triangle formation from each other.  They hovered for 1-2 minutes then flew up and East while staying in their triangle formation.  That was definitely not an airplane, or helicopter or anything I can identify.",
      "link": "http://www.nuforc.org/webreports/118/S118064.html",
      "state": "AZ",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c3393",
      "summary": "Its shape was outlined from the two lights on the ends and how it covered the stars behind it.",
      "city": "scottsdale",
      "shape": "triangle",
      "date": "2015-03-06T00:00:00",
      "story": "Its shape was outlined from the two lights on the ends and how it covered the stars behind it. Me and my two young sons were leaving on a bike to home.  I was fixing the bike seat so my older of the two sons could ride the younger one home, as I was going to walk besides them.   I looked up and saw two lights floating by, seems close to the ground.  I walked over couple of feet and saw it was a triangle, black, quiet, floating straight north.  I told my boys to look and they started yelling and saying \"what is that?\"  I began yelling to, hoping someone would come out to see it.   The lights were small and white on the ends of the side that was facing us.  I told my youngest to run inside the house to get my nephew to see it.  He tried to run, but fell.  By the time my nephew came out, it went draught into the clouds.   I was excited, but my son's began to shake terriblely.  And one even threw up from being so scared of what we had just seen. It took about 3-4 minutes for it to be a field away from us to get into the clouds about 8 miles away. It was low, no noise. I'm in shock.",
      "link": "http://www.nuforc.org/webreports/117/S117469.html",
      "state": "AZ",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c3445",
      "summary": "Not the Phoenix Lights, but the Scottsdale Lights.",
      "city": "scottsdale",
      "shape": "light",
      "date": "2015-02-20T00:00:00",
      "story": "Not the Phoenix Lights, but the Scottsdale Lights. My journey started near Greenway road and 56th street at around 8pm.  It was dark outside on March 13, 1997.  I needed to head out to CompUSA which was located near Scottsdale Road and Shea Blvd.  I was heading north on 56th street and I made a left on Shea Blvd which had me heading east towards Scottsdale road.  As I was driving east on Shea, when I got to about 60th Place, I noticed a couple lights coming around on the east side of the McDowell mountains on my left.  They were higher the peak of the mountain which is 3,900 feet, my estimate would be somewhere between 5,000 and 8,000 feet. As I drove to about 64th street, I noticed about 4 lights spaced at what I would estimate about a 1 or 2 blocks apart.  My immediate thoughts were these are some military helicopters because the speed they were travel was way to slow compared to airplanes.  Scottsdale Airpark is right in the same area and I’ve seen hundreds of planes coming in and out of that airport and none ever flown in that formation.  And I would not say commercial airplanes because none have every flown in that direction either. I kept looking out to the left out my window and counted about 7 lights now.  All evenly spaces and was in kind of an arch, like the arch of an old fashion bow.  Totally strange to me because I have never seen any lights like this before, so I was excited to think it was a convoy of military helicopters. When I made it to my destination and got out of my car, I looked up and watched the lights come and pass right over me.  2 of the 7 lights went right over my head.  When they went over, I heard ZERO sounds.  Just a light that sputtered and it was completely black around the lights.   I watched as the 3 light went over and in my head, I said this is really strange because I hear NOTHING.  The lights traveled very slowly.  I waited more than 5 minutes in the parking lot for the first light to travel over and then probably 3 to 5 minutes for the second light. I headed into the store and did my shopping.  Never once did I think of it as a UFO.  I used to watch XFiles at that time and didn’t think of taking a picture.  I was thinking they were silent helicopters that ran about a mile or more in length.   After about 20 to 30 minutes in the store, I came out and the lights were gone. It wasn’t for a day or two later when I heard the news and it made me think different about what I saw.  The strange part, these lights were in northeast Scottsdale.  Not southwest Phoenix like the Phoenix lights were reported and known for. This event, these lights are burned into my memory like it was yesterday.",
      "link": "http://www.nuforc.org/webreports/117/S117331.html",
      "state": "AZ",
      "duration": "45"
    },
    {
      "_id": "64d005f478aba2ec5a3c36bb",
      "summary": "Bluish Green diamond shaped coming in at a steep angle towards the earth, then it banked hard right and gained altitude as it headed S.",
      "city": "scottsdale",
      "shape": "diamond",
      "date": "2015-02-12T00:00:00",
      "story": "Bluish Green diamond shaped coming in at a steep angle towards the earth, then it banked hard right and gained altitude as it headed S. Just dropped my Girlfriend off after seeing movie.  Was entering on the 101 Freeway heading south from Shea Rd Exit. At first I though it was a shooting star.  It had a blue/greenish color to it.  It looked like it was going to crash into the indian reservation (Talking Stick Casino) but before it hit, it changed directions and shot across the 101 Freeway toward Phoenix at an AMAZING SPEED and just disappeared as it gained altitude.   Other people on the Freeway saw this too.",
      "link": "http://www.nuforc.org/webreports/117/S117229.html",
      "state": "AZ",
      "duration": "6 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c3802",
      "summary": "Around 7:15 PM, 4 others and I witnessed 2-3 glowing orbs over Mesa/Salt River Reservation in AZ.",
      "city": "scottsdale",
      "shape": "light",
      "date": "2015-01-30T00:00:00",
      "story": "Video taken by a witness:  http://youtu.be/iQ2ht9sxNfk   Around 7:15 PM, 4 others and I witnessed 2-3 glowing orbs over Mesa/Salt River Reservation in Arizona.  As I watched in awe, it looked like energy was charging up and the orb was flashing various colors, then my camera got blurry and the focus stopped working. It almost seemed as if it were some sort of energy like pulse.   The orbs aligned into triangular formations as well as a line.  Previously to starting video there was 4 orbs that moved fast across the sky in a way that I could only say compares  to a star realigning In the sky.  At the end the orbs grew closer and combined into one orb that ended up fading out and slowly grew harder to see.   I don't know what this was, but I have never seen ANYTHING like it before.   In person the light coming off of it was powerful.",
      "link": "http://www.nuforc.org/webreports/117/S117038.html",
      "state": "AZ",
      "duration": "30-35 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c3df1",
      "summary": "I saw 10 objects in the eastern sky with white and red blinking lights and they are not airplanes. They move back and forth.",
      "city": "scottsdale",
      "shape": "other",
      "date": "2015-07-10T00:00:00",
      "story": "i saw 10 objects in the eastern sky with white and red blinking lights and they are not airplanes.  They move back and forth. very creepy.",
      "link": "http://www.nuforc.org/webreports/120/S120264.html",
      "state": "AZ",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c45ad",
      "summary": "I looked up at a very bright shining circle objects.  ((NUFORC Note:  Possible sighting of planets?  PD))",
      "city": "scottsdale",
      "shape": "circle",
      "date": "2015-11-26T00:00:00",
      "story": "I was working graveyard shift at Tatum and Deer Valley I was on my lunch break at 3 a.m. and off of our three story balcony when I was smoking a cigarette I looked up at a very bright shining circle objects at first I thought it might be a star or a planet from far away I realized after recording the video on my phone that it's definitely not when I worked the next day at the same location there is no I like to be found it was pulsating also I have been trying to upload the video for social media but its too large. ((NUFORC Note:  Possible sighting of planets, we suspect?  PD))",
      "link": "http://www.nuforc.org/webreports/124/S124273.html",
      "state": "AZ",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3c47ee",
      "summary": "Two shiny orbs east Scottsdale, AZ.",
      "city": "scottsdale",
      "shape": "circle",
      "date": "2015-11-06T00:00:00",
      "story": "Two shiny orbs east Scottsdale, AZ. I'm at work and I see 2 bright shiny orbs over Scottsdale and they slowly headed east over the mountains.  Before they started moving, they stayed close to central and Bethany for a short period, and then took off towards Scottsdale. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/123/S123337.html",
      "state": "AZ",
      "duration": "45 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c4b41",
      "summary": "I saw a what appeared to be a  very bright star but was too big  and too round low in eastern sky.had circles inside circles under zoom",
      "city": "scottsdale",
      "shape": "circle",
      "date": "2015-09-25T00:00:00",
      "story": "I saw a what appeared to be a  very bright star but was too big  and too round low in eastern sky.had circles inside circles under zoom At about  4:30 am I witnessed what seemed to be a really bright star looking toward the eastern sky just a little ways above the Mcdowell  mtns.  It was way too bright and too perfectly  round to be a star, so I  got my digital camera with a 36x digital zoom lens and when I zoomed I was completely startled.  It took a little time for me to remember how to use the zoom and get the camera to work correctly as I was seeing on the camera screen what resembled a sort of bright perfectly round object with concentric circles getting smaller as you go towards the center and a solid dot in the middle of this object.  Which by the  way was still shining bright into the morning light while all other stars had disappeared from sight.  There also appeared to be a smaller object that appeared to be spinning with light emitting from it as it  stood out because it was kind of black and it was in different positions  inside the outside edge and in some shots it didn’t appear at all.  I shot  pics for over an hour until my battery ran out and it was day light.  I went inside for another battery and it was gone when I came out.",
      "link": "http://www.nuforc.org/webreports/122/S122215.html",
      "state": "AZ",
      "duration": "2.5 hours"
    },
    {
      "_id": "64d005f478aba2ec5a3c4f17",
      "summary": "Unusually shaped object flying over North Scottsdale.",
      "city": "scottsdale",
      "shape": "other",
      "date": "2016-03-18T00:00:00",
      "story": "Unusually shaped object flying over North Scottsdale. North Scottsdale, Arizona.  My wife and I had been observing the night sky and noticed something strange.  The object was flying from South to North.  We observed the object for about 20 seconds as we watched from the central courtyard of our house; the house prevented us from viewing any longer. I’ve seen the international space station fly over before and this was most definitely not the same viewing experience. This object seemed to be in the normal flight path, however, no visible navigation lights and the object was dimly lit, almost bluish.  It was cauliflower shaped and seemed to be tumbling end over end. Approximate altitude was 10-12,000 feet. My wife and I have over 60 years of combined (military and civilian) aviation experience and have not seen anything like this before.",
      "link": "http://www.nuforc.org/webreports/126/S126390.html",
      "state": "AZ",
      "duration": "20 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c505e",
      "summary": "4 lights seen in a formation.",
      "city": "scottsdale",
      "shape": "formation",
      "date": "2016-03-04T00:00:00",
      "story": "4 lights seen in a formation. The object was in a triangle light formation with an additional light on the side.  The formation did not move for the duration I observed.  There were four bright circular lights, and they were relatively close together.  I first noticed the lights after exiting the 101 and going down Frank Lloyd Wright.  My mom pulled over into a residential area to take pictures.  I've been watching the skies, and keeping track of anything out of the ordinary.  Last year on March 4, 2015, a single light was hovering in the same spot for 45 minutes.  I am unsure about the correlation between this incident and the previous one from last year, but I couldn't disregard the possible connection due to the fact that it was around the same date and time.",
      "link": "http://www.nuforc.org/webreports/126/S126157.html",
      "state": "AZ",
      "duration": "7 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c5060",
      "summary": "5 lights seen traveling over Scottsdale/North Mesa area in uniform fashion.",
      "city": "scottsdale",
      "shape": "light",
      "date": "2016-03-04T00:00:00",
      "story": "5 lights seen traveling over Scottsdale/ North Mesa area in uniform fashion. I was driving south on 101 Scottsdale toward Chandler.  Just before the Raintree exit, 5 light all in a row, travel from west of Scottsdale towards the east over the freeway (toward Fountain Hills).  They are evenly spaced without blinking lights, just white/pale yellow in color.   The lights move in a unified direction headed south very slowly, over Talking Stick resort area.  At moments they are still as if they are \"hovering\" in the sky.  I could see a helicopter around the lights and could tell the difference.  The helicopter had blinking red and blue lights were as the other lights did not.   The lights move south toward North Mesa, where I called a friend and he was at Gilbert Road and University.  He stated he could see lights hovering above him, but since he was looking up, he only saw 3 not 5.  He also stated that there wasn't any blinking lights like a helicopter. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/126/S126165.html",
      "state": "AZ",
      "duration": "25 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c5325",
      "summary": "Bright white lights and lots of helicopters.",
      "city": "scottsdale",
      "shape": "light",
      "date": "2016-01-20T00:00:00",
      "story": "Bright white lights and lots of helicopters Two very white bright lights were hovering over the city and/or native reservation.  There were so many helicopters out, I would say probably seven roaming around.  I described another similar incident that happened on January 6, 2016, that is more detailed.",
      "link": "http://www.nuforc.org/webreports/125/S125358.html",
      "state": "AZ",
      "duration": "unknown"
    },
    {
      "_id": "64d005f478aba2ec5a3c53bc",
      "summary": "Star-like object in SE sky over Reservation with distinct multi-colored lights.  ((NUFORC Note:  Sighting of the star, Sirius.  PD))",
      "city": "scottsdale",
      "shape": "light",
      "date": "2016-01-05T00:00:00",
      "story": "Star-like object in southeast sky over Reservation with distinct multi-colored lights. ((NUFORC Note:  Sighting of the star, Sirius.  PD))   Both yesterday (12/31/15) and tonight (1/1/16) we have seen a star-like object in the southeast sky as we went on a walk.  It caught my attention because it looks larger that a normal star and was twinkling different colors - blue, green, white, and red.  It behaved like the star as it moved higher in the sky as the night went on. I lost interest as I thought it must have been just a star.   Tonight I went for a walk with my parents and saw it again.  I pointed it out and they thought it was very strange. My whole family lived hear O'Hare in Chicago for a majority of our lives making us used to aircraft. We got out the binoculars and four of us (me, my parents, my boyfriend) viewed it through the binoculars all seeing the same thing - distinct red, blue, green, white lights - my dad said it reminded him of LEDs because they were so vivid and distinct. I could also see the halo around the object changing color with the object. My parents said they've never seen an! ything like it. It was higher than the planes that had taken off from the PHX airport (south, southwest of where we are, which flew below within the same view).  This is near 101 off Indian Bend Road. I am visiting my parents from Chicago. They said it is over the Native Amer Reservation east of Scottdale. I would like to know if this could be disproven, but everything man-made that flies doesn't really fit. Also, it doesn't fit as a star considering the distinct lighting. I also have video, but it's so grainy and it only looks like a star. Please let me know if anyone has an idea or if you would like video.",
      "link": "http://www.nuforc.org/webreports/125/S125029.html",
      "state": "AZ",
      "duration": "60 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c53e6",
      "summary": "Three bright lights in a triangle formation low on the horizon; disappearing and reappearing as well as traveling.",
      "city": "scottsdale",
      "shape": "changing",
      "date": "2016-01-08T00:00:00",
      "story": "Three bright lights in a triangle formation low on the horizon; disappearing and reappearing as well as traveling. ((male name deleted)) and 110th st.  Scottsdale, AZ, higher than the rest of the valley 7:30-8:30pm  I stepped outside to see three large bright lights in the sky in a triangle formation.  I was driving but every time I looked they had rotated while staying in a triangle.  If you had a full moon and put a point on the top and sides of a full moon, I would say this is how far they were from one another.  By the time I pulled over there was only one light left; I told my boyfriend I wasn’t going anywhere until this light disappeared.  It was not above me in the sky, but south of me low on the horizon. Another bright light reappeared nearby the other.  One left its location and slowly crossed the sky.  It decreased in brightness and traveled east to west.  If you split the sky in 18 sections, it would cross one of these in a little less than a minute.  Planes flew by but were fast and not nearly as bright as even the traveling UFO.  The light they emitted was pure white.  When they traveled they usually got dimmer.  I took off my glasses and the only light I could see in the sky, including stars, were these lights. We starred at them freaking out with excitement for an hour.  They would occasionally disappear and reappear in a nearby location.  My boyfriend and I argued of what he thought was a plane at about 8 o’clock.  It had two very dim white lights flashing very close in proximity and moved faster than the UFO’s before.  I convinced him that it was a UFO because the lights were not consistent in spacing.  They also would fly back and forth from east to west. Also I do not know if it was just me because I was wearing glasses, but they individually appeared to be elongated vertically.  The light looked like it came to a small point and expanded to the rest of the light. It was very subtle, but he said he could kind of see it too. We ended up leaving before they were gone.  At midnight I was back on the road and I could see one bright UFO.  A couple minutes passed and it was gone; I didn’t see anything else this night.",
      "link": "http://www.nuforc.org/webreports/125/S125163.html",
      "state": "AZ",
      "duration": ">1 hour"
    },
    {
      "_id": "64d005f478aba2ec5a3c5530",
      "summary": "Very fast, noiseless bright lit lights.",
      "city": "scottsdale",
      "shape": "unknown",
      "date": "2015-12-04T00:00:00",
      "story": "Very fast, noiseless bright lit lights. Watching the clear evening sky, into my vision came a very fast, noiseless moving object.  There was a red light and a white light.  I was sure it was a jet, but too low to not have a noise associated with it.   Moving from east to west, as it moved from my vision, only bright white light was still showing. ((NUFORC Note:  Witness elects to remain totally anonymous.  Possible hoax??  PD))",
      "link": "http://www.nuforc.org/webreports/124/S124496.html",
      "state": "AZ",
      "duration": "20-30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c58f9",
      "summary": "A shadow moving across mountain peaks which cause could not be determined.",
      "city": "scottsdale",
      "shape": "other",
      "date": "2016-06-01T00:00:00",
      "story": "A shadow moving across mountain peaks which cause could not be determined. At about 11:43 on Sunday, May 29, 2016, I observed the following.  There were no clouds from horizon to horizon in any given direction.  The temperature was in the low nineties.  I was in a patrol vehicle at my place of employment traveling in a northern direction and drifting slightly east.  To the north west of my locating about a half a mile away there are some small peaks that are maybe a thousand feet higher in elevation than my location.   These peaks are strung out east to west. I glance at the peaks and saw a round dark shadow that followed the surface contour of the landscape moping from east to west.  I only saw it for a couple of seconds before it passed the most western peak. What was strange about it was that the sun at that time in the morning is almost straight up and the peaks are very close to my location.  I immediately stopped (less than five seconds) and got out of the vehicle looking for an object that may have caused the round shadow, but there was nothing to be seen anywhere in the sky in my general location. There was nothing between the sun and those peaks.  There was nothing moving out of the area heading west as far as the eye could see.  Many miles to the west (about twenty miles) I could see Sky Harbor International traffic along the I-17 corridor flying from north to south, but those shadows would be cast further to the west.  I had seen shadows before across those peaks caused by aircraft but they moved slower and had the definite shape of an aircraft.  This was round and moving very fast.  I estimate the size of the shadow to have been about sixty to eighty feet in diameter. End of Report",
      "link": "http://www.nuforc.org/webreports/127/S127575.html",
      "state": "AZ",
      "duration": "2-4 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c5900",
      "summary": "Flash of light in the sky followed by a boom, followed by smoke trails that appear in uneven circles. ((NUFORC Note:  Meteor?  PD))",
      "city": "scottsdale",
      "shape": "flash",
      "date": "2016-06-03T00:00:00",
      "story": "Flash of light in the sky followed by a boom, followed by smoke trails that appear in uneven circles. At 3:56am a very bright flash of light was seen in the eastern sky over scottsdale.  Around 5 minutes later a loud bang was heard as if someone was slamming the door inside a house.  I witnessed this inside and the other witness was outside for the noise.  As the sun came up around 4:50am colorful trails that were in uneven circles were seen in the sky.   After checking several outdoor security cameras the light was seen.  Pictures have been taken of the flash and the colorful trails in the sky. ((NUFORC Note:  Object reported by the news as a probable meteor.  We agree.  See photos of smoky trail left high in the sky above Arizona.  PD))",
      "link": "http://www.nuforc.org/webreports/127/S127645.html",
      "state": "AZ",
      "duration": "1 second"
    },
    {
      "_id": "64d005f478aba2ec5a3c5e49",
      "summary": "Upon stepping out to the back yard this evening, I noticed 3 large, orange fireball type objects low in the north sky.",
      "city": "scottsdale",
      "shape": "fireball",
      "date": "2016-11-11T00:00:00",
      "story": "Upon stepping out to the back yard this evening, I noticed 3 large, orange fireball type objects low in the north sky.  These objects were stacked in a vertical fashion in no measured formation with a vector towards the vertical.  These objects appeared to move rather slowly.  The size of each object to be roughly a third the size of a full moon.  No sound included in this sighting.  These objects moved to the vertical to about 60 degrees vertical before the light appeared to suddenly dim, then continued to vertical over head.  A large very dim/muted object three times the size of each individual \"fireball\" appeared to travel west, southwest orbitally.",
      "link": "http://www.nuforc.org/webreports/131/S131045.html",
      "state": "AZ",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c6b2f",
      "summary": "Huge fire orange objects over Phoenix.",
      "city": "scottsdale",
      "shape": "triangle",
      "date": "2017-02-03T00:00:00",
      "story": "Huge fire orange objects over Phoenix. Leaving our house in the mountains of Scottsdale with a view of the city, my wife said oh my god what is that?  There were three huge diamond shaped lights in the sky that were fire orange.  They had two smaller white lights flanking the side.   They suddenly changed formation and disappeared.    They were 10x the size of commercial jets landing at Sky Harbor which we have a view of.   Oddly enough, my office is by the Scottsdale Airport and there were many (f18’s – not exactly sure) on the tarmac all week, which is odd because there are very few military planes there ever (I have worked close to that airport for over 20 years and have only seen military aircraft for air-shows.) ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/132/S132349.html",
      "state": "AZ",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c70b9",
      "summary": "Dark & Light Circular Objects Raced Across the Sky.",
      "city": "scottsdale",
      "shape": "disk",
      "date": "2017-08-11T00:00:00",
      "story": "Dark & Light Circular Objects Raced Across the Sky Looking in the west direction, black object moved across the sky from south to north moving very fast (arms length cover 5 sec) time.  Object was much higher then commercial airline due to seeing commercial airline moving north to west direction.   Object stopped on a dime then shot straight up no longer in view.  The black disk shaped object had no markings, no lights, no noise and very big.  The size of this object was about 5-6 Boeing 747 in diameter at 80 degrees from my position of view.   Seconds later another large object (white) at the same altitude as the black object moved north to where the black object shot straight up and lost view. The white object was saucer in shape much lighter in color then the first object, also at 80 degrees of view. The white object was moving very fast, (half of arms length covered 2.5 seconds +-)  The white object had no markings, no light, no noise).  Location view Mayo Clinic Shea Blvd facing west, it was truely amazing thing to see, my only regret was that I didn't have time to record or take pictures with cellphone.",
      "link": "http://www.nuforc.org/webreports/135/S135647.html",
      "state": "AZ",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c750a",
      "summary": "Bright white light.",
      "city": "scottsdale",
      "shape": "unknown",
      "date": "2017-05-06T00:00:00",
      "story": "bright white light Like many nights, I'm watching the sky.  I noticed something out of the corner of my eye, and when I turned to look, I saw a very bright light and it went out.  It came on again within 2 seconds.  I didn't think much of it since it was in a high flight path for airlines.   In between the light flashes, the object didn't move much more the a passenger plane would have moved, it flashed one more time and I never saw any lights again, it just disappeared.   I noticed there were no other navigation lights.  No red or green nor a flashing white. this flight path was west to east and would have to be 10 to 30 thousand feet.  No contrail was observed.  No sound heard. I would describe the light as very bright like a helicopter landing light.  The light was to my south and between 75 to 80 degrees, almost overhead. Within about 1 minute there was a plane making an east to west pass almost on a reciprocal course and altitude, all lights were visible, you could hear it, there was no comparison between the two. I spent 2 years active duty in the navy.  I was trained in lookout techniques, and was a radar operator in the combat information center for most of my service.",
      "link": "http://www.nuforc.org/webreports/133/S133947.html",
      "state": "AZ",
      "duration": "5-10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c77f5",
      "summary": "Me and my mother were looking outside at the night sky. After a few moments we saw a plane off in the distance. Then at least 20 minute",
      "city": "scottsdale",
      "shape": "teardrop",
      "date": "2017-12-04T00:00:00",
      "story": "Me and my mother were looking outside at the night sky.  After a few moments we saw a plane off in the distance.  Then at least 20 minutes went by then, they were two headlight looking objects flying at least 50 ft off the ground.   Once we were clearly in sight of the object, the lights went out.  There were a lot of stars out so once the headlights went out we could see the outline of it.   The shape of it was a triangle you with curves.",
      "link": "http://www.nuforc.org/webreports/137/S137398.html",
      "state": "AZ",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c7d9b",
      "summary": "Hovering and then fast moving object, Scottsdale, AZ.",
      "city": "scottsdale",
      "shape": "other",
      "date": "2018-06-07T00:00:00",
      "story": "Hovering and then fast moving object, Scottsdale, AZ. Hovering bright red light in southwest sky then extremely fast moving south to north.  Moving in a very straight, smooth line north.  Oval shape with tail that had a green light.   This happened south of Camelback and Hayden Roads and moved very fast north.  Color may have been light blue or gray.",
      "link": "http://www.nuforc.org/webreports/141/S141763.html",
      "state": "AZ",
      "duration": "1:00 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c7fb6",
      "summary": "Bright light in sky, slowly increase elevation and then faded. Second night in a row.",
      "city": "scottsdale",
      "shape": "light",
      "date": "2018-04-19T00:00:00",
      "story": "Bright light in sky, slowly increase elevation and then faded. Second night in a row. I am a semi-retired finance professional with an advanced degree.  I rarely drink and do not do any drugs.  I am also an amateur astronomer with a small scope, and because the airport is fairly close, a plane watcher with binocs on the outside table at all times.  The point is that I am intelligent, sober, rational, skeptical, and I can recognize planes, man-made satellites (have seen 3), and stars/planets.  What I saw was not one of these. On 4/12, at 10:30 PM, took dogs outside for the normal business.  As usual I looked at the stars.  Visibility was good – a bit hazy at about 20 degrees and below from a dust storm earlier in the day but generally clear directly overhead with major constellations visible.   Saw a bright flash (about as bright as landing lights turning on but much farther away and not in the flight pattern) due west at about a 70 degree elevation.  The light was flashing at 15 second intervals (I measured it) which is too infrequent even for a plane at cruising altitude.  It was moving south for about 3 minutes but moving too slow for an aircraft and much much too slow for a satellite.  It also did not seem to be moving in a straight line (somewhat difficult to tell due to infrequency of flashes).  Over this time the light gradually dimmed and took-on a slight reddish hue before it became too dim to see. On 4/13 at 8:30 PM went outside for some fresh air.  Looked up and saw the identical scene with these changes:  I did not see initial flash and the direction was south/southeast.  The sky was much clearer tonight. Also, about 8 weeks ago I was up very early 3:00AM to catch a flight.  Outside with the dogs.  Looked up and saw a moving, steady light (no flashing or colored lights) about the size and magnitude of a typical star.  It was moving slower than satellites I have seen before, and seemed much too high for an aircraft (my first thought was that it was a private jet a high altitude).  The light moved straight south covering about a 20 degree arc and then quickly faded at about Orion’s shoulders. The third sighting in the list very well could have been a satellite, but the other two were definitely neither planes, satellites, nor meteorites.",
      "link": "http://www.nuforc.org/webreports/139/S139443.html",
      "state": "AZ",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c7fc5",
      "summary": "Object sighted, triangular shaped with curved magenta bottom.  Lights moved sequentially from left to right bluish-white with magenta .",
      "city": "scottsdale",
      "shape": "other",
      "date": "2018-04-19T00:00:00",
      "story": "Object sighted, triangular shaped with curved magenta bottom.  Lights moved sequentially from left to right bluish-white with magenta . Scottsdale, AZ 85260 - Near Shea Boulevard and 101 Loop (Highway).                    Approximately 8:30 pm Saturday, April 14th, 2018. At approximately 8:30 pm Saturday, April 14th, 2018 I arrived at my home, parked my car and stepped to the backyard. I am in a neighborhood that is dark, does not have streetlights and the properties are all close to 1 acre plus in size, the night is clear, still has some suspended dust particles in the lower atmosphere/sky that can affect the color like a filter. I unplugged the lights that illuminate a Paolo Verde tree in my backyard.  I looked to the South West and saw the “Belt of Orion” the significantly identifiable constellation that I recall my children always pointing out to me.  I was alone and enjoying the dark sky and the stars straight up and to the north. After seeing the “North Star” as directed by the “Big Dipper’s” outer ladle stars I turned back to view towards the South East and saw a magenta colored object with sequential lights, like a 1970 Ford Thunderbird with its right turn signal on, observed rolling from my left to right moving at a steady swift speed in a Southern and lower trajectory; maybe below 10,000 to 15,000 feet. The object seemed to stay on the same altitude in my field of vision. The lights were red and then bright white and the background of the lights lit up in magenta (magenta, somewhere midway between blue and red); it was very pretty and very different.  The lights where arranged in similarity to a shallow bowl, curving upwards and at an apex point above there was a point that was not lit but visible with some opaque connection from the curved lit zone upward to that apex point. The sequential movement of the light created a visual image that made the object seem to be spinning, however it was very quick and this was unlike anything I have seen in the sky before. I witnessed the sighting for about 5 to 10 seconds, then ran into my house and gathered my binoculars which were very close to the screen door to view.  I was excited to view the same outline however, the sequential movement of the lights changed to an “all on” or all illuminated pattern but, the apex point (at the top of the curved bowl shape) and the outline of a structure was more evident. I quickly went back into my house to grab my camera that can zoom and potentially capture an image.  At first because the screen is very small and aligning the camera in the night with a moving object in the sky I didn’t think I captured the image. However, I do have something on the camera. It is very small and only visible for about less than 1.5 seconds.  The camera shows a more blue in color but, I do not have a good way to review the video yet.  On the counter between 6 and 8 seconds, the small spot in the field of view on the top half of the screen shows, what I believe is the moving object described above.  It is very quick and very poor, the larger light was unfortunately one of my solar powered lawn lights.  I am willing to share the video, the sighting in the video is on the higher side of the field of view than the garden light I ended up targeting instead for the remainder of the shoot.",
      "link": "http://www.nuforc.org/webreports/139/S139451.html",
      "state": "AZ",
      "duration": "45 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c842b",
      "summary": "I was driving hone and when I got off the 101 at Hayden road in north Scottsdale I saw a bunch of smaller crafts hovering in the sky wi",
      "city": "scottsdale",
      "shape": "triangle",
      "date": "2018-10-18T00:00:00",
      "story": "I was driving home, and when I got off the 101 at Hayden road in north Scottsdale, I saw a bunch of smaller crafts hovering in the sky with flashing lights; I counted 10.   They were moving too quickly to be planes, and I saw one get lower and lower to the ground and then just disappear.",
      "link": "http://www.nuforc.org/webreports/143/S143522.html",
      "state": "AZ",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c843f",
      "summary": "Object is visible in sky in burst of flashing light disappearing and appearing intermittently",
      "city": "scottsdale",
      "shape": "light",
      "date": "2018-10-12T00:00:00",
      "story": "Object is visible in sky in burst of flashing light disappearing and appearing intermittently In the video there is a flashing light in the sky that appears and disappears repeatedly.  By eye the objects appears to have an aura or haze around it.  I have seen these frequently by naked eye and cannot seem to identify what it could be.",
      "link": "http://www.nuforc.org/webreports/143/S143446.html",
      "state": "AZ",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c86ed",
      "summary": "Numerous objects (6+) moving in various directions being pursued by military crafts it appeared, nighttime above Scottsdale, AZ.",
      "city": "scottsdale",
      "shape": "changing",
      "date": "2018-08-10T00:00:00",
      "story": "Numerous objects (6+) moving in various directions being pursued by military crafts it appeared, nighttime above Scottsdale, AZ. 1450ft above sea level. Viewed from 33°36’48” N x 111°52’35 W Viewed with a naked eye  Numerous unidentified “aircraft” shaped objects above North Scottsdale, Sunday, August 5th, 2018, at 8:48 p.m. The initial object was a solid bright orange, not flashing, then the orange disappeared and was replaced by what appeared to be all dark with a spotlight being adjusted.  This object was moving NE to SW, then changed direction and moved W, it flew at increased and decreased pitch like a greater-than-less-than symbol. Several airplanes appeared shortly after and began flying towards the object, at which point three additional objects that appeared to look like Military Drones, as they were torpedo-shaped but with large bat or seagull shaped wings.  As it was dark outside, I determined shape by looking at the cast of the light.  Eventually a fourth object that was solely a golden Naples-yellow color appeared where previously I had identified Venus as being with the use of the SkyView Application, as if the lights were just turned on, and then the object began traveling quite slowly North to South. All of the objects with the exception of the identifiable aircraft were silent, and no wind sheer could be heard.  The initial object appeared to be around 15,000 feet high, while the other objects appeared to be above the 38,000ft altitude most commercial aircraft fly at. Then at 9:35pm what initially appeared to be a military aircraft, silently jettisoned across the sky very quickly, North to South, before eventually turning and heading East also seen from Scottsdale.  Though initially it appeared to be a military jet with traditional lighting for perhaps a Stealth plane or an F18 Hornet, then the lights suddenly vanished and a golden light overtook the silhouette of the aircraft and instead of traveling East it made a full loop very quickly as if traveling faster than anything I’d ever seen before, at which point a loud guttural sound was heard, perhaps it was an antique military craft, but all observations do not support that theory.  Throughout the totality of the event a plethora of sounds could be heard from airplane, to jet sounds, to sounds similar to motor boats, as well as sounds similar to Electronic music synthesizers. The initial observer and his fiancée  are a 34 year old man and a 33 year old woman ,residents of Scottsdale, who is originally from Chicago and recently moved to Arizona in 2017, initially moving to Wickenburg before moving to Scottsdale on 1/118.  The man is a graduate of Columbia College Chicago and has a degree in Art History and has a passion for art, fashion, photography, wildlife, poetry, literature, history, Geology, Lapidary, Nature, and Politics.  The woman studied Pre-Med at Northwestern University Chicago and received an additional degree in Creative Non-fiction from Pitzer College, California, she top shares many of the same interests, and they both work in high fashion retail management. The third observer is an Arizona native, 35 years old, with a history of drug abuse and extensive criminal background, the fourth observer is also an Arizona Native who works in Engineering and Refrigeration, lives in Scottsdale and enjoys off-roading.  He is 39 years of age.",
      "link": "http://www.nuforc.org/webreports/142/S142576.html",
      "state": "AZ",
      "duration": ">1 hour"
    },
    {
      "_id": "64d005f478aba2ec5a3c8849",
      "summary": "2 blue lights in the Sky East of Phoenix July 3, 2018.  ((anonymous report))",
      "city": "scottsdale",
      "shape": "light",
      "date": "2018-07-05T00:00:00",
      "story": "2 blue lights in the Sky East of Phoenix July 3, 2018 Two Blue lights appearing in the low sky East of phoenix (From Scottsdale they were in the direction of Mesa).  Both lights blinked and moved around each other in a circular pattern.   They remained in that general direction for 1.5 hours.  They appeared to have bursts of light a couple times. They were pointed out to us by a neighbor.  We had company at our house and we all went outside to witness.  We took photos and a video. ((NUFORC Note:  Witness elects to remain totally anonymous; provides little contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/142/S142055.html",
      "state": "AZ",
      "duration": "1.45 hours"
    },
    {
      "_id": "64d005f478aba2ec5a3c8ff6",
      "summary": "There was a light moving intermittently in the sky with a hazy aura surrounding it.",
      "city": "scottsdale",
      "shape": "light",
      "date": "2018-11-24T00:00:00",
      "story": "There was a light moving intermittently in the sky with a hazy aura surrounding it. We went outside on the patio and noticed a light in the sky, making erratic movements intermittently.  There was some kind of hazy aura around the object.  It appeared to be low in the sky and then disappeared.   We live very close to Scottsdale Airpark and see planes in the flight path daily.  There were other planes flying to and from the airpark when we noticed this object, which was very different from the planes flying last night and during other times we have seen them.   It was very obviously not an airplane but we have no other idea what it could have been. ((NUFORC Note:  We spoke with both witnesses to the event, husband and wife, and we found them both to be quite eloquent and sober-minded.  We suspect that they are highly reliable witnesses.  PD))",
      "link": "http://www.nuforc.org/webreports/143/S143873.html",
      "state": "AZ",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c928d",
      "summary": "a red light in the night sky with a slow blinking white light",
      "city": "scottsdale",
      "shape": "unknown",
      "date": "2019-12-01T00:00:00",
      "story": "a red light in the night sky with a slow blinking white light tonight i was walking around my apartment complex for while considering how nice out it is. on the way to the mailbox area, I saw a red light in the sky, and it had a slowly blinking white light. it was flying either downwards or farther away, I couldnt tell. it couldnt have been a plane since there was no noise of it flying. i tried to capture it with video footage on my windows phone, but i dont think anything showed up. this was about 20 to 30 minutes ago.",
      "link": "http://www.nuforc.org/webreports/150/S150276.html",
      "state": "AZ",
      "duration": "20-30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c952b",
      "summary": "Solid bright red light (thought it was a small plane) moving SE the speed of small plane from above North Scottsdale. Red glow turned t",
      "city": "scottsdale",
      "shape": "light",
      "date": "2019-12-01T00:00:00",
      "story": "Solid bright red light (thought it was a small plane) moving SE the speed of small plane from above North Scottsdale.  Red glow turned to orange and grew 4X in size as it brightened and slowed down to near stop.  Slowly turned to NE direction changed from orange to white and slowly faded out.  Approximate time laps 2-3 minutes.  Not sure if it was a flare.  No other aircraft close in proximity were visible.",
      "link": "http://www.nuforc.org/webreports/150/S150689.html",
      "state": "AZ",
      "duration": "2-3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c97cd",
      "summary": "3 lights above McDowell mountains, changing colors rapidly.",
      "city": "scottsdale",
      "shape": "light",
      "date": "2019-12-01T00:00:00",
      "story": "3 lights above McDowell mountains, changing colors rapidly. Have a really unique view of the McDowell mountains, on Mummy Mountain, up on the mountain, around 1600 ft of elevation. Was looking towards the McDowells, which would be directly Northeast of my view. Looked up and immediately was entranced by 3 very bright and large lights in the sky. Airplanes flying near so I could distinguish between a airplane as plane lights blink but these were not blinking.  My glasses weren’t on so they looked blurry, but they also were colorful and rapidly changing light colors.  I grabbed some binoculars and looked through, the light would change rapidly from yellow, green, red, blue, etc.  The lights were stationary for a couple minutes, maybe 2-3 minutes.  Soon they all started moving slowly to the south together, with the lights forming in a triangular formation.  They would move and rotate with one another, as if the 3 lights were a point of an invisible triangle rotating in the sky. They all faded out and disappeared after 5 minutes or so.  Had my wife look at the lights and she immediately noticed their colors changing as well.",
      "link": "http://www.nuforc.org/webreports/151/S151042.html",
      "state": "AZ",
      "duration": "7 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c98c5",
      "summary": "6 Silver Irregular Flying Objects Zig-Zagging Over Scottsdale, AZ",
      "city": "scottsdale",
      "shape": "teardrop",
      "date": "2019-10-04T00:00:00",
      "story": "6 Silver Irregular Flying Objects Zig-Zagging Over Scottsdale, AZ There were 6 silver objects flying off in the distance in zig zags and other particular patterns that no regular aircraft could do. I was able to get pictures of these 6 flying objects and it shows the shape of them and edge of the craft.  The moon was able to beam off of the flying objects which is why they where easy to spot.  The flying objects looked to be in a specific tear drop or almost circular pattern.",
      "link": "http://www.nuforc.org/webreports/149/S149001.html",
      "state": "AZ",
      "duration": "10 minutes"
    }
  ]
}