{
  "city": "shreveport",
  "fetch_timestamp": "2025-07-12T14:36:41.514854",
  "record_count": 27,
  "pages_fetched": 1,
  "api_calls": 2,
  "source": "ufo_aficionado_api",
  "records": [
    {
      "_id": "64d005f478aba2ec5a3b431c",
      "summary": "A big triangle of light.",
      "city": "shreveport",
      "shape": "light",
      "date": "2006-05-15T00:00:00",
      "story": "A big triangle of light. When I with my parents on a trip we were in th midle of nowere and I saw a light that was triangle shaped moving about 80 mph 60 feet to my corner and made no sound.",
      "link": "http://www.nuforc.org/webreports/049/S49604.html",
      "state": "LA",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b45fd",
      "summary": "White / Orange Orbs In Triangle Formation Shreveport, La",
      "city": "shreveport",
      "shape": "triangle",
      "date": "2019-08-23T00:00:00",
      "story": "White / Orange Orbs In Triangle Formation Shreveport, La UFO Sighting -  Date - July 31, 2019  Time - 8-9pm CST hour  Location - Shreveport, Louisiana  # Of Sightings Experienced - 1, second hand  # of Persons Involved / Witnesses (number of those present, not their names) - Two (brother, neighbor)  Description of events leading to, during and post sighting - Asked my brother on 8/1 if he'd ever seen a UFO and he laughed and said \"Last night\" and that he'd gotten a photo of it on his phone.  He explained that it was three lights in the sky.  I interjected, \"triangle shaped?\" and he nodded, agreeing. He said he and his friend (a neighbor at the end of the drive) were outside talking last night and saw this formation of three lights. The neighbor is the one who'd taken the photo with his cellphone (don't know what kind). It remained in place for awhile and then vanished.    Neighbor forwarded the photo to my brother's phone and it was accidentally deleted. He texted the neighbor with my number and asked if he'd forward the photo to me. Neighbor did so. Description of UFO/UAP - Three bright white orb lights or glowing orbs hovering not too high over the condos across from neighbor's.  Remained in the sky for an unknown amount of time before they noticed it.  Vanished = one second it was there, the next it wasn't.     No further details. Photos / Video - [Imgur](https://i.imgur.com/FjDx5sX.jpg)",
      "link": "http://www.nuforc.org/webreports/148/S148097.html",
      "state": "LA",
      "duration": "1 hour"
    },
    {
      "_id": "64d005f478aba2ec5a3b5b4a",
      "summary": "A green light in the sky...",
      "city": "shreveport",
      "shape": "teardrop",
      "date": "2007-08-07T00:00:00",
      "story": "A green light in the sky... I am a 31 year old father of 2. I was outside smoking a cigarette. I happen to gaze up in the sky towards my neighbors house when I saw a bright, neon green light shoot across the sky at a rapid rate. My first thought was that it may have been a spotlight because we have casinos near by. I noticed that there was no light trail to the ground and that the object seemed to be BEHIND the thin layer of clouds. I looked for it to loop back in case it was a spotlight, but nothing ever came. I stayed out looking for it to come back or ANYTHING, but nothing ever came. There was NO NOISE to suggest it was a plane or any type of aircraft. It flew in the general direction of the air force base.",
      "link": "http://www.nuforc.org/webreports/057/S57059.html",
      "state": "LA",
      "duration": "a few seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b6985",
      "summary": "Multiple-type UFOs are witnessed multiple times, in multiple states, near U.S.A.F. bases in LA and CO.",
      "city": "shreveport",
      "shape": "oval",
      "date": "2007-06-12T00:00:00",
      "story": "((NUFORC Note:  Source of report describes self as an \"M.D..\"  We do not know the precise dates of the alleged incidents, described below, and find it unusual that NUFORC has not received reports about the alleged sightings before now.  PD)) Multiple-type UFOs are witnessed multiple times, in multiple states, near U.S.A.F. bases in LA and CO. Several other individuals and me have been observing clandestine military \"UFOs\" for approximately five years now. Two to four distinguishable crafts have been observed during this time period. The locations I speak of are Shreveport, Louisiana area and the Denver, Colorado cosmopolitan center and Bailey, Colorado, approximately 45 miles south of Denver. Both in Shreveport and in Colorado, United States Air Force Bases are nearby. In Colorado the sites are the U.S. Air Force Academy plus NORAD within Cheyenne Mountain in and near Colorado Springs. In Shreveport, Louisiana, the site is Barksdale Air Force Base.  I will first comment on the history of others and my observations. Beginning in 2003, my brother, a friend and me began seeing large, glowing and color-changing objects over Lake Bistineau in Bossier Parish about 20 miles from Shreveport and near a very small rural town called Hall Summit. Periodically, on a darkened road very near Hall Summit, LA, my brother and I (and occasionally others brought along)witnessed several aerial crafts in the night sky and depending on the evening of observation, one or more different crafts were observed. Typically, the activity in this country area peaked in the late AM hours, before dawn. However, there was some activity as long as it was dark. The most prominent and constantly witnessed UFO was a large, bright orange oval object in the sky which was capable of hovering, moving at an variable speeds, none of which were considered to be \"high-speeds,\" as seen in LA, anyway. These identical crafts were also seen hovering above the lake named above with the same light/shape configuration and rapid color changing properties. These \"color-changers\" were discoid in shape, appeared metallic and when viewed by high-magnification binoculars They all moved from side-to-side or if viewed from directly below,they made small concentric circles as if their propulsion was possibly related to the harnessing of the earth’s own (geo)electromagnetism as the movements were identical to that of two magnets of opposing poles when brought close together. The propulsion of these type crafts were silent. The most often seen color was orange, however, all colors of the visible spectrum were viewed at varying times; often the type of craft mentioned cycled through this spectrum rapidly.  The \"color-changers\" were often but not always associated with faster moving crafts we termed \"strobers\" as they displayed strobe-like qualities flashing intense bluish-white light at extremely high frequency when moving and a slower frequency when  approaching a landing area on government land, in the middle of virtually zero population. They were difficult to look upon as a prolonged gaze requires.Their propulsion was, too, silent. These crafts \"buzzed\" our vehicle at a very low altitude while stationary or when driving--multiple times over the years. I cannot comment on the shape of these crafts, due to the light intensity. These were much smaller than the above crafts that appeared at least 100-200 ft.in diameter and were rarely witnessed hovering except as they were about to land. They were capable of high-speed maneuvers such as small angle turns and abrupt stops and change of direction without deceleration. These accounts of the aerial ships seen in the country were near government owned land and is inaccessible. One evening at about 4:00 AM CST while driving on a small rural highway nearby, an orange-glowing \"color-changer\" passed over us at a very low altitude (150-200 ft. perhaps) and my bother and me were within 1 mi. of our usual observation point and we sped there, eyeing the orange ship until we reached our stationary observing position. The huge craft proceeded to land about 1000 to 2000 yards away. Two \"strobers\" buzzed by us as the larger craft passed over us toward its landing spot. Upon landing, either the orange ship’s lights were turned off or it proceeded underground. Too, we had seen lower hovering crafts \"cloak\" or shutting down their lights.These UFOs seem to be of military association. Gasoline? Free energy appears to have been harnessed.  In Denver and Bailey CO, the hovercrafts (\"color-changers\") were seen yet in massive numbers, at higher altitudes and typically emanating only bluish-white light. The same small movements--as if magnetically-related propulsion was used--were identical to the ships in LA. An extremely large hoverer appeared over the same mountain peak nightly and the intensity of its white light was remarkable. It was viewed from a much greater distance (~1.5-2 mi.)and using the LA crafts as a reference,was at least 1000 feet across. In Bailey, (not seen in LA) the crafts at higher altitudes often zipped away with no apparent acceleration and, too, could stop on a dime. On an average evening, barring unfavorable weather conditions, there were 30-40 of these objects scattered in the sky. Other times there were much fewer present. They were over the urban area of Denver, also, at relatively low altitudes.  I have not returned to the country viewing area in LA for several years. Now, the same \"color-changing’ discoid crafts hover over Shreveport proper, a few at higher altitudes and typically one or two at lower altitudes. The lights however appear to remain white. While hovering, if viewed from binoculars, rapid color changes are seen. Many I know have witnessed these crafts and agree they are presumably military. The last time I spent time observing one of these was April 30, 2007, with a friend, within the city, from my front porch. Their presence in the evening sky is constant. The sightings are regular yet the crafts over the city do not maneuver, they just hover and make their small nutated  movements. The fact I’ve read absolutely  no reports of these highly visible \"UFOs\"  is incredible to me. They need to be evaluated by experts with the proper equipment and brought to the largely unknowing public’s awareness given the potentiality for a cheap or free energy source. They are obviously higher aerial technology that has been disclosed and I feel as though they are at least partly used for surveillance/security. They fall under the definition of a UFO as they are not identified.  Two other type crafts were witnessed in the country, both similar: rectangular shuttle-like crafts heading in the direction of the Air Force base. Propulsion could be heard (a low uniform hum); these were of such a low-flying altitude (~60 ft.) that 6 (on one of these crafts) to 8 (on the other)circular propulsion devices were viewed beneath each \"shuttle.\" Windows were present on the crafts' front which were very small and rectangular. Side windows were large and square with yellow light inside seen along with human shaped figures near the windows. There were no exterior lights present on either and an estimated speed of both is 40-50 mph: an atypical, very slow speed for an object of their size and apparent weight. The rectangular humming crafts appeared 40-50 ft.long by 15 ft. wide.  The high level of activity in the region warrants investigation. I have seen the same hover-type crafts not only in the two locations mentioned but everywhere I have traveled within the U.S. I am an M.D. and a trained observer. To let this slip by without investigation would be tantamount to continuing to allowing the government and its military to fund and operate these specialized crafts without inquiry and to continue to use hidden, inexpensive propulsion, likely in most cases presented above, to be geo-electromagnetism harnessed and likely regenerated--for free.  (You may contact me by email (or by written mail or phone if requested).",
      "link": "http://www.nuforc.org/webreports/056/S56526.html",
      "state": "LA",
      "duration": "hours"
    },
    {
      "_id": "64d005f478aba2ec5a3b788d",
      "summary": "2 different objects seen in Louisiana",
      "city": "shreveport",
      "shape": "unknown",
      "date": "2006-10-30T00:00:00",
      "story": "2 different objects seen in Louisiana I actually saw 2 separate objects this night. They were actually at 2 different times. Also I need to point out that I live close to an air force base. There are times when I've seen obvious unknown military planes and one would suspect these as being \"UFOs\". As we all know, not everything seen can be said to be from another planet.  The first object i saw was in the middle of a large amount of air traffic. I was in the backyard taking my dog out and happened to noticed how much air traffic was flying over. There are several distinctive paths where the airlines fly and over the years I've come to know where in they sky they usually are. There was plane after plane. Probably about 5 minutes apart in sightings. All of a sudden there was this one object that came across the sky in a totally odd flight path. It had lighting like what you see when several windows of a commercial plane is glowing. There was probably 8 double windows down the side. It sort of had a banana shape to it actually. There were no other lights. No red blinking light underneath. No landing geat lights either. Just these lights. It seemed to hold some reflection from the ground as there was a slight glow. Not a glow as if it were from the object, but just reflected up from the ground. It didn't really have a feel that it was flying straight either. I got a sense of a \"tumbling\" while watching it. It went over in an \"S\" shape too. It came from the north flying southwest, then southeast, then back southwest. It was wide curves and not sudden direction changes. I couldn't say there was no sound either as there was still many other planes flying over.  The second object came a few hours later. I decided to go back out to see if I could see something else. Just something you do I guess when you see an object like that. Sort of a hope that you see it again I guess. As I was looking up I noticed a \"star\" out of place straight over head. I know the constellations pretty well so I knew this light shouldn't be there. About that time I noticed it was actually moving. It was really slow. Iwas traveling from the west heading East. It's the path that I generally see satellites when they are illuminated by the sun. I had thought that's what this was too, but it was moving so slow I felt that was worth ruling out. It kept travling the same path and became dimmer and dimmer as it move toward the Earth's shadow. It was just like a satellite in everyway, just extremely slow. The complete time of seeing this object would be around 12 - 15 minutes.  Both of these object could easily have other explainations rather than \"UFO\". They are UFOs though in the sense that I had no clue what they were. I don't think any other regular average person could have said either. But I thought this was worth reporting. I would have sent info in sooner but I had teken pictures of the first object and was trying to get something to show up. I used a digital camera and had the settings wrong. All I got was a blurry dim light in one photo and nothing in the others. I tried to increase the brightness and played with the contrast but was unable to get a shape. There wasn't anything worth sending with this report.",
      "link": "http://www.nuforc.org/webreports/052/S52939.html",
      "state": "LA",
      "duration": "6-8 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3ba0ad",
      "summary": "Mandolin shaped soundless craft, with colored lights on belly, and red sequence lights on side, two white light on front.",
      "city": "shreveport",
      "shape": "other",
      "date": "2010-04-13T00:00:00",
      "story": "Mandolin shaped soundless craft, with colored lights on belly, and red sequence lights on side, two white light on front. Craft well above tree line on left of highway 71, approaching our vehicle.  Appeared as two bright white lights.  As it neared vehicle and crossed in front and above it had a line of red lights flasing in sequence in a row. Craft crossed to left of road and hovered well above our vehicle above pasture ground.  Higher than a radio tower.  Shape of craft vaguely mandolin. Small Greenish blue light on belly, also red light on belly. A number of white lights, also rather small interspersed.  I would estimate no more than 6.  Craft made no noise and seemed to drift slowly in air.  Another car following behind us in the night must have also seen it, as we slowed down and so did the car following, which appeared to drop way back to study the UFO. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/074/S74938.html",
      "state": "LA",
      "duration": "ten minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bad30",
      "summary": "Small orange-white flickering light.",
      "city": "shreveport",
      "shape": "unknown",
      "date": "2011-01-05T00:00:00",
      "story": "Small orange-white flickering light. Spotted in the sky sitting still with a orange-white flicklering light for about 7 minutes. Started moving and withing 3 minutes disappeared. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/079/S79221.html",
      "state": "LA",
      "duration": "7 mins"
    },
    {
      "_id": "64d005f478aba2ec5a3bc46c",
      "summary": "1st  at 6:13 a.m., Shreveport, LA.  2nd  6:15 a.m.,  3rd sighting, 6:19 a.m. Slow moving, no noise, oval, we think, red & white lights",
      "city": "shreveport",
      "shape": "oval",
      "date": "2012-01-12T00:00:00",
      "story": "1st  at 6:13 a.m., Shreveport, LA.  2nd  6:15 a.m.,  3rd sighting, 6:19 a.m. Slow moving, no noise, oval, we think, red & white lights Jan. 4, 2012 @6:12 am.  Grandmother and granddaughter leave their apartment.  Grandmother notices lights in the sky but thought nothing of them because there is a cell phone tower, street lights, private home lights, etc. in the area.  They exit apt. complex to the left, take another left on Normandie St.  (1st sighting)Grandmother see an object with red and white lights moving slowly behind them.  She stops her car at the intersection of Southland Park Drive and Normandie Drive and gets out of car.  Granddaughter, age 8, is beggin her to stay in car.  The object passed over them and veered to the left, heading west on So.Land Park Dr.  Near Sams, a fish eatery, the object suddenly disappears.  It is no where in site.  Grandmother gets back in car, turns right on So.Land Park Drive then turns left on Fireside Drive.  She pulls into driveway at 9343 Fireside Dr. to pick up newspaper in driveway.  She gets out of car, goes to back of car, picks up paper, takes! paper to carport and places it on table, goes back to car and gets in.  Backs out of driveway, car is facing south on Fireside Dr. (2nd sighting) They look up, there the object is again.  Grandmother and grandaughter can see the object from the windshield.  It is just above them, no noise.  She pulls into 9344 Fireside, gets out of car, picks up my newspaper, gets back in car.  Dials my number, call comes in at 6:18 a.m.  This is my signal to go outside and bring my granddaughter inside.  I go out, nothing unusual, go to car and granddaughter begins to excitedly tell me they have just seen a \"flying saucer\".  Other grandmother is also telling me what they have just witnessed.  I am very skeptical at this time but as I am standing there, SUDDENLY, over the house at 9343 Fireside Drive, (3rd sighting)this hugh object appears.  It has red and white lights.  Beautiful lights.  Very, very slow moving, if moving at all, more like it was hovering.  No sound or noise at all.  I as! k them if this is what they saw and YES, that's it.  They jump! out of car and come around to where I am standing and we all gaze at the object not really knowing what to do.  We watch it and then it slowly goes up Fireside Drive in a north west direction.  Other grandmother gets in car to try and see where it went.  At 6:23 a.m. she calls me back to say the thing is nowhere in site.  I called airports in the vacinity but they knew nothing and you could tell they were disbelieving of what I was telling them. Also called several other agencies to report this but no one was interested.  This was such a vivid thing in my memory, I drew a diagram of the events and wrote a timeline.  This was the morning of the meator showers and also when the sun came up, the southern sky was full of chemtrails.",
      "link": "http://www.nuforc.org/webreports/086/S86428.html",
      "state": "LA",
      "duration": "11 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3be7f0",
      "summary": "Light object,",
      "city": "shreveport",
      "shape": "light",
      "date": "2012-05-13T00:00:00",
      "story": "light object, This is just one of the pics, ive taken. on this night , i was on the bridge, just taking pics, i was tryna get a couple of em, before it started yo rain, the clouds where out.  It was real cloudy, i didnt notice the light until, untill i looked at my pics da next day.  And somehow ah gleam was inthere, im certified,there was no stars out that day, cause its was finna rain.....",
      "link": "http://www.nuforc.org/webreports/088/S88941.html",
      "state": "LA",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3bebeb",
      "summary": "This was a close encounter of a UFO. This was around 11:53 PM and I was 12 and I was helping putting stuff in our U-Haul in our drivewa",
      "city": "shreveport",
      "shape": "disk",
      "date": "2013-08-30T00:00:00",
      "story": "This was a close encounter of a UFO.  This was around 11:53 PM and I was 12 and I was helping putting stuff in our U-Haul in our driveway and I felt this weird sensation to look up and I saw this ufo disk/ saucer and it was 7-10 feet above my driveway and it made no sound just hovered.  The UFO had 3 lights on red, white, and blue. The object was black and had a black tinted window.  It was really weird looking underneath. I'm starting to think there were line patterns underneath that almost resembeled circuit boards. The light  frame was  a bit bigger than a watermelon, but were ovaled shaped.  It was all black underneath, but it's hard to rember if there were other lights on which I think there were. This took place on Chase Oaks street. I think the line patterns were going from straight lines to curved lines and were connected to little bright lightbulbs. I'm uncertain how long it was there for at least a few minutes and I don't know if I was abducted or not! , but I think if I was I wouldn't have remembered so much detail from this encounter. I remember running inside to tell my dad and I went back out their by myself and a minute later it was gone. I didn't see it take off. It was in Chase Oaks off of Baird RD. I'm not sure if there was missing time are not, but I remember going back inside around 12:40 PM. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/100/S100415.html",
      "state": "LA",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3c0f1a",
      "summary": "Some type of craft of light speed.",
      "city": "shreveport",
      "shape": "flash",
      "date": "2014-03-18T00:00:00",
      "story": "some type of craft of light speed. I'm a professional truck driver I was coming through at the state line of Louisiana on the eastbound side of interstate 20 as I look to the right Southside around exit 8 I seen the wind speed of light coming from the ground within seconds to disappear into the clouds  I am un aware of what this was but it was not of one of our aircraft  it was 7 a.m.   The light that it was producing bright white light looks almost like a year or bright star coming from the ground up into the sky almost as fast does a bullet  I reported it to 911  they said that they were going to do. Surveillance",
      "link": "http://www.nuforc.org/webreports/107/S107888.html",
      "state": "LA",
      "duration": "<5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c1757",
      "summary": "3 foreign objects hovering over downtown Shreveport.",
      "city": "shreveport",
      "shape": "other",
      "date": "2014-06-04T00:00:00",
      "story": "3 foreign objects hovering over downtown shreveport On or around may 2nd, myself and my fiance were just about to check out at a casino.  I proceeded to the window to take a picture of the view below us.   As I took the picture on my phone, my camera caught these 3 spaceship looking objects floating in the sky.  they were kind of saucer like objects wit a light at the top.   They appear to have either lights or windows going around them.  And also there are two shadowy figures that looks like they are walking on top of them.   The objects appear in a line from biggest to smallest. I have the photo currently in my phone right now. ((NUFORC Note:  We have not seen the photos, but wonder whether the objects might be reflections of ceiling lights, located behind the photographer.  PD))",
      "link": "http://www.nuforc.org/webreports/109/S109943.html",
      "state": "LA",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3c1a81",
      "summary": "Objects with red blinking lights n no sound n dog goes crazy.",
      "city": "shreveport",
      "shape": "circle",
      "date": "2014-07-04T00:00:00",
      "story": "objects with red blinking lights n no sound n dog goes crazy. red blinking lights, 100 feet from me, they move from left to right, no sound, dog barks a lot.  If you stand outside it will act like its floating down to us.   I'm not scared just curious.   There is about 16 of them.  I have pics on my phone. shape not sure yet.  Will have telescope tonight.",
      "link": "http://www.nuforc.org/webreports/110/S110727.html",
      "state": "LA",
      "duration": "6:00"
    },
    {
      "_id": "64d005f478aba2ec5a3c1a99",
      "summary": "A saucer shaped craft was spotted in the sky in broad daylight, moving slowly horizontally, then quickly shooing up and disappearing.",
      "city": "shreveport",
      "shape": "disk",
      "date": "2014-07-20T00:00:00",
      "story": "A saucer shaped craft was spotted in the sky in broad daylight, moving slowly horizontally, then quickly shooing up and disappearing. My son witnessed a saucer shaped object flying in the sky in a horizontal line, somewhat slowly at first, then quickly speeding off and disappearing.  It appeared to be high in the sky, but large, and clearly a saucer shaped craft. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/111/S111555.html",
      "state": "LA",
      "duration": "Several seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c1a94",
      "summary": "Quick moving circle of light in downtown Shreveport. Moved in a zig-zag motion.",
      "city": "shreveport",
      "shape": "circle",
      "date": "2014-07-20T00:00:00",
      "story": "Quick moving circle of light in downtown Shreveport.   Moved in a zig-zag motion. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  Does not indicate time of the sighting.  We wonder whether the date is correct, given the other sightings reported from Louisiana on July 12th.  PD))",
      "link": "http://www.nuforc.org/webreports/111/S111598.html",
      "state": "LA",
      "duration": "6 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c2166",
      "summary": "My family witnessed three craft shaped like a saucer with a bright light on the top and bottom that glowed bright white.",
      "city": "shreveport",
      "shape": "disk",
      "date": "2014-04-24T00:00:00",
      "story": "My family witnessed three craft shaped like a saucer with a bright light on the top and bottom that glowed bright white.  Initially the craft were in a triangle formation facing northand still.  They changed formation and moved to the south and one was very visible with the other two farther up in the sky.  The saucer ring in the middle had a greenish hue.   We have never experienced anything like this and I can honestly say 'freaked out,\" if you will.   My dogs are acting very scared and worried.",
      "link": "http://www.nuforc.org/webreports/108/S108774.html",
      "state": "LA",
      "duration": "Ongoing"
    },
    {
      "_id": "64d005f478aba2ec5a3c2175",
      "summary": "Boomerang object spotted",
      "city": "shreveport",
      "shape": "other",
      "date": "2014-05-08T00:00:00",
      "story": "Boomerang object spotted me and my fiancé where in our front yard gazing at the half moon, I then spotted something move. thought it was the clouds, but it was moving fast.  I pointed at it to her to witness also, we both watched carefully.  The object made no noise and was huge.  The color was almost clear and parts of it was white.  It was in the shape on a boomerang. and for it to go across the sky to a disappearing point, took about 10 seconds.  I personally thought it was a person hand ((sic.  Hang.)) gliding.  But nah!!!  We both agree it was not.",
      "link": "http://www.nuforc.org/webreports/109/S109226.html",
      "state": "LA",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c315d",
      "summary": "I observed an aircraft looking object moving from W to E.  It has bright lights that move in a zig zag, up and down, and around.",
      "city": "shreveport",
      "shape": "light",
      "date": "2014-08-08T00:00:00",
      "story": "I observed an aircraft looking object moving from West to East.  It has bright lights that move in a zig zag, up and down, and around type movement.  Its position is to the left of the Big Dipper handle.   It has been in the same area for more than 2 hours now.   Is it something from the Barksdale Military just testing its capabilities??   Please if you see it, report it!!!   Thanks, concerned civilian!! ((NUFORC Note:  We have changed the time above, to reflect a nighttime sighting.  PD)) ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/112/S112297.html",
      "state": "LA",
      "duration": "2+ hours"
    },
    {
      "_id": "64d005f478aba2ec5a3c4070",
      "summary": "Flying Triangle craft observed over Shreveport, Louisiana, on night of 27 May 2015.",
      "city": "shreveport",
      "shape": "triangle",
      "date": "2015-05-29T00:00:00",
      "story": "Flying Triangle craft observed over Shreveport, Louisiana, on night of 27 May 2015. Shreveport, Louisiana, around 10:15 pm CDT  Duration of sighting:  5 minutes  Angle of view: 45 degrees above horizon  Estimated altitude of craft: 5,000 ft gal  Estimated speed of craft: 50 mph  A triangle shaped craft was observed flying slowly and silently over Shreveport on a northerly heading, most likely flying directly over Interstate 49 which is a north-south highway in the city. I was observing from a distance of one (1) mile east of Interstate 49 with a clear field of view, in the southeast section of the city.  Weather conditions were clear and calm. At arms length, the craft appeared to be the same size as the width of my thumb, which is an average-sized adult male thumb. I was also able to view the craft using a high-quality pair of 10x50 binoculars that gave an enlarged and more detailed view. I could not discern any distinct structure, but did observe that background stars disappeared from view as the craft passed in front of them. The shape of the craft was an elongated deltoid triangle with a single blinking red light centered underneath, and non-blinking white lights on each of the three corners. There was no green light, which is normally required on the right wingtip of all aircraft. With the binoculars, a row of three dimmer non-blinking yellowish lights could be seen along the starboard leading edge of the craft just aft of the most forward non-blink white light. I surmise that these were windows. I observed the craft as it continued to fly north of the city until if became obscured by trees on the horizon in the distance. The speed and altitude seemed to remain constant during my observation. There was no audible sound at any time. This is the sixth time in the past year that I have observed such a craft flying over my city at night, and it has always been seen in this same way, in the same place, flying in the same manner and direction. The next time I see this craft I will be prepared with my Nikon DSLR and f/1.8 lens along with my Panasonic PV-GS300 low-light capable miniDV camcorder. I am a lifelong aviation enthusiast and airplane spotter and am certain that this was not a conventional aircraft. I would welcome a reply, but am not requesting one.",
      "link": "http://www.nuforc.org/webreports/119/S119183.html",
      "state": "LA",
      "duration": "00:05"
    },
    {
      "_id": "64d005f478aba2ec5a3c4130",
      "summary": "Fireball sighting approximately NNW from gator drive and youree drive.",
      "city": "shreveport",
      "shape": "fireball",
      "date": "2015-05-08T00:00:00",
      "story": "Fireball sighting approximately NNW from Gator Drive and Youree Drive.",
      "link": "http://www.nuforc.org/webreports/118/S118736.html",
      "state": "LA",
      "duration": "1 second"
    },
    {
      "_id": "64d005f478aba2ec5a3c4a4c",
      "summary": "Craft with 2 large colorful light like orbs. changing from array of different colors as it flew by at an incredibly fast speed",
      "city": "shreveport",
      "shape": "unknown",
      "date": "2015-09-25T00:00:00",
      "story": "Craft with 2 large colorful light like orbs. changing from array of different colors as it flew by at an incredibly fast speed In my back yard about 8:00 pm.  Watching all the stars start to come out with my daughter.  And a very fast, colorful, and silent object was flying low over what looked like my roof top.  I got my phone and started to take pictures.   It was moving so fast it was hard to get a clear picture.  But a few turned out.   We know it wasn't a helicopter or plane because there was absolutely no noise.  It was traveling in an up and down like manner.   We watched it fly away into the horizon, then it just disappeared suddenly",
      "link": "http://www.nuforc.org/webreports/122/S122107.html",
      "state": "LA",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c4b3e",
      "summary": "Grey teardrop shaped craft spotted above I-49.",
      "city": "shreveport",
      "shape": "teardrop",
      "date": "2015-09-17T00:00:00",
      "story": "Grey teardrop shaped craft spotted above I-49. Driving on Interstate 49 a few miles before the Southern Loop exit along the furthest outskirts of the city, a flat grey craft shaped like a teardrop hovered about 75 feet above treeline approximately ~1 mile from our vehicle.   Object remained in sightline for several seconds before either disappearing behind the horizon OR descend into forest.  Was not spotted again despite traveling in same direction.",
      "link": "http://www.nuforc.org/webreports/121/S121966.html",
      "state": "LA",
      "duration": "20 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c4c58",
      "summary": "I was walking across the street and looked up and saw a solid red and green disc shaped object approx.1 mile high slightly east of my p",
      "city": "shreveport",
      "shape": "oval",
      "date": "2015-08-27T00:00:00",
      "story": "I was walking across the street and looked up and saw a solid red and green disc shaped object approx.1 mile high slightly east of my position.  I went in for my binoculars, couldn't find, so I came out and it was still there.  No noise, no movement.  It then began moving east and lowering until trees hid it. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/121/S121170.html",
      "state": "LA",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c58f5",
      "summary": "Multiple, moving lights, changing from super bright to shiny silver",
      "city": "shreveport",
      "shape": "changing",
      "date": "2016-05-20T00:00:00",
      "story": "Multiple, moving lights, changing from super bright to shiny silver Multiple, moving lights, changing from super bright white to shiny silver. While driving down the inner state I noticed multiple bright silver objects.  I thought it was a flock of birds at first but it stayed in the same circular area and pattern, it kept changing from bright white to shiny silver. I pointed it out to my wife and 17 yr old.  They saw it as well, and they too said birds at first but it was not like any bird formation we’d ever seen.  We have pelicans and seagulls that frequent the area but they are always seen over the lakes.  This was inner city, no water around. As we drove away from that location my 17 yr old was still watching this weird occurrence that stayed over the same location.",
      "link": "http://www.nuforc.org/webreports/127/S127335.html",
      "state": "LA",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c5a01",
      "summary": "Rectangle object vertical with white lights and red on ends",
      "city": "shreveport",
      "shape": "rectangle",
      "date": "2016-05-10T00:00:00",
      "story": "Rectangle object vertical with white lights and red on ends. Rectangle object white and red lights, in SW Sky .. I am located in northwest Louisiana. Object stationary.",
      "link": "http://www.nuforc.org/webreports/127/S127208.html",
      "state": "LA",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3c9423",
      "summary": "3 bright lights circular..was watching something else when 3 citcular bright shapes caught my attention. Thought it was stars..then the",
      "city": "shreveport",
      "shape": "circle",
      "date": "2019-12-01T00:00:00",
      "story": "3 bright lights circular..was watching something else when 3 citcular bright shapes caught my attention. Thought it was stars..then the stats moved upward and across then back up this happened twice they were staggered in the sky with 1 above the other 2 they werent close to each other rhen the one on top turnrd off lights and took off to the right but you could see silver tint cause the moon was bright the other 2 are still where they were not moving . I showed them to my employee and he saw them thought it was stars too then they were bright then no light period and the 2 objects vanished but for some reason i think i got a glimpse  of them going the direction of the top one.. ut they moved very quickly",
      "link": "http://www.nuforc.org/webreports/150/S150521.html",
      "state": "LA",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c9500",
      "summary": "20-25 bright white lights streamed in perfect formation across the sky,  ((NUFORC Note:  Cluster of \"Starlink\" satellites.  PD))",
      "city": "shreveport",
      "shape": "light",
      "date": "2019-12-01T00:00:00",
      "story": "20-25 bright white lights streamed in perfect formation across the sky, lasted about 1 minute There was a perfectly aligned stream of white lights across the sky. They were about the same size and brightness of stars.  It was cloudy, the moon was full, there were no other stars in the sky, and I was still able to see them clearly. My wife also saw them. We watched as we drove, and they disappeared after about a minute.",
      "link": "http://www.nuforc.org/webreports/150/S150700.html",
      "state": "LA",
      "duration": "1 minute"
    }
  ]
}