{
  "city": "spokane",
  "fetch_timestamp": "2025-07-12T14:36:21.630658",
  "record_count": 136,
  "pages_fetched": 6,
  "api_calls": 7,
  "source": "ufo_aficionado_api",
  "records": [
    {
      "_id": "64d005f478aba2ec5a3b4529",
      "summary": "Extremely large Cross/Star shaped UFO moving silently across the sky and then vanished no skipping or burning",
      "city": "spokane",
      "shape": "cross",
      "date": "2019-08-23T00:00:00",
      "story": "Extremely large Cross/Star shaped UFO moving silently across the sky and then vanished no skipping or burning Object looked very large flying from east to west.  Object was very high in the sky and looked like 50 satellites combined into one large UFO.  This object was by far the largest I have seen in my life.  I am 50 years old. It was moving very fast and completely silent.  It wasn't skipping across our atmosphere and it didn't appear to be burning.  This UFO never changed in color.  The color was a bright soft white color.  There was no colored lights blinking indicating that it was an aircraft.  After about 45 seconds it vanished from full brightness to nothing.  My 18 year old son was with me.  I will never forget what I saw last night.  I tried to video with my phone and couldn't zoom in to get a good video.  I did try and saved what I have.",
      "link": "http://www.nuforc.org/webreports/147/S147862.html",
      "state": "WA",
      "duration": "30-45 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b4553",
      "summary": "In the early morning hours of July 27th 2019. I witnessed between 3 and 6 lights that moved consistantly accross the sky as if they wer",
      "city": "spokane",
      "shape": "light",
      "date": "2019-08-23T00:00:00",
      "story": "In the early morning hours of July 27th, 2019.  I witnessed between 3 and 6 lights that moved consistantly accross the sky as if they were Satellites.  These lights would appear moments after visually seeing what appeared to be a shooting star which each appeared to me to be leaving the orbit as opposed to entering it.  When following each of these lights from one side to the other, there would then be a shooting star at a 45 degree angle outward that would happen.  This same thing happened 3 clear times.  There were other high flying US planes to compare speed, trajectory etc. as well.  Locater in the PNW, I was facing westerly centering myself with a bright star I later determined to be Zenith.  The more complex part is that while trying to telepathically communicate with this star, when showing emotion the object were responding to my feeble attemps at communication.  I dont drink or use drugs.  I was sober.  I absolutely believe we all should be looking up.  Not just for a moment or two.  But spend and hour go sit under the stars.  Let your eyes adjust. You CAN communicate with it all if you let it happen.  This is also the first of any such article I have ever written on this or any similar subject.  I believed enough to find this page and offer my contribution.  I now believe.  I will be back out tonight and each night! ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/147/S147834.html",
      "state": "WA",
      "duration": "30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b478e",
      "summary": "I saw nine orange pulsating lights originate from the the horizon in same NW area of Spokane lasting a duration of 20 minutes",
      "city": "spokane",
      "shape": "light",
      "date": "2019-06-07T00:00:00",
      "story": "I saw nine orange pulsating lights originate from the the horizon in same NW area of Spokane lasting a duration of 20 minutes At around 10:10 pm, I was on my front porch, when I noticed a strange looking orange pulsating light (star or planet or plane size).  It had no noise, usually when planes are seen at that distance you can hear them.  Then a second light came out from the same NW place on the horizon (right of Division on the north side for Spokane people).  They were both following the same flight pattern and extremely close, heading diagonally to about a 45 degree angle then just disappearing.  They originated from the same spot and vanished from the same spot.  I continued to watch five more come out at the same spot and vanishing at the same spot during 5 minutes.   Then my fiancé came out and saw two more do the same thing.  Then we saw two come, one right after the other, from the same spot on the horizon and then just hovered diagonally (about 2 inches apart, if I held my fingers up to measure).  Then one slowly disappeared followed shortly by the other. This happens once more an! d I am able to catch a little on video.   In total, I saw 9 lights in a course of twenty minutes, all dark orange pulsating, all originating from the same area past the NW horizon.",
      "link": "http://www.nuforc.org/webreports/146/S146232.html",
      "state": "WA",
      "duration": "20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b47e5",
      "summary": "A massive humanoid shaped craft with white and yellow lights",
      "city": "spokane",
      "shape": "other",
      "date": "2019-07-25T00:00:00",
      "story": "A massive humanoid shaped craft with white and yellow lights. A friend and I were traveling east on highway 2, just about 2 miles before the Interstate 90 freeway entrance.  When suddenly to the south direction, I  noticed some very strange lights coming up over the trees heading west as we were going south.   This object was massive, I'd say it was a 1/2 mile away from our car, and from that distance, I would say that this thing was easily over 500 feet high and 3 to 400 feet wide.  It had two arms protruding out in front of it and it appeared to have a head and face in the middle.  It was making a very loud vibrating sound  and would occasionally rise up higher and was churning the ground up as it traveled and this object looked as if it had a large body or it was riding on a very large machine.   In the morning or when i woke up i had absolutely no memory of seeing this or did I even rememberthat i had filmed ir until 4 days ago when i was going through the video in my phone.  I didn't know what I was looking at when i watched t! he video until i played it a few times and some of that morning started to come back.  I want you to watch the video.  And please help me figure out what we saw.  I can tell you that this thing had a organic like appearance.  It qas a very powerfull sighting. ((NUFORC Note:  We spoke via telephone with the source of the report, and he assured us that the report is a sincere and honest account of what he and his friend had witnessed.  We have requested an independent report from the other witness.  PD))",
      "link": "http://www.nuforc.org/webreports/147/S147802.html",
      "state": "WA",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b480a",
      "summary": "Swerving stars.",
      "city": "spokane",
      "shape": "light",
      "date": "2019-06-07T00:00:00",
      "story": "I’m an astronomer and physics student, so I’ve been fairly skeptical until I started witnessing “swerving stars”  My most recently encounter was last weekend at first I figured it was just a satellite but not flashing.  Same color of the stars, but moving across the sky swerving.  It came closer and slowed down then started moving again quickly in the same direction it was initially going and vanished upwards. This is a very common occurrence here, most of the time they come in groups.  The locals who witness such things call them “swerving stars”  Past events I’ve seen up to about 20 in one night with other people witnessing them.  They also seem to be selective on who witnesses them.",
      "link": "http://www.nuforc.org/webreports/146/S146122.html",
      "state": "WA",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b480b",
      "summary": "Swerving stars",
      "city": "spokane",
      "shape": "light",
      "date": "2019-06-07T00:00:00",
      "story": "I’m an astronomer and physics student, so I’ve been fairly skeptical until I started witnessing “swerving stars”  My most recently encounter was last weekend at first I figured it was just a satellite but not flashing.  Same color of the stars but moving across the sky swerving.  It came closer and slowed down then started moving again quickly in the same direction it was initially going and vanished upwards. This is a very common occurrence here, most of the time they come in groups.  The locals who witness such things call them “swerving stars”  Past events I’ve seen up to about 20 in one night with other people witnessing them.  They also seem to be selective on who witnesses them.",
      "link": "http://www.nuforc.org/webreports/146/S146268.html",
      "state": "WA",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b4964",
      "summary": "Silver cigar-shaped object very slowly moving over Spokane in SW direction.",
      "city": "spokane",
      "shape": "cigar",
      "date": "2019-07-25T00:00:00",
      "story": "Silver cigar-shaped object very slowly moving over Spokane in SW direction. I was sitting in a chair in my backyard at approximately 17:30.  I looked overhead in a southerly direction and I saw a cigar-shaped object.  This object was moving slowly, if at all, in a southwest direction.  It was silver and the late afternoon sun was reflecting brightly on it.  This object had no wings or rotors and there was no sound coming from it.  I observed it for about 20 seconds.  I got up and ran into my house to grab my binoculars.  By the time I came back out (25 seconds later-I timed myself later) it was gone.  No sound – nothing.",
      "link": "http://www.nuforc.org/webreports/147/S147667.html",
      "state": "WA",
      "duration": "20 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b4a21",
      "summary": "Black triangular craft flying over house.",
      "city": "spokane",
      "shape": "triangle",
      "date": "2019-06-27T00:00:00",
      "story": "Black triangular craft flying over house. On the evening of July 26, 2010, my son photographed a triangular craft flying silently over his house.  It was traveling from the direction of the moon, heading northwest.  He said it had a white light on each tip and a pulsating red light in the middle, on the underside of the craft.  He recently rediscovered the photos, which he had saved to his computer.  On several other occasions he has photographed what appear to be white spherical craft.",
      "link": "http://www.nuforc.org/webreports/147/S147070.html",
      "state": "WA",
      "duration": "Several minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b4ae8",
      "summary": "Thick blue beam of light coming from the sky.",
      "city": "spokane",
      "shape": "unknown",
      "date": "2019-07-25T00:00:00",
      "story": "Thick blue beam of light coming from the sky. I was watching the lighting storm from my living room window on the south hill in Spokane on 53rd street, while my girlfriend was in the bathroom.  There was a large volume of lightning.   All of a sudden I saw a blue beam of light shoot down from the sky at a 45 degree angle, and it was thick.  It was about a 7 foot wide beam of light and I was approximately 1000 feet relative to the event.  There's no way I could be the only person who saw this.   It didn't look like any light any person could have possibly owned.  This thing shot way up into the clouds and was intense.  It remained a solid beam of light for approximately 20 seconds and then disappeared.  This was absolutely not lightning by any chance whatsoever.  I know what lightning looks like.  This was CLEAR.",
      "link": "http://www.nuforc.org/webreports/147/S147739.html",
      "state": "WA",
      "duration": "20 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b4ca7",
      "summary": "Three Loud Trumpet-like Blasts from the Sky",
      "city": "spokane",
      "shape": "other",
      "date": "2019-06-20T00:00:00",
      "story": "Three Loud Trumpet-like Blasts from the Sky Somewhere between I would say 1900-1910 hours this evening (June 13, 2019), my husband and I were sitting outside in our little popup camper, enjoying the cooler air and listening for bird sounds.  The just out of the sky, we hear this enormously loud trumpet blast, three times! (He said it sounded more like a trombone because of its timbre.)   On my piano, I found the notes were within a four-key (such as C,E,E and F - a major key signature) and were slurred (no break in-between the four-note phrase).  Each blast lasted about a second.  So loud!  We both agreed we had never heard anything like this and have no idea what could've been its source except to say that it came from the sky!  We discussed all of the options we could think of and came up with nothing that we're aware of that could emit these blasts. We are both retired Federal employees.  I am a former Public Affairs Officer for the USFS. ((ADDENDUM FROM WITNESS)) Actually, we are located east of Reardon and west of Spokane (just west of the ATV park just west of the Spokane River) in a coulee.  I don't think I was very accurate in my description of where we were because I was still stirred up over that noise!  If you travel Highway 2 east of Reardon, Coulee Hite Road is a left hand turn off Highway 2.  We were sitting in our little pop up camper which we have set up on our ranch property right now; it's so nice to enjoy our coffee there because it's cool (in the morning and evening) with the breezes.  I will ask our neighbors if they have heard any noises. We heard another one last night, but just a single loud blast; however, it was different from the three blasts we heard the other evening.  In fact, my husband and I are still talking about it, racking our brains for trying to remember anything similar that we've heard but so far, no luck!  ((END ADDENDUM))",
      "link": "http://www.nuforc.org/webreports/146/S146826.html",
      "state": "WA",
      "duration": "&lt;1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3b530f",
      "summary": "January 24, 2007, flying West to East over Spokane, WA, 7 elongated triangles following a bright sphere flew over with no sound.",
      "city": "spokane",
      "shape": "triangle",
      "date": "2008-06-12T00:00:00",
      "story": "January 24, 2007, flying West to East over Spokane, WA, 7 elongated triangles following a bright sphere flew over with no sound. At approximately 4:48 PM on January 24, 2007, Wednesday, a total of eight UFO's flew overhead from West to East in the clear sky of Spokane, Washington.  The first that went over was a large (about the size of my thumb nail) and extremely bright spherical light, then 7 elongated triangular flying objects flew over.  The triangles were as long as my thumb (held at arm's distance).  The edges were illuminated and showed depth. There were 6 amber colored lights under each one of the triangles.  There was no sound.  This occurred during the fireworks display for the opening ceremonies of the United States Figure Skating Championship.  The fireworks had just started, perhaps about a minute into the display when up above the arrow head shaped craft flew over following the sphere of extremely bright light.  The first triangle went over, then the second, then the third turned sharply to the left then the right, the fourth one went over, then the fifth, the sixth and when the seventh one went over itchanged shape.  The moment I said to the witness with me that these were not a flock of birds.they transformed to a flock of birds in front of our eyes. Soon after the event, perhaps a minute or two, an unexpected heavy fog set in over the city and above us. The witness with me is a trained observer who has worked for a major medical facility for over 23 years in security.  I am the daughter of two law enforcement officers and I do not seek out attention for any reason. ((NUFORC Note:  We know the source of this report quite well, and we consider her to be an exceptionally reliable witness.  We hope to receive a second report from the second witness.  PD))",
      "link": "http://www.nuforc.org/webreports/063/S63106.html",
      "state": "WA",
      "duration": "1 minute approximately"
    },
    {
      "_id": "64d005f478aba2ec5a3b5310",
      "summary": "On January 24, 2007 approximately 4:48 PM, a series of 8 silent UFO's, one sperical and  seven elongated triangles flew over Spokane",
      "city": "spokane",
      "shape": "triangle",
      "date": "2008-06-12T00:00:00",
      "story": "On January 24, 2007 approximately 4:48 PM, a series of 8 silent UFO's, one sperical and  seven elongated triangles flew over Spokane On January 24, 2007 approximately 4:48 PM during the fireworks display for the United States Figure Skating Championship opening ceremony in Spokane, Washington: a series of 8 UFO were seen by me and another witness. They made no sound.   The first UFO looked to be the size of my thumb nail held out at arms distance and extremely bright white sphere of light followed by 7 elongated triangles.  The triangles were the size of my thumb held at arm's distance and showed depth as the edge of the craft as it was illuminated.  Under the spear shaped triangles were 6 amber colored lights.3 to each side of the triangle.  The first bright shimmering light went over, and then the first triangle.then the second. the third went over and made a sharp maneuver to the right, to the left then backs to the right. The fourth triangle went over, then the fifth, the sixth and when the seventh one went over I said to the witness with me that this was not a flock of birds and at that instant the triangle turned ino a flock of birds in front of our eyes.  The total time of the incident was approximately one minute. My witness has worked 23 years at a major medical facility in the security department and is a trained observer.  I am the daughter of two law enforcement officers. I do not seek out attention for any reason. ((NUFORC Note:  We met with both witnesses, at the location from which they experienced the sighting, and we believe that both are highly credible.  It was a very dramatic sighting.  PD))",
      "link": "http://www.nuforc.org/webreports/063/S63289.html",
      "state": "WA",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3b55a0",
      "summary": "Reflective silver craft viewed in Spokane Washington",
      "city": "spokane",
      "shape": "oval",
      "date": "2006-10-30T00:00:00",
      "story": "Reflective silver craft viewed in Spokane Washington Im a 26 year old male studying pursuing a profession and attending college.  I realize that \"college students\" have been the subject of submiting hoaxes, however I do believe that this report is not a hoax although determining such is left to subjective review by this site.  At about 10:32 am at Riverfront Park a large oval shaped craft was spotted flying very slowly while I was relaxing under a shaded tree in a large grass field area of the Park.  It had a high glossy silver color, and reflected the sun rays exposing the highly reflective metal.  It was as large and oval like a blimp and just after about 13 seconds, it completely vanished, leaving a short chem-trail just before it disappeared.  The day this occured, the sky was completely void of clouds and the object did not decrease in size before vanishing like airplanes do, it was simply there one second, then gone the next.  I searched the sky for it after it left but couldn't find it.  Im convinced from this experience and others, that they are here, and they do exist..",
      "link": "http://www.nuforc.org/webreports/051/S51626.html",
      "state": "WA",
      "duration": "approx 10-15 sec."
    },
    {
      "_id": "64d005f478aba2ec5a3b55ba",
      "summary": "Triangular shaped UFO silently flies over Spokane, Wa. August 5th, 1999",
      "city": "spokane",
      "shape": "triangle",
      "date": "2008-03-04T00:00:00",
      "story": "Triangular shaped UFO silently flies over Spokane, Wa. August 5th, 1999 On the 5th of August, 1999, I was lying on my balcony looking up at the stars.  At about 1:30 am an object came into view.  If I hadn't been looking straight up, I never would have seen it.  It blocked out the stars as it flew overhead, but it was not lit up.  It made absolutely no sound.  I'm not sure just how large it was because I don't know how high it was flying but I could see it well enough to see detail on it. It was as big as a plane would be if it were flying quite low, as if it were going to land soon. I could tell it was metallic because it was reflecting the lights from the city. It was a perfect triangle with rounded corners. It had a circle on each corner as if they were lights, but as I said it was not lit up when I saw it. There was also a circle directly in the middle of the triangle. I froze when I saw it. I watched it fly from east to west until it was no longer in sight. It did not fly very fast, about the same as an airplane, but it was no airplane I've ever seen before. I guess it could have been a secret government craft, but I know it was not like the Stealth or anything like that. It was obvious that it didn't want to be seen. As soon as it was out of sight, I got up and wrote the exact time and date of what I saw in my diary, and I drew a picture of it. The next day I told my mother what I had seen, and she said she had seen the same object the night before, except when she saw it she said it had a green neon glow around it. I would like to know if anyone else saw what I saw around the same time.",
      "link": "http://www.nuforc.org/webreports/061/S61272.html",
      "state": "WA",
      "duration": "5-10 min."
    },
    {
      "_id": "64d005f478aba2ec5a3b577d",
      "summary": "a black  box  object",
      "city": "spokane",
      "shape": "other",
      "date": "2007-11-28T00:00:00",
      "story": "a black  box  object my family and i where at the spokane international airport. on the west side watching airplanes land. my two sons at that time liked watching planes. after 15 minutes i looked up to the west. and saw a box in the sky about half a mile away. then it came to about a quarter of a mile from us and just stayed there. i then took my videocamera and filmed about 20 minutes of this box hovering there it stayed in one place for 30 minutes. and would turn from side to side then stop. the sun would reflect down the medial of the object. we then thought we would get closer to see if we could get a better vew of this. when we got in to the van and started to drive to it. it was gone.  i do have the videocassette of this if you would like to see it for your self?  the shape was like a box and the color was black. and about the size of car or truck. P.S. i would like someone to look at this video and tell me what this is? i have had this video for five years now and i thought i would give it to the news but did not want to be made fun of! ((NUFORC Note:  We have written the source of the report, requesting a copy of the video.  PD))",
      "link": "http://www.nuforc.org/webreports/059/S59900.html",
      "state": "WA",
      "duration": "30minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b5ce4",
      "summary": "Solid, triangular object with 3 lights on top and bottom spotted by Spokane, Washington.  Make two turns; one sharp and one slow.",
      "city": "spokane",
      "shape": "triangle",
      "date": "2008-03-04T00:00:00",
      "story": "Solid, triangular object with 3 lights on top and bottom spotted by Spokane, Washington.  Make two turns; one sharp and one slow. We were in a car, traveling to Fred Meyer's to get some food.  Suddenly a triangle shaped aircraft appeared over the mountains (more like big hills with houses) to our right.  It had 3 lights on the corners (on the bottom), and three on top (but on the same corners), so it appeared to be roughly 1/8 as tall as it was long (But it did look like a solid triangular object).  It also appeared to be pretty far up, and considering that it moved fairly fast.  It originally came over the hills and west straight, perpendicular to the highway, before making a 90 degree right-turn and following the highway.  After that turn, it slowly veered off to the left again, diverging from the path of the highway. ((NUFORC Note:  Witness indicates that the date of the incident is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/060/S60239.html",
      "state": "WA",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b5cf8",
      "summary": "two obects ,huge ,very high,moving  west to east slowly stopped briefly appeared to intercept a smaller object then moved vertically ou",
      "city": "spokane",
      "shape": "disk",
      "date": "2007-02-01T00:00:00",
      "story": "two obects ,huge ,very high,moving  west to east slowly stopped briefly appeared to intercept a smaller object then moved vertically ou on or around said date i was running a mixer on a hi-rise project with a little time on my hands i looked across to the building across the street to see about how hi this buiding was going to ,then i noticed some movement behind said building. it was two roundish objects silvery white very high moving what appeared to be the speed of a small air craft moving west to east i tried to dismiss this peculiar sight when they stopped &remained motionless for aprox. .30 seconds while motonless something shot into view moving really.really fast went toward lead object ,,that object got brighter fora split second then both objects started moveing again,  i looked down at my task at hand briefly looked back up at objects only to watch them disapear verticle",
      "link": "http://www.nuforc.org/webreports/054/S54287.html",
      "state": "WA",
      "duration": "5min"
    },
    {
      "_id": "64d005f478aba2ec5a3b5e9e",
      "summary": "Brightly-lighted, box-like stationary craft. Looked like a scaffold or a playground \"jungle Gym\"  (maybe a space station)  First sighti",
      "city": "spokane",
      "shape": "rectangle",
      "date": "2008-03-04T00:00:00",
      "story": "Brightly-lighted, box-like stationary craft.  Looked like a scaffold or a playground \"jungle Gym\"  (maybe a space station)   First sighting   Age 88. No telescope or binoculars. Don't know how to copy and paste.   How are things in Harrington?",
      "link": "http://www.nuforc.org/webreports/060/S60290.html",
      "state": "WA",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b6411",
      "summary": "fireball fizzel out and resparks later from same spot",
      "city": "spokane",
      "shape": "fireball",
      "date": "2007-06-12T00:00:00",
      "story": "fireball fizzled out and resparks later from same spot December 16, 2005 in downtown Spokane WA @ approximately 9:30 PM??  My Friend, who was a once a military pilot and a POW, and I were traveling west on I-90 and from the Southern sky what appeared to be a meteorite or Fireball traveled in a northwestern direction.  It was huge.  We both spotted it at the same time.  It was bright, changing color yellows, reds, blues, and greens.  It has a tail trailing it like you would expect with a comet.  It lasted a good 6 seconds before it fizzled out but, in the time it takes to say, \"Did you see that?\" it suddenly sparked back up from the same spot it was last seen at and continued its course for another 2 or 3 seconds.  We weren’t quite sure what to make of it and thought we would hear something about it somewhere but never did.  Please note it was last seen in the general area of the Spokane International Airport also that of Fairchild Airforce Base.  Something like that had to have been noticed.  In my search to find out what it had been, a friend who had been out visiting on the West Side of Town at the time of the occurrence also mentioned having seen it and had commented that it was really cool.",
      "link": "http://www.nuforc.org/webreports/056/S56533.html",
      "state": "WA",
      "duration": "15 sec"
    },
    {
      "_id": "64d005f478aba2ec5a3b6764",
      "summary": "15 degree`s west of downtown spokane from a third floor apartment, Note : due west is Fairchild Air-force Base and Spk International Ai",
      "city": "spokane",
      "shape": "light",
      "date": "2008-03-04T00:00:00",
      "story": "15 degree`s west of downtown spokane from a third floor apartment,  Note : due west is Fairchild Air-force Base and Spk International Airport.  I do see Planes coming and going often, east to west, coming in.  This object came in (from the west), in a arc going north and east, seemed to be stationary for a while, then light faded out slowly, as it seemed to go mid way between west and north and towards Quebec ? Canada so the question is, do planes have bright tail lights ?.  I do not usually see any planes coming back around in an arc from due west from the departure course of west ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/060/S60565.html",
      "state": "WA",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b6952",
      "summary": "i was on the trampoline with my cusien and i was  shot back after  taking a picture of the UFOs the picture just shows a bright light",
      "city": "spokane",
      "shape": "changing",
      "date": "2007-04-27T00:00:00",
      "story": "i was on the trampoline with my cusien and i was  shot back after  taking a picture of the UFOs the picture just shows a bright light over a hill ujst about a mile and a half away at least 12 crafts were seen by my grandfather and my self it was just next to a radio fricuincy tower and NO!! it was not the radio towers!!!",
      "link": "http://www.nuforc.org/webreports/055/S55749.html",
      "state": "WA",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3b6b60",
      "summary": "Slow object observed and video taped for approx. 10 minutes during daylight hours moving across the sky.",
      "city": "spokane",
      "shape": "changing",
      "date": "2006-10-30T00:00:00",
      "story": "Slow object observed and video taped for approx. 10 minutes during daylight hours moving across the sky. About one hour to sundown myself and several friends and neighbors observed an object tree line, moving slowly from the south, object moved just east of our house, where it was close enough to tell it had no noise no wings, it moved very slowly, was black in color, and the shape appeard at first to be triangular form a distance, once it was by our house it appeared more flat and round, with a dull light from time to time circling it, it also had a white light that would come on underneath it, a red light would come on at various times sometimes staying on then blinking five to six times before stopping. the object continued to move towards the north at a somewhat slow pace, it never turned, but it did appear to slow down then gain altitude as it moved away. Myself and approx. ten others witnessed it, my sons friend video taped the object.",
      "link": "http://www.nuforc.org/webreports/052/S52411.html",
      "state": "WA",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b6cd4",
      "summary": "I saw a bright flash of light, reminding me of an electrical transformer blowing up.  It lit up the whole skyline with a brilliant ligh",
      "city": "spokane",
      "shape": "",
      "date": "2008-03-04T00:00:00",
      "story": "I saw a bright flash of light, reminding me of an electrical transformer blowing up.  It lit up the whole skyline with a brilliant light.   I was traveling south on Highway #395, gps coordinates 48 55 03 north and 47 27 10 west, traveling at a heading of 131 and observed the center of the flash at approx. 171 degrees heading, at an approximate 20 degree inclination from the seat of my truck.   I do not believe that it was a UFO, just a meteorite, but was listening to a local AM radio program on 920 KXLY and the guest, Peter Davenport, asked for folks to report it.",
      "link": "http://www.nuforc.org/webreports/061/S61755.html",
      "state": "WA",
      "duration": "4 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b6cd3",
      "summary": "Either space junk or a meteor, very close to my position. ((NUFORC Note:  Dramatic meteor at 05:28 hrs..  PD))",
      "city": "spokane",
      "shape": "unknown",
      "date": "2008-03-04T00:00:00",
      "story": "Either space junk or a meteor, very close to my position. I was driving due south on ash street at cross street indiana.  I viewed a brighly lit object streaking across the sky in a large arc. An estimated 12:00 to 9:00 arc at about 15-30 degrees above the horizon, and an estimated southwesterly direction from my vantage point, and heading south (parallel to my direction of travel). The objects \"tail\" was pastel green in color. It looked to seperate or breakup at the end of it's travel (like an explosion). In a very bright light as magnesium or titanium would look when it burns. Sort of like fireworks would look if you fired it horizontally. That's what I thought it was. Either that or an electric transformer. It looked very, very close. ((NUFORC Note:  Dramatic meteor at 05:28 hrs..  PD))",
      "link": "http://www.nuforc.org/webreports/061/S61714.html",
      "state": "WA",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b7093",
      "summary": "White dot over Spokane WA moving in extreme angles instantly",
      "city": "spokane",
      "shape": "unknown",
      "date": "2007-08-07T00:00:00",
      "story": "White dot over Spokane WA moving in extreme angles instantly About 10:30-11:00 P.M. in the northwest sky from Spokane WA. I saw a small white dot moving extremely fast. It then slowed almost to a stop then started moving in extreme angles to points in the area it was in. It stopped at each point for a fraction of a second before instantly changing directions and going to another. The speed at which it was moving between points was almost instantaneously. It did this for about 20 seconds staying in the same relative area. Then it started making curving and dipping motions for about 15 seconds before making a 180 degree curve and disappeared. I have never seen anything like this in my lifetime.",
      "link": "http://www.nuforc.org/webreports/057/S57701.html",
      "state": "WA",
      "duration": "30-45 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b7075",
      "summary": "Large, low-flying square aircraft with lights in each corner moves quickly then makes a right turn",
      "city": "spokane",
      "shape": "rectangle",
      "date": "2008-02-14T00:00:00",
      "story": "Large, low-flying square aircraft with lights in each corner moves quickly then makes a right turn I was out shoveling with my brother and a friend, and we saw this large, perfect-square aircraft over head, which had lights in each corner.  It moved fairly fast before stopping, turning to the right, and continuing on at a lower altitude.  Have seen a similar aircraft before about 20 miles away.",
      "link": "http://www.nuforc.org/webreports/061/S61433.html",
      "state": "WA",
      "duration": "Approx. 2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b7515",
      "summary": "Strang orange glow in Eastern Washington",
      "city": "spokane",
      "shape": "fireball",
      "date": "2007-04-27T00:00:00",
      "story": "Strang orange glow in Eastern Washington I was star watching with my daughter when out of the west we saw two objects with a dull orange glow around them. I've star watched a long time and never seen any thing like it. ot went from west to east then kinda shook the disappeared.",
      "link": "http://www.nuforc.org/webreports/056/S56142.html",
      "state": "WA",
      "duration": "20 sec"
    },
    {
      "_id": "64d005f478aba2ec5a3b7829",
      "summary": "Noticed a pulsating star which looked liked Sirius, only it was to the far North.",
      "city": "spokane",
      "shape": "changing",
      "date": "2006-07-16T00:00:00",
      "story": "Noticed a pulsating star which looked liked Sirius, only it was to the far North.  Next thought, its an airplane, but it wasn't moving.  I grabbed the binoculars and observed that it pulsated white, red & blueish green.  I called my daughter to take a look and she noticed that it was moving very slowly in kind of a shuffle.  A little the left/West and then a little further to the right/East.  I called a neighbor over and he stated that no way was this a star or an airplane.  I watched for several hours as it repeated the pulsating and a graduale motion to the East...the opposite direction than the stars.  At one time an airplane flew between me and the object, with no reaction from either.  As I called it a night the white color to change to amber--could have been dust in the atmosphere--whom knows.  That was it. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/050/S50865.html",
      "state": "WA",
      "duration": "2 hours"
    },
    {
      "_id": "64d005f478aba2ec5a3b7a82",
      "summary": "Strange lights in the southeast of Washington moving at high speed.",
      "city": "spokane",
      "shape": "disk",
      "date": "2007-02-24T00:00:00",
      "story": "Strange lights in the southeast of Washington moving at high speed. I live in Spokane Valley, WA and I had just gone out to the street to move my car in the driveway for the night when I noticed a light moving quickly across the southeastern sky, from right to left. The light was unusual, multicolored, and seemed to be flashing in a rotating motion. My immediate thought was a meteor (I've seen meteors before) when all of a sudden it made an abrupt change of direction from left to right. That's when I noticed the second object, which seemed to be wavering in one position, the light pattern was the same on this object. The first object came within close proximity of the second object and stopped, then the first object started to move at a rapid speed straight up, then stop and move down towards the horizon very rapidly, almost like a figure 4, again it raised up, at an angle, and stopped. The other object did not move. At this time I noticed a prop driven aircraft approaching from the north, I could hear the sound of the engine in the distance and recognized the red flashing safety lights (Felts Field Aviation is just 2 miles from where I live and this sighting took place so I see aircraft on a regular basis.) As the aircraft got closer to the objects the first object that had been moving across the sky suddenly dropped to the horizon and I lost sight of it, I have to say I lost track of the second object since all of my attention was affixed on the first one that was doing all the strange maneuvers. I quickly ran in the house to call my girlfriend and brother to come and look, my girlfriend came out and witnessed the last of the event. She saw the erratic movement up and down, across left to right, she saw the lights move and actually go out then back on, then witnessed the object drop all the way to the horizon. The aircraft seemed to pass directly through the objects location and continued on, by then both objects had vanished.",
      "link": "http://www.nuforc.org/webreports/055/S55209.html",
      "state": "WA",
      "duration": "about 5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b7fdc",
      "summary": "My wife, son and myself were going to Spokane Washington to look at some houses that we were going to buy during the first week of this",
      "city": "spokane",
      "shape": "other",
      "date": "2009-12-12T00:00:00",
      "story": "My wife, son and myself were going to Spokane Washington to look at some houses that we were going to buy during the first week of this Sept. 2009. We decided to drive all night because we have a disabled son that has a late schedule. Twenty miles out from Spokane on HWY 90 east around 4:30am we encountered several sparklers like things hovering over our car just off the right side of the windshield. I noticed that they were pacing our car as we drove. I felt like I was being hypnotized by the sparklers like objects. I noticed my wife and son staring at it and not saying a word about what was happening. I thought this was some kind of warning and felt very scared that something was going to happen to us. I was afraid to stop so I lowered my speed and shielded my eyes so I could not see them. By doing so I felt like I was not being affected by the attempt by them to hypnotized me. I was scared at this point and yelled out to my wife, \"Is it trying to hypnotiz! ed you, is it a warning of some kind.\" Cathy finally said something like \"I don't know what do they want?\" I kept looking down at the time and it didn't seem like it was changing even after a very long time and miles had past. I was thinking they wanted to hurt us or do something to the road ahead to hurt us. Each time I took my hand down from shielding my eyes I felt again they were trying to hypnotize me, like I was blacking out and not in control. I remember cars and trucks passing in the other direction and honking there horns at us as if they were seeing these things over our car. We begin praying and saying the lords prayer, it seem as if I could not think as if my mind went blank and I could not remember even what was happening to us and even what these things looked like. I had to put a memory into my head what they looked like or I think I wouldn't remember what they looked like. I remember saying to Cathy they look like giant sparklers at the same time she said it! . I thought they had gone away but they must have just moved a! way for a short time because I noticed they were back and I remember saying to Cathy no they are still here, don't look at them. She noticed my speed had dropped to 40 miles an hour in a 70 miles an hour zone and she told me to speed up or we were going to be hit from behind. Soon after that they left. I think that they tried to abduct us but were not able to because of the medication I take for depression. (Zoloft) I feel if I had not taken this medication that night we would of for sure been abducted by these strange devices that hovered over our car for such a long time that night.  500 Lights On Object0: Yes",
      "link": "http://www.nuforc.org/webreports/072/S72664.html",
      "state": "WA",
      "duration": "30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b8061",
      "summary": "We don't have craft that can fly this fast and make right turns at several thousand miles per hour",
      "city": "spokane",
      "shape": "circle",
      "date": "2008-10-31T00:00:00",
      "story": "We don't have craft that can fly this fast and make right turns at several thousand miles per hour I was working a couple of grave yard shifts out at the airport. As I came out of the main terminal lobby about 12:40 am I was with another gentleman to have a smoke. We looked north and saw about a dozen moving objects that looked liked stars in size, but were a distance off toward the north over what we knew was a military base, but as we watched these objects simply did what no flying object we have could do. They would fly at great speeds; stop on a dime and at great speeds would make right angle turns that should smash any inhabitants like a bug from the inertia of such a turn.  The man I was with was some flight specialist and was able to determine speeds roughly and distance etc, because he was simply trained in such things - I thought maybe he was a pilot himself. But he told me quite frankly that the objects have to be traveling several thousand miles per hour in the “bursts” of speed. They would all suddenly fly into one place as to meet, then fly apart in different direction and stop on a dime - staying there for a short time. Some would fly then other directions and take those right turns without slowing or stopping. You just can’t watch that kind of thing and think that we have any aircraft whatsoever that has that kind of ability. They did seem to glimmer from a bright whitish to other colors, but our distance from them it was hard to distinguish it and then - after near 10 - 12 minutes of watching this “dance in the sky” - they all flew off it different directions like a 4th of July exploding flare shot. And, no - it was no firework show either. Even if it were fireworks - even that is NOT allowed over the military base that we were watching this happen over. I had never known anyone to have ever reported this before now. The thing is - that the very next night on another grave yard shift at about closer to 2 am I saw the very same thing. This time about 5 people were standing outside watching it and I had told them I had seen it the night before as well - just didn’t know what it was, but said - nothing can fly like those things that we have - so it’s something else.  Having had a friend who used to work with NASA I had discussed with him my theory that these are not inter planetary, but rather inter-dimensional and the discussion turned into the color changing issue as they change and right when they disappear from site is at the ultra-violet or infra-red spectrum so the idea of inter-dimensional seemed to fit with that scenario and the idea of the speeds and right turns they could make without getting hurt would indicate this same idea - that, inter dimensionally they could pull this off. So, that’s my story.",
      "link": "http://www.nuforc.org/webreports/065/S65855.html",
      "state": "WA",
      "duration": "15 Minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b8145",
      "summary": "fast moving star like object over spokane, washington 09/11/09",
      "city": "spokane",
      "shape": "light",
      "date": "2009-12-12T00:00:00",
      "story": "fast moving star like object over spokane, washington 09/11/09 I also witnessed the event described by a helicopter pilot in Spokane, WA. on Sept 11th, 2009.  My 4 year old son and I went outside to play with his balsa wood airplanes when I noticed a star like object moving west to east directly over our heads.  It was very bright, brighter than any star in the sky and was moving at a rate faster than a jet, but too slow for a shooting star.  It had no blinking lights, just a bright single star like light.  No perimeter of the object was visible.  My angle of view was further west than the pilot that also witnessed it.  It appeared to slightly elevate in altitude before disappearing making me believe that it accelerated at a high rate of speed towards space giving it the appearance that it just went dim.  I was able to watch it for approximately 6 seconds... according to the other report it would have traveled approximately 30 miles during that period of time.  I would estimate that the object was flying under 3000 ft a! nd made absolutely no sound.",
      "link": "http://www.nuforc.org/webreports/072/S72559.html",
      "state": "WA",
      "duration": "15 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b83d6",
      "summary": "Five orbs the size of hot air balloons  rotated each other for 5 seconds and sped away at about 1 oclock.",
      "city": "spokane",
      "shape": "circle",
      "date": "2009-03-19T00:00:00",
      "story": "Five orbs the size of hot air balloons  rotated each other for 5 seconds and sped away at about 1 o'clock. Sighting of Dancing Orbs over Spokane Community College, Spokane, Washington at 10.09 PM on 7-7-07 .  After leaving the computer room on the first floor of the park Towers Apts, a 180 unit 20 story high apt complex I went to my apt #1905 on the 19th floor. This apt faces east across Division Street, and I can see all the Lights of East Spokane and the Spokane Valley looking down to the River, The Spokane Community college. I can see the lights of the lights Valley Mall about 7miles east of my apartment, which is about 190 feet above street level. Y W a friend of mine living on the 17th floor came up to my apt to listen to the Coast to Coast radio program, we usually listen to George Noory together most evenings from 10 to 11 PM. She brought with her a bag of micro-waved popcorm and she then sat next to the window looking east while I found a container to pour the hot bag of popcorn into. I then sat down beside her and after a few moments there appeared lights out side our window. Yvone ask, what are those. I answered they look like UFO’s to me, and I opened the window wide so we could get a clearer view of a spectacle taking place in the sky. We saw 5 orbs each one looked exactly the same as all the others the were glowing the color of a soft pink similar to the color of the rising moon at night. The were all in a straight line of 5 round orbs or discs straight up into the sky. The were approximately 1, 500 feet away right over the Spokane Community College and were approximately 500 feet above the ground. Each one was moving in rotation around each other. This was a sight of beauty that reminded me later of looking down upon a group of square dancers. You know the doe, see, doe, and spin your partner type thing. The size of each of the 5 orbs or balls was the same, each was approximatly the size of a hot air baloon. There was no sound as they continued to circle around each other in the sky in front of our ring side seats. The speed of each rotation was a complete rotation took less than one second. After viewing this for about 5 seconds I decided to get a picture of this strange scene and rose up to find a camera. At the same time I ask Yvone to keep her eyes on the orbiting orbs. A few seconds later Yvone said they were no longer visible and described them all rising together at an angle to the right rather than straight up. She also said that the color faded out and the last she could see was the out line or a circle of each one without the each soft orange color.",
      "link": "http://www.nuforc.org/webreports/068/S68694.html",
      "state": "WA",
      "duration": "60 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b86c0",
      "summary": "After 10 minutes there was no sign of the object in any direction from where we first observed it.",
      "city": "spokane",
      "shape": "changing",
      "date": "2009-01-10T00:00:00",
      "story": "My son and I were in our vehicle at the intersection of East Wellesley and North Crestline at about 6 PM on 10/31/08 in Spokane WA and we saw a strange object way up high in the early dusk sky due north and slightly west of us for about 5-6 minutes before it vanished behind some clouds.  Its behavior was strange because it did not move like a helicopter or plane and there were no lights of any color.  The object stood out like a blimp but it was not shaped or colored like one.  It was too high up for a kite and if it was a kite at that height it was too large in size.  The object was very dark black and it moved in a somewhat hovering manner almost like a large bird but at that height and distance from us it was too large in size for a bird.  The object shape was somewhat like a boomerang, normally after seeing such an object I would be writing it off as something natural but then after 10 minutes there was no sign of the object in any direction from where we first observed it. I thought that maybe if anyone else made a report to you that my information might help, I am sorry but I had no observing or recording equipment with me at the time.",
      "link": "http://www.nuforc.org/webreports/066/S66766.html",
      "state": "WA",
      "duration": "5-6 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b87eb",
      "summary": "Black sphere with  red rotating light flying silent in sky.",
      "city": "spokane",
      "shape": "sphere",
      "date": "2009-08-05T00:00:00",
      "story": "Black sphere with  red rotating light flying silent in sky. At about 920 pm tonight I was standing on my front porch when I observed a small black object moving across the sky it was approximately the size of a small car or golf cart. It had a red light that was spinning over the top and back under I would say it was oval or maybe football shaped approximate flying at 500 ‘-750 ‘ it moved quite quickly and absolutely silent.  It was the silence that sent chills up my spine. I am absolutely certain after seeing what I saw that it could not be a plane or helicopter. I was an air traffic controller in the u.s.n. I know aircraft. This was something else.",
      "link": "http://www.nuforc.org/webreports/070/S70560.html",
      "state": "WA",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3b89c2",
      "summary": "i saw three beings about 4ft tall looking into a cars window. they spotted my dog an i walking toward them.they lined up, one behind th",
      "city": "spokane",
      "shape": "",
      "date": "2010-02-14T00:00:00",
      "story": "I saw three beings about 4ft tall looking into a cars window.  They spotted my dog an I walking toward them.they lined up, one behind the other and floated one foot off the ground .lost sight of them in between 2 houses.i went to find them, they were gone. help me. ((NUFORC Note:  Witness indicates that date is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/073/S73760.html",
      "state": "WA",
      "duration": "1min."
    },
    {
      "_id": "64d005f478aba2ec5a3b899b",
      "summary": "Orange glowing ball (sphere) seen in Spokane sky in the Summer of 1975",
      "city": "spokane",
      "shape": "sphere",
      "date": "2010-04-13T00:00:00",
      "story": "Orange glowing ball (sphere) seen in Spokane sky in the Summer of 1975 While laying in sleeping bags in the backyard of our Spokane Valley home on a summer's night in 1975, my older brother and I, at approximately 11:30pm were star gazing the clear sky watching for falling stars when an orange glowing ball (sphere) flew directly above us from east to west.  We could not stop talking about it that night and decided that we would go up into the foothills by our home the next day to search for it.  It seemed so low, like only a thousand feet above us.  I recently read a book called \"Search for the Skinwalker\" which made reference to a military base in Montana that had logged a glowing round UFO crossing their skies that same night back in 1975.  So I thought I would file a report here and see if any other Spokane-area people witnessed it. ((NUFORC Note:  Date in 1975 may be approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/074/S74799.html",
      "state": "WA",
      "duration": "3 mins"
    },
    {
      "_id": "64d005f478aba2ec5a3b8ada",
      "summary": "Confirmation of 1974 report 34 years later.",
      "city": "spokane",
      "shape": "cigar",
      "date": "2008-08-12T00:00:00",
      "story": "Confirmation of 1974 report 34 years later. I just wanted to confirm this siting I found in your data base. http://www.nuforc.org/webreports/037/S37346.html   It was a clear sunny afternoon and I was at Fairchild AFB.  As I was rounding the corner of the supply building I noticed a cigar shaped craft with a flame about twice as long as the craft. It was approximately 10 miles to the south and traveling north-northwest at about the same speed as an airliner, which I thought it was except for the single flame from the back, and the were no discernible wings or tail.  As I watched it, the flame shortend up, the craft turned abruptly due east and shot off at an incredible speed. I was 20 at the time and there were no dugs or alcohol involved. ((NUFORC Note:  Date of event may be approximate, although the witness does not indicate that fact.  PD))",
      "link": "http://www.nuforc.org/webreports/064/S64385.html",
      "state": "WA",
      "duration": "10-15 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b8f7d",
      "summary": "Bright, pulsating lights on round object in Northern sky in Spokane on 6/28/08",
      "city": "spokane",
      "shape": "disk",
      "date": "2008-08-12T00:00:00",
      "story": "Bright, pulsating lights on round object in Northern sky in Spokane on 6/28/08 Sighting from south hill.  Approximately northerly location. Craft was round, with lights (appearing red, white, green bluish) which were located around exterior of object.  Use of a telescope made the light changes easily visible, although they were also visible with the naked eye.  The object was observed from approximately 10:30 to after 3:00 am and was still visible when fatigue won out over observation.  An hour or two before we quite observing, a second smaller object with the same lighting appeared in the sky below and to the left of the larger object.  It generated the same lights on a smaller scale.  We thought we saw other similar objects in the area but could not be absoulete.  Three of the observers have graduate degrees (Phd Science, engineer, attorney).  The fourth observer was the adult child of one of the observers.",
      "link": "http://www.nuforc.org/webreports/064/S64412.html",
      "state": "WA",
      "duration": "6 hours"
    },
    {
      "_id": "64d005f478aba2ec5a3b9459",
      "summary": "Steel fish-looking ufo swimming through our atmosphere",
      "city": "spokane",
      "shape": "diamond",
      "date": "2010-06-03T00:00:00",
      "story": "Steel fish-looking ufo swimming through our atmosphere I stepped outside and looked northeast.  The sky was clear. I saw a gray, diamond shape enter my view over the constellation Lacerta.  It hung in the air completely still for a few seconds(about three seconds).  Then it made two counter-clockwise loop da loops.  At the top of the second loop it hung still again for a few more seconds(about five seconds).  Next it dipped left into a clockwise loop. At the top of this loop it doubled in speed and rose up and to the left toward the constellation Hercules until it was out of view.  The ufo looked like a gray matte diamond.  I saw no lights, heat, or exhaust.  Its movements were smooth and playful like a fish in water.",
      "link": "http://www.nuforc.org/webreports/075/S75407.html",
      "state": "WA",
      "duration": "15-20 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b9466",
      "summary": "It really could have been a jet way up there but when it took that little jog I knew,it wasn't WHEW!!!",
      "city": "spokane",
      "shape": "triangle",
      "date": "2008-10-31T00:00:00",
      "story": "It really could have been a jet way up there but when it took that little jog I knew,it wasn't WHEW!!! I was outside at dusk looking south at the star I always see in the southern sky.  Then I saw what I thought was a jet flying from south to the north.  There were strobe lights in a triangular shape.  They were flashing very brightly in a seemingly random pattern.  I waited to hear the roar but as it approached overhead I still could not hear anything.  As it flew overhead it took a very quick and bizzare little jog.   I could see that it was triangular in shape as the sky was not completely dark yet.  I'd have to guess it was 15 to 20 thousand feet up. I don;t know nor can I even guess if it was something form earth or not.  Why would an alien craft have strobe lights like that?  Did anyone else see it?  I had a phone camera/video cam in my pocket but I was in too much awe to think to get it out.  PLEASE Peter, could you send me a note if anyone else reports this?  Thank you so much and I'm glad someone keeps track of this!!  ((name and e-address deleted)) ((NUFORC Note:  Source of report does not indicate exact time of the sighting.  We have assigned an arbitrary time of 19:00 hrs..  PD))",
      "link": "http://www.nuforc.org/webreports/066/S66470.html",
      "state": "WA",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b9653",
      "summary": "This happened about 2 years ago, my brother, and his wife were came over to visit around 2:00 in the afternoon, I went outside to great",
      "city": "spokane",
      "shape": "other",
      "date": "2009-06-09T00:00:00",
      "story": "This happened about 2 years ago, my brother, and his wife were came over to visit around 2:00 in the afternoon, I went outside to great them, 2 hours passed and we were all having a great time it was time for them to leave and they went on their way,  about an hour later my head suddenly started to ache, so I grabbed a bottle of water and went outside so I could get some fresh air, the closer to the door I got the worse my head hurt. After I got out side I spotted 2 \"objects\" in the sky the both of them appeared to be a triangle shape, they were moving in very rapidly, I’ve never been in airplane but I’m pretty sure the way they were moving wasn’t possible for a human made ship to move. The faster they moved they worse my head was getting, I couldn’t handle it any longer and I passed out when I awoke it was 9 at night. Also i was wondering what caused me to black out, if anyone at this reporting center knows please i would like to know  I know this sounds impossible to most people, but I know it’s the truth and that’s all that matters    ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD)) ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/070/S70310.html",
      "state": "WA",
      "duration": "4"
    },
    {
      "_id": "64d005f478aba2ec5a3b975f",
      "summary": "If you are reading this at 10:54 PM or after please look to North (slightly northwest)and you will see the object previously sent to yo",
      "city": "spokane",
      "shape": "",
      "date": "2008-08-12T00:00:00",
      "story": "If you are reading this at 10:54 PM or after please look to North (slightly northwest)and you will see the object previously sent to you.  Also at tonights sighting there have been flashing white lights from other objects.",
      "link": "http://www.nuforc.org/webreports/064/S64519.html",
      "state": "WA",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3b9825",
      "summary": "((HOAX??))  UFO'S elevators  leaving the earth",
      "city": "spokane",
      "shape": "other",
      "date": "2009-06-09T00:00:00",
      "story": "UFO'S elevators  leaving the earth We were standing out side 5-5-09 and we were talking about ufo's and I pointed a (what I call ''elevator)  It was and every night we have been watching these many space crafts  leaveing the earth and other places..but it is located from spokane due southat the 10 o'cock spot. I am welling to show the spots three in total ''elevators''",
      "link": "http://www.nuforc.org/webreports/070/S70327.html",
      "state": "WA",
      "duration": "all night"
    },
    {
      "_id": "64d005f478aba2ec5a3b9a06",
      "summary": "Really birght white light spotted southwest of Spokane WA. 12/13/08, 6 p.m.  ((NUFORC Note:  Sighting of Venus?  PD))",
      "city": "spokane",
      "shape": "light",
      "date": "2009-01-10T00:00:00",
      "story": "Really birght white light spotted southwest of Spokane WA. 12/13/08, 6 p.m. My girlfriend and I seen a bight light in the sky, it was 6 pm here, night but it didn't look far enough away to be a star or planet. The light looked white, and was not moving. I watched it for about 5 minutes to make sure it was not moving. Then i went inside my house to get my girlfriend to come take a look at it also. It was very cold so we went back inside and I checked on it again about 15 minutes after I first seen it. It was still there but it was getting pretty cloudy and the light was getting dimmer, I am not sure if it was the clouds making it dimmer. But when i went to look if it was still there about 30 minutes after i first seen it, it was not there. But it was really cloudy by then, so i think maybe the clouds was hiding it. The reason i find this light to be so interesting is because this is not the first light I seen like this. Sorry my computer does not have Microsoft word any more. Around this time of year, last year I seen a light just like this one, only this one was close and i knew exactly where it was. I lived by a Mountain i use to run up all the time, it has those towers with red lights that blink at night. One night around 3 a.m. at night i went outside to have a smoke, and right above those towers there was a huge bight white light. I say its huge because it looked way closer then this last one I seen, but i did not think \"UFO\" at that time. But I knew that there is no reason a light like that should be there at that time of night. It took me about 10 minutes to finish my smoke, but i watched a little longer to see if it would move. By then I knew this was not normal and wanted to go grab my cell phone to get it on camera, so i could show my girlfriend and others. So I went inside my house to get it all the way down stairs, and went back out and it was still there. I was able to get it on video, I could of went on forever but i can only send 15 seconds of a clip to my girlfriend that lived in Minnesota at the time. I sent it to her, but the light was very smal! l on my cell phone cam and did not look like anything i was looking at. Now since I watch UFO Hunters I know these type of lights are while known, and would like to know what it is i am seeing. I wish I knew what I know now or i could of simply called 911 and drove over to that light and got really close to it. The one that i just now seen looked pretty far away and I did not want to drive in the ice we got out here. This one I don't really know what it could have been since it looked so far away, I am thinking maybe a planet may have been really close, but I don't know. The other light I seen was a \"UFO\" for sure. But I will keep watching maybe I will be lucky and see a light like my first one.  ((NUFORC Note:  Sighting of Venus?  PD))",
      "link": "http://www.nuforc.org/webreports/067/S67456.html",
      "state": "WA",
      "duration": "30 min."
    },
    {
      "_id": "64d005f478aba2ec5a3b9cf9",
      "summary": "Triangle shaped 3 lights with one big red light on bottom of craft.",
      "city": "spokane",
      "shape": "unknown",
      "date": "2008-10-31T00:00:00",
      "story": "Triangle shaped 3 lights with one big red light on bottom of craft. It was up pretty high but I could clearly see 3 lights. one big red near the front or in the middle with 2 smaller white lighs behind and away from craft. So i belive it was triangular. At first i thought it was a airplane untill I noticed it was not moving or flasing. I was driving west bound now with the red light I assume that is the front then that would say it is facing north east. at that angle I would not mistake it for a slow moving airplane at an angle that looks like it is staying still. after about 10 seconds it started moving about 60 mph then I lost track of it. But I know what i seen. even if it was an airplane appering to move so slowly that there is no movement to all the sudden be moving at a steddy pace. Id say it was at an 50 degree angle from me and i could tell that the red light was  on the bottom not the front and there was no green light or any other light near the red one no light were flashing. I do spent sum time looking up at the sky this is only my second experiance seeing some craft I know was not made by man.",
      "link": "http://www.nuforc.org/webreports/066/S66135.html",
      "state": "WA",
      "duration": "15 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3ba424",
      "summary": "Triangular, flashing lights, possible spycraft",
      "city": "spokane",
      "shape": "triangle",
      "date": "2009-03-19T00:00:00",
      "story": "Triangular, flashing lights, possible spycraft Got out of the car in my parking lot and was walking to my apt. Looked up to see the beautiful night sky which filled with high, puffy clouds that were reflecting the moon and I could see a few stars here and there. My eyes quickly fell upon the typical “spycraft” triangle UFO. I knew it wasn’t a plane, although at first I thought it was because it had flashing lights like one. One light was white, the other red, and the other blue if I remember right. I haven’t a clue how high up it was but it seemed a bit higher than the clouds and seemed small from a distance, and it was moving about as fast as a plane. No engine sounds although that didn’t surprise me at all considering the height it appeared to be at. My assumption it was one of those spyplane things. Why it had flashing, blaring lights though when it’s supposed to be spying is beyond me! But that’s what I think it may have been as we have an Air Force base nearby.",
      "link": "http://www.nuforc.org/webreports/069/S69081.html",
      "state": "WA",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bad42",
      "summary": "The four (5)of us watched as two glowing objects flew slowly in the sky from the east.  They were flying one directly behind the other",
      "city": "spokane",
      "shape": "oval",
      "date": "2010-11-21T00:00:00",
      "story": "The four (5)of us watched as two glowing objects flew slowly in the sky from the east.  They were flying one directly behind the other and appeared to be pulsating a firey reddish/orange color.  Regarding size: If you held out a dime away from you they would be that size.  Distance: About as high as an aircraft approaching a landing.  Speed: each object maintained it's distance from one another until the object in the front \"took off\" at an incredibly high rate of speed at about a 70 degree angle away from us until the light disappeared (about 3-5 seconds).  Just about the time the fist object disappeared, the second object stopped and appeared to simply hover (much like a helicopter).  Then, it too, lifted straight up to the sky and took off at an incredibly high rate of speed and within 3-5 seconds, was gone from sight.  There were no sounds that accompanied either object.",
      "link": "http://www.nuforc.org/webreports/078/S78482.html",
      "state": "WA",
      "duration": "120 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bae17",
      "summary": "craft seen hovering below tree line no noise and had bright white light and many small red lights on top",
      "city": "spokane",
      "shape": "unknown",
      "date": "2010-11-21T00:00:00",
      "story": "craft seen hovering below tree line no noise and had bright white light and many small red lights on top I saw a bright white light hovering in the neighborhood at midnight.  It hovered perfectly still for about 2 min and then slowly moved behind some trees and vanished.  It had about 10 small red light on top that I could see.  It did not make any noise that I could hear so it couldn't have been a helicopter. None of the lights on it were blinking and I couldn't make out the shape of it.",
      "link": "http://www.nuforc.org/webreports/078/S78571.html",
      "state": "WA",
      "duration": "3 min"
    },
    {
      "_id": "64d005f478aba2ec5a3badcc",
      "summary": "Circular, silver object  flying with jet east over Spokane, April 11, 2011",
      "city": "spokane",
      "shape": "circle",
      "date": "2011-05-02T00:00:00",
      "story": "Circular, silver object  flying with jet east over Spokane, April 11, 2011 We were standing outside of a theatre, looked up and saw a large jet, very high/silver and red on the fuselage, so appeared to be a commercial jet - and above it, to the right side, there was a silver, circular object (ball shaped/sphere) that was travelling with it at the same speed.   This jet was very high - it was a clear, sunny day, (today, April 8th, 2011) and the object appeared to be angled to the right side, higher than the jet but cruising along at the same speed, same path of flight. We watched until the jet left our view.   This happened over a period of about 3 minutes.  The jet was flying over Spokane. Again, this was a large jet at cruising altitude. It was travelling east.  The witnesses include two adults, one teenager, 3 children.   We each speculated what it could be and it was not, and could not, have been part of the plane as it was not attached.  Given the height of the jet, the object had to be relatively close to have been noticed but it! was definitely discernable as a separate object.  There was no jet stream from the object like there was from the plane, and it had no propellant system that was visible.  We definitely had a clear view of the plane and object.  In contrast to the largeness of the jet, the object appeared to be about a 1/4 of the size.",
      "link": "http://www.nuforc.org/webreports/080/S80803.html",
      "state": "WA",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3baf30",
      "summary": "Silent erratic lights cross dry non-traversable  lakebed, then chase observer at high speeds.",
      "city": "spokane",
      "shape": "light",
      "date": "2011-01-31T00:00:00",
      "story": "Silent erratic lights cross dry non-traversable  lakebed, then chase observer at high speeds. On the warm evening in June of 1999, It was just getting dark, I lived above the Salteese flats, a drained lake bed, that is swampy till late summer.  My car window was down, I noticed on the far side of the lake bed, aprox: 1/4 to 1/2 mile away.  There was a set of very bright lights with smaller green lights behind moving back and forth on what I first thought was the road across the lake bed. I stopped to observe the erratic behavior.  After 20 seconds or so, I realized the object was below the road, and switching directions too quickly for it to be a car.  I wondered maybe a helicopter?, but there was no sound and I know that sound carries well across that marshy land.  I then realized that the object had turned 90 degrees and was then headed straight at my car, still no sound.  I know there is no path in that area for any vehicle to traverse without getting bogged down.  I also realized it was flying too high to be a car on the ground.  I put my car in gear and! decided to move down the road out of the way.  The object arrived on the road on my side of the road and again did a sharp 90 degree turn in my direction, I then became very alarmed so I accelerated my car to the point of unsafe speed.  Keeping my eyes on road and rear view mirror I saw the object was now following me at speeds 55 mph on winding  roads.  All I could see in the rear mirror was now two lights brighter than any halogen lights I've ever seen, blinding me in the mirror.  I was now terrified and kept thinking please god let me get home so I can tell my husband.  I hit the crest of the steep hill still doing 50 mph. At that point I was 90 seconds from my drive way.  But I do not remember pulling into the drive or entering the house, let alone telling my husband what had just occurred.  The next I recalled was getting up the next morning. I had been terrified but did not even recollect the event till over a week later.  No matter what has ever happened, I have always talked to my spouse.  All I wanted was to survive to tell my spouse, yet I did not remember.  Nor am I given to hysteria.  My mind is completely blank as to the end of that event, yet I recall every last detail leading up to it. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/079/S79849.html",
      "state": "WA",
      "duration": "3 min"
    },
    {
      "_id": "64d005f478aba2ec5a3bb0da",
      "summary": "I was sitting in my vehicle waiting for someone to come pick up a vehicle from our impound yard and I was watching a bright light move",
      "city": "spokane",
      "shape": "cylinder",
      "date": "2011-01-31T00:00:00",
      "story": "I was sitting in my vehicle waiting for someone to come pick up a vehicle from our impound yard and I was watching a bright light move across the southern sky at about 1000 MSL and maybe 1 or so miles away.  It would travel one way then the other maybe 90' or so.  Did not think much but I began to notice it didn't have any nav lights, beacons or strobes and I found that odd.  It traveled at aprox. 120-200 knots, about what I would expect of a aircraft.  We are close to Felts Field but the tower was closed at this time and it was not in the pattern or even close and it was not on approach to Spokane Int or Fairchild AFB.   I had my cell phone camera and decided to take about 20 pictures. I forgot about them then the other day I looked at them and noticed a object above the bright light.  It seems to take several different forms and changes form.  I realized my phone was a video also and took a video and in the video, on frame by frame play only you can see the object! go behind the bright light then back which you could not see at normal speed.  Also you can hear the sound of what sounds like a jet aircraft but during this all I heard nothing.  I did have my truck running during most of the time which would have covered any sounds but when I turned it off I don't recall any sounds.  I have a extensive aviation background, could fly before I could drive, lived on a airport, father is a retired 747 pilot, I know aircraft and this was not any type known to myself.  I don't have any idea what it is and I find it very interesting, whatever it is?",
      "link": "http://www.nuforc.org/webreports/079/S79759.html",
      "state": "WA",
      "duration": "15min"
    },
    {
      "_id": "64d005f478aba2ec5a3bb4e1",
      "summary": "Slow moving triangular object in night sky disapeares into cloud.",
      "city": "spokane",
      "shape": "triangle",
      "date": "2010-11-21T00:00:00",
      "story": "Slow moving triangular object in night sky disapeares into cloud. A slow moving air craft moved in the sky into the clouds, moving at about 20-to-30 miles per hour (that is my best guess) too slow for any man made craft to sustain flight! I watched it for about 10 to 15 seconds. I almost fell off of my front steps to turn my friend around so they could see it too. He did not get as long of look at it as I did, but he too agreed with the shape and speed of the craft.  It was triangular in shape, and almost looked like you could see through the middle of it, like it was transparent, yet I could still see very defined edges of the shape.  There were no lights coming from it, and no sound, yet on the edges of the craft it looked as though there were shapes on it on the outer edge that were square and rectangular shapes that I could make out that didn't look to be in any particular pattern.  The object in a whole had a sheen to it like a \"metal, yet glass look\" to it.  When it went into the cloud it disappeared. Thank you very much for your time in reading this report.",
      "link": "http://www.nuforc.org/webreports/078/S78870.html",
      "state": "WA",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bb659",
      "summary": "the object resembled a blimp, flat/concaved on the underside with 3 lights.",
      "city": "spokane",
      "shape": "oval",
      "date": "2010-11-21T00:00:00",
      "story": "the object resembled a blimp, flat/concaved on the underside with 3 lights. I am a 22 year old male recently back from Alaska for seasonal work.  On the night of November 18th, 2010 at approximately 8:20 P.M, 2 good friends and myself  saw something  about  100 feet away (behind an unoccupied house)and 150-200 feet above the ground hovering.  I was driving home from the store about 1 block south of my home in Millwood.  I did not notice the object first of us three, my eyes were on the road.  I noticed my friend in the passenger seat was looking at something very intently.  He was gazing through the driver side window and practically leaned over me to stare at it, when my friend in the rear driver side seat blurted out “dude what ((deleted)) is that in the sky?”  My first reaction was to instinctively look at the object, but at first only glimpsed it for a brief moment before returning my eyes to the road. At first glance I certainly thought that someone in the area had inflated an advertisement blimp with lighting and let it float over their house attached to the ground via cable. After taking my eyes off of the object my observations had become clear to me, I had indeed seen something floating above the ground, unnaturally. I drove on about 50 feet and made a left hand turn onto my road and stopped after about another 20 feet to better observe the object as it was stationary when first sighted, and still on the left above the ground.  As soon as I stopped to observe it however, the object slowly turned 180 degrees and began moving in the direction that I had just came from slowly. I realized that the object had begun to move and shifted my car in reverse to pursuit. I reversed very quickly around the corner and started to chase the object with my car. As soon as I rounded the corner, however, the object was gone from sight passing behind trees in the neighborhood, and I sped ! down the street to see it again and reached 60 mph before I got the last glimpse of it (I was the only one to see it that last time) speeding across the road in a southwestern direction. I returned home and reviewed my observations with my friends. What I saw was almost blimp shaped- metallic grayish in color- with what appeared to be 3 street lights (or lights with similar color) on its underside.  Rounded like a blimp on the top of it and concaved on the underside.  There was no sound observed by us.  Although we had the music volume turned up, it was reasoned by us 3 that if it were a helicopter or anything man-made than we should have heard it, especially in considering that the object was very close to us.  When the object began to move I noticed that the lights on the bottom side got significantly bright for a brief moment than begun rotating around the object, and at my last glimpse of it I only saw a circular ring of light speeding across the road. ((NUFORC Note:  We spoke via telephone with the source of the report, and he assures us that it was submitted as a serious-minded report.  We have edited out profanity.  PD))",
      "link": "http://www.nuforc.org/webreports/078/S78977.html",
      "state": "WA",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bb949",
      "summary": "Large bright light that was still but then quickly moved across the sky faster than an airplane could have and it was very big.",
      "city": "spokane",
      "shape": "light",
      "date": "2010-07-28T00:00:00",
      "story": "large bright light that was still but then quickly moved across the sky faster than an airplane could have and it was very big. I saw a bright light in the sky and thought it was an unusually bright and large star, until it started to move faster than an airplane across the sky.  It was very large and fast, and had lights unlike I have ever seen before on anything in the sky.  It was beautiful.",
      "link": "http://www.nuforc.org/webreports/076/S76713.html",
      "state": "WA",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bbdd0",
      "summary": "3 bright orange lights at low altitude over northwest Spokane.",
      "city": "spokane",
      "shape": "light",
      "date": "2011-10-10T00:00:00",
      "story": "3 bright orange lights at low altitude over northwest Spokane. While walking to my brothers house, I was north on 2400 n. Belt walking past a man walking his dogs.  At at about 30 degrees to my left (slightly northwest of my position, I observed three orange lights all equal in size fairly large, about one quarter the size of a full moon.  They looked like flares but did not move for about 20 seconds. I called my brother and told him to go outside to see them and by then one went north/northwest, one went west, and one went east.   My brother was able to momentarily see the one traveling east but seemed to go up and disappear quickly.  It was around 9:11pm to 9:12pm and were probably between 200 to 400 feet up above the area of Audubon Park when first seen.   No noise was heard, my brother observed the eastbound one straight over his house before it went up and disappeared. ((ADDENDUM FROM WITNESS, SUBMITTED ON SUNDAY, NOVEMBER 04, 2018.)) The date error i made was reported as occurring in Spokane on 8/28/11 at 21:12. The time is correct but the sighting date was actually 8/27/11.  ((END ADDENDUM))",
      "link": "http://www.nuforc.org/webreports/083/S83507.html",
      "state": "WA",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3bc0b3",
      "summary": "Fireball??",
      "city": "spokane",
      "shape": "fireball",
      "date": "2012-01-12T00:00:00",
      "story": "fireball?? Saw a giant meteor/ ???? Enter atmosphere west/above spokane. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/086/S86029.html",
      "state": "WA",
      "duration": "10 sec"
    },
    {
      "_id": "64d005f478aba2ec5a3bc0c7",
      "summary": "Bright green light, fast moving.",
      "city": "spokane",
      "shape": "light",
      "date": "2012-01-12T00:00:00",
      "story": "bright green light, fast moving. Saw bright green light moving from east to west, *very* fast, from just past the middle of the sky, into the horizon. To me, this gave it the appearance of a \"downward-moving\" light. The green light appeared to be the same size and intensity of the green light on a red/yellow/green stoplight, but I couldn't tell if it was low in the sky, or high up. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/086/S86027.html",
      "state": "WA",
      "duration": "4 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bc0af",
      "summary": "Bright orangish spheres traveling slowly from east to west then ascending until gone.",
      "city": "spokane",
      "shape": "fireball",
      "date": "2012-01-12T00:00:00",
      "story": "Bright orangish spheres traveling slowly from east to west then ascending until gone. On 12/23/11 at approx. 1630, 3 large fireball like objects were observed by my daughter in the northeast sky above the Hillyard area of Spokane, Wa. As she was driving to my house. When she arrived, I went outside and looked in the sky and observed two bright orange lights, larger than the brightest star visible, basically hovering in the sky above the Beacon Hill of Hillyard. One object was perfectly still in the southern part of the sky while the other object moved slowly and silently from east to west then stopped and went straight up into the sky until it disappeared.  The object to the south remained stationary. Approximately 30 seconds later, another bright orange ball appeared out of the East at what appeared to be a very low altitude and appeared to be heading right towards us. There was absolutely no sound associated with it. People were pulled over in their car and a man came running over to me asking if I was seeing what he was seeing. I grabbed my digital camera and attempted to video the event but could not get anything recorded. I was able to get some still pictures of the last object before it and the object to the south disappeared.",
      "link": "http://www.nuforc.org/webreports/086/S86015.html",
      "state": "WA",
      "duration": "30 min"
    },
    {
      "_id": "64d005f478aba2ec5a3bc1a9",
      "summary": "formation of 5 or 6 red lights flying over my house",
      "city": "spokane",
      "shape": "formation",
      "date": "2011-12-12T00:00:00",
      "story": "formation of 5 or 6 red lights flying over my house At around 7pm on 11/15/2011 I was standing outside my house while having a cigarrette, not really looking at anything I caught some movement straight up and when I looked up I saw 5 or 6 dim but clearly visible red lights crossing over my head at extremly fast speed, they were in a triangle or boomerang sort of of formation and were visible for about 4 seconds in which they covered a great distance going east to west.  I live near an airport and a AFB and also have planes flying across towards seattle all the time and I would say the distance these objects covered would have taken a commercial airplane probably a minute.  Thats all I really saw, after these about 4 seconds the objects were already too far away to be seen",
      "link": "http://www.nuforc.org/webreports/085/S85331.html",
      "state": "WA",
      "duration": "3-4 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bc24c",
      "summary": "2 fireball like lights,silent.south to north.",
      "city": "spokane",
      "shape": "fireball",
      "date": "2012-01-12T00:00:00",
      "story": "2 fireball like lights,silent.south to north. first object appeared in eastern part of sky from south and moved in a northerly direction direction below the cloud deck until moving into clouds after aprox 1 minute.it made no noise and traveled at a fairly slow rate of speed.appeared orange - yellow.it also flickerd like a flame. light appeared round in shape and remained equaly visible on approach,overhead and on exit.travel was straight line.speed and altitude was about that of a small private plane.wind at ground level was negligable.second light appeared aprox 1 minute after the first one and was identicle in appearance and flight path.it did however enter the clouds faster than the first.i was able to view the second light through binocs and at 10x it appeared identical with no detail visible.",
      "link": "http://www.nuforc.org/webreports/086/S86180.html",
      "state": "WA",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bc9e4",
      "summary": "Spokane River (McCoys Marina):  Red-Yellow Fireball witnessed.",
      "city": "spokane",
      "shape": "fireball",
      "date": "2011-07-17T00:00:00",
      "story": "July 3, 2011 22:00 Spokane River Red/Yellow Fireball above Mccoys Marina NE Washington State A group of people and friends were waiting for a firework show to start, when a fireball appeared across the lake above the treeline.  The object appeared as a yellowish redish light and once appeared just stayed in position for 10-15 minutes.   People starting commenting on the strange light drawing more attention to it.  The object neither got closer or further away it just stayed there on the horizon. We had roughly 10 people in our group, but there where well over 100 people there to watch the fireworks (I didn't ask everyone, but I assume most saw the strange object)   We where there together sitting on the beach facing South West, the object was roughly 35-45 degree's in the air and was about half the size of a full moon.    A full range of thoughts and emotions began through the group questioning the origin and exact nature of the object when the fireworks started.  I would turn my head and watch the fireworks, then turn and look at the fireball (I was half afraid that it was a comet heading straight to my location).   I would watch fireworks, then glance back and forth then, the next time I look, the object had disappeared. ((NUFORC Note:  We spoke via telephone with this witness, and he sounded to us to be quite sober-minded and credible.  We suspect that he is an excellent witness.  PD))",
      "link": "http://www.nuforc.org/webreports/082/S82336.html",
      "state": "WA",
      "duration": "10-15 Minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bca0b",
      "summary": "Looked to the sky and noticed very high up in the sky, 2 gliding lights/saucers almost dancing around each other.",
      "city": "spokane",
      "shape": "oval",
      "date": "2011-08-07T00:00:00",
      "story": "Looked to the sky and noticed very high up in the sky, 2 gliding lights/saucers almost dancing around each other. Noticed 2 gliding lights/or maybe a metallic tint that the sun was reflecting off of EXTREMELY high in the air, they were so high up from here almost looked like 2 birds gliding around each other.  They however were not birds, 2 gliding lights almost dancing around each other, then they disappeared up further into the sky",
      "link": "http://www.nuforc.org/webreports/082/S82788.html",
      "state": "WA",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bca72",
      "summary": "Dozens of lights in the sky over Spokane Wa. Seen of 4 different occasions",
      "city": "spokane",
      "shape": "light",
      "date": "2011-08-21T00:00:00",
      "story": "Dozens of lights in the sky over Spokane Wa. Seen of 4 different occasions On the 31st of July 2011, my boyfriend and I were outside around 10:30 at night. I saw what, at first, I thought was a shooting star. I pointed it out to him and we both watched it move across the sky and get dimmer and brighter.  It seemed to be at a pretty high altitude, but hard to say with no size reference to compare it to.  We continued to watch it for about 30-45 seconds until it completely faded away.  Thought it was kinda odd.  But then another one popped up in the sky, in a completely different spot. It didn't move in a straight pattern this time. It moved up and down left and right at a pretty steady pace. Not fast, not slow. Almost like a cruising like matter you'd see an airplane travel at. Mind you there were NO flashing lights. Just ONE solid light that was white, like a star. Hence why I thought at first it was a shooting star. We watched it until it faded away as well. THEN AGAIN, a third one pops up in a completely different spot and does the s! ame thing. Gets really bright and moves around until it fades away to nothing. We definitely thought it was strange but didn't have any explanation. The next night August 1st 2011, around 10:30 again, I was outside and out of the corner of my eye I caught a light flash in the sky. It was exactly like what we had seen the night before. I watched it travel across the sky until it faded completely. I stayed outside to watch a little longer but didn't see any other lights. THE NEXT NIGHT August 2nd 2011, again around 10:30, I was again, outside when THIS TIME I was looking to the sky to see if I'd catch a glimpse of the lights. And to my \"not so much surprise\" I seen another light!! By this point my mind is blown and I'm really wishing my boyfriend was out there to witness the lights with me again. I had told a couple people about it and every night I would watch the sky to see if there were any more lights. But there was nothing. Last night (mind you this was at 10:00pm last night August 17th 2011) my best friend and neighbor calls me and asks if I can hear the helicopter outside flying around. Apparently they were looking for someone because they had their spot light on looking in all the back yards. (This is the NW Blvd/Maple-Ash neighborhood) When I came out I looked up and seen what I thought was the helicopter. I say to my friend that I don't see its spotlight. She then directs me to the south where the helicopter was when all along I was looking at the bright light \"flying\" around in the northern sky. I am then VERY excited and tell her to come look at the bright light, explaining to her that its just like what I had seen earlier in the month. We watched it fly around until it faded away completely. We sat outside and started talking about how strange the light was when ANOTHER one pops up out of nowhere in the northeastern sky.  Our older kids (10 and 12yrs) come outside wondering why we've bee! n gone so long.  So we start explaining to them whats up. When YET AGAIN another light pops up in the sky. My best friend goes inside to get her camera so we can try and capture some of this. Me and the boys see yet another one moving from west to east, the light got REALLY bright, stopped, then descended to what looks like, from our position, to be about the felts field/valley area. Hard to say from our viewpoint exactly. Anyways, while it descended, it started pulsating red and orange. We watched it until it slowly drop out of the sky until it was out of our view. By this point we're really tripping out! (We never heard any booms though, always silent) We sat out there and continued to watch the \"lights in the sky\" until about 11:00. There were too many to count. Had to be DOZENS of different lights. Some individual and some in groups. Some travel in the exact same flight pattern as the one before it, some are completely random. Some blink on and off. Some are just really ! dim like the light you'd see when a satellite moves across the! sky, an d some are extremely bright!  To me they're UFO's... now that does NOT mean its aliens but it sure as hell DOES mean they're unidentified!!! The best way I can describe them is, they look like stars at first, then they get REALLY BRIGHT, and travel across the sky in no particular pattern and fade away until you can't see them with your naked eye anymore. They do NOT fly in straight lines every time either. Some do, but others move from left to right then up and down then back to the left again. Very strange. Going out tonight to try and catch this on video.! Really hoping for clear skies tonight!!  There were many reports and A LOT of talk on our local news stations facebook pages last night, 8/17/2011 and today, 8/18/2011, about a bright light seen over the Spokane Valley that fell from the sky and a HUGE BOOM that shook people out of their homes to the streets to investigate. The light that we seen descending from the sky, pulsating orange and red is approximately the same time as the reports from the Valley. Coincidence? There is currently no explanation to what these witnesses in the valley experienced.",
      "link": "http://www.nuforc.org/webreports/083/S83258.html",
      "state": "WA",
      "duration": "1 hour"
    },
    {
      "_id": "64d005f478aba2ec5a3bcfe6",
      "summary": "Saw a light similar to a star that darted around the sky in straight lines.",
      "city": "spokane",
      "shape": "light",
      "date": "2012-08-05T00:00:00",
      "story": "Saw a light similar to a star that darted around the sky in straight lines. My girlfriend and I drove out the Palouse Hwy one evening to find a secluded place.  We were just outside of town and drove up a dirt road that put us into the northwest shadow of Tower Mtn.  We could see the finger shaped rocks that you cannot see from the Dishman-Mica area.  We found a spot and did our business. Afterwards we were just relaxing on a blanket in a field on a hillside looking up at the stars.  We noticed a small star that would move rapidly in a straight line one direction not very far at all then stop abruptly and change its trajectory.  This went on for a few minutes and we decided to bail, quickly, and drove back to her parent’s house. I cannot recall the conversation we had on the drive, I do recall driving fast down that dirt road though. The next day I was at work and my closest co-worker, a few years older than me, asked me if I had seen anything strange in the sky.  Our sightings were very similar. I remember it so clearly.",
      "link": "http://www.nuforc.org/webreports/091/S91139.html",
      "state": "WA",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bd3f5",
      "summary": "What appeared to by a very large \"invisible\" craft making very loud, low frequency rumble.",
      "city": "spokane",
      "shape": "other",
      "date": "2012-10-30T00:00:00",
      "story": "What appeared to by a very large \"invisible\" craft making very loud, low frequency rumble 8:00 Pm, Sunday, September, 2012  While sitting in outdoor hot tub with my wife, we began to hear a very deep rumble, similar to a jet engine but unlike any either had ever heard.  I turned the power off to the hot tub to locate the direction of the rumble which by now the vibration could be felt physically while in the water. The sound seemed to come from all directions, North, then South, East and West.  I could see no outline of an aircraft in all directions.  The sound increased as it appeared to fly over, but again, nothing appeared against the night sky…although commercial airlines were easily spotted along with their exhaust and/or contrails. As It seemed to pass to the West, I stepped out of the hot tub onto an adjoining deck and noticed two red light, similar to the port wing light of an aircraft although these did not flash.  Now, what was amazing was the distance between these lights.  I called my wife to jump up and look, which she did and also saw the lights which by now were several miles away.  The distance between these lights at best estimate was 2000’—and no siloutte of an aircraft.  We watch the lights disappear through the horizon, but the noise, still a very low rumble continued for another 4 – 5 minutes. Our home is situated within the apporach patterns of FAFB and have seen and heard aircraft from tankers to stealth fighter but have NEVER heard an engine noise of that low frequency or decibal level. That’s it.",
      "link": "http://www.nuforc.org/webreports/093/S93218.html",
      "state": "WA",
      "duration": "7 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bd577",
      "summary": "Triangular Craft on Dishman Mica Road - Spokane, WA",
      "city": "spokane",
      "shape": "triangle",
      "date": "2012-07-04T00:00:00",
      "story": "Triangular Craft on Dishman Mica Road - Spokane, WA Dad was driving down Dishman Mica Road at night, I was sitting in back and saw a small dark triangular craft flying just above the telephone/treeline. The craft was flying ahead parallel to the car and once I saw the craft, it appeared to fall back and fly side by side, looked to be a one man triangle craft with dull blinking lights and was completely silent. No one else in the car saw it and appeared to be watching us for the duration of the drive on Dishman Mica Road (about 5 min). I looked away to tell my parents and looked back and saw the craft fly away slowly. It didn't look to be in a hurry, though I was able to make out a shape in the cockpit. I have never seen a craft fly so low and be so quiet. That is why my parents probably didn't notice it.  All this happened in the mid 80's while I was a kid, the whole family was in the car. The date above is very approximate. I'm sure it was Fall because of how early darkness was. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/090/S90200.html",
      "state": "WA",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bd97e",
      "summary": "Bright glowing white orb, morphing into cylindrical shape and then back to orb hovering for 20- 30 minutes",
      "city": "spokane",
      "shape": "egg",
      "date": "2012-05-13T00:00:00",
      "story": "Bright glowing white orb, morphing into cylindrical shape and then back to orb hovering for 20- 30 minutes At approx. 10 p.m., as I closed the window blinds in my kitchen, I noticed a bright object in the northwestern sky, about the magnitude of Venus, maybe a but brighter.  As an amateur astronomer, I knew it could not be Venus as she had set at least two hours prior.  The object did not move at all, just hovering in the distance.  I took a look with my high powered binoculars and as I did, it appeared to be a bright glowing white orb which then morphed into a cigar shape and back to an orb.  After about 20-30 minutes it simply disappeared into thin air!!!",
      "link": "http://www.nuforc.org/webreports/087/S87974.html",
      "state": "WA",
      "duration": "20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bdc41",
      "summary": "A round like saucer shape, with 3 bright lights orbiting over spokane, washington at 3 in the morning.",
      "city": "spokane",
      "shape": "disk",
      "date": "2012-08-19T00:00:00",
      "story": "a round like saucer shape, with 3 bright lights orbiting over spokane, washington at 3 in the morning. woke up to a neighbors dog barking to see in the sky back by the hills, that there is a flying object that has been sitting there in place for the past 45 minutes or so, normal airplanes cant sit in one spot like that, thats just not normal. the flying object has 3 bright lights  on it, going horizontal across it.  i wish it was lighter to give more of a description all i know is what i see isnt normal, and i wouldnt be up at almost 4 in the morning if what i saw was normal.",
      "link": "http://www.nuforc.org/webreports/091/S91590.html",
      "state": "WA",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3bdeaa",
      "summary": "seen an alien",
      "city": "spokane",
      "shape": "unknown",
      "date": "2012-05-13T00:00:00",
      "story": "seen an alien I was returning home about 4 am when just off to the left of my drive way some thing stood up in the field and looked at me and when it seen me stop and get out and look in its direction  it than ran or squirmed across the street in to the trees at first I thought a deer but it was up right and running in a weird way like an octopus I think I seen it dragging one tentacle  it than went from tree to tree like it was circling me so I walk very quickly in the house making sure not to take my eyes off of it and when it was going from tree to tree it would stop at that tree and peek at me from one side or the other than move to the next tree and do the same thing at each tree so when I went in the house I grabbed a flash light to see if it was a person mind you I live in the country so I don’t really think someone was sleeping in my field and dragged there sleeping bag across the street another thing that helps me know it was not human when I shined my flash light on it its eye shined green not red like a humans would. After I saw the eye color I went back in the house waiting for it to try to get in or peek in my windows so I laid on my couch looking and waiting and listening for and nothing happened  so I just tried to go to sleep and just get over it buy this time I was in denial and thought ok it was a deer. The next morning I thought about what I saw and walked out to the field where I saw it there was nothing but I remembered what it looked like and it was up right a light shade of blue witch could have been from the moon light it was really skinny and tall  with a tear drop shaped head that kind of  just formed in to the body no shoulders and long arms that looked like tentacles. But that’s all I remember and know I can say it was flat out the most scariest moment I have ever been through I have seen ghosts and ufo’s but nothing like that and it still scares me just thinking about it and its been almost a month another thing! just a week or two before my event there was reports of stra! nge ligh ts over one of my city’s neighbor hoods that was on the news the next day or day after but I didn’t think twice about this because I was in denial about what I saw until  like two weeks after it all happened than I started realizing that it could be possible that I actually saw an alien putting the two events together",
      "link": "http://www.nuforc.org/webreports/088/S88849.html",
      "state": "WA",
      "duration": "20 min"
    },
    {
      "_id": "64d005f478aba2ec5a3bdf8e",
      "summary": "Saw three amber lights under the half moon about 7 other lights danced around them they all blinked out total lights 20.",
      "city": "spokane",
      "shape": "light",
      "date": "2012-11-04T00:00:00",
      "story": "Saw three amber lights under the half moon about 7 other lights danced around them they all blinked out total lights 20. I saw at first three amber lights under the half moon Oct. 22nd 6:30 at night.  Around the amber lights danced 7 other lights.  Then they disappeared then they came two by two.  It lasted for about 25 minutes.  May sound strange but I got a message before the sighting.",
      "link": "http://www.nuforc.org/webreports/093/S93998.html",
      "state": "WA",
      "duration": "25 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3be3bb",
      "summary": "Large very bright silent orb flew very fast through night sky then dimmed, blinked and disappeared.",
      "city": "spokane",
      "shape": "circle",
      "date": "2012-08-19T00:00:00",
      "story": "Large very bright silent orb flew very fast through night sky then dimmed, blinked and disappeared. Came home from store at 9:30 p.m.  Noticed a very large extremely bright circular object moving from northwest to southeast.  It moved very quickly and steadily.  It had no other lights around it, it was not an airplane, it was silent.  When it had travelled over our house we saw  an airplane flying towards it, the object then seemed to lose brightness and turn almost yellow while getting smaller and flickering a few ties then disappeared.    I could see a small orange light a few times just for a second then nothing.",
      "link": "http://www.nuforc.org/webreports/091/S91943.html",
      "state": "WA",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3be929",
      "summary": "I saw four lights in perfect formation at about 60 thousand feet.",
      "city": "spokane",
      "shape": "triangle",
      "date": "2012-04-18T00:00:00",
      "story": "I saw four lights in perfect formation at about 60 thousand feet. At approximately 7:40 am I was sitting in my hot tub facing south-west.  At first I saw one white light traveling way slower than an airplane and even slower than a satellite.  I thought maybe someone had let a balloon loose but it was so high I thought it was doubtful.  I am pretty sure the altitude was twice as high as an airplane flies, so maybe 60,000 feet?  I am a private pilot so I have a little bit of experience with judging altitude, but it is hard to say because of not really knowing what I was looking at. After about 10 seconds I noticed a second and then third light that formed a perfect triangle.  The front light was white and the side lights were red, not solid red, but reddish.  After a few more seconds I saw the fourth and final light.  It was white and trailed the front white light by 3 to 4 times the distance from the front light to either of the red lights.  So what I saw was a perfect triangle of white in front and red on both side and then the trailing light. Why I am intrigued with what I saw is because of the perfect geometry of the shape.  The lights were traveling from south west to north east.  As it turns out I had a perfect view from my hot tub.  The lights travelled directly above my head.  I think it took between 10 and 12 minutes from about 30 degrees from horizon to about 120 degrees of horizon.  I am not sure if that is how you describe it but I am thinking 180 degrees spectrum. I am not sure what I saw, but I have never seen anything like it in the past.",
      "link": "http://www.nuforc.org/webreports/088/S88248.html",
      "state": "WA",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3beace",
      "summary": "Dancing blue light in the sky",
      "city": "spokane",
      "shape": "diamond",
      "date": "2012-02-10T00:00:00",
      "story": "danceing blue light in the sky When i went out side from my house to go to a friends house. I saw a bright blue object faceing south of northen spokane. as i watched it it moved up and down and sideways.  It did this for about 5min then it just stoped moveing around.   I noteced that when i used my flash light and turned it on and i would flash the light at it it would move.  When i got to my friends house the object must have followed me there because it moved from the south west to south east.  I have been seeing this object for the past two weeks what it is i dont know. ((NUFORC Note:  Witness elects to provide no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/087/S87039.html",
      "state": "WA",
      "duration": "20 min"
    },
    {
      "_id": "64d005f478aba2ec5a3bec60",
      "summary": "Nighttime fireball on July 5",
      "city": "spokane",
      "shape": "fireball",
      "date": "2013-08-30T00:00:00",
      "story": "Nighttime fireball on July 5 Driving to work at night when I saw this object.  Pulled off arterial onto side street to watch it pass overhead.  Saw what appeared to be an orange light approximately 1000 ft above ground travelling in a northeast direction.  Appeared to travel nearly as fast as an airplane, but made now sound.  Looked like a fireball when directly overhead.  Continued for another 30 seconds or so in same direction then disappeared out of sight. ((NUFORC Note:  Witness elects to remain totally anonymous; provides little contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/100/S100476.html",
      "state": "WA",
      "duration": "1-2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bed4a",
      "summary": "Dozens of free Flying Stars over Spokane on sunny afternoon, taking triangular formations.  White and Red Pulsing.",
      "city": "spokane",
      "shape": "fireball",
      "date": "2013-05-15T00:00:00",
      "story": "Dozens of free Flying Stars over Spokane on sunny afternoon, taking triangular formations.  White and Red Pulsing. I was waiting outside my girlfriends house off of sprague when I looked in the sky and saw dozens of flying objects that looked like stars in the blue clear skys around the afternoon sun.   After ten minutes or so they began to move around slowly at first, and I noticed that some of them were red and blinking while the others looked white and sparkly.   They would take triangular formations and the red stars would take a position in the middle of the triangles.   They would move back and forth, and fly toward the horizon, and accelerate at extremely high speed until disappearing.  Then they would be replaced by others that would return, while often the red pulsing ones would stay still or move slowly.  My girlfriend came outside and I pointed out the stars asking &quot;why are there stars over spokane in the middle of the day?&quot;  She got binoculars, and when we observed them the white sparkly stars were only what looked three red, blue, and green lights, ! together looking white with the naked eye.  They almost looked like the pixel of an old T.V. closeup.  The red ones were just red, and clear blue sky in between pulses as if nothing was there.  Eventually, they all either shot over the horizon with seemingly parabolic acceleration, or strangly flew into the sun until unobservable.  It almost seemed like it new I saw them, since they were not hardly visible or moving at all at first, and as soon as I had binoculars they all slowly dispersed.  Whatever they were, they were definitely coordinating they're movements and seemed to like the triangle formation, although it was not a constant theme as they silently moved where ever they liked.  Also, the red blinking ones seemed to be more stationary as the white ones formed triangles around them.  I reported to the police and the airport, both said call the airforce or one of the others.",
      "link": "http://www.nuforc.org/webreports/096/S96582.html",
      "state": "WA",
      "duration": "30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bee7a",
      "summary": "8 lights in formation going north west.",
      "city": "spokane",
      "shape": "formation",
      "date": "2013-05-15T00:00:00",
      "story": "8 lights in formation going north west. well i was stepping out on my porch to have a smoke and i decided to look up to view Orion and a few of the constellations west of my location and as i looked back at Orion I firs seen three lights spinning in formation about 1000 to 4000 feet going about the speed of a f-14 full throttle going north east and after they got as bright as a dimmed led on low battery five more joined and made a u formation but the ones in the middle where still spinning and after the got out of view i seen a fairchild refueler or a 747 heading south west about 30 thousand feet 2 seconds later.",
      "link": "http://www.nuforc.org/webreports/096/S96585.html",
      "state": "WA",
      "duration": "8-10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3beedf",
      "summary": "Falling star turns into flash, then flash goes away, then in a total different direction what looked like a satellite goes out of site,",
      "city": "spokane",
      "shape": "flash",
      "date": "2013-07-03T00:00:00",
      "story": "Falling star turns into flash, then flash goes away, then in a total different direction what looked like a satellite goes out of site, From east to west, first thought it was a falling star due to the speed, then there was a flash, as the flash got smaller and went away, what appeared to be a satellite came from center of flash in a total different direction, now from north to south slower at the speed of a satellite until it went out of sight.  my son was with me, we both had no idea what it was.",
      "link": "http://www.nuforc.org/webreports/098/S98446.html",
      "state": "WA",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bf049",
      "summary": "Two white circles covering 65 degrees in 4 seconds",
      "city": "spokane",
      "shape": "circle",
      "date": "2013-07-03T00:00:00",
      "story": "Two white circles covering 65 degrees in 4 seconds I took my dog out for one last job between 12:10 and 12:20am on Sunday May 12th (early mothers day).  I was out there for less than a minute when I thought I saw a shooting star in my peripheral vision almost directly above me.  Upon focusing on it I saw two white circles, not like bright directional shining lights normally seen on a plane but just white circles.  I initially thought it could be one object total but it could be two separate in the same path of travel as the white circles were separated.  The white circles were about the same size around as a #2 pencil held out at arms length and they were spaced out to fit about two of those #2 pencil diameters in between them.  It was moving very fast from East to West.  I saw it from about 90 degrees to about 25 degrees above the horizon.  I could tell it was pretty high up because the sky was clear straight up and all the way to the east but to the west there was some very thin cloud cover that I was able to sti! ll see bright stars through and I could see the white circles slightly dim as it went behind one narrow cloud then get brighter after it passed over it into the clear for a bit and then went behind more cloud cover and got smaller the further away it was and dimmed and then it was gone. This all happened very fast. I estimate the total time from it first catching my eye till it went out of sight was 4 seconds. I know for a fact it was not a plane or a satellite. Way too incredibly fast to be either. The object made no noise. It was purely silent. I also pulled up airplane radar flight records online between 12:10 and 12:20 and there was no planes flying over the city in this timeframe. I talked to an individual at a local airport about it and they stated that it could be a secret military aircraft as they fly those in the middle of the night so they aren't easily seen. Whether this is true or not I have no idea. It suppose it could be as it was headed in the direction of a ! nearby air force base.  About me: I'm in my twenties, have very good eyesight and don't use glasses/contacts, have good hearing etc.",
      "link": "http://www.nuforc.org/webreports/098/S98730.html",
      "state": "WA",
      "duration": "4 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bf70a",
      "summary": "3 red/orange fireballs moved across the night sky and then disappeared, this happened in Spokane, WA.",
      "city": "spokane",
      "shape": "fireball",
      "date": "2013-07-03T00:00:00",
      "story": "3 red/orange fireballs moved across the night sky and then disappeared, this happened in Spokane, WA. My friend and I were outside in front of our apartment building at 22:30, and I was standing up, she was sitting down in a lawn chair.   I saw two bright fireballs coming in from the east, and they were headed in a west-southwest direction.  They were probably about a 1/4 of a mile above us.   After a few seconds, a third fireball appeared out of nowhere and went in the same direction.  They disappeared into the same place, I mean they just vanished into thin air.   We live on the south hill of Spokane, and it was pretty clear here, no clouds to the east, and very few to the west-southwest.  These things were not going real fast, but maybe about as fast as a small plane would travel when going in for a landing, not very fast.   My friend and I sit outside to smoke during the day and at night, we are both 59 years old and have no reason to make this kind of stuff up.    After looking up sightings, we decided to make a report of the sighting of these 3 fireballs.   The fireballs were red/orange, did not leave a trail behind them and I saw nothing fall to earth when they disappeared.",
      "link": "http://www.nuforc.org/webreports/098/S98689.html",
      "state": "WA",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bf75a",
      "summary": "Lights seen onve Spokane.",
      "city": "spokane",
      "shape": "oval",
      "date": "2013-02-04T00:00:00",
      "story": "Lights seen over Spokane. While looking off my back porch watched several of these objects slowly coming off the ground and slowly moving up then they just disapeared into the sky, seen several of them at first thought they were airplanes, but they were not flying in any formation at all.",
      "link": "http://www.nuforc.org/webreports/095/S95556.html",
      "state": "WA",
      "duration": "10-15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bf7e0",
      "summary": "Multiple orange orbs over downtown Spokane.",
      "city": "spokane",
      "shape": "sphere",
      "date": "2013-10-14T00:00:00",
      "story": "Multiple orange orbs over downtown Spokane. While driving south through downtown Spokane- passing Spokane Club on the right.  I looked out of the drivers window while stopped at traffic light.  I noticed a steady orange light between the tree branches to my left.  The light was some distance above the trees, at about a 60 degree angle relative to my car.   I pointed out the object to my wife and opened the moon roof of the car so she could see.  My son in the back seat just behind me also saw the object.   At that time I noticed two other bright orange objects but lower and seemed to be following the first object spotted yet the tree were in a line from west to east.  The traffic light had changed so I needed to move and briefly thought they might have been military aircraft.  These lights did not make a sound I could hear, were not common aircraft light colors, and did not strobe so I dismissed that idea.  The lights were moving east-to-west against the prevailing winds which would exclude luminaria.  I thought the lights were very odd.   We proceeded south to the freeway onramp since we were headed home to the east in Spokane Valley.  I told my wife and son the keep an eye out for the objects we had just seen since I had to drive.  The highway is elevated above the city so we had a better view above the buildings.  I glanced several times over my shoulder to the left toward the objects.  I was able to get a good estimate of the altitude.  There were three objects I could clearly make out, but possibly four or five, since I was driving I was only able to focus on the first three objects.  Object furthest to the west (which I believe was the first object) was at about 1250 feet, the second two were at about 450 feet (above ground level).  They were about evenly spaced about 500 feet apart horizontally.  From I-90 the first object was roughly over Masonic Temple with the last object being over River Park Square.  I could clearly triangulate from the first sighting, the freeway sightings, and using size of the buildings in downtown Spokane for a reference.   After getting home I dropped off my wife, son and car at the house, this was about 2110.  I got in my truck and headed back downtown to investigate the objects, while driving to roof of parking garage at Sacred Heart Medical Center there was a brief flash of light in the pickup,  I think this was a mercury vapor streetlamp flashing or a surge to the truck cab lamp so not concerned.  Only stopped briefly to observe on the top level of west parking garage at SHMC.  No objects visible over Spokane at this time.   Returned home at 2130.",
      "link": "http://www.nuforc.org/webreports/102/S102993.html",
      "state": "WA",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bf7de",
      "summary": "Orange Spherical Orbs doing a Brilliant Show over the City sky.  Over 10 witnesses on the scene.",
      "city": "spokane",
      "shape": "sphere",
      "date": "2013-10-14T00:00:00",
      "story": "Orange Spherical Orbs doing a Brilliant Show over the City sky.  Over 10 Witnesses on the scene I am a ((job description deleted)) at the ((deletd)) here in Spokane, Washington.   Last night upon entering our ((deleted--work area)) on my 1st round at 8:45 pm; immediately I could see a number of highly luminous glowing orange spherical objects (orb like) through the trees as I looked west over the roof of our ((deleted)) toward the Convention Center of the Downtown area.   Having witnessed 3 of these objects 4 months ago and since having heard the sweeping reports from all over the country, I knew this was going to be a big event that I wanted as many people as possible to see.   So I immediately ran into our ((deleted--area))  and summoned as many interested witnesses as I could by asking everyone if they wanted to witness some UFO’s.  First thing; I had our ((deleted)) attendant accompany me as he along with many of his neighbors had personally witnessed over thirty of these same objects traveling through a couple weeks before I had over 4 months ago.  When we and the some 10 to 12 guests arrived on the scene, we were all amazed and perplexed at the show the near dozen of these firey orange objects were putting on as they floated around drifting upward and slowly gliding around from north to south with their distinctive luminous orange glow.   Because I was trying to acquire as many witnesses as possible, I was unable to closely examine the movements and activity of the objects for very long.  However, from what I did witness, they appeared and acted exactly the same as those I had witnessed some months back. After about 7 minutes had passed, and I was scrambling to get more witnesses to observe the phenomena and get it recorded, suddenly all but a few ((deleted)) came back in side and said they all just vanished.   I then worked my way back out and there remained one mother and her daughter who showed me the one orange ufo remaining.  They told me that after all the ufos vanished and everyone left, this one object suddenly lit up and remained as it was hovering with its’ distinct orange glow.   We watched on for a few minutes as this object stayed hovering only to lose its luminosity and vanish in thin air like the others…   The mother then showed me the multiple pictures she took with her smart phone and I gave her my email address and she got my name and insisted that her and her daughter would email me the pictures as well as a detailed account of what they witnessed. As I write this report, I am still waiting and hoping she delivers on her words. This was an extraordinary event witnessed by over 10 people who were all mesmerized by the show these objects put on.  In fact a couple ((deleted)) came to me afterwards and thanked me very much for alerting them so they could witness the extraordinary phenomena.   In hindsight, however it was very disconcerting to me that 2 of the teenagers who caught the whole incident on video went right back into the ((deleted)) showed just a few people and then went right back to watching a football game like nothing even happened.  When I asked them if they could put the footage on youtube they just kind of blew me off like they didn’t care.  I wish I had given them some money in exchange for the footage as it was the type of ufo event that many people hope to see their lifetime…",
      "link": "http://www.nuforc.org/webreports/103/S103006.html",
      "state": "WA",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bff03",
      "summary": "I was on the phone in my front yard when I looked up in the sky and saw strobe lights on a craft for approx 10 sec and stopped then the",
      "city": "spokane",
      "shape": "flash",
      "date": "2013-10-14T00:00:00",
      "story": "I was on the phone in my front yard when I looked up in the sky and saw strobe lights on a craft for approx 10 sec and stopped then the object was stationary.  then it went dim to orange then slowly went west.  my son and wife saw it to.   it was south of me approx 3000 ft up.  I know because the radio towers on the mountain it was over are at 2000 ft.   Also, I   very awkward that I go out and look and there's a craft strobe light back at me.",
      "link": "http://www.nuforc.org/webreports/103/S103227.html",
      "state": "WA",
      "duration": "8-15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c060a",
      "summary": "3 spheres in sunset sky",
      "city": "spokane",
      "shape": "sphere",
      "date": "2013-02-18T00:00:00",
      "story": "3 spheres in sunset sky My husband and I were driving home to Seattle via I-90 from Spokane it was 16:00hrs.  I was taking many photos due to the strange sky above - I did not see these 3 spheres at the time as my focus was on the Sunset but also the Sun high above, then we witnessed a second Sunset later on.   It was only when I got home did I notice the 3 spheres in a triangle formation.  There seems to be one yellow one in the center, and two orange/red spheres to the side.  These were taken through the windscreen, however they are not on the windscreen as they move position in the sky, these are distant objects.  Please see photos",
      "link": "http://www.nuforc.org/webreports/096/S96346.html",
      "state": "WA",
      "duration": "~7 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c0a9e",
      "summary": "Box with wings flying low and fast.",
      "city": "spokane",
      "shape": "rectangle",
      "date": "2013-11-11T00:00:00",
      "story": "Box with wings flying low and fast At around 5:30 I saw a large rectangle shape under a pair of wings flying low near I-90 and Freya.  The object had no propellers or engines but did have a white/blue strobe light on top.  From the side it appeared to be towing the object and the wings were at a 45 degree angle like when a plane takes off. It went straight from South to North and disappeared with in a minute.  When I wa directly behind it the wings looked huge like 70' or so, and were barely visible, like they were 3 inches thick.  Strange sight can't explain!",
      "link": "http://www.nuforc.org/webreports/103/S103644.html",
      "state": "WA",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c0ad4",
      "summary": "Large bright stationary spherical object appearing to be with earth atmosphere about 45 degrees above horizon.",
      "city": "spokane",
      "shape": "sphere",
      "date": "2014-02-27T00:00:00",
      "story": "Large bright stationary spherical object appearing to be with earth atmosphere about 45 degrees above horizon Driving SW on I-90 from Spokane Valley, Washington, I observed a very bright stationary spherical object in the SW sky for 3-4 min.  The object was moon-like in appearance minus the shadows, and was clearly in front of the thin layer of clouds and sunrays which were behind and above the object.   It was very bright, glowing, light gold with a very smooth surface -luminescent rather than metallic.  It appeared to be solid – light was not reflecting through it.  Size is difficult to guess, altho it seemed to be quite large and about a 45 degree angle above the horizon.   No clue as to distance or height, however, it was close enough to see details.   Outline of object was distinct with sky behind darker than object itself.  It remained stationary, but appeared to turn and change to a slightly faceted shape with what appeared to be two small triangular fins one above the other, protruding from behind.  The fins appeared to be of the same material and color.   As I continued driving SW toward the object, I saw a very small, very black spot which at first appeared and disappeared so I wasn’t sure if I actually was seeing it.   The black spot appeared to expand until it was very clearly a rectangular shape located on the lower right quadrant (from my viewpoint).  It remained visible, but rectangular shape appeared to change to an hour glass shape.   The object remained stationary, but the descending sun made it more and more difficult to view.   At this point, the terrain obscured my view as I drove behind and up up a small hill.  At the top of the hill (about a minute later), I had full view of the SW sky and the object was gone.",
      "link": "http://www.nuforc.org/webreports/107/S107431.html",
      "state": "WA",
      "duration": "3-4 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c0bf6",
      "summary": "Shiny spherical object traveling across sky SE-NW direction, hovers for 10 mins in NW, then leaves in N-S direction.",
      "city": "spokane",
      "shape": "sphere",
      "date": "2014-01-24T00:00:00",
      "story": "Shiny spherical object traveling across sky SE-NW direction, hovers for 10 mins in NW, then leaves in N-S direction I was in my kitchen making lunch and I noticed my neighbors (about 5 of them, one who is retired military) were all outside talking, pointing and looking at the sky, and one of them had binoculars.  So I went out to see what was up. It was noon and the sky was absolutely clear of clouds. I observed was a spherical object moving across the sky, coming from the SE, headed in a NW direction. It was moving at a steady speed, slower than a satellite, maybe as fast as an airplane that was REALLY high (so I am guessing around 500-800 miles per hour).  The object appeared to be higher than most aircraft fly around here, but still definitely within the atmosphere.  It was extremely shiny.  It glinted a lot as it reflected the bright noon-time sunshine.  The light it reflected was white, which gave me the impression that the object was silvery and metallic.  It was hard to make out any details other than light, but because it was so evenly reflective, it seemed like it must have had a smooth surface. The object moved at a constant speed across much of the sky, about 75 degrees above the NE horizon once directly overhead, all the way from the SE horizon until almost to the NW horizon, in about 5 minutes time, until it stopped and just sat in one spot about 25 degrees above the horizon for about 10 minutes.  It still seemed round and very shiny.  I thought it was a single light, but my husband and my daughter thought they could sometimes see two \"lights,\" very, very close together.  It glinted a lot, like the object or the surface was moving ever so slightly, even while seemingly standing still.  There was never a time when there was not light reflecting from the object; it just changed in intensity, like a silver beaded windchime blowing in the breeze (but without any visible change in direction). After a bit, the object started to move again, toward the South, at the same speed as before. It soon went behind my neighbor's trees, from my vantage point, and the object was so far away and it was so bright outside that I couldn't find it again.  After a bit, the neighbors lost it too and went back inside.  During the sighting, there were no other aircraft in the sky (which is not very common around here, since the Spokane Airport and Fairchild Air Force Base are only about 10 miles away). However, about 10 minutes after the UFO disappeared, I noticed two airplanes in the sky (with an obvious airplane shape to each of them, as opposed to the UFO), and both left distinct contrails. The UFO had left no trails at all, even though it was traveling at jet speeds.  The UFO did not give off any sound that was audible to me, but neither did those two airplanes, so it doesn't mean the craft didn't make noise way up high. If I were to guess, I would say this object was larger than a Boeing 747, but not more than twice as large.  After the sighting, it seemed like there was more airplane traffic than usual, but it may just been because we were looking to the sky more than usual. Again, we live close to an airport and a base, so airplanes are common in our skies.  The thing that makes this sighting stand out to me is the fact that the object had been moving in a NW direction, stopped and hovered in one spot for several minutes, and then started moving in a S direction. No airplane I have ever seen can hover like that, nor does it look round. Drones have wings or arms for rotors, so they should look more irregular than a sphere, and they shouldn't be as large as this was. No helicopter I have ever seen appears to be silver and round and that large when that high in the air (one would have been a speck). The ISS and satellites do not stop and then change direction.  I have never before seen a UFO and I was so shocked by this sighting that I watched, dumbfounded. I was worried I wouldn't be able to locate it again if I went for my camera, plus I wasn't sure if my camera would capture more than a glinty speck because the object was so far away. After the fact, I regret that I didn't dash quickly for my cell phone and get a video of this so as to share it with friends and family.",
      "link": "http://www.nuforc.org/webreports/106/S106538.html",
      "state": "WA",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c1041",
      "summary": "Orange/red light in the sky moving from east to west seen in southern sky gone 30 seconds after spotted.",
      "city": "spokane",
      "shape": "light",
      "date": "2014-01-10T00:00:00",
      "story": "Orange/red light in the sky moving from east to west seen in southern sky gone 30 seconds after spotted I thought I was looking at a star then I realized it was too bright and too close to be one.  The colour changed back and forth from orange/red to silver.  It was travelling in the sky from east to west.  I watched it until it was gone.  The light flickered a few times and then it turned off. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/105/S105941.html",
      "state": "WA",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c113c",
      "summary": "What was that?",
      "city": "spokane",
      "shape": "triangle",
      "date": "2014-01-24T00:00:00",
      "story": "What was that? Saw three blinking lights in the sky moving in formation and blinking at different times.  The shape the lights made were in a triangle against the blue sky and then gone…",
      "link": "http://www.nuforc.org/webreports/106/S106502.html",
      "state": "WA",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c1174",
      "summary": "\tOn Saturday 11-23-13 at approximately 7:15pm I let the dog outside to go to the bathroom.  The backyard faces south.  I looked up in t",
      "city": "spokane",
      "shape": "light",
      "date": "2013-12-12T00:00:00",
      "story": "\tOn Saturday 11-23-13 at approximately 7:15pm I let the dog outside to go to the bathroom.  The backyard faces south.  I looked up in the sky at about 45 degrees towards the southeast and saw 12 orangish flickering lights moving through the sky towards the south.  At first I thought it looked like Santa’s sleigh and reindeers light up.  As the lights curved and moved upwards  towards the south I noticed that they disappeared one by one as they were directly over our garage which is south of the house. \tI went inside and yelled for everyone to hurry up and get outside and look at the sky.  My husband, Sam Powell, and my neighbor who was over visiting, Zebbie Wassom, came outside.  I counted 10 lights in the sky.  We all watched for a few minutes.  There was no noise.  I saw new lights emerge from the distant southeast at about 30 degrees in the sky.  They appeared more of a flaming red color.  The lights followed an arcing pattern through the sky. (Appearing in the southeast, moving northwest, moving west, moving southwest, then moving south and disappearing.  All this activity occurred in the southern part of the sky.) Some lights were further apart from each other.  Some lights were higher than others but not by more than about 5 degrees.  Some lights appeared to change speed slightly.  Some lights appeared to change direction slightly.  As the lights got closer they all appeared more of an orange color. \tWe all went back inside.  My husband got out the phone book.  Zebbie and I grabbed our cell phones and went back outside. It was 7:20 pm according to my cell phone as Zebbie called her husband who was at home across the street and told him to look out the window towards the south in the sky. \tZebbie went back inside shortly thereafter.  I continued watching until the last light was gone at 7:24 pm. Overall, I counted about 15 lights in the sky at one time and about 24 lights total.   The lights were high up in the sky – not to be confused with airplanes coming in for approach to Spokane International Airport or Fairchild Air Force Base.  The lights appeared larger when they emerged from the distant southeast sky. When they were closer they were about the size of a regular star in the sky except they were bright and flickered.  The lights did not come down from the sky instead the moved across: in, around, and then out. The lights did not have a tail on them like a comet. I didn’t bother to try and record this event on my cell phone because I thought the clarity would be bad and besides it would be on the news with an explanation of what had happened. The rest of the evening and for a few days I watched  local TV news stations to see if anyone else saw it, but nothing was reported that day or since. ((NUFORC Note:  We spoke via telephone with this witness, and we found her to be exceptionally eloquent and objective in her description of the object she and her husband witnessed.  Very high-quality witnesses, we believe, and high-quality reports.  PD))",
      "link": "http://www.nuforc.org/webreports/105/S105221.html",
      "state": "WA",
      "duration": "9 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c1175",
      "summary": "On 11-23-2013, Saturday, about 7:15pm, my family, a guest and I went out back of my home to play with our dog. The sky was clear. While",
      "city": "spokane",
      "shape": "light",
      "date": "2013-12-12T00:00:00",
      "story": "On 11-23-2013, Saturday, about 7:15pm, my family, a guest and I went out back of my home to play with our dog.  The sky was clear. While there we were looking around into the sky and the neighborhood.  Then my wife ((name deleted)), happened to look toward the southeast and notice all these lights popping out.  There had to be about a dozen or so when she said look at all those lights. They appeared to be a bright fiery read in color and changing to an almost orange color.  I would guest they were not as far away as the stars.  We got as quiet as possible to notice if there was any sounds.  We noticed none. Then, the further they went to the northwest they would stop and move back and forth toward one another, like they were playing, then stopping and going.  They seem to be in some random formation.  Suddenly the first several would disappear to the south of where I reside, then more would appear from the southeast. This display lasted from about 7:15 pm until about 7:25 pm. I then called three media stations, KREM-2; KXLY-4 and KHQ-6 and none of them seem to be interested in my conversation, at all.",
      "link": "http://www.nuforc.org/webreports/105/S105220.html",
      "state": "WA",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c11ae",
      "summary": "Hovering, undentified, flying object that changed colors and traveled through the sky",
      "city": "spokane",
      "shape": "disk",
      "date": "2014-02-07T00:00:00",
      "story": "Hovering, undentified, flying object that changed colors and traveled through the sky The location that we live at in Spokane is app. 500 feet higher than the rest of Spokane, WA.  On 2/5/14 I was awoken to a loud sound that sounded like after burners of a rocket.  The noise was coming from right above our house and it shook our room.  My father was an airplane pilot and we have airplane's and helicopter's that go over our house frequently.  So, I am very familiar with the noises that they make when they travel over the air space above our home.   I knew right away that this was no airplane because I grew up around airplanes as my dad was a pilot.  The noise startled me because I never, ever had heard anything like that before in our area.   I got up looked out our large bay window from the 2nd floor of our house and couldn't believe what I saw.  I saw an object that was changing colors that was hovering and like floating westbound through the air.   My husband and son also got up and witnessed the object, and they couldn't believe what we were seeing.  The object changed colors from a beautiful emerald green, red, blue, orange and also to a white color.   We were so surprised to see such an object right in front of our own eyes that was so beautiful just traveling slowly through the air westbound towards Seattle.   We watched it and watched it, of all times none of our cameras were working.  While watching it at one point we did witness what appeared to be a helicopter approach the object.  They kept their distance from the object, they didn't get close to it.  The helicopter stayed back from it, again didn't get close to it at all and it finally it backed off and left the object alone.  The object appeared to be larger than the helicopter but not by much.   The object just seemed to hover in the sky slowly moving westbound.  We watched the object until we could no longer see it any longer.  We were shocked to see such an unbelievable site, and we have always been uncertain about if there are UFO's in the world or not.   After seeing th! is AMAZING BEAUTIFUL OBJECT, the three of us that watched it for the a pp. 44 minutes are believers!!  We would of never ever had the opportunity to witness such an unbelievable, AWESOME, site it the noise it had made when it was traveling through the sky hadn't awoken me again at about 2:00 AM, when we normally are sleeping.   We felt excited, had so many questions that we will never have answered and we did feel somewhat scared, as the questions go on and on. In the end we felt very blessed to see such a site, and again we now are believers in UFO's as our family had just seen one.   It shook our room and the noise was unbelievable.  Without the noise that it made in passing through the sky in the middle of the night, we would never ever witnessed such an astonishing site of a object that appeared to be a real UFO!! ((NUFORC Note:  We spoke via telephone with the witness, and we found her to be quite eloquent and serious-minded.  The object may have passed quite close to Fairchild AFB, which is located just west of Spokane.  PD))",
      "link": "http://www.nuforc.org/webreports/106/S106963.html",
      "state": "WA",
      "duration": "44 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c16a7",
      "summary": "Two small, intense, blinking lights circled above Spokane Valley, WA.  ((NUFORC Note:  Advertising lights??  PD))",
      "city": "spokane",
      "shape": "flash",
      "date": "2013-10-23T00:00:00",
      "story": "Two small, intense, blinking lights circled above Spokane Valley, WA. Peter Davenport: I just saw the strangest of the three or four UFOs I have seen.  At about 6:57 PDT, I saw two blinking lights zooming around.  It started with one very small and bright, blue-white light heading east, which appeared to be a satellite. I was about fifteen miles north of Spokane, WA and looking to the south.  A second one appeared slightly to the east of the first and heading west, toward the other one.  They were blinking randomly about one second each two to four seconds.  At this time I thought I was watching something taking place a thousand feet above I-90, in Spokane Valley.  They might have been a few miles north of Mica Peak. As the two small, intense, blinking lights interacted for thirty seconds or so, they changed speed and direction.  Because the lights were off more than they were on, it was hard to tell which one was which as they cirlcled.  Sometimes they may have been moving at about the speed of airplanes and sometimes much faster than any airplane.  I blinked my eyes and asked myself if I was really seeing it in the physical realm and the answer was yes.   After twenty or thirty seconds, they separated and disappeared when they were about a mile apart, providing they were actually above I-90.  --  I can't rule out some sort of Laser light show, but it sure looked like an interdimensional light show to me.       -- Sincerely, J S",
      "link": "http://www.nuforc.org/webreports/103/S103425.html",
      "state": "WA",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c18a9",
      "summary": "Odd light twinkle.",
      "city": "spokane",
      "shape": "sphere",
      "date": "2014-07-20T00:00:00",
      "story": "Odd light twinkle It was about midnight and I wanted to see the supermoon at its fullest and needed to water my garden, I went to turn on the outside water and something felt a little eerie, I looked up and to the North and I saw what I describe as a twinkle like the end a meteror but as soon as I focused on it, it went black.   I didn't feel excited or happy, it made me feel scared.  I watered my plants in a hurry and still felt uneasy about it.  It was probably less than 50 yards above me.",
      "link": "http://www.nuforc.org/webreports/111/S111440.html",
      "state": "WA",
      "duration": "seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c1cd8",
      "summary": "Orange sphere that was completely silent.  It moved from West to East for about 1 minute, and then sped up and changed direction to N.",
      "city": "spokane",
      "shape": "circle",
      "date": "2014-06-04T00:00:00",
      "story": "Orange sphere that was completely silent.   It moved from West to East for about 1 minute, and then sped up and changed direction to north.  Eventually it disappeared on the horizon.  Bright from every angle and completely silent.   Altitude was approximately 1000 feet.   It was dusk. ((NUFORC Note:  Witness elects to remain totally anonymous; provides little contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/109/S109743.html",
      "state": "WA",
      "duration": "90 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c1dd1",
      "summary": "High flying, fast, large white object Eastern Washington",
      "city": "spokane",
      "shape": "oval",
      "date": "2014-06-20T00:00:00",
      "story": "High flying, fast, large white object Eastern Washington I was waiting at the Hastings Park and Ride bus Terminal in North Spokane.  I was waiting for the 11:55 am bus headed north to my home in Deer Park.  I estimate the time to be about 11:30 am.   I was facing north and I happen to look up at the sky to see a very large, white object heading east to west at height and with speed.  What surprised me was the speed it seemed to travel and the size it was.  Normally, when one sees a plane at that height the plane is small, hard to see, and moving at a speed that appears slow to our relative perspective.   This white colored object, however, was 3 to 4 time larger that a plane would be at that height and is travel through a large cloud break at a very fast pace.  Much faster than any convention planes I’ve ever seen.   Oddly enough it also left no condensation trail of any kind.   I would normally discount this as the sun reflecting off an airplane but I can still not account for the size of this thing, the lack of any type of condensation trail, and the speed it was moving at.",
      "link": "http://www.nuforc.org/webreports/110/S110287.html",
      "state": "WA",
      "duration": "4 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c1f07",
      "summary": "I witnessed unexplainable bright light with very strange movement in Spokane.",
      "city": "spokane",
      "shape": "light",
      "date": "2014-06-04T00:00:00",
      "story": "I witnessed unexplainable bright light with very strange movement in Spokane. I witnessed unexplainable bright light movement in sky tonight.  I live out in the country in South Spokane, and I went out past my yard and house to edge of woods to hear the owls.   I looked up at what I thought may be very bright plane or maybe satellite but the movement was like NOTHING I have ever seen before.  This light was almost falling slowly in the north eastern part of the sky.  Almost a 60-70• angle above horizon.   It would \"fall\" or orbit downward in a feather like trajectory, swaying from left to right slowly and then stopping perfectly still with no blinking lights or sound of any kind.  Then it would start up again never really following a pattern but seemingly heading downward toward the horizon.  Then it just disappeared.   I have been a lifelong satellite watcher and can say it was a bit bigger or at least brighter but not much.  It had absolutely no flashing lights and when planes or helicopters are that close there is sound.   Not sure what to think.  Does ISS behave this way?",
      "link": "http://www.nuforc.org/webreports/109/S109827.html",
      "state": "WA",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c2667",
      "summary": "Silver cylinder no wings no sound.",
      "city": "spokane",
      "shape": "cylinder",
      "date": "2014-12-05T00:00:00",
      "story": "Silver cylinder no wings no sound. A very brief sighting in that I noticed this object the size of a normal passenger  airline except it had no wings.  It was flying south east of my location at a hight lower than normal.  I was entering  at park with trees, by the time I was able to get another clear look at it no longer was it visible. A clear day blue sky not a cloud.  This object was silver not a normal silver I don’t know what made it different in color it just was.  And thats about all I have with me a good cam maybe next time.",
      "link": "http://www.nuforc.org/webreports/115/S115698.html",
      "state": "WA",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c2d75",
      "summary": "Orb like vehicle with green and red glow hovering in one area then moving vertical, horizontal, and 180 degree turns.",
      "city": "spokane",
      "shape": "sphere",
      "date": "2014-08-22T00:00:00",
      "story": "Orb like vehicle with green and red glow hovering in one area then moving vertical, horizontal, and 180 degree turns. On Aug. 15, 2014, around 8:00 PM just after sunset in Spokane, Washington State, on the northeast side of town, my neighbors, my wife, and I were having a BBQ, when I noticed a green flash move very quickly across the sky.  I asked if anyone else had seen the light and they replied with a no.   About ten minutes later, my wife had asked, “Is that the Lights you saw?”  I said yes.   Then we realized that this was not normal, it was too large to be an online purchased drone, and it was not an airplane or a helicopter because there was no rotor noise and we would have heard it at the distance we were.   The craft was between 10 and 20 feet long and was emitting a bright green light with a faint red light with it.   This vehicle hovered for a few moments, then went vertical, horizontal, and even maneuvered in what appeared to be a 180 instant turn around without having to bank like a plane or helicopter, then it slowly descended behind the trees as if it were coming down to land.",
      "link": "http://www.nuforc.org/webreports/112/S112516.html",
      "state": "WA",
      "duration": "2-5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c2f94",
      "summary": "Sitting on My Deck and saw Fireball heading N x NE from Spokane Valley I-90 at Hwy 27 at arms leangth about the size of dime - pretty l",
      "city": "spokane",
      "shape": "fireball",
      "date": "2014-08-22T00:00:00",
      "story": "Sitting on my deck and saw fireball heading N x NE from Spokane Valley I-90 at Hwy 27 at arm's leangth about the size of dime - pretty large really, and moving not all that fast.  A white center and orange to yellow edges and yellow to white trail which followed about 1/3 of the sky - horizon to horizon - the trailing streak seemed much softer than the usual shooting star and was moving much slower.   I would estimate it at around 10-20,000 ft. ele. and If I had to guess it would have hit the Earth somewhere near Deer Park or Chewelah WA.  The duration was about 4-5 sec.. I have seen something similar in 1974 in Oregon but this one was much more colorful (yellow and orange and \"floating\" very slow for a meteor . . . Thanx",
      "link": "http://www.nuforc.org/webreports/112/S112627.html",
      "state": "WA",
      "duration": "4 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c306c",
      "summary": "Green and red light hovering silently around treeline block away from my house.",
      "city": "spokane",
      "shape": "fireball",
      "date": "2014-08-08T00:00:00",
      "story": "Green and red light hovering silently around treeline block away from my house. I was on my patio which faces south of 1800 W Cleveland, the wind was stating to blow a storm was coming in, then a pair of lights came up from the tree a block south, one was green and one was red they looked seperate but had the exact same movement.  First I noticed it come from the south side of the tree, its a bushy tall tree so like 150 feet tall and sits in the back of a vacant home on Grace.  The lights came half the distance closer to my patio at one point, staying at the same height then went back to the other side of the tree and went behind, then it went up real fast like it was propelled.   I'm from England but moved here 12 years ago and have gotten used to heavy airplane and helicopter traffic and this was neither because it was only a block away and didn't hear anything.  It went on for several minutes I thought it was longer but can't remember.   It seems as though it was looking for something in the tree the way it went back and forth and behind it.  The red and green lights were just glowing and basically and nothing else was seen.  I find it hard to describe.",
      "link": "http://www.nuforc.org/webreports/112/S112237.html",
      "state": "WA",
      "duration": "several minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c306d",
      "summary": "Black shiny orb over west Spokane during evening storm.",
      "city": "spokane",
      "shape": "sphere",
      "date": "2014-08-08T00:00:00",
      "story": "Black shiny orb over west Spokane during evening storm. A storm was approaching Spokane at 18:20pm, 8-2-2014, and the lights began to flicker in my house.   I went outside (still daylight with clouds ) to observe the storm and noticed strong winds pushing to the Northeast and birds scattering around.  Then a black shiny polished looking orb flies over in a perfect trajectory flying S.E. (like the ISS, I see it fly over at night alot)  The elevation could be around 2 - 4 hundred feet.   It could not have been affected by the wind as it seemed to be in an orbit like the ISS.  Did not make a sound and I continued watching until it went out of sight in the far S.E. and I know it wasn't ISS because this was under the clouds, black and much larger.   It did not appear to change in elevation during the 30 seconds it was viewable.  Again it was black and had a shiny polished look to it.   The size was not large from my perspective about the size of a half dollar at arm's length at its closest from my back yard it was just a bit east of my position in west Spokane but almost straight over so I got a good look at it.  I watched it until it got smaller and smaller until it was no longer visible. ((NUFORC Note:  We spoke via telephone with this witness, and we found hime to be both eloquent in his description of the sighting event, and sincere.  PD))",
      "link": "http://www.nuforc.org/webreports/112/S112132.html",
      "state": "WA",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c3409",
      "summary": "Flat shaped white light traveling fairly slow, with a long trail of red and white tail, almost like what u would see from a plane.",
      "city": "spokane",
      "shape": "light",
      "date": "2015-03-06T00:00:00",
      "story": "Flat shaped white light traveling fairly slow, with a long trail of red and white tail, almost like what u would see from a plane.  Had sparkling dust like lights within the trail mist.  And had small sparkling white lights following, that would fade and come back.  Possibly a BIG meteor, but deff not anything I have ever seen.   Was like a giant slow moving shooting star with lots of color.  Almost beautiful!! ((NUFORC Note:  Re-entering Chinese 3rd-stage rocket casing.  PD))",
      "link": "http://www.nuforc.org/webreports/117/S117455.html",
      "state": "WA",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c3bfe",
      "summary": "Father and son witness two highly-reflective, disk-shaped craft, in the southeastern sky of Spokane.",
      "city": "spokane",
      "shape": "light",
      "date": "2015-07-31T00:00:00",
      "story": "Father and son witness two highly-reflective, disk-shaped craft, in the southeastern sky of Spokane. Telephoned Report:   An adult male contacted the UFO Hotline, and reported that he and his adult son had witnessed two highly-reflective, perhaps disk-shaped, objects in the southeastern sky, as viewed from the City of Spokane. The caller described himself as a serious amateur astronomer, having once used a hard-mounted 10-inch reflector telescope.   He stated that he had never witnessed such a phenomenon. ((NUFORC Note:  Neither witness has submitted a written, detailed, report, and the caller has not responded to multiple calls to his telephone number.  PD))",
      "link": "http://www.nuforc.org/webreports/120/S120763.html",
      "state": "WA",
      "duration": "30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c3dc8",
      "summary": "Reddish-orange light over downtown Spokane, WA.",
      "city": "spokane",
      "shape": "light",
      "date": "2015-06-24T00:00:00",
      "story": "Reddish-orange light over downtown Spokane, WA. I was sitting in the park with my friend, stargazing.  I suddenly saw a reddish orange light moving over downtown Spokane from what looked like the east.   It seemed too fast for a regular plane and as soon as I pointed it out, it curved hard towards south south-west, directly away from my pointing finger, and kind of corkscrewed, until we couldn't see it anymore.   About 5-7 minutes later, a plane appeared, taking almost the same path as the light, but much slower. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/119/S119677.html",
      "state": "WA",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c3ece",
      "summary": "Bright light in front of cloud east of Spokane",
      "city": "spokane",
      "shape": "light",
      "date": "2015-06-15T00:00:00",
      "story": "Bright light in front of cloud east of Spokane Hi, My husband and I enjoy listening to Peter on Coast to Coast, but I never figured I would be sending in a report. I actually live in Spokane, north of Fairchild, down in the canyon… so not too far from Peter.   Yesterday, Tuesday, June 9th, I was heading into work eastbound on Hwy 2 towards I-90.  I was watching the geo engineering in the eastern sky, as there were three planes that I could see at the time that were spraying.   At about 7:45 just before I got to the I-90 ramp I saw something bright and round in front of a cloud, north of the three planes.  Honestly I have never seen anything like this before.  It was much larger than a star and much brighter than one.  It was round and just incredibly bright.   It did not move at all, just pulsated bright.  I watched it for about 10 seconds, then it disappeared into the cloud behind it.",
      "link": "http://www.nuforc.org/webreports/119/S119465.html",
      "state": "WA",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c4074",
      "summary": "Yellowish orange sphere.",
      "city": "spokane",
      "shape": "",
      "date": "2015-05-29T00:00:00",
      "story": "Yellowish orange sphere. For the past week, on and off, we have seen two orange spheres with lights moving slowly in the sky.  They move from south to northwest then to east",
      "link": "http://www.nuforc.org/webreports/119/S119184.html",
      "state": "WA",
      "duration": "30-45 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c45a3",
      "summary": "2 objects East of Spokane  pulsed for over an hour.  ((NUFORC Note:  Sighting of 3 planets in eastern sky.  PD))",
      "city": "spokane",
      "shape": "circle",
      "date": "2015-11-06T00:00:00",
      "story": "2 objects East of Spokane  pulsed for over an hour 10-31-2015 4 am to 5 am  East of Spokane, there appeared  quantity (2)  two  objects.  The two objects glow, then would pulse and expand  to 4 objects each. and return to  two objects ,(not a airplane strobe)    Objects  appear to be much larger than a star.  The two  objects did not move,  the spread when pulsing was much greater than dirty atmosphere reflection would  explain.  the two objects   pulsed every 4 seconds I  watched   for about an hour ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/123/S123291.html",
      "state": "WA",
      "duration": "1+ hours"
    },
    {
      "_id": "64d005f478aba2ec5a3c45af",
      "summary": "I looked out my window and saw this glowing light.  It was to bright and to big to be a star.  ((NUFORC Note:  Venus??  PD))",
      "city": "spokane",
      "shape": "other",
      "date": "2015-11-26T00:00:00",
      "story": "I woke up to go to the bathroom at 5 o'clock in the morning.  After I finished, I looked out my window and saw this glowing light.  It was to bright and to big to be a star.  The light was pulsing on and off.  I was rubbing my eyes to make sure this was real.  After 5 minutes of me watching, it disappeared.   Then, after that, I stayed up for about 45 minutes, looking into the sky.  Then I eventually fell asleep, not seeing the object again.  The object looked like it had 5 separate lights almost like an atom particle.  The light it produced was white, like any standard light bulb color you can find in the store.",
      "link": "http://www.nuforc.org/webreports/124/S124300.html",
      "state": "WA",
      "duration": "5 minutes +"
    },
    {
      "_id": "64d005f478aba2ec5a3c47c4",
      "summary": "12+ blinking, pulsing, and darting around lights at varied distances for 5+ hours after power outages and less light pollution.",
      "city": "spokane",
      "shape": "circle",
      "date": "2015-11-19T00:00:00",
      "story": "12+ blinking, pulsing, and darting around lights at varied distances for 5+ hours after power outages and less light pollution. There were several circular, blinking lights in the sky.  Some were reddish in hue that blinked and pulsed white and very, very quickly--a greenish light.  There was a bright gold star-like light that moved then was hovering over the area.  There were three to four white, blinking lights that seemed to be aware that I was watching them.  When I waved at them, hoping they would be able to see me, their movements became more rapid and longer in distance.   During the three hours I was walking around in and out of the Hangman Hills neighborhood, I saw five to six \"shooting stars\".  However, I realized after the third one that they were moving a bit slowly to be shooting starts, and I believe that they were craft, dipping in and out of perhaps our dimension, or perhaps my disbelief and excitement prohibited me from being able to perceive them for a prolonged amount of time.   As I continued watching, different craft would become \"seen\" by me that were closer and closer to me.  I truly believe that they wanted to be seen and the whole experience was very peaceful, calm and loving.",
      "link": "http://www.nuforc.org/webreports/124/S124177.html",
      "state": "WA",
      "duration": "5 hours"
    },
    {
      "_id": "64d005f478aba2ec5a3c490b",
      "summary": "Many aircrafts one main with bright white light, bobbing and weaving; all of them.",
      "city": "spokane",
      "shape": "light",
      "date": "2015-10-09T00:00:00",
      "story": "Many aircrafts one main with bright white light, bobbing and weaving; all of them. Saw a very bright light and many smaller lights they were flashing colors being blue, white or yellow and green, the bigger light was showing colors but only around the light if you didn't look directly, all of the lights were moving up and down and side to side, I have videos and pictures of the event, is happening again currently, less extra crafts and the bright main one is way father away.  Never have I ever seen this kind of thing.  Keep your eyes and skies open.",
      "link": "http://www.nuforc.org/webreports/122/S122588.html",
      "state": "WA",
      "duration": "4 hours"
    },
    {
      "_id": "64d005f478aba2ec5a3c4a3c",
      "summary": "There's 1 big light that I've seen every night since I first spotted it.  ((NUFORC Note:  Three planets in the eastern sky.  PD))",
      "city": "spokane",
      "shape": "unknown",
      "date": "2015-10-29T00:00:00",
      "story": "There's one big light that I've seen every night since I first spotted it, some nights there's only one, other nights there's 3,. . .it just bobs in the same spot, you can tell that it's moving, the colors on it are white, purple, and green, almost looks like a star to the naked eye but with binoculars you can tell that it's not ((NUFORC Note:  Three planets in the eastern sky.  PD))",
      "link": "http://www.nuforc.org/webreports/123/S123195.html",
      "state": "WA",
      "duration": "Still there"
    },
    {
      "_id": "64d005f478aba2ec5a3c4aae",
      "summary": "Saw one green fireball zoom downward.  ((NUFORC Note:  We suspect a meteor.  PD))",
      "city": "spokane",
      "shape": "fireball",
      "date": "2015-10-02T00:00:00",
      "story": "Saw one green fireball zoom downward. While driving south on Wall Street towards downtown Spokane, I saw green ball of light starting about 45 degrees up from the horizon, zooming down to horizon in less than 2 seconds and disappeared.   I would call it a \"fireball\" because it was much bigger than a star or the meteors I've seen. ((NUFORC Note:  We suspect a meteor.  PD)) ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/122/S122418.html",
      "state": "WA",
      "duration": "2 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c5106",
      "summary": "Bright star like object that crossed sky then went straight up out of sight.",
      "city": "spokane",
      "shape": "light",
      "date": "2016-02-26T00:00:00",
      "story": "Bright star like object that crossed sky then went straight up out of sight. I have never reported any type of ufo before so this will be my first time.  I live in the city of Spokane by the college campus of Gonzaga.  I stepped out onto my front porch as I do often on a clear night and look up at the stars.  Instantly I noticed a very bright star to the south that at first seemed stationary but then started moving across the sky due north.  It looked like a very bright star much bigger then any satellite but had no lights that a aircraft would possess.   It traveled for maybe 5 seconds before stopping I expected at this point to be able to recognize the object but at that point it took off directly straight up shrinking in size and then disappearing.  I don't know what else to say except this was no satellite no aircraft or a illusion the object traveled far enough and definitely went straight up to rule out a illusion.",
      "link": "http://www.nuforc.org/webreports/126/S126039.html",
      "state": "WA",
      "duration": "10-15 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c52ff",
      "summary": "Plane Vs UFO.",
      "city": "spokane",
      "shape": "circle",
      "date": "2016-01-14T00:00:00",
      "story": "Plane Vs UFO This last summer me and my son were on the roof star gazing, facing west we saw the red orb type ufo fly from northwest to southeast, then a second or few later it flew back northwest from the southeast direction until it disappeared. What I believed makes this sighting so great  is that we saw a passenger plane flying about 2000k ft. below the ufo(the ufo was extremely high in the sky) so we could get a real reference of how fast the ufo was going which was a lot faster than the plane at a much higher altitude.",
      "link": "http://www.nuforc.org/webreports/125/S125201.html",
      "state": "WA",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c5751",
      "summary": "Black Triangle Craft spotted in Spokane, Washington.  ((NUFORC Note:  Serious report, or maybe not??  PD))",
      "city": "spokane",
      "shape": "triangle",
      "date": "2016-07-15T00:00:00",
      "story": "Black Triangle Craft spotted in Spokane, Washington It was a fairly clear day in Spokane, me and my parents were on a walk with our dog while I was visiting and we heard a noise coming from the sky.  The sound however was not the sound of an airplane from the nearby airport.  I looked up to the sky to see a small black triangle craft coming down to earth, I panicked and pointed it out to my parents (I'm 23). We did not get a photo graph of the object.   The craft slowly descended down to the sidewalk, the craft was around 4 ft. long and 2 ft. tall. and had green and blue lights all over, the craft also made a few sounds along the lines of \"boop beep ziiip\". The craft hovered in front of me and my parents for a short time before shooting off into the sky. Us 3 are the only witnesses to this event as far as I know. I'm not sure if our dog should count as a witness or not, he did bark at the object a few times, so if you do count as animals as witnesses, it's 4. ((NUFORC Note:  Serious report, or maybe not??  PD)) ((BEGIN ADDENDUM #1 FROM SOURCE OF REPORT)) Dear Peter, Thank you for replying to my report. My report is 100% sincere. My parents don't believe in aliens and are dismissing this and don't want to get involved, so I'm all you've got right now.  I live east coast near D.C.  I own a Cessna 172g and fly it for recreational purposes, I am currently looking into a job to be a Pilot. I did not fly a plane to Spokane where my parents live, I took a long and beautiful car trip.  My phone is currently in repairs after I accidentally spilled my beer on it yesterday and will not be able to take calls for a while.  If you have any questions feel free to Email me. ((END #1)) ((BEGIN ADDENDUM #2 FROM SOURCE)) I understand that you would expect this report to be a hoax, but I'm dead serious, this has to be the strangest thing that's ever happened to me. ((END #2)) ((ADDENDUM #3 FROM SOURCE)) there is no one to my knowledge who saw it, when we got back home I had asked a few neighbors if they had seen what I had seen and told me I was crazy, I'm assuming they haven't seen It. I had my parents give me a run down of the whole situation, my father believes the craft may have been scanning us, my mother doesn't know what to think, but they don't want to be involved with the whole situation ((END #3))",
      "link": "http://www.nuforc.org/webreports/128/S128445.html",
      "state": "WA",
      "duration": "~15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c5b0f",
      "summary": "Fast moving white orb moving north.",
      "city": "spokane",
      "shape": "circle",
      "date": "2016-04-15T00:00:00",
      "story": "fast moving white orb moving north. Clear night.  Could see a lot of stars & a few aircraft flying in area.  Out in backyard with my dog.  Looked up in sky & noticed far up in sky a very fast moving white colored circle shape moving north.  It seemed to suddenly appear from the southern part of sky.  It was not aircraft. It was too fast & moved unlike a plane.",
      "link": "http://www.nuforc.org/webreports/126/S126676.html",
      "state": "WA",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c5f6a",
      "summary": "Brightly lit triangle craft hovered 50 feet above roadway Spokane, WA.",
      "city": "spokane",
      "shape": "triangle",
      "date": "2016-11-11T00:00:00",
      "story": "Brightly lit triangle craft hovered 50 feet above roadway Spokane, WA. I was driving home on High Drive around 9:30 pm Wednesday Nov. 9, 2016, after having dinner in downtown Spokane when this incident occurred. I was headed east on High Drive and approaching the intersection of High Drive and Grand Boulevard when I saw this giant incredibly bright object in the sky that was immediately above the treetops about four blocks away. At first, I wasn't sure if it was a panel of stadium lights, but there's no stadium anywhere nearby. I live just a short distance from where this incident occurred, and I have been there thousands of times over the past 17 years, and I have never once seen a light like that anywhere in the neighborhood. I drove toward the object, and pulled over on the south side of East 43rd Avenue, between South Scott and South Garfield Streets. What I saw was a giant triangle that was only 50 feet or so above me, and hovering above some trees in a residential neighborhood. The object appeared to be about 180 feet long (half the distance between Scott Street and Garfield Street on 43rd Avenue) and 90 feet wide. There were white lights all the way around the sides of the triangle, and it was hovering in one place and didn't make any noise. Where I pulled over by the side of the road was almost directly underneath this triangle object, and I could see dark black circles on the underside. I turned my engine off, and watched this triangle object. There was absolutely no noise coming from it. Right after I pulled over, the thing started moving slowly from east to west. I reached in my purse to grab my cell phone so that I could take a picture, and I kept looking back at the triangle when suddenly it took off faster than anything ever seen my life. It was the strangest thing I've ever seen. When the object took off, it went west. It's speed was so fast that had I blinked my eyes, I would've missed it. The entire incident lasted about 10 minutes (9:30 to 9:40 pm). I know this because I had just looked at my dashboard clock as I approached the intersection of High Drive and Grand Boulevard, and I called my mother immediately afterward to tell her what I had seen. If I was to compare the size of the triangle from my perspective it to the size of a full moon, it was dozens if not hundreds of times bigger. If I was to compare the size of the triangle to my clenched fist held at arm's length, it was much, much larger. Although I was alone in my car, I am absolutely certain that there were other witnesses to this incident. When I reached the intersection of Grand Boulevard and High Drive at 9:30 pm, there were several Spokane Police officers standing in the flowerbeds of a private residence and talking to an older gentleman. They were parked in the driveway of the house on the north side of High Drive. They appeared to be looking for something in the flowerbeds adjacent to the roadway at a private home on the south side of High Drive. While I was parked on 43rd Avenue and watching the triangle, another car (vehicle #2) drove by my car. Vehicle #2 was headed east to west on 43rd Ave. and passed directly under this giant lighted triangle. I am absolutely certain the driver of Vehicle #2 saw the triangle, because it was brighter than any light I have ever seen. When I got home, I went to the Spokane News page on Facebook to see if anyone had posted anything about this. The only thing I found was a post about a car accident that occurred at 6 pm that night at the intersection of Grand Boulevard and High Drive. However, was no sign of any vehicle collision at that intersection at 9:30 pm, so I don't think the  triangle object is related to the car accident earlier that evening. ((NUFORC Note:  We spoke via telephone on two occasions, and she seemed to us to be quite eloquent and sincere.  We strongly suspect that she is a quite capable, and credible, witness.  PD))",
      "link": "http://www.nuforc.org/webreports/131/S131140.html",
      "state": "WA",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c625c",
      "summary": "Two members of her family had seen two strange lights over Fairchild Airforce Base.",
      "city": "spokane",
      "shape": "unknown",
      "date": "2016-09-30T00:00:00",
      "story": "On September 28, a co-worker told me that on the prior evening, Sept 27th, approximately 9:30pm or 10:00pm, two members of her family had seen two strange lights over Fairchild Airforce Base.  Said there was cellphone video of one of the object.   As the two witnesses observed, jets were scrambled to intercept these lights.  As the jets approached, the two lights shot straight up and out if sight. ((NUFORC Note:  We have requested that the eyewitnesses be invited to submit reports, and we have expressed a desire to look at the video.  PD))",
      "link": "http://www.nuforc.org/webreports/130/S130342.html",
      "state": "WA",
      "duration": "~30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c6fde",
      "summary": "UFO oval shape emitted immensely bright lights for one minute.",
      "city": "spokane",
      "shape": "oval",
      "date": "2017-08-04T00:00:00",
      "story": "UFO oval shape emitted immensely bright lights for one minute. Saw it pull up with bright lights, floating semi close to the ground, but I was in the valley below looking upwards at the top of the tree covered hill.  It was barely above the trees.  It made a stationary stop and started to emit a very very bright light that illuminated for around a minute.  It had no flashing red lights like planes usually do, so intrigued I began to take a look. It pulls up with large white lights above the trees and stops, it then starts the lights.  I was scared because it was moving quite slow in comparison to that of a normal plane.  These lights lasted roughly one minute average.  I even recorded it on my phone in person I was staring at the blinding light.  In my recording, I was able to capture the image and even notice what seemed to be a second spacecraft blinking in a non-rhythmic pattern. ((NUFORC Note:  Witness elects to remain totally anonymous; provides little contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/135/S135397.html",
      "state": "WA",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c7007",
      "summary": "Oval craft emitted a extremely bright light for a minute then went back to the \"normal\" lights then headed W.",
      "city": "spokane",
      "shape": "oval",
      "date": "2017-08-04T00:00:00",
      "story": "Oval Craft Emitted a extremely bright light for a minute then went back to the &quot;normal&quot; lights then headed W Washington RESUBMIT WITH MORE DETAIL. Saw the Oval lighted craft pull up 11:20PM lights lasted around one minute average. While it drove their were constant lights going on like headlights.  But the light it emitted during that minute was the brightest I had ever seen.  Never seen anything that can stay stationary until last night.  After the lights it headed towards W Washington.  It did this light thing at the top of the hill over some trees. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/135/S135396.html",
      "state": "WA",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c703e",
      "summary": "Just before 10pm, it streaked slower than a meteor, arching from S to N faster than a jet, it left silver blue trail. ((anon. report))",
      "city": "spokane",
      "shape": "unknown",
      "date": "2017-08-04T00:00:00",
      "story": "It was shortly before 10pm, it streaked slower than a meteor, arching from South to North faster than a jet, it left a silver blue trail behind it, it started to Dip low and it seemed to turn to West and looked like a bright green orb fairly large.   I know the airbase had air shows this weekend, but not at night. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/135/S135453.html",
      "state": "WA",
      "duration": "<5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c712d",
      "summary": "While trying to capture photos of the Northern Lights on Sunday evening/early morning Monday, I witnessed a flashing light that went fr",
      "city": "spokane",
      "shape": "circle",
      "date": "2017-07-23T00:00:00",
      "story": "While trying to capture photos of the Northern Lights on Sunday evening/early morning Monday, I witnessed a flashing light that went from bright white to red and then would vanish.  I saw this happen twice between the span of 30 to 45 minutes.  The first one was sighted roughly around midnight and the second one, roughly 30 or so minutes later.   I tried to capture it on my camera, but was unable too.  I only witnessed this happening two times through the 3 hours I was taking photographs to the east, but it really stood out as unusual.   There was air traffic turning and coming in from the east to the west to land at Spokane International Airport (GEG), but what I saw did not resemble any kind of aircraft nor was it moving and transitioning through the sky, as it was stationary.   Object/Light appeared to be about 2,000 to 3,000 feet in elevation and about halfway between the Summit of Mount Spokane and Newman Lake, which resides to the South.",
      "link": "http://www.nuforc.org/webreports/135/S135210.html",
      "state": "WA",
      "duration": "Seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c7550",
      "summary": "Huge LED looking light hovering at tree line disappeared instantly after 4 minutes of watching.  No trace",
      "city": "spokane",
      "shape": "circle",
      "date": "2017-04-28T00:00:00",
      "story": "Huge LED looking light hovering at tree line disappeared instantly after 4 minutes of watching.  No trace Saw a literal perfect sphere that was at my tree line of our house.  Watched for at least 4 minutes, don't know how long it was there was just getting home.  Took 3 pictures, doesn't capture the brightness or the size well but it does show the perfect sphere.  It instantly disappeared.  No trace, no light trail, nothing it was gone.",
      "link": "http://www.nuforc.org/webreports/133/S133738.html",
      "state": "WA",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c80a5",
      "summary": "The object started out appearing like a bright star or planet. Something seemed odd about it. It was staitionary for about five mins, t",
      "city": "spokane",
      "shape": "other",
      "date": "2018-03-29T00:00:00",
      "story": "The object started out appearing like a bright star or planet.  Something seemed odd about it. It was staitionary for about five mins, then it defended strait down, and we knew it was not a star.  We drove towards it to get a better look.  At that point it seemed to start following us.  It became a game of cat and mouse for 45 minutes.  At one point it hovered over us.  When it wasn't in the bright star position, it appeared to have a blinking blue lift, and a blinking red light.  It flew over us about 200 feet off the ground, and looked like a flat streamlined jet, no sound, and when it tunned, it remains horizontal no wing tips, gluiding through the air.",
      "link": "http://www.nuforc.org/webreports/139/S139301.html",
      "state": "WA",
      "duration": "45 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c8268",
      "summary": "Bright star like lights in north day time sky, Spokane Wa.",
      "city": "spokane",
      "shape": "light",
      "date": "2018-11-09T00:00:00",
      "story": "Bright star like lights in north day time sky, Spokane Wa. On Wednesday, July 19, 2006 I went out to wait for the mailman, my house faces north so I was observing the north sky while I waited, it was 1:15pm.  I noticed a bright star in the north about 45 degrees above my position just sitting and looking like the north star in the day time, unusual since it was bright and sunny with no clouds.  (about the same place you'd see the north star at night)  Then, coming from the east about two degrees above the first light, I witnessed another bright light coming towards it.  When light #2 was directly above the first one it stopped and now there were 2 star like lights above and below each other.  After several seconds the lower light started moving west and the upper one remained. It took a few minutes but light 2 eventually faded.  I believe the sun was reflecting off of what ever they were since the sun was directly behind in the south.  I have lived in Spokane all my life and have worked for the same company for 25 years.  I! spend a great deal of time outdoors and have witnessed several unidentified aerial phenomena events over the years.",
      "link": "http://www.nuforc.org/webreports/143/S143659.html",
      "state": "WA",
      "duration": "4-5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c840e",
      "summary": "It was a radio announcer.",
      "city": "spokane",
      "shape": "unknown",
      "date": "2018-08-10T00:00:00",
      "story": "It was a radio announcer. Hello!  Back in 1974, my husband and I were driving along in Idaho, heading to Washington, and we kept hearing the guy on our favorite rock and roll station say things like, “Ya can't keep a secret in the ol deep freeze,” and this went on for 30 minutes between songs. So, when the news came on the jockey  said “a ufo had crashed in Indiana and four humanoid bodies were aboard and were deceased.  WELL!!!  Not another word about it, and lots of people I spoke to heard the radio announcement and were really curious. That is all I have to say, other than I have contacted the angel, Raphael, many times in meditation to go help others and he was always a blue color….I never understood that till recently and I cried finally knowing…I am not religious or organized in any way.  I have dreams, at least that is what I call them, which are very revealing but that's a long story. I mainly wanted to say something about that 1974 news that never reached many people, LOL. Thank you for being here.  8)",
      "link": "http://www.nuforc.org/webreports/142/S142394.html",
      "state": "WA",
      "duration": "30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c85ad",
      "summary": "Sept 9th, 2018 strange reddish brown, rectangular disc shaped object seen over Spokane.",
      "city": "spokane",
      "shape": "disk",
      "date": "2018-09-13T00:00:00",
      "story": "Sept 9th, 2018, strange reddish brown, rectangular disc shaped object seen over Spokane. On September 9th, 2018, at approximately 10:35 A.M., I was looking out of my upstairs bedroom window on the South Hill of Spokane.  Facing north, I saw an object traveling across the sky that was dark reddish brown in color and was shaped like a disc or rectangle. The object didn’t make any noise or leave a trail. The sky was clear blue with no clouds or other objects in view.  I visually followed the object traveling in the sky from east to west for approximately five seconds when it dropped in altitude and changed direction moving south west of my window and out of view.  It moved horizontally and sped up when it changed direction.  The sighting lasted about ten to fifteen seconds. The object was too large to be a drone and at an altitude that would be occupied by aircraft seemingly.   I am 38 years old, often looked to the sky in admiration, but this is the first time I have seen anything resembling what I saw this morning. ((NUFORC Note:  We spoke via telephone with this witness, and he seemed to us to be quite sincere and sober-minded.  We suspect he is a very good witness.  PD))",
      "link": "http://www.nuforc.org/webreports/143/S143059.html",
      "state": "WA",
      "duration": "10-15 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c8700",
      "summary": "((HOAX??))  Two white cigar-shaped craft close together.  ((anonymous report))",
      "city": "spokane",
      "shape": "cigar",
      "date": "2018-08-10T00:00:00",
      "story": "Two white cigar-shaped craft close together At 12 noon I saw two white cigar shaped craft very close together high in the sky.  One flew just ahead of the other, and they were close, about the width of a wing had they been airplanes.  They flew west to east across the sky and flashed briefly in the Sun, but I still saw no wings or contrails.   40 minutes later I saw two similar craft fly back east to west in the same configuration.  One emitted a thick white contrail and the other did not.  They may well have all been airplanes.  Now it is 14:24 and there are two contrails twisted like a double helix across the sky ESE to WNW.  That's probably just a wind pattern.  I don't really think these are extraterrestrial craft, but I'd love some answers. ((NUFORC Note:  We can't provide answers, if the witness doesn't provide contact information.  Witness elects to remain totally anonymous, and provides no contact information.  Hoax??  PD))",
      "link": "http://www.nuforc.org/webreports/142/S142595.html",
      "state": "WA",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c8964",
      "summary": "Two satellite objects traveling at typical satellite speeds then taking an acute right angle at shooting star speed.",
      "city": "spokane",
      "shape": "light",
      "date": "2019-09-06T00:00:00",
      "story": "Two satellite objects traveling at typical satellite speeds then taking an acute right angle at shooting star speed Scanning the night sky I caught a moving object above the NE horizon that appeared to be a satellite moving at typical speed.  Once I focused on the object I saw a second similar object trailing relatively close behind moving at identical speed.  I followed their trail for a few moments then suddenly the lead \"satellite\" took an acute right angle maneuver with a speed of that of a shooting star and disappeared.  The trailing \"satellite\" a second or two later performed the same maneuver. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/147/S147829.html",
      "state": "WA",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c8d1f",
      "summary": "Spokane, WA, lights.  ((NUFORC Note:  Possibly a planet or \"twinkling\" star??  PD))",
      "city": "spokane",
      "shape": "unknown",
      "date": "2019-02-01T00:00:00",
      "story": "Spokane, WA, lights. HI, I am originally from Spokane.  Here is my question.  When I am in Post Falls at night I look toward Spokane at a 45 degree up angle and I can see a light that flashes green then red then white in a repeating pattern.  As I drive into Spokane Valley, the light disappears although I can still see surrounding stars.  If I continue on up Sunset Hill and get out by Spokane international airport and look back east to Spokane, I can see the blinking lights again at a 45 degree angle to the east.  The lights are stationary.  Other people have seen lights like this.  Here is a youtube video that looks like what I see. https://www.youtube.com/watch?v=jdNSUIua7l8  I have seen these lights over different towns that I have visited.  You could go and look for yourself at the Spokane light.  It is located above the tower mountain area just south of the city. I have no idea what it is.  I just found it weird that I could triangulate its location.  That makes me consider that it is not at a very high altitude. ((NUFORC Note:  Source of report indicates that the date of the sighting is approximate.  PD)) ((NUFORC Note:  Possibly a planet or \"twinkling\" star??  PD))",
      "link": "http://www.nuforc.org/webreports/144/S144728.html",
      "state": "WA",
      "duration": "continuous"
    },
    {
      "_id": "64d005f478aba2ec5a3c8d9a",
      "summary": "Moving circular white light/object slows down, merges with second, smaller light, combined object turns 90 degrees, and disappears.",
      "city": "spokane",
      "shape": "circle",
      "date": "2019-01-11T00:00:00",
      "story": "Moving circular white light/object slows down, merges with second, smaller light, combined object turns 90 degrees, and disappears. We had barbequed a turkey at my folks place southeast of Spokane, WA.  Most of my family was there, including two sisters, two B-i-l’s, mom, dad (skeptic) and me.  My two sons had gone home to Washington earlier in the day.  Well, I like an occasional cigarette after dinner and Tim, my skeptical brother-in-law is a confirmed addict.  We went out on the back porch to smoke after dinner.  It was very dark, very clear, and cold.  I happened to look up and saw a white circular light/object moving from west to east and very high up (seemed to be anyway.)   This light was very much like one I’d seen about 10 years ago in Fall City, WA. (reported to NUFORC) but seemed higher up.  If I hold my hand straight up and away, the object would have been about 1/8th of an inch or so wide.  Much bigger than any star.  Once again it appeared to be a weird, “confined” light.  I immediately shouted “look at that” and pointed at it.  Tim looked up and didn’t say anything, but he wa! s watching.  He saw it. The light approached a smaller, less well-defined white light that looked like a big star.  My first thought was “satellite” but the moving object seemed too big for that.  Then it slowed down and seemed to merge with the smaller light, then they both changed direction to the south and poof, they disappeared. Several observations:  It was much larger than any star in the sky and once again it was that weird, seemingly confined white light.  Not terribly bright, but very obviously moving.  If I pick a spot on the ceiling of my office, while sitting in my chair, the object would appear to have moved about 1 foot across the ceiling/starfield, if that makes sense. When we first saw it, it was moving, once again, in what seemed a purposeful way (we’ve discussed this before) from west to east.  Tim saw it almost immediately after I did and we both saw it slow down and approach another light/object that was similar in color, but appeared smaller – maybe ½ the size.  They came together and became a single light/object – no size change.  Once they merged together, they turned but not in an immediate, 90 degree turn that is often described and seems physically impossible.  This was more gradual, as though going around a corner, but a sharp corner.  In the previous ceiling example, it would’ve executed the turn over just a couple of inches.  Then it was moving to the south.  While we were both staring at it, it just blinked out.  Gone.  We waited a bit, looking, but no other objects appeared to be moving.  I asked him “you saw that didn’t you!”  He said “yeah, I did….and it was weird.”  He was obviously taken aback.  Not quite shaken really, but definitely weirded out.  I can’t tell you how happy I was to have someone else see it.  We went back in and I told the group around table that we’d seen a UFO!  We'd all had a couple of drinks and they all jeered a bit, of course, but I think that Tim’s behavior caught them off guard.  They know him very, very well and know he’d be jeering too if it hadn’t been quite a sight.  It was that, alright.  I checked on the ISS and it was in the sky, but much later that night.  I also check flightaware, etc., there were airliners up of course, but this wasn’t an airliner.  Airplanes don’t slow down that way and then execute a quite sharp turn. It was almost an instantaneous 90 deg. turn, but not quite.  No noise of course.  Don’t know what it was, but for now at least, we know it was a UFO.  I don’t know if these things are extraterrestrial or not, but I would sure like to know. I need to report to Nurforc and will do so tonight.  Should’ve called Peter D. before now, but was very busy and oddly, I didn’t t! hink to do it immediately, nor did either of us think of trying to pull out a phone.  It was one of those things where we were both sort of stunned by what we were seeing.  I’ll give it more thought and file a report with Nuforc and Mufon tonight.",
      "link": "http://www.nuforc.org/webreports/144/S144348.html",
      "state": "WA",
      "duration": "~1 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c8eab",
      "summary": "Numerous objects flying NW to SE over Spokane County",
      "city": "spokane",
      "shape": "fireball",
      "date": "2019-01-04T00:00:00",
      "story": "Numerous objects flying NW to SE over Spokane County. About 15 flying objects flew one after another from northwest to southeast.  They flew at different heights.  A couple turned midflight, a couple heading west and one heading east.",
      "link": "http://www.nuforc.org/webreports/144/S144230.html",
      "state": "WA",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c8eae",
      "summary": "They were orange, they made no sound. They came from the northwest and traveled to the southeast direction.  ((anonymous report))",
      "city": "spokane",
      "shape": "circle",
      "date": "2019-01-04T00:00:00",
      "story": "They were orange, they made no sound.  They came from the northwest and traveled to the southeast direction.  They appeared one at a time and seemed to come from a low altitude and as they traveled they seemed to go higher then disappear.",
      "link": "http://www.nuforc.org/webreports/144/S144252.html",
      "state": "WA",
      "duration": "20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c97bf",
      "summary": "I was viewing sky from my back porch, when I noticed a glowing orange orb located southwest of my backyard way off in the distance in t",
      "city": "spokane",
      "shape": "circle",
      "date": "2019-12-19T00:00:00",
      "story": "I was viewing sky from my back porch, when I noticed a glowing orange orb located southwest of my backyard way off in the distance in the clear section of the sky, the glowing orb slowly dropped down while moving southwest, till it was out of my sight.",
      "link": "http://www.nuforc.org/webreports/151/S151596.html",
      "state": "WA",
      "duration": "11 minutes"
    }
  ]
}