{
  "city": "stlouis",
  "fetch_timestamp": "2025-07-12T14:33:39.945828",
  "record_count": 157,
  "pages_fetched": 7,
  "api_calls": 8,
  "source": "ufo_aficionado_api",
  "records": [
    {
      "_id": "64d005f478aba2ec5a3b4162",
      "summary": "Observation of spherical white colored craft in geostationary position for 1 hour plus.",
      "city": "stlouis",
      "shape": "sphere",
      "date": "",
      "story": "Observation of spherical white colored craft in geostationary position for 1 hour plus. The altitude at a guess at 2,000 feet high. This was seen on September 4, 1962 at 3:30 pm Central Standard Time. Location of sighting was 2.6 miles south of St. Louis Lambert airport. The sky was clear and wind was calm. My mother was hanging clothes out to dry, and called out to me to come out and see the object. I rejected her offer for some time, but she insisted that it was  something I should see. When I finally went out and saw the object we talked and she asked if it could be Venus? I told her that it could not be because of the time of day and direction was eastward. I was a member of the St. Louis Astronomical Society at this time. My mom said I should get my telescope and take a look. At the age of 15 I wasn't totally coordinated yet, and I broke the front glass out of the front screen door. Trying to get the telescope out the door. I'm adding for the time frame. It took a bit of work to gather the broken glass up before a got the telescope to the back yard. Setting up the telescope. It was a Tasco refractor 60 mm objective lens, with a alt-azimuth mount. I first used the wide angle eyepiece to spot the object. I found it magnified well, but still rather small. I let my mom look through the scope and by this time we had the next door neighbors over also. So now we have our own star party. Three adults and one kid. I let everyone take there time and look. Of course they all asked if I could get it bigger. I set the 3 X barlow and the strongest eyepiece. This set the magnification of 525 power. When I looked at the object it nearly filled the entire field of view.  I can only explain that I had it focused perfect!  It looked like a cue ball.  No markings.  Perfectly smooth and rather off white, not shiny.  It did not give any glow off.  No sense of spinning motion, and no noise at all. This is important. This object has not moved one nanometer in an hour of time. Nothing in the heavens or earth can do that!  When you view the moon at full power with that telescope it's like a big train moving by. This didn't move. I expected it to move and was in total disbelief at what I was seeing. I let my mom and the neighbors husband and wife both take long looks at the object and we all agreed that it was not moving. I kept saying this can't be happening! No one is going to believe me at the next Astronomical meeting. But I got witnesses!  Better yet I've done lunar eclipse photos, and said I will be getting my camera and special eye mount for it and I'll be back. Never had a chance to move. When we look back at the time in history, it was as one of the worst in nuclear confutations. The \"Cuban missile crisis\" was happening. I no sooner said that I was going to get the camera when I hear a very load jet aircraft take off. Living for many year near the airport we grew accustomed to the different sounds of the commercial, and air force aircraft flying and even crashing near by as a F-86 did a mile down the road. This was the sound of afterburners and full throttle. As soon as the plane came above the tree line I spotted it as a B-47. She was doing a tight circle as we literality turned our bodies around as it circled and climbed for altitude. On the second sweep around I was beginning to wonder if it had something to do with our visitor in the sky above. I was a lucky hunch, because at that very moment I scream! Look it moved! What had been stationary for an hour did a sudden straight vertical movement to twice the altitude in a split second and stopped. The B-47 was still in hot pursuit with all engines at full throttle. It kept a circular pattern as she climbed up toward the object. After about the fourth revolution around the B-47 chase was over. I saw the object go from that second position to ascend straight up out of sight. My mom insisted that I report this to the Air Force base at Lambert Field. I looked up a few numbers that sounded official and dialed them. When I mentioned I wanted to report a UFO, they responded I could get in a lot of trouble doing this. Did my parents know I was doing crank calls to the US Government? The last call I made I did get through to an Air Force official and said I wanted to report a UFO and it was being chased by a B-47. He said that's ridicules there's no B-47 aircraft in the air. I said if you don't believe me look out your window. He hung up quickly.  No report was ever made to the papers that I could ever recall. Iwould like to know if anyone in the St. Louis area saw this object also.",
      "link": "http://www.nuforc.org/webreports/049/S49863.html",
      "state": "MO",
      "duration": "1 Hour plus"
    },
    {
      "_id": "64d005f478aba2ec5a3b429b",
      "summary": "UFO's over  Saint Louis and Metro East Counties.",
      "city": "stlouis",
      "shape": "light",
      "date": "2006-05-15T00:00:00",
      "story": "UFO's over  Saint Louis and Metro East Counties. It was about 4 AM on the night of January 15th 2004, When my friend and I were driving home from another friends house in Belleville IL. Between Belleville and Centerville IL, there is about a 5-8 mile strrtch of wood encompassed Highway, and thats when we saw and experienced the following events: About a mile or so past Fairview Hieghts, I inexplicablly had the sensation to look over my shoulder and to the left of me. At that moment I noticed something very out of the ordinary. Shining down on the surface of the adjacent, Westbound side of Interstate 64/40 were three blue circles of light. Even stranger, was that these concentric circles were pacing our car...in the same direction we were traveling, on the opposing westbound highway. Then what seemed to begin happening is that a state of...Oh well,What can I do...feeling came over me, not fear or panic, just....Oh well. My friend looked over after I said to look, she looked back at me, we looked at the clock on her car radio and it read 4:05 AM. We looked back at the lights and then eachother, and the next thing I knew it was 4:30 or so by the radio clock and we were entering the highway interchange near Centerville IL. about 6 or 7 miles from were we had just been! To this day me and my girl still talk about it. We also saw about a Year later, another strange object at her apartment complexs in Kirkwood Missouri. It was about noon, in the broad day light. I went out onto her back patio to smoke a cigarette, and as I was lighting it, I looked up to my left to see a jetliner cruise by and its contrail forming. Only, at the end of the contrail, and seemingly following the jetliner, was a bright green, glowing sphere of light. As soon as I noticed it though and called for my griend to qiickly grab her camera, it seemed to take notice in me. It bounced arounded and darted from point to point in the sky, almost as if it were putting on a show for me, just to make a point of saying \"Hi you can see me, I also see you.\" It kept this up until my friend returned with her camera, at which point this object shot right to my zenith. She quickly snapped a picture, and with that the object simply zipped off out of view. Although we knew whatever came out on that film would be low and questionable quality, nontheless we were still excited to see what we did have on it. When the film was developed though, oddly, every single print was blank.",
      "link": "http://www.nuforc.org/webreports/050/S50024.html",
      "state": "MO",
      "duration": "30 mins"
    },
    {
      "_id": "64d005f478aba2ec5a3b4404",
      "summary": "There was a sudden appearance in the sky of a bright green light travelling extremely fast from north to southest with a bright green t",
      "city": "stlouis",
      "shape": "light",
      "date": "2006-05-15T00:00:00",
      "story": "There was a sudden appearance in the sky of a bright green light travelling extremely fast from north to southest with a bright green tail out behind it. It was larger than a star or planet, and was travelling horizontally to the ground.",
      "link": "http://www.nuforc.org/webreports/049/S49917.html",
      "state": "MO",
      "duration": "2 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b44fb",
      "summary": "IWas walking around the park w/ my son, we were looking at clouds ,trees, i was showing him the deference in clouds and the diferenr k",
      "city": "stlouis",
      "shape": "unknown",
      "date": "2019-08-23T00:00:00",
      "story": "I was walking around the park with my son ,we were looking at clouds,trees,i was showing him the deference in clouds and the diferenr kinds of seeds each tree makes.  As we come full circle around the park look up at the clouds and happen to notice an object hovering almost over us in the sky.  It was higher then the trees but under the clouds.  It was as hight as you would exspect a helixopter to be and about the same size of one with out the tail propeler.  It rotated about 45 degrees, then it descended slightly, rotated again i could see heat wave coming form under the back of it and it looked as it had a small blue flame like jet purpoltio.  Coming from it that made it illuminate a light blue.  It moved forward about 29ft the started to elelvate until it vanished in the cloud.  After the cloud had past it was gone, just disappeared.  It made no sound at all",
      "link": "http://www.nuforc.org/webreports/147/S147840.html",
      "state": "MO",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b47ed",
      "summary": "White UFO not seen by naked eye, but captured in camera",
      "city": "stlouis",
      "shape": "disk",
      "date": "2019-06-07T00:00:00",
      "story": "White UFO not seen by naked eye, but captured in camera While visiting the Gateway Arch in St. Louis, MO, I took several photos of the Arch, landscape, family and overall views. While shooting pictures of my son drinking from a water fountain, a large US flag over a nearby building caught my eye so shot a picture of it, to then return to a couple more photos of my son. Two weeks later, back at home, while reviewing the photos, there is a white unidentified object behind the flag, white in color and what seems a very classical disk. At the time I didn't see any object with my eyes of the optical viewfinder of the camera. If I seen the object I would have shot a burst and tried to track it as long as possible. ((NUFORC Note:  We see nothing in the photo, which is terribly out of focus.  PD))",
      "link": "http://www.nuforc.org/webreports/146/S146659.html",
      "state": "MO",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3b4893",
      "summary": "Something in clouds.",
      "city": "stlouis",
      "shape": "unknown",
      "date": "2019-06-07T00:00:00",
      "story": "something in clouds I'm not sure what's going on here but I can tell you I was in a hotel on the 3rd floor, which is right by the river  Looking out the window that morning I noticed the clouds were not moving but shaking so I started to record the clouds I then put a filter on my camera and that's when I black things floating around the clouds look like electric but only a few and then it seemed they were getting sucked into something I have no idea where to begin and then it all just stops and there was a flash that kept happening on my phone after coming home and looking over the footage there are all kinds of things going on there's something with 2 eyes transparent and a spine I think I'm sending you the video.",
      "link": "http://www.nuforc.org/webreports/146/S146556.html",
      "state": "MO",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b48a7",
      "summary": "I was looking up into the sky and seen a white light travel straight for around 10 sec and  and disappear.",
      "city": "stlouis",
      "shape": "light",
      "date": "2019-07-25T00:00:00",
      "story": "I was looking up into the sky and seen a white light travel straight for around 10 sec and  and disappear",
      "link": "http://www.nuforc.org/webreports/147/S147535.html",
      "state": "MO",
      "duration": "5sec"
    },
    {
      "_id": "64d005f478aba2ec5a3b4a7d",
      "summary": "Fast moving object fly towards the horizon in 0.16 sec",
      "city": "stlouis",
      "shape": "light",
      "date": "2019-06-20T00:00:00",
      "story": "Fast moving object fly towards the horizon in 0.16 sec While reviewing family vacation videos, a fast moving UFO was captured during 5 frames of video (30 fps recording).  It appeared over ourselves moving towards the horizon.  It took the object 5 frames to cross the entire visible sky towards the horizon. Attaching 6 frames of the video, first one without the object as reference when the object enters the frame.",
      "link": "http://www.nuforc.org/webreports/146/S146735.html",
      "state": "MO",
      "duration": "0.16 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b4e20",
      "summary": "Bright blue silent flash lights up eastern sky.",
      "city": "stlouis",
      "shape": "flash",
      "date": "2019-05-09T00:00:00",
      "story": "Bright blue silent flash lights up eastern sky. My husband and I live on the river bluff in St. Louis city.  We were looking due east and saw a bright blue silent flash light up the sky.  It wasn’t coming from up or down it came from the middle of the sky.  The location of the flash would be directly over illinois.  It lit up the whole sky.  Have never ever seen anything like this before.",
      "link": "http://www.nuforc.org/webreports/145/S145871.html",
      "state": "MO",
      "duration": "2 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b4ed1",
      "summary": "On our way to the hockey game about 7pm as we we were getting on to 55 north from highway 270 there was a very fast moving bright green",
      "city": "stlouis",
      "shape": "light",
      "date": "2019-04-08T00:00:00",
      "story": "On our way to the hockey game, about 7pm, as we we were getting on to 55 north from highway 270, there was a very fast moving bright green light that looked like it was heading towards the earth's surface.  It was moving faster than anything I've ever seen before.  It didn't appear to be very big.",
      "link": "http://www.nuforc.org/webreports/145/S145463.html",
      "state": "MO",
      "duration": "3-5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b4ed7",
      "summary": "Facing SE on Telegraph Road, I was walking and as I left a QT gas station I looked up and saw a glowing sphere shaped object. It",
      "city": "stlouis",
      "shape": "sphere",
      "date": "2019-04-08T00:00:00",
      "story": "Facing south east on Telegraph Road, I was walking and as I left a QT gas station, I looked up and saw a glowing sphere shaped object.  It was shing bright blue with a white glow to the back, almost like a propellant or exhaust.  The object was in my view only for a few seconds before it flew off at alarming speeds.  The fastest thing I have ever seen in my lifetime.",
      "link": "http://www.nuforc.org/webreports/145/S145455.html",
      "state": "MO",
      "duration": "<4 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b543b",
      "summary": "Black rectangle hovering",
      "city": "stlouis",
      "shape": "rectangle",
      "date": "2006-10-30T00:00:00",
      "story": "Black rectangle hovering Driving east on Rt 364 just west of I-270 a little after 7am when a black rectangle appeared about 30 degrees up from the horizon and in the south / southeast sky.  The rectangle just hovered in the sky.  After about two minutes the shape dimished in shape and eventually disappeared.  About 30 seconds later a bright white \"cloud\" appeared in the same place that was likely a reflection of the sun.  Seconds later the rectangular shape turned black again hovering in the same place.  After about 10 minutes the shape simply disappeared.  The sky was clear and their were no aircraft in the area.",
      "link": "http://www.nuforc.org/webreports/051/S51416.html",
      "state": "MO",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b55bf",
      "summary": "January 5th, 2000, 5 Dupo lights.",
      "city": "stlouis",
      "shape": "unknown",
      "date": "2008-03-04T00:00:00",
      "story": "jan 5 dupo lights sorry i cant add much to this  i worked a walmart in waterloo il overnight.  had a late lunch 330-430.  crossing the jb bridge going east saw lights over dupo il it was far away 5+ miles  noticed large brite and low---- did not know what i saw untill next day   you wanted to know",
      "link": "http://www.nuforc.org/webreports/060/S60432.html",
      "state": "MO",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b5644",
      "summary": "Large black fast moving triangular shaped aircraft rumbling across the sky.",
      "city": "stlouis",
      "shape": "triangle",
      "date": "2006-10-30T00:00:00",
      "story": "Large black fast moving triangular shaped aircraft rumbling across the sky. My husband and two year old were sitting outside on a lounge chair, when my husband yelled out my name, \"come quick, girls come quick.\" Within eight steps I was out my door, with three girls behind me.  I had heard the aircraft it was load!  Thinking I would see three fighter jets (which would have been typical, especially since we have the National Guard here cleaning up from the storms).  But when I looked up it was a black triangular shaped aircraft where it was wide in shape with two of the points being squared off, and completing the triangle.  I ran fast to the end of the drive pointing it out to my three daughters but it moved so quickly and then disappeared through the clouds.  As we discussed what we had just seen some answers maybe Boeing has a new craft-possilby gearing up for a war?  My husband said maybe a UFO?  My husband explains while sitting there with our two year old he heard it coming and felt it, it rumbled as it went over him, when he realized it was something he had never seen he started to call us.  He said, \"I thought I'd ask you to grab your camera but I didn't want you to miss it, it was moving so fast.\" Seconds later we heard another aircraft off in the distance, like a 747 airplane, not sure if it was following.  Couldn't see it but heard it once the sound of the first aircraft was gone. ((NUFORC Note:  Witness indicates that the date of the incident is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/051/S51681.html",
      "state": "MO",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b56eb",
      "summary": "i saw something in the sky blinking in a orange colored light moving for about 10 minutes.",
      "city": "stlouis",
      "shape": "light",
      "date": "2006-10-30T00:00:00",
      "story": "i saw something in the sky blinking in a orange colored light moving for about 10 minutes. When i looked out my window i saw a orange colored light blinking in the night sky.at first i thought it was a planet, so i went to go get some water and came back it was moving really fast and it stoped and something came out of it and started to move. then it turned around and then it left the area.",
      "link": "http://www.nuforc.org/webreports/051/S51740.html",
      "state": "MO",
      "duration": "light"
    },
    {
      "_id": "64d005f478aba2ec5a3b5a9a",
      "summary": "Dear Mr. Davenport, \tEvery now and then I like to check in on your website.....that I thank you very much for by the way. Back in May t",
      "city": "stlouis",
      "shape": "",
      "date": "2007-08-07T00:00:00",
      "story": "Dear Mr. Davenport, \tEvery now and then I like to check in on your website.....that I thank you very much for by the way.  Back in May there was a lot of hype about the BLUE MOON & JUPITER coming from SpaceWeather.com \t At around 10:50 (May 31st, 2007) I went out to view the BLUE MOON & JUPITER.  I was standing on my deck facing the East and slightly South when I saw what looked like a vertical column/vapor/cloud to the left of Jupiter.  There was a something that looked like a star rising up and out of it but then disappeared the higher it went.  To the right of the moon I could see a dim star.   I live in the city of St. Louis and most stars are lost in the night sky for us. This just felt a little weird but I am sure there is a probable explanation. After about twenty minutes I went back out on the deck to look at the BLUE MOON & JUPITER again. When I looked up I saw a small airplane with what I will call a vapor coming out of the back.  It was really up high and very small.....in the daylight it would look like smoke coming out of the back of it like when we were kids......could this have been a crop duster and do they do that at night?  It was flying like an airplane NOT LIKE WHAT I SAW EARLIER. That STAR LIKE object seemed to be rising up and out of the vertical column of cloud.  I know the difference.  I have gone over this incident a hundred times in my mind and yes, I do realize that very often we don’t always see what we think we see but I wanted to tell you about it anyway.  I am 66 years of age but this is one of the strangest things that I have ever encountered.  By the way I did check the news on the computer the next day to see if anyone else reported it but could not not find anything.  Then I rationalized that there were certainly enough people viewing the BLUE MOON that night and surely someone other then myself would have seen it.  So now I am left with the dilemma of what was it if anything?????  Carol  From SpaceWeather.com…..  BLUE MOON & JUPITER:  Tonight's Blue Moon has a companion: Jupiter.  All night long, the giant planet will be located right beside the Moon.  You can see them with the naked eye or, for a real treat, scan the pair with a backyard telescope.  Behold the moons of Jupiter, lunar mountains and craters, and maybe even the Great Red Spot: sky map. ((NUFORC Note:  Witness elects to remain totally anonymous;  provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/057/S57478.html",
      "state": "MO",
      "duration": "10 Minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b5df5",
      "summary": "Orange Ball UFO chased by F-4 military fighter jet with abrupt maneuvering by UFO and impossible speeds.",
      "city": "stlouis",
      "shape": "sphere",
      "date": "",
      "story": "Orange Ball UFO chased by F-4 military fighter jet with abrupt maneuvering by UFO and impossible speeds. With my best friend from school, while in the side yard at his house, we heard loud sound of jet plane coming over trees in park across the street. In less than one second there was an F-4 fighter plane chasing a glowing orange ball about 20 feet in diameter, 75 to 80 feet in front of the F-4. They flew almost directly over our head at less than 200 feet. The F-4 and the glowing orange object continued out over the adjacent interstate highway for a mile or so, toward the River de Peres. Before they got to the river, still at just above treetop height, the orange ball abruptly changed direction by approximately 90-degrees, and increased speed to the point that it was able to cross half the sky (60 degrees of angle) from left to right and achieve an altitude of 10 miles or more, in less a quarter second. The object then, just as abruptly, stopped dead in the sky, and it appeared to be taking a position so as to better observe the F-4 as it banked around looking for it. Or so it seemed to a 13-year-old’s imagination. After the glowing orange object abruptly changed course, the F-4’s engines--previously very loud--suddenly became almost silent, and he banked right and left a couple of times as if he were looking for the object. He then continued for a couple of seconds, and made a wide sweeping turn over the River de Peres, and doubled-back over his previous path. After a few seconds, the glowing orange spherical object sitting still in the sky shot away at incredible speed and was completely out of sight within an eighth of a second. It has been many years since this occurred, and I just want to make sure that it gets reported. Back then it never occurred to me to report it; much less did I know whom I would report it to. I have discussed this with the other witness as recently as 14 years ago, and our recollections were very similar, but not in the level of detail as I have included, herein. For the record, I believe there may be good explanations behind such phenomena, which go beyond ascribing them to alien intelligence. ((NUFORC Note:  Witness indicates that the date of the event is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/061/S61288.html",
      "state": "MO",
      "duration": "2 min"
    },
    {
      "_id": "64d005f478aba2ec5a3b5df4",
      "summary": "fire ball over south county 1963  north to south",
      "city": "stlouis",
      "shape": "fireball",
      "date": "",
      "story": "fire ball over south county 1963  north to south i lived in the south county most of my life, in 1963 moved off of christopher dr in a subdivision known as tam o shanter, it was summer, and i was going home walking  west at the top of a hill on the way, out of the north came this fireball. it took this damned thing. witch was so low, to leave a glow on the ground and the lake to my left. it went south over the tree line, this thing had a tail behind it about as long as it was around, yellowish-red it color    i was wating for it to hit the ground  this thing looked so damed unreal almost like a cartoon,  you wanted them all this one ive keep to myself ((NUFORC Note:  Date is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/060/S60431.html",
      "state": "MO",
      "duration": "10 sec"
    },
    {
      "_id": "64d005f478aba2ec5a3b5e62",
      "summary": "1969 forest park , cigar ,  brownish gray color     went of to the west",
      "city": "stlouis",
      "shape": "cigar",
      "date": "2008-02-14T00:00:00",
      "story": "1969 forest park , cigar ,  brownish gray color     went of to the west i was siting in my car at hampton and watson facing north forest park was at horizon line. the trees were starting to green up real good when i noticed a brownish gray shaped thing above the park .it floted there a min or less diped into the green of the park back up into view .lifted up about 4 times its lengh and started moving to the west it was out of sight it about 5 sec moving in an upward angle into some high cloudes. the thing was in the park between my drive line and barns hospital about by the horse stables, when it started  my distance was about 2.5 to 3 miles from the craft it was aprx 150 to 200 ft in lengh and no it was not the arena. this was a clear blue sky sighting ((NUFORC Note:  Witness indicates that the date of the event is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/060/S60430.html",
      "state": "MO",
      "duration": "2min"
    },
    {
      "_id": "64d005f478aba2ec5a3b5e61",
      "summary": "1968 sighting south st louis county , other people witness .5 min  new 255 and lemay ferry rd",
      "city": "stlouis",
      "shape": "oval",
      "date": "",
      "story": "1968 sighting south st louis county , other people witness .5 min  new 255 and lemay ferry rd i was sitting at lemay ferry and an off ramp of the new 255 interchange.the light turned green and the car in front of me did not move .the man was looking to the southwest over a then a central hardware store. other people were looking in the same direction.thats win i notice a round parachutes look thing floating about 1500ft above and behind the store, what seemed odd is it was not falling stayed in one spot also it had dim lighting on the under belly of the object. we watched it for about a min or two long enough to here (do you see that) and other remarks from the crowd of people. then like a flash it took off and up and to the west i noticed something like a vaper trail in the direction it went.we all looked at oneanother and got in our cars want on our ways ((NUFORC Note:  Witness indicates that the date of the event is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/060/S60429.html",
      "state": "MO",
      "duration": "5min"
    },
    {
      "_id": "64d005f478aba2ec5a3b62f1",
      "summary": "Black floating objects flying over St. Louis, Mo.",
      "city": "stlouis",
      "shape": "unknown",
      "date": "2007-08-07T00:00:00",
      "story": "Black floating objects flying over St. Louis, Mo. On the evening of Monday, June 25, 2007 I noticed what seem to be floating balloons (4) at first, but then I noticed they were keeping a permanent formation. As they drew nearer I realized they were some sort of aircraft. They were very black in color, no associated noise. They seemed to be floating. They were close, but I could not make out a definite shape, no lights (still daylight out). Their flight pattern was south to north, then back again. In route two of them switched positions. Their was one leader and 3 trialing behind, almost in a triangular formation.  I am an avid sky watcher and always study aircrafts, I can't explain what these were...I am baffled.",
      "link": "http://www.nuforc.org/webreports/057/S57353.html",
      "state": "MO",
      "duration": "15-20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b638b",
      "summary": "Another night, another sighting over St. Louis, Mo.",
      "city": "stlouis",
      "shape": "unknown",
      "date": "2007-08-07T00:00:00",
      "story": "Another night, another sighting over St. Louis, Mo. The night after my sighting I spotted a \"star\" with a yellow/red/orange glimmer. It was really twinkling, that is why I noticed it. I tried to ignore it, but curiosity got the best of me, so about 15 minutes later I went back outside to see what the \"star\" was doing...that is when I noticed the red and white flashing lights that were moving around the sky as if they were planes circling while waiting to land at the airport. The airports are too far away from where I was to have been the case. So I stood and watched while they decided to take a flight pattern to the north from south, as they did the night prior. The red and white lights never stopped and I could see them at least 30-40 miles away. Then they came back, just like the night before, but 2 of them went east while the other one stayed south.  My dog and I were on a walk earlier that evening and all of a sudden she got spooked, like I've never seen her ever do before. She just started walking as fast as she could looking and sniffing for something, but it was an aimless chase. She finally settled down about 5 or so minutes into the chase. When we got home she wouldn't go near the front door and that is her post day in and day out.  Like I said before...I am baffled and would love some answers.",
      "link": "http://www.nuforc.org/webreports/057/S57354.html",
      "state": "MO",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b63d4",
      "summary": "December 20, 2007 at 10:06 P.M. in thick fog a tiangle box shaped air craft was seen over the Mississippi River in South St.Louis City.",
      "city": "stlouis",
      "shape": "triangle",
      "date": "2008-03-04T00:00:00",
      "story": "December 20, 2007 at 10:06 P.M. in thick fog a tiangle box shaped air craft was seen over the Mississippi River in South St.Louis City. We were driving north on highway 55 in south St.Louis City on 12/20/07 at 10:06 P.M., it was super foggy that night. We looked east toward the Mississippi River, the highway is about 70 feet above the river on a sloping bluff. We saw three lite blue lights at each point of a dark triangle box shaped air craft. The triangle shaped air craft was traveling north following at a height of about 500 feet above the Mississippi River at about 48 knots/hr.. The craft seemed to be following the the river, but then dipped slightly to it's right and turned north/east over the river and disappeared in the thick fog. There was no sound that we could hear. The triangle shaped craft seemed to just float in the fog like a gost ship at sea.  We seen the craft for only a duration of 10 sec., but it was real.",
      "link": "http://www.nuforc.org/webreports/060/S60445.html",
      "state": "MO",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b63d5",
      "summary": "triangular  object three light on three corners sighted in st. louis city MO.",
      "city": "stlouis",
      "shape": "triangle",
      "date": "2008-03-04T00:00:00",
      "story": "triangular  object three light on three corners sighted in st. louis city MO. location of sighting was highway 55 going north befor Anheuser Busch brewery. facing east on highway 55 over the mississippi river about 600ft off the ground. on an angle going north east. there where three lights on the three corners of the craft and it was on an angle in the sky as though it was making a qwick turn. it was very foggy out at the time of the sighting.",
      "link": "http://www.nuforc.org/webreports/060/S60467.html",
      "state": "MO",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b6837",
      "summary": "very bright,stationary white light rapidly flashing on and off. It stayed in the same spot for at least 6 hours.",
      "city": "stlouis",
      "shape": "flash",
      "date": "2007-11-28T00:00:00",
      "story": "very bright,stationary white light rapidly flashing on and off. It stayed in the same spot for at least 6 hours. I saw a very bright, silent, white light rapidly flashing on and off. It did not move at all. I observed it at about 10:00 pm. It was still in the exact same spot flashing on and off at 3:30 am. It was not a planet because planets don't blink on and off and it was not a helicopter because it did not move at all.",
      "link": "http://www.nuforc.org/webreports/059/S59583.html",
      "state": "MO",
      "duration": "at least 6 hours"
    },
    {
      "_id": "64d005f478aba2ec5a3b6e25",
      "summary": "triangle shape w/lights kinda transparent with fluid movement",
      "city": "stlouis",
      "shape": "triangle",
      "date": "2008-03-04T00:00:00",
      "story": "triangle shape w/lights kinda transparent with fluid movement While observing the lunar eclipse on the night of February 20, 2008 with a neighbor,  we witnessed an object moving  directly above and south of us. The object appeared  to be a triangle shape kinda transparent moving slowly fluid like in a south and slightly westward direction . It appeared to be low the size of 20 to 30 feet across and 15 feet to the point with about 15 soft red lights along the back, the lights did not blink but moved or softly waved with the entire craft kinda fluid like, similar to a  a jelly fish's appearance and movement (not shape). We had the opportunity to witness this with binoculars as well as unaided sight it is hard to say the size but we lost sight of it as it went over the neighbors house .",
      "link": "http://www.nuforc.org/webreports/061/S61913.html",
      "state": "MO",
      "duration": "45 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b6e88",
      "summary": "Big triangle thing the size of a medium sized bank.  ((NUFORC Note:  Cannot certify whether this is a serious report.  PD))",
      "city": "stlouis",
      "shape": "triangle",
      "date": "2007-08-07T00:00:00",
      "story": "Big triangle thing the size of a medium sized bank with light up ends hopvers over my house and my camera is staticy with greys.  50 IT looked like a cigar at first, but it was turning in a circle pattern and it turned out to be a triangle. It had orangeish crimson lights at its points and it was a black middle section. I was slowly moving towards where i live and all the cats in my house came into the same room i was in  (all 5) and i held one up to the window as it was hovering over my house and the faint humming sound from the craft was gone. I was on the phone with a relative who was 5 miles away telling him about it on my cell phone, the phone was making weird noises and the screen was static, and the radio in my bedroom was going rampid and alot of static and what sounded like the russian language being chirped (like a bird would try to communicate in russian). THe thing hovered over and then all the electrical devices in my house were fine. My camera was experiencing static but there was a light shade of a humanoid in the background of it in static like an old black in white tv having bad reception. They were small like 3-4 feet tall and were Grey in the static wearing some kind of clothing and they had big round heads. the eyes were the biggest part of their face and i could not notice any face parts like a nose ears or mouth. ((NUFORC Note:  We cannot certify that this is intended as a serious report.  No other reports from the area for this date.  PD))",
      "link": "http://www.nuforc.org/webreports/057/S57638.html",
      "state": "MO",
      "duration": "4 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b6e8a",
      "summary": "THe ufo was a triangle and it tryed to abduct me and it happend before 8 years ago.",
      "city": "stlouis",
      "shape": "triangle",
      "date": "2007-08-07T00:00:00",
      "story": "THe ufo was a triangle and it tryed to abduct me and it happend before 8 years ago. The UFO appeared at 21:33 left at 21:39 and then returned exactly one hour later and left exactly one hour after the last time it left. It was a triangle shaped craft with lights on the tips of the triangle. The lights were a mix of these colors, red, maroon, orange and yellow. The body of the craft was black. It came from the west and was moving east. It was large, it was bigger than any airplane or I had ever seen and it made a small humming noise. The size of the craft would have been he size of a baseball field. The craft was able to distort radio waves and cell phone frequencies. It caused a lot of static on radios and on my cell phone. There were chirping noises coming from my radio in the static. My cell phone had a lot of static. I was on the phone with a family member telling him about it and he may have seen it. It was able to mess with any electrical appliances that were left on. It had my watch on my hand going off the fritz. The second hand kept spinning forward and eventually stopped after it left. My camera even had static on it. I am mailing what I saw on the camera lcd screen. It looked like they were hailing me on my camera like on the show star trek. The weirdest part of the experience is the effect it had on my 5 cats. All five cats came into the room I was in. I even had one locked in my room and it opened the door to get out there. The cats circled me as I was gazing at the object. The object was slowly moving over my house and there was another flying object behind it and it was much smaller like a manmade aircraft chasing it. That aircraft did not make any sound and when it came close to the UFO it left for approximately one hour. I had sent in an earlier report and I mixed up the times by three hours. It happened at dark and the lights of the craft were the only things that could easily be seen. It was spinning clockwise the entire time and when it was hovering over the house. I tried to go outside but my cats would not let me. It came back an hour latter and the! same re sults with electrical devices were happening. I was on the phone with my girlfriend and it went static, I went out to the room and I saw the ufo coming from northwest going southwest towards my house it looked like it was going to collide and then it went invisible and the cats started hissing at something I could not even see in the room. There was a constant humming sound in the room until the cats hissed then it went away again and did not come back. This happened before in September 8 years ago on the 23. The same thing happened then. That was when I was 8 years old, half my life in the past. I think they were going to try and take me.",
      "link": "http://www.nuforc.org/webreports/057/S57650.html",
      "state": "MO",
      "duration": "6 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b71c0",
      "summary": "Object zig -zagging in sky.",
      "city": "stlouis",
      "shape": "light",
      "date": "2007-06-12T00:00:00",
      "story": "Object zig -zagging in sky. Far off into the sky saw a blinking light. Though it was a plane, but after studying it, I watched it zig-zag. It moved in straight lines and sharp angles. After a couple minutes I could not see it any longer. A building blocked my view of it when it kept moving.",
      "link": "http://www.nuforc.org/webreports/056/S56672.html",
      "state": "MO",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b73e4",
      "summary": "((HOAX))  i was abducted",
      "city": "stlouis",
      "shape": "circle",
      "date": "2008-01-21T00:00:00",
      "story": "i was abducted   I was walking my dog on my late night jog and all of a sudden I saw a large circular object over head.  So i ignored it at first and just kept walking and then it swooped down and landed about 1/2 mile in front of me.  I just kept walking and ignored it and got up to it, it was about 50 yards across.  I was just going to walk by and i was sucked into it.  They started poking me with sticks with red probes on the end and my dog too.  Thats all I remember and then I was just back walking where I was and the ship was gone.  It was 23:05 when i got off and it seemed like hours. ((NUFORC Note:  Witness elects to remain totally anonymous;  provides no contact information.  Our gratitude to Barb Becker, of Missouri Investigators Group, for pointing out that this report is a hoax.  I had missed it, in proofreading reports.  PD))",
      "link": "http://www.nuforc.org/webreports/060/S60943.html",
      "state": "MO",
      "duration": "1 hour"
    },
    {
      "_id": "64d005f478aba2ec5a3b7652",
      "summary": "Pulsating , odd performing \"aircraft\"(?)",
      "city": "stlouis",
      "shape": "light",
      "date": "2007-08-14T00:00:00",
      "story": "Pulsating , odd performing \"aircraft\"(?) I was sitting on the patio this evening enjoying a warm clear night. I'm an amateur astronomer/sky watcher and had a pair of 16X Nikons. I noticed a rather bright \"star\" moving from the NW to the SE. I watched it for @3 seconds and it disappeared. Then 3-4 seconds later it reappeared, still traveling in the same direction. I got the binoculars on it and it appeared simply as one of the brighter stars, in motion and with a constant glow. It repeated this twice, on the last \"illumination\" it came to a dead stop, increased in brightness @ 4X, remained at this maximum illumination for @ 2 seconds, and disappeared. That's it.  As I said, this object appeared as nothing more than a moving star, a rather common sighting of terrestrial origins. It was not moving exceptionally fast, it was the on/off of the \"light\" and it's finale that I found unusual. As for altitude I can't speculate beyond that, though not in what would be called space, it was MUCH higher than conventional civilian/commercial aircraft operate at. I've no idea what it was.",
      "link": "http://www.nuforc.org/webreports/058/S58057.html",
      "state": "MO",
      "duration": "@15 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b7ed9",
      "summary": "MISSOURI INVESTIGATORS GROUP Report:  I saw a black metallic cigar shaped object. It moved slowly and was silent.",
      "city": "stlouis",
      "shape": "cigar",
      "date": "2009-12-12T00:00:00",
      "story": "I saw a black metallic cigar shaped object. It moved slowly and was silent. Witness says he reported this to the police. Did not report to any other UFO organization. (Possibly same event reported to NUFORC on 8/10)   Report received by Missouri Investigators Group - http://ufomig.bravehost.com ((NUFORC Note:  We express our sincere gratitude to the MISSOURI INVESTIGATORS GROUP, and to its Director, BARBARA BECKER, for their having shared this report with our Center.  If you have had a sighting in Missouri, please consider contacting that organization, at the website above, to share your sighting with their investigators, in addition to submitting a report to NUFORC.  Thank you!!  PD))",
      "link": "http://www.nuforc.org/webreports/073/S73242.html",
      "state": "MO",
      "duration": "1 hour"
    },
    {
      "_id": "64d005f478aba2ec5a3b833d",
      "summary": "6 glowing orange lights with a center blue light seen in St. Louis",
      "city": "stlouis",
      "shape": "formation",
      "date": "2009-12-12T00:00:00",
      "story": "6 glowing orange lights with a center blue light seen in St. Louis I stepped outside and noticed a formation of 6 glowing orange lights in the Northeastern sky.  In the middle of the lights was a bright blue that traversed across the sky in a Southwestern course. The orange lights were constant glowing like a campfire although it did not flicker.  It was very primative looking with a very dull glow to it.  They were individually points in what appeared to be in the shape of a stretched out hexagon, or a holly leaf.  They all seemed to be traveling at the same speed and in the same pattern, and same direction.  I estimate that they were 4-6 ft tall. The formation traveled between 75-100 ft off of the ground. I was traveling about 200 mph/322 kmh.  All together they would have stretched across 3 football fields.  I noticed I could see through it.  I was able to see things through the “UFO” as it crossed the sky I could watch a stars and a plane in the distance behind the object as it passed by.  As if it was not there at all except for the lights. The blue light was in the direct center.   This light was very precise and very \"high-tech\" looking like an LED light. This light would normally pass as a star, but it stayed in the same formation as the other lights, it traveled in the same direction, and stayed in the direct center.  It also seemed to be pulsating slowly. The only reason that this struck me as a possible “UFO” is that when the lights disappeared, they all dimmed at the same time.  They did not disappear one at a time, like it was going into a cloud bank. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/072/S72372.html",
      "state": "MO",
      "duration": "2 min"
    },
    {
      "_id": "64d005f478aba2ec5a3b8845",
      "summary": "It was about 7:20 to 7:30 pm in St. Louis MO, I was outside, getting some fresh air, when all of a sudden, something I believed to be a",
      "city": "stlouis",
      "shape": "disk",
      "date": "2009-12-12T00:00:00",
      "story": "It was about 7:20 to 7:30 pm in St. Louis MO, I was outside, getting some fresh air, when all of a sudden, something I believed to be a planet, started moving across the night sky. I knew it couldn't be an earth aircraft due to blinking lights moving in a circular fashion. I didn't hear anything but the music that my neighbors had left playing in their garage, but I estimate that it was about 1200 feet above ground, and about 30 meters in diameter. Note that this is just an estimate. I knew it couldn't be an earth aircraft once I started focusing on it. I just couldn't believe my eyes. My dad and brother seem to think I'm lying, but I know there is life outside earth, life forms smarter than us. And that was their craft.",
      "link": "http://www.nuforc.org/webreports/072/S72677.html",
      "state": "MO",
      "duration": "about 10-20 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b88d9",
      "summary": "square or diamond shape craft with flashing and scrolling lights near Hall Street in St Louis Mo  ((NUFORC Note:  Star??  PD))",
      "city": "stlouis",
      "shape": "diamond",
      "date": "2008-10-31T00:00:00",
      "story": "square or diamond shape craft with flashing and scrolling lights near Hall Street in St Louis Mo square or possibly diamond shaped craft with stationary and flashing lights. Vehicle had green white and red lights.. a green on one corner a bright white on the other and across the width was a red blinking light that flashed..left to right blink pause blink pause blink...then like a slide or scroll across the three then back to the blink sequence...chased light down the highway recording with cell phone...will upload video ((NUFORC Note:  Star??  We will await video.  PD))",
      "link": "http://www.nuforc.org/webreports/066/S66513.html",
      "state": "MO",
      "duration": "half hour"
    },
    {
      "_id": "64d005f478aba2ec5a3b8d37",
      "summary": "brilliant pink light observed then emitted sparks then vanished",
      "city": "stlouis",
      "shape": "light",
      "date": "2009-12-12T00:00:00",
      "story": "brilliant pink light observed then emitted sparks then vanished At 6:58pm on Oct. 20th I was driving eastbound on Heege Rd. 1/2 mile east of Gravois Rd. I looked north, when I observed a brilliant pink light which was at the very top of my drivers side window.  I had to put my head up against the window which was appox. 4 inches down to observe this light.  The color of this pink light startled me.  With no reference point (it was dark) it was hard to estimate the size and the height of this light in the air.  I slowed my truck down from 35mph to about 5mph to stop and get out and take a closer look.  As I justed about stopped, the pink light emitted sparks then disappeared.  The pink circular light was moving east to west almost directly above me, no sound was emitted either.  This lasted 6-8 seconds.",
      "link": "http://www.nuforc.org/webreports/073/S73034.html",
      "state": "MO",
      "duration": "6-8 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b8ea8",
      "summary": "Two square/rectangular red crafts spotted above St. Louis on July 4th.",
      "city": "stlouis",
      "shape": "rectangle",
      "date": "2009-08-05T00:00:00",
      "story": "Two square/rectangular red crafts spotted above St. Louis on July 4th. On July 4th, 2009, myself and four other family members and friends were on our front porch watching fireworks coming from the next suburb East of us, approximately two or three miles away.  In the middle of the show, a bit past 21:15 we noticed a red, almost square shape high in the Northern sky above St. Louis county,  a somewhat higher altitude than airplanes that arrive into Lambert Airport, it continued to rise at a very quick pace faster than regular aircraft; a minute later in the direction of the fireworks display, the same size red square shaped craft  rose from the tree-line straight up at an unbelievable fast pace and then angled towards the other red square now hovering high in the sky. All of us on the porch witnessed it, at first a couple people thought the second one was a hot air balloon but within seconds of it rapidly rising faster into the atmosphere than even airplanes do that theory was discounted; it was clear it was not any type of balloon or regular aircraft, we lost visual contact of both crafts in the clouds as it had rained about 10 minutes prior.  Both were identical, almost square, and possibly slightly rectangular, with a very small light at one corner. Visual contact lasted about two minutes in duration.",
      "link": "http://www.nuforc.org/webreports/070/S70882.html",
      "state": "MO",
      "duration": "2 min"
    },
    {
      "_id": "64d005f478aba2ec5a3b8ed6",
      "summary": "St. Louis County Sky Object",
      "city": "stlouis",
      "shape": "diamond",
      "date": "2009-03-19T00:00:00",
      "story": "St. Louis County Sky Object Just wondering whether anyone else in St. Louis County noticed an unusually bright object in the low western sky about 8:50 p.m., January 29, 09.  Object appeared cube shaped, very bright, motionless for about a minute and then disappeared to the west.  Color seemed a bit on the orange side.  Since we watch birds at our bird feeder, I grabbed the binoculars and was able to make out the unusual shape to this thing. By the way, I'm not believer in this kind of stuff, but have been a little troubled since seeing this.  Hopefully someone else saw this too and can offer an explanation. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/068/S68348.html",
      "state": "MO",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b9128",
      "summary": "A cigar shaped ufo was hovering over the mississippi river then went straight up and was gone. WOW!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
      "city": "stlouis",
      "shape": "cigar",
      "date": "2008-10-31T00:00:00",
      "story": "A cigar shaped ufo was hovering over the mississippi river then went straight up and was gone. WOW!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! Well i was sitting in my kitchen i looked out the window and my neighbor was pointing at it i grabbed a video camera and recorded it hovered over the mississippi river then itwent straight up and disapperd it was amazing i know it was a ufo for sure it just sat ther for a good 30 seconds then like that it was gone. ((NUFORC Note:  Witness elects to remain totally anonymous;  provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/065/S65809.html",
      "state": "MO",
      "duration": "26seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b9223",
      "summary": "Orange, glowing jelly fish-like object.",
      "city": "stlouis",
      "shape": "circle",
      "date": "2010-02-14T00:00:00",
      "story": "Orange, glowing jelly fish-like object. An orange glow appeared in the NW sky about 2000 ft. above the ground.  It moved slowly, and to the SW.  It was \"jelly fish\" like in appearance and movement.  We all watched it for a few minutes.  There was no sound.  It suddenly shot straight up into the air and disappeared.",
      "link": "http://www.nuforc.org/webreports/073/S73906.html",
      "state": "MO",
      "duration": "2 - 3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b9296",
      "summary": "7 floating orbs or fireballs moving from southwest to northeast direction.",
      "city": "stlouis",
      "shape": "fireball",
      "date": "2010-02-14T00:00:00",
      "story": "7 floating orbs or fireballs moving from southwest to northeast direction. My family and friends who were over for a new years eve party went outside and saw 7 floating fireballs or orangish yellow orbs floating in formation about 500 ft traveling from soutwest to north east.  These were not helicopters nor planes from what we saw.  There was no sound what so ever. No flashing red or green lights on the sides.   I was about half a mile and looked as if it flew over a nearby park that closes at 10 pm.  I am not sure what these were, but they were bright.  I did not see any flickering like a candle or flare.  They were very strange.  I tried to get the camera working for a picture and the camera would not respond.  The batteries were drained and I just put new batteries in the camera a couple hours before.",
      "link": "http://www.nuforc.org/webreports/073/S73908.html",
      "state": "MO",
      "duration": "1 min"
    },
    {
      "_id": "64d005f478aba2ec5a3b98af",
      "summary": "Object floating in sky in far distance.  ((NUFORC Note:  Suspected lens flare in camera lens.  PD))",
      "city": "stlouis",
      "shape": "unknown",
      "date": "2009-03-19T00:00:00",
      "story": "Object floating in sky in far distance. I was looking through some digital pictures, just to see if I had anything in my images that could be a UFO.  This is what I found in my images.  I did not see the object when I took the pictures. On this day my wife and I were driving south on i-270 toward Manchester Blvd. from I-70.  I took pictures of the sky because of the clouds and sun.  I was not trying to find UFO'S.  You can contact me if necessary, but if not then don't. I will email the pics. ((NUFORC Note:  We have viewed the photos.  One object is a lens flare; the other is a tiny, blurry dark object.  We have no reason to believe that it is a genuine UFO.  PD))",
      "link": "http://www.nuforc.org/webreports/068/S68687.html",
      "state": "MO",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3b98d4",
      "summary": "Near light speed flying metallic shining energy charged saucer on a road to a city that is located between west and east bumblefudge",
      "city": "stlouis",
      "shape": "disk",
      "date": "2009-05-12T00:00:00",
      "story": "Near light speed flying metallic shining energy charged saucer on a road to a city that is located between west and east bumblefudge Me and my family were driving to my uncles funeral from the Philadelphia, PA region: we were driving an extremely small town in Donovan, MO on some highway when about 2/3rds of a mile into the sky I saw an astonishingly fast metallic bright blue and white object run in a direction parallel to us so fast, it was gone as quick as I could spot it. It emitted no distinguishable noise over the car's engine or through the car's glass windows. The object was also huge, probably the size of at least 2 3 story duplexes. I read other reports of similar description around the St. Louis region, so I thought it would be dutiful for me to post this. Hopefully helping us make sense of this strange yet fascinating phenomenon. In Pennsylvania, I've never seen a flying saucer up this detailed and close. The most striking thing to me about what I saw was the metallic like texture. I am still in awe - but I don't feel like I can question what I saw. I am 22 years old. I know I'm not the oldest, but I'm not stupid. ((NUFORC Note:  Source of report indicates that the date of the incident is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/069/S69859.html",
      "state": "MO",
      "duration": "Seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b98c7",
      "summary": "Diamond shaped object in southern sky, have compelling video",
      "city": "stlouis",
      "shape": "changing",
      "date": "2009-06-09T00:00:00",
      "story": "Diamond shaped object in southern sky, have compelling video I saw a strange object in the southern sky on Sunday 5/10/09 at approximately 7:30 PM.  The flight was not consistent with any aircraft I'm familiar with.  It was slow and methodical, and in the distance.  It appeared to be 2000-4000 feet in altitude, approximately as large as a 2 story house, and appeared to change shape either by rotating or turning over somehow.  I also caught about 4 minutes of video tape; of which about 10-15 seconds are pretty compelling that what I saw is simply unexplained.  Here is a brief description of the events:  \tAt about 7:30 PM on 5/10/09 I had just finished cleaning up from a massive Mother's Day feast that I had prepared.  I stepped outside on my back porch for some fresh air, when I noticed a very small object in the sky.  I first thought it was a high flying plane at 50,000 feet which sometimes fly overhead.  Then I realized that it was overcast, and that I couldn't possibly see that high.  After reasoning about the cloud cover I thought the object to be around 2000-3000 feet high.  Since then I have learned that the cloud cover was at 7000-8000 that night, so the object was definitely under that ceiling.  My initial thoughts of 2000-3000 feet may be correct, but not for certain. Right after I realized that is was moving too slow for a normal aircraft at that altitude so I called for my girlfriend to come and take a look.  She thought it was odd as well, and I asked her to rush to get the video recorder.  We started shooting the object, and was initially very hard to get into focus as our zoom was at 35 xs and was in auto focus mode.  So if we moved just slightly, or caught the top of a tree, or had a bird fly right by it would keep auto focusing and then blur out the object. Once we fiddled through it for a minute or two, we got the hang of it, and were able to capture several distinctly different shapes not visible with the naked eye.  One was a diamond, one looked like a slightly elongated football, and one like a top with some sort of antennae protruding from the top half of the shape.  There was only one object, but was either turning or rotating to create these different shapes.  The video we have is shaky, showing the object to dart around, but in reality it was moving in a straight line, and our zoom at 35 xs and our shaky hand is the cause for the appeared erratic motion of flight. The flight of the object was in the southern sky headed due north.  As it came north, it seemed to drop in altitude.  Then it went 45 degrees NE, and then headed due east.  As it headed east it appeared to ascend. At various times it appeared to have some sort of halo or ring around the entire object; either from air displacement or something else.  It made no noise, and there were other aircraft in the sky that were farther away and closer that were making noise.  The whole event from start to finish lasted roughly 7-10 minutes, and we have roughly 4-5 minutes of video.  There are about 15 seconds of very compelling shots of an object that I've never seen before. I'm about as well versed in Military Aviation as a private citizen can be, as I'm fascinated with the Military Channel, the Discovery Channel, and the History Channel.  This was not a B2, a F117, F22, or an F35.  I have seen all of them on numerous shows, and I can't see how any of the shapes I saw on the video could be one of those aircraft. Lastly, after my story aired on some local news stations here in town, a gentleman contacted me via fax with some sketches he drew after a sighting with him and his girlfriend on June 20th 2007 at approximately at 7:50 PM.  When I saw the fax it was clear that the images were very similar though he didn’t have a video or a picture.  I contacted him and he came to my office to hear my story.  When he showed up, we talked for a bit.  He seamed genuine in nature, and as he was telling me his story, I quickly realized the similarities to my event.  The object seemed to change shape on an axis, there were at times a blur or a ring around the object obscuring the air around the object, that it moved slowly and deliberately across the sky changing altitude, and that it matched no aircraft he had ever seen either in shape or flight characteristics.  He explained that when he called his girlfriend into the room to see the story on TV she immediately said, “That’s it…”  Although he saw most of the object with the naked eye, it was closer to him than for me, as I wouldn’t have been able to decipher the shapes with my naked eye.  Only with the use of my camera with the zoom all the way at 35 xs was I able to clearly see the shape of the object.  In telling me his story, I could see he felt vindicated of sorts, and was very interested in seeing where this went.  He said with almost 99% certainty that we saw the same object... I can send a still picture, and I'm truly writing to see if we can get any type of explanation of what we saw, or if you could shed some light into where we could go for help.",
      "link": "http://www.nuforc.org/webreports/070/S70036.html",
      "state": "MO",
      "duration": "7-10 Minuites"
    },
    {
      "_id": "64d005f478aba2ec5a3b9997",
      "summary": "Bright white ball, flash and and then dimmed straight path, out of nowhere",
      "city": "stlouis",
      "shape": "light",
      "date": "2010-06-03T00:00:00",
      "story": "Bright white ball, flash and and then dimmed straight path, out of nowhere On a path from south to north a bright light, at 9:55 pm CST, in north western sky flared up like a flash, as if coming through atmosphere, then dimmed down for a few seconds and in a straight line heading north.  ISS not to fly over tonight wed may 18, nor was it a satellite which are visible longer with a reddish hue usually, or a plane unless it turned off all FAA lights, nor a meteorite cause there was never a tail. Visibility was very clear.  Flash was as bright as the ISS flyovers, then dimmed out slowly, slower than a meteorite, was traveling as fast as a commercial airliner but no FAA lights just one solid white ball like, and too big to be a normal commercial airliner at the distance.  Live 10 miles from airport and see flights all the time.  Also, came through right before the brightest star of Virgo.  Also no planes were in the area around St.Louis airport or flying by for the past hour and up to 10:15 pm when I went back inside.  Bigger than regular com! mercial airplane at the distance it was, would have been the size of 4-5 707 and light as bright as the ISS.",
      "link": "http://www.nuforc.org/webreports/075/S75461.html",
      "state": "MO",
      "duration": "6 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b99fe",
      "summary": "UFO Seen Over Saint Louis Arch when on my vacation",
      "city": "stlouis",
      "shape": "sphere",
      "date": "2008-08-12T00:00:00",
      "story": "UFO Seen Over Saint Louis Arch when on my vacation well my girl Friend and i went to the Saint Louis arch on our vacation and it was about 10 at night we looked up and noticed something strange.    took a pic of it might have lasted about 2 min we have a photo of it during and one right after when it seemed to just have vanished when it was there it appeared to be rotating witch you can clearly see in the photo we never believed in UFO or anything until this point . at first we thought it was the moon but the moon was still rising in the east and was not directly above us like this object was",
      "link": "http://www.nuforc.org/webreports/064/S64687.html",
      "state": "MO",
      "duration": "2 min"
    },
    {
      "_id": "64d005f478aba2ec5a3b9af6",
      "summary": "Very bright amber, green and red lights in the night sky moving slowly to the west northwest.",
      "city": "stlouis",
      "shape": "unknown",
      "date": "2010-06-03T00:00:00",
      "story": "Very bright amber, green and red lights in the night sky moving slowly to the west northwest. My husband and I observed a very bright light to the west in the night sky that looked as if it were 'twinkling'.  I am interested in astronomy and know a little about stars and planets.  This was no star or planet that I know of and seemed unusual because it was so very bright.  It was moving very slowly to the west northwest.  Through binoculars, flashing green, amber and red lights were noted. No shape could be seen as it was dark and only the lights were visible.  There was no sound but that could have been because of distance. It appeared that the lights were changing color, and maybe changing configuration although it was difficult to tell because of the distance. We both watched for a while, then my husband went in the house and I stayed and watched until it disappeared behind the tree line.",
      "link": "http://www.nuforc.org/webreports/075/S75498.html",
      "state": "MO",
      "duration": "12 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b9ce1",
      "summary": "White Light, circular, N to S flight path, dim at first then bright whight back to dim, 30 seconds",
      "city": "stlouis",
      "shape": "light",
      "date": "2010-06-03T00:00:00",
      "story": "White Light, circular, N to S flight path, dim at first then bright whight back to dim, 30 seconds Tonight at 9:35 pm, May 25th 2010, it was a dim white light traveling from a north to south line. When directly overhead the intensity of the light grew as bright as the ISS does and then slowly dimmed out again as it was when I first started watching opposed the flash i saw with ther object.  The total time of the visible object was around 30 seconds. I could see the extreme humidity outside was very thick and can only see 1 or 2 visible stars.  After checking the ISS flyovers of St.Louis, there are no orbital paths flying over here until June so it wasn't an ISS flyover or a satellite, because satellites always give off a reddish hue due to the infrared light reflected back off the earth.  Again it was a bright white object started out as a dim light then in the middle of path grew extremely bright as the ISS is and then slowly dimmed out with a speed about as fast as the ISS flyovers are from what I can reference.  There were no FAA lights, just one solid whi! te light, nothing blinking or flashing. No other planes in the sky before or after event.",
      "link": "http://www.nuforc.org/webreports/075/S75554.html",
      "state": "MO",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b9da1",
      "summary": "slow moving object changed colors from violet to white to transparent except for a spot in the center that was constant",
      "city": "stlouis",
      "shape": "sphere",
      "date": "2008-10-31T00:00:00",
      "story": "slow moving object changed colors from violet to white to transparent except for a spot in the center that was constant I am a 32 yr old male in good health with good eyesight. I was working on a house in green park, MO. near south county on 10-9-2008 around 5pm I looked up and saw what appeared to be a semi-clear spherical object moving/falling in the northeastern part of the sky. It had a oblong dot in the center and what looked like wavy lines changing shapes inside, the lines looked like electricity they changed color from violet to white and then dissapeared. The spot in the center was the only constant. I am not sure the object was spherical as it seemed to change shape, the lines were the only thing I could see making a shape. I could see no outside edges. The object moved slowly as if drifting.I lost sight of the object when it passed the horizon of the roof of the house. I ran to the other side of the house but could no longer see the object.",
      "link": "http://www.nuforc.org/webreports/066/S66178.html",
      "state": "MO",
      "duration": "30-45seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3ba48a",
      "summary": "Formation of 9-12 points of light with another object in the middle covered with five lights in a diamond pattern.",
      "city": "stlouis",
      "shape": "formation",
      "date": "2009-01-10T00:00:00",
      "story": "Formation of 9-12 points of light with another object in the middle covered with five lights in a diamond pattern. On New Years around 23:45, my girlfriend and I were outside on an open patio of an eight story building on Washington Ave. in downtown St. Louis.  We were on the South side of the building facing south, when we both noticed a formation of lights.  The speed of the formation and altitude was steady and resembled what one would expect from airplanes heading toward Lambert International airport.  The formation was composed of points of light that looked just like stars, approximately 9 points of light with a tight cluster in the middle of this formation that appeared to be one object with five points of white lights on it that were in a diamond pattern.  The position of the points of light did not appear to change.  The formation was traveling towards the northwest.  We had eyes on it for approximately two minutes and lost sight of it because of the view to the west is obstructed by the buildings design.",
      "link": "http://www.nuforc.org/webreports/067/S67797.html",
      "state": "MO",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3ba792",
      "summary": "Metallic object, square/triangular shape, with blinking lights.",
      "city": "stlouis",
      "shape": "triangle",
      "date": "2008-10-31T00:00:00",
      "story": "Metallic object, square/triangular shape, with blinking lights. On the night of October 26, 2008, my three buddies and I were on hall st. which is just north of st. Louis.  We were watching street races as I noticed this object just hovering there at the end of Hall St.  I told my buddy to look at it and he thought it was just a plane  because Lambert airport is near.  15 minutes later I told him to look again.  He said it was just a helicopter.  45 minutes later as we were leaving when the cops came, all cars scattered, that's when my buddy said that things still there. As we were driving down the road it started to move near where we were.  As it got closer it was about a football field high.  The craft appeared to be like a square/triangle and big, about the height of a one level house.  The length of about 50 yards.  It had three blinking red lights on the side, a blinking red light at the top, and a big spot light in the front. As this description sounds like an airplane, it wasn't. The craft was swaying back and forth as to where you can see the reflection of the metallic looking bottom look square.  I have a video of it. I had three people in my car that were going crazy.  The craft made no noise.  We left the pack of cars (which normally we wouldn't do), we jumped on the highway to follow the craft.  We were driving parallel with the craft.  You could see it clear as day.  It started  to veer off over highway 70 toward Illinois. We got off at the Bellfontaine exit and made a right.  The object was on the western side of us starting to travel quickly and we were following it for about 3 miles, then the object disappeared.  All four of us were freaking out cause this was no  aircraft that we have ever seen before.  The object had no propeller, no wings, made no noise, and had a square shape to it.  I have a video on my phone of this object. It's not the clearest video but you can see the square shape and the lights.  I have four witnesses that seen it.",
      "link": "http://www.nuforc.org/webreports/066/S66532.html",
      "state": "MO",
      "duration": "1 1/2 hours"
    },
    {
      "_id": "64d005f478aba2ec5a3ba863",
      "summary": "Black spot low on South St. Louis sky",
      "city": "stlouis",
      "shape": "cigar",
      "date": "2008-08-12T00:00:00",
      "story": "Black spot low on South St. Louis sky I've never seen or reported anything like this before.   I was just sitting in a parking lot talking to a friend and noticed a black line in the sky.  We were on S.Kingshighway about a mile north of Chippewa.  It was very small and I could barely see it but my friend saw it as well.  It never moved.  Not one time.   There were clouds, black and white, moving behind it at a slow speed.  But the shape never moved.  It stayed there for a long time.  I thought it must be a weather balloon.  However, it never moved.  As I said, the clouds were moving but the black shape never moved.  It appeared very small, since it must have been below the clouds in the atmosphere.  It was tall and skinny.  I watched it for about 30 minutes.  I did take a picture with my cell phone, however it was so tiny, I don't believe it showed up. I moved to another location about 100 yards away and could still see it.  I finally had to go, but I couldn't find it again when I got home.  It freaked me out a bit, so I started looking on the news sites and didn't find anything about it.  Dont' know... just felt I should tell someone.",
      "link": "http://www.nuforc.org/webreports/065/S65149.html",
      "state": "MO",
      "duration": "20-30 mins"
    },
    {
      "_id": "64d005f478aba2ec5a3ba914",
      "summary": "Hi. Top of the day too you. I have been keeping these stories to myself for a long time.",
      "city": "stlouis",
      "shape": "triangle",
      "date": "2010-11-21T00:00:00",
      "story": "Hi. Top of the day too you. I have been keeping these stories to myself for a long time. I think the time is right to tell someone.I have two stories that happend years apart. The first time I saw what I think was a UFO, To tell the truth I dont know what it was  but reports on the news and pictures made me rethink what i had seen. The first  time I was camping with friends for the weekend. It had gotten late and we all went  into our tents. I came back outside my tent to, Well you know. Anyway while I was  doing that I happend to look to my left and I saw three bright white lights.The lights  looked like a triangle.one light on top and two at the bottom. They looked to be a  mile or so away. So I thought it must be someone with lights on a  hill but the next  morning I looked in the direction that I saw the lights and the ground was flat for as  far as you could see. The lights were in a vertical position. So its no way it could  have been lights on a hill. Case number two, It was midday about six years ago my wife and I was on our way in the house. I looked up and saw what I thought was a balloon, It was silver But then I thought the wind was blowing and the object was not moving. I called too my wife to look. She asked me \"What is that\" I said I dont know when we looked agin it was gone. Like I said it was silver and round mybe a little oval but more round. I almost forgot...I'm from Saint Louis Mo. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/078/S78929.html",
      "state": "MO",
      "duration": "1:oo min"
    },
    {
      "_id": "64d005f478aba2ec5a3ba942",
      "summary": "I felt like it knew we were looking at it . I  felt like it was looking at us.",
      "city": "stlouis",
      "shape": "oval",
      "date": "2010-11-21T00:00:00",
      "story": "I felt like it knew we were looking at it . I  felt like it was looking at us. It was midday about six years ago my wife and I was on our way  in the house.  I looked up and saw what I thought was a balloon,  It was silver  But then I thought the wind was blowing and the object was not moving.  I called to  my wife to look.  She asked me \"What is that?\"   I said I dont know, when we looked agin  it was gone.  Like I said it was silver and round mybe a little oval but more round. I almost forgot Im from Saint Louis Mo. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/078/S78946.html",
      "state": "MO",
      "duration": "1 min."
    },
    {
      "_id": "64d005f478aba2ec5a3ba91e",
      "summary": "Hi. Top of the day too you. I have been keeping these stories to myself for a long time.",
      "city": "stlouis",
      "shape": "triangle",
      "date": "2010-11-21T00:00:00",
      "story": "Hi. Top of the day too you. I have been keeping these stories to myself for a long time. I think the time is right to tell someone. The first time I saw what I think was a UFO,  To tell the truth I dont know what it was  but reports on the news and pictures made me rethink what I had seen.  I was camping  with friends for the weekend. It had gotten late and we all went  into our tents. I came  back outside my tent to,  Well you know.   Anyway while I was  doing that I happend  to look to my left and I saw three bright white lights. The lights looked like a triangle. One light on top and two at the bottom.  They looked to be a mile or so away. So I thought it must be someone with lights on a  hill but the next morning I looked in the  direction that I saw the lights and the ground was flat for as far as you could see. The lights were in a vertical position.  So its no way it could have been lights on a hill. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/078/S78945.html",
      "state": "MO",
      "duration": "1 min."
    },
    {
      "_id": "64d005f478aba2ec5a3babb8",
      "summary": "Saw what appeared to be a commercial jet headed for airport but no lights or sound",
      "city": "stlouis",
      "shape": "chevron",
      "date": "2010-11-21T00:00:00",
      "story": "Saw what appeared to be a commercial jet headed for airport but no lights or sound I was out running at the Clayton High School track/football field around 10:00 p.m. and saw what looked like a commercial airliner on a flight path towards Lambert Airport but it had absolutely no lights and it made no sound whatsoever.  I often run at night on this track and almost always see aircraft heading toward the airport during my run.  I am familiar with the typical flight path of planes on their way to Lambert.  What I saw tonight was a clear outline/silhouette of the wings of what looked like a typical jet headed for landing but it was lower (in altitude) and was traveling a little faster than the planes I usually see when running at this track.  I could make out the wings quite clearly but the tail and nose (assuming they were there) of the craft were less clear.  There were absolutely NO lights whatsoever - just a silhouette against the dark sky.  It moved just like a regular jet but there was absolutely no sound.  I had just seen a jet go by on! the same path about 5 minutes or so prior to this sighting.  After reporting by phone to NUFORC, I called Lambert Airport police/security and they transferred me to someone named John in \"Ops\" (couldn't clearly hear what John said when he answered). I told John what I had seen (jet with no lights/no sound headed toward Lambert) and he said they'd had no reports of anything unusual tonight.  I will also mention that Boeing has a large facility right next to Lambert Airport - perhaps some kind of test plane?",
      "link": "http://www.nuforc.org/webreports/078/S78116.html",
      "state": "MO",
      "duration": "15 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3babec",
      "summary": "3 redish lights over saint louis, triangle shape",
      "city": "stlouis",
      "shape": "triangle",
      "date": "2010-11-21T00:00:00",
      "story": "3 redish lights over saint louis, triangle shape Looking out to the east, I saw 3 redish lights right above the horzion. there where in a triangle shape. They seem to be slowly moving together, keeping there shape. I have lived in saint louis my whole life and I have seen this before, I have seen it about 3 times this year alone. All 3 times this year and a the other times threw out my life, they have always been in the same spot in the sky, it is always 3 redish lights making a triangle shape in the sky(I can't tell if its one big object our 3 small ones), and its always the same size, it almost seems like its floating there, I have sat out one night just to wach to see how long it stays there, I sat there for about 2 hours before going to bed due to boredom. The lights did not move. I have seen the object move a little bit before, when it dose move it always keeps the same shape size and speed wich makes me think it is one HUGE object in the sky with 3 lights on its coners. But yeah, oi have seen this th! ing for years and I will keep seeing it for years to come, its almost come part of nomal life for me to see this object a few times a year( its always a few moths apart) the next time it shows up ill take pics and videos of it. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/078/S78227.html",
      "state": "MO",
      "duration": "unknown"
    },
    {
      "_id": "64d005f478aba2ec5a3bae3e",
      "summary": "V-shaped perfect formation of lights traveling over St Louis, heading eastward, soundlessly.",
      "city": "stlouis",
      "shape": "chevron",
      "date": "2010-11-21T00:00:00",
      "story": "V-shaped perfect formation of lights traveling over St Louis, heading eastward, soundlessly. Was outside at 9:00 pm on 10/26/10, with my 20 year old son.  We were setting up a 12\" Dobsonian telescope to view Jupiter, when we noticed a V-shaped formation with numerous lights on each side.  Not aircraft running light, more like luminous spots.   The lights stayed in perfect formation, and moved very rapidly eastward, toward Scott AFB.  Absolutely no sound whatsoever.",
      "link": "http://www.nuforc.org/webreports/078/S78574.html",
      "state": "MO",
      "duration": "15 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bafab",
      "summary": "bright long shaped object in sky illuminated by circling spotlight.  ((NUFORC Note:  Possible sighting of Venus??  PD))",
      "city": "stlouis",
      "shape": "other",
      "date": "2011-01-05T00:00:00",
      "story": "bright long shaped object in sky illuminated by circling spotlight My son went outside to the backyard to take out our dog at 5:30 p.m. and seen a large spotlight circling repeatedly from a distance away.  My son called me and I could see that this large spotlight was circling up into the clouds.   While it was circling clockwise it would pass over a bright long shaped object, illuminating this object in the sky above the clouds.  You could not see the object when the spot light was not shining directly on it.  The clouds were moving but the object remained stationary.  It is now 6:30 p.m. and the spotlight is still circling the sky.  I do not know when the spotlight began circling to detect this object in the sky.",
      "link": "http://www.nuforc.org/webreports/079/S79121.html",
      "state": "MO",
      "duration": "over one hours"
    },
    {
      "_id": "64d005f478aba2ec5a3bb07a",
      "summary": "((HOAX))  I was standing on my porch, smoking a doobie, when, all of a sudden, I saw 3 weird shapes in the sky. My",
      "city": "stlouis",
      "shape": "changing",
      "date": "2011-05-02T00:00:00",
      "story": "I was standing on my porch, smoking a doobie, when, all of a sudden, I saw 3 weird shapes in the sky.  My buddies Cheech and Chong also saw it.  The craft appeared to be pencils, but after several seconds, they morphed into pens.  They landed in my front yard, and took me aboard their starship, where we headed for they sky.  Then they stuck some stuff up my butt, and put me back in bed. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/080/S80956.html",
      "state": "MO",
      "duration": "20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bb3c2",
      "summary": "Floating morphing, color changing object.",
      "city": "stlouis",
      "shape": "changing",
      "date": "2011-01-05T00:00:00",
      "story": "Floating morphing, color changing object. My friend and I were walking to the gas station to get some cigarettes and snacks, and on the way back he pointed up at something in the sky. It was just like a morphing shape of color. It changed colors at a slow rate between different shades of blue and purple.  Then after a minute and a half, it faded away.",
      "link": "http://www.nuforc.org/webreports/079/S79333.html",
      "state": "MO",
      "duration": "1.5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bb9f2",
      "summary": "white lights moving within the clouds in irregular circular formation.  ((NUFORC Note:  Possibly advertising lights.  PD))",
      "city": "stlouis",
      "shape": "light",
      "date": "2010-07-28T00:00:00",
      "story": "white lights moving within the clouds in irregular circular formation White lights seen moving counter clock wise within the large cumulus clouds.  Circular pattern was irregular, not a perfect circle. About 3 different circular patterns taking approx.  6 and 8 seconds respectively.  Light was only seen within the clouds, when the light entered an area outside of a cloud formation it was not seen.   As the cloud formations began to change or dissipate, the light pattern altered.  Finally after witnessing this for about 25 minutes it reduced from 3 separate circular light patterns to only one. T he pattern of the counter clock wise movement changed as well. Finally, it faded away. This happened about 1 ½ to 2 hours after scattered thunder showers.  At the time of the witnessed light movements, the sky was clearing away.  There was no storm activity; not lightning or rain. There was no sound.  No flashing or colored lights.  Only a round white light moving counter-clockwise within the clouds in an asymmetrical round pattern.   If you held your finger to the area in the sky the circular area would be about 5 inches in diameter.",
      "link": "http://www.nuforc.org/webreports/076/S76783.html",
      "state": "MO",
      "duration": "45 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bbb5d",
      "summary": "8-10 lights following each other",
      "city": "stlouis",
      "shape": "fireball",
      "date": "2011-10-19T00:00:00",
      "story": "8-10 lights following each other I was on my friends back porch and like always I'm looking at the stars (great view) and in the distance over the trees I see a light.  It looked like it was pulsating and then slowly faded in the distance.  But not but 10 seconds later from the tree line 1 mile away another orange light same idea brighter though lifted up and away, but then 2 then 3 then 4 then 5 started following that 1 that came out of the tree line.  At certain areas in the sky it looked like it was forming a half circle then they would fade away and then 6 then 7 then 8 coming from the same distance would rise and take that exact same route.  I actually called the police to ask if anybody else reported weird lights...no body.  But myself and a friend saw the same thing!  Funny part is back in June of 2010 I was at my house and I saw the EXACT same thing!  Any further information witness or educated would be greatly appreciated. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/084/S84574.html",
      "state": "MO",
      "duration": "2-4 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bbe40",
      "summary": "World Series Game 6 in St Louis on 10/27 @10:18pm CST Light 'Flying' rear of blimp - unknown",
      "city": "stlouis",
      "shape": "unknown",
      "date": "2011-12-12T00:00:00",
      "story": "World Series Game 6 in St Louis on 10/27 @10:18pm CST Light 'Flying' rear of blimp - unknown 10/27/2011 At 10:18pm during World Series Game 6, the FOX Cameras were on the blimp. Right after one of the announcers made a comment about the weather being cool or brisk, I saw a light, or something lighted by the stadium lights, enter the camera shot from the top right of the frame and 'fly' on an angle down and to the left. From the camera vantage point it appeared at one point that the object passed very close to the rear of the blimp, but I couldn't determine if the object was in front, or behind the blimp. I had not see any birds or bugs all night and could not identify what it was, or if it had structure on my poor quality hd television. Just thought maybe someone with the game on their DVR and better equipment that I could take a look at it. Thank You",
      "link": "http://www.nuforc.org/webreports/084/S84942.html",
      "state": "MO",
      "duration": "3 Seconds or so"
    },
    {
      "_id": "64d005f478aba2ec5a3bc116",
      "summary": "6 lights spanning across the street , a triangle shaped object hovering and spinning, silent",
      "city": "stlouis",
      "shape": "triangle",
      "date": "2012-01-12T00:00:00",
      "story": "6 lights spanning across the street , a triangle shaped object hovering and spinning, silent I was coming home from spending Christmas eve with family.  As I was driving down my street to my house, I saw 6 orange lights in the sky.  I was thinking at first they were Christmas lights someone had figured out how string high up in the sky across the street, but realized they were too high to be hung using the telephone poles.  My next thought was that they were strung somehow using the church steeple on one side; but couldn't figure out what was holding them up on the other side of the street.  I parked my truck, walked to the top of the driveway. I was planning on walking down to the church (1 block down) to see how they had strung the light across the street.  When I got to the top of my driveway, only 3 lights were left in the sky.  Not only that, but they were no longer crossing the street, they were now hovering over the homes one block up to the left.  I walked a couple houses up to get a better look. I realized the lights were forming a triangle! shaped object.  Then I realized I could acutally see the object against the dark sky.  It was a long, thin triangle about the size of the block it was hovering over.  It was also completley silent.  It was hovering and then began a lazy spin.  The tip of the triangle was spinning away from me.  I saw the two base corner lights.  The right base light faded, then the left base light.  It seemed to take a long time for the left base light to fade out.  When I realized there was an actual triangle shaped object hovering over the block of homes, I also realized that I must have first seen two triangle objects over the street.  I also realized that this meant the tips of the triangles were in the middle of the street, the bases on either side.  That is the only way to describe the lights I saw across the street.  Two vertical from each other on either side and two in the middle of the street.  I looked around to see if there was anyone else in the street who might have seen this! as well, and of course, there wasn't.  Neither did a car pass! by duri ng this time.  The area where I saw the triangle hovering is a quiet block of homes, however, the street they face is a pretty busy local street.  I would be surprised if I was the only one who saw this.  I'm going to listen to the 10:00 news to see if anyone else reported this, but that's probably futile.  I also know there are two airfields in the immediate area. One is Lambert Airfield, the other is Scott AirForce base.  I do remember a few years ago (8 or so maybe?) there was a report of a UFO that made the news on the Illinois side of the river.  I cannot identify what I saw, but I know I saw something I've never seen before. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/086/S86055.html",
      "state": "MO",
      "duration": "approx 90 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bc454",
      "summary": "Walked outside...saw green and blue lights flashing so rapidly; no shape as far as I can see.  ((NUFORC Note:  We suspect Sirius.  PD))",
      "city": "stlouis",
      "shape": "flash",
      "date": "2011-12-12T00:00:00",
      "story": "Walked outside...seen green and blue lights flashing so rapidly....no shape as far as I can see. I heard people talking about it on facebook.  I thought nothing of it. I finally went outside and looked under Orien's Belt...there it was.... I cant assess the shape..its very far away..close to the horizon. its flashing blue, and green very very fast.  Almost like a strobe light. Its been there for an hour. ((NUFORC Note:  We suspect Sirius.  We received several calls from St. Louis about what we concluded was the star, Sirius, rising above the eastern horizon.  PD))",
      "link": "http://www.nuforc.org/webreports/085/S85564.html",
      "state": "MO",
      "duration": "hasn't ended."
    },
    {
      "_id": "64d005f478aba2ec5a3bc53d",
      "summary": "Round craft on a heading at about 340* over St. Louis, Missouri",
      "city": "stlouis",
      "shape": "circle",
      "date": "2011-12-12T00:00:00",
      "story": "Round craft on a heading af about 340* over St. Louis Missouri Witnessed a circular craft fly over St. Louis on a heading of approximately 340* north northwest.   It appeared to be quite small, it left no trail, and it flew in a straight line.   There was no sound and it flew just below the clouds with no lights and looked black in color.   The wind and the clouds were moving east at approximately a 90* heading.",
      "link": "http://www.nuforc.org/webreports/085/S85647.html",
      "state": "MO",
      "duration": "3 Minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bc69b",
      "summary": "I was sitting in my kitchen and I saw a bronze-ish, gold looking, see thru craft come thru my window and vanish. It sort of resembled a",
      "city": "stlouis",
      "shape": "triangle",
      "date": "2011-12-12T00:00:00",
      "story": "I was sitting in my kitchen and I saw a bronze-ish, gold looking, see thru craft come thru my window and vanish.  It sort of resembled a golden dorito.  It made a weird buzzing sound after it left my sight.  No damage was done to my home. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/085/S85749.html",
      "state": "MO",
      "duration": "4 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bc717",
      "summary": "UFO hovers and vanished outside of baby's window.",
      "city": "stlouis",
      "shape": "diamond",
      "date": "2011-10-10T00:00:00",
      "story": "UFO hovers and vanished outside of baby's window. Saw a bright white light in the shape of a diamond with light blue lights across it hovering slowly up and down outside of my daughters window.   It came very close to the ground and back up high very slowly numerous times and even at one time stopped moving completely.  I called for my husband and only moments after he saw it, the UFO flew towards our house overhead and vanished.",
      "link": "http://www.nuforc.org/webreports/084/S84413.html",
      "state": "MO",
      "duration": "two minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bc795",
      "summary": "Group of Orange Fireballs sighted in South City Saint Louis.",
      "city": "stlouis",
      "shape": "fireball",
      "date": "2011-08-07T00:00:00",
      "story": "Group of Orange Fireballs sighted in South City Saint Louis. I observed approximately 10-12 roughly sphere shaped masses that appeared to be burning, they were bright and were glowing orange with red and yellow color inconsistently visible.  They appeared from my east and seemed to be traveling northwest.  They appeared approximately one minute apart and varied in size.  They seemed to be traveling relatively slowly and made no noise.   I called my husband and also my neighbor and they witnessed the last 5 or so of the burning \"balls\" ((NUFORC Note:  Witness provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/082/S82606.html",
      "state": "MO",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bc8d5",
      "summary": "Steady light with no sound or shape disspeared,",
      "city": "stlouis",
      "shape": "unknown",
      "date": "2011-08-21T00:00:00",
      "story": "Steady light with no sound or shape disspeared, I was outside smoking and saw a steady light northwest of my location.  I surveyed for other lights to count aircraft.  All others were blinking.  I returned to the steady light to discern its shape.  It continued moving northwest to southeast.   As it got closer I still could not see a shape other than the shape of the light itself.  It winked out no shape against the background light no sound.  I continued looking for the light, shape and listening for sound.  Nothing.  Other than satellites which cannot be seen with the naked eye over such a large city with it's light pollution I have never seen that happen.",
      "link": "http://www.nuforc.org/webreports/083/S83134.html",
      "state": "MO",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bcb91",
      "summary": "I was taking a few pictures of an approaching storm front on June 25, 2011, South St. Louis County, Missouri, facing west. In the lower",
      "city": "stlouis",
      "shape": "triangle",
      "date": "2011-07-04T00:00:00",
      "story": "I was taking a few pictures of an approaching storm front on June 25, 2011, South St. Louis County, Missouri, facing west.   In the lower center of the photo, there appears to be a winged image with a half moon of smaller objects in front of it. The object was so far away from my field of vision that I can't give  any more details, other than I heard no sound other than the rumbling of thunder, nor witnessed anything else unusual.   This picture was taken with a relatively cheap Kodak digital camera and I have not altered the photo in any way. I'm hoping that someone with experience with photography or sky objects can give me a logical explanation.",
      "link": "http://www.nuforc.org/webreports/081/S81969.html",
      "state": "MO",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bce4b",
      "summary": "A luminous greenish circle was visible 2 seconds going fast out and then into clouds near St. Louis, MO",
      "city": "stlouis",
      "shape": "circle",
      "date": "2011-06-03T00:00:00",
      "story": "A luminous greenish circle was visible 2 seconds going fast out and then into clouds near St. Louis, MO I was leaving the St. Louis County Library at 8:50 PM on June 2nd.  I was at the headquarters on Lindbergh, just south of the 64/40 highway. No other person was in the parking lot at that moment. The sky to my eyes was cloudy, with some gaps containing haze.  I saw an object moving in the north/northeast sky, moving north/northwest for about 1-2 seconds.  The speed was greater than a conventional airplane.   The object caught my attention because of its size, which appeared to be the size of a significant fraction of the moon if that had been visible, about a 1/3 visible moon size.  Most striking was the bluish green color, not a deep strong color but more of a shade of white.   The object emerged from a cloud, passed through I believe some haze because the outline was not sharply distinct, and was gone into another cloud.  I did not hear any sound.   I have not heard any mention on the local radio.  I realize this could have been a meteor just before impact, but it sure looked totally different from any \"shooting star\" I ever have seen before. ((NUFORC Note:  We spoke via telephone with this witness, and we found him to be exceptionally eloquent, lucid, and objective.  We suspect that he is an unusually capable witness.  PD))",
      "link": "http://www.nuforc.org/webreports/081/S81639.html",
      "state": "MO",
      "duration": "2 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bcf3b",
      "summary": "Blue whote lights rotating sometimes stays still.",
      "city": "stlouis",
      "shape": "disk",
      "date": "2012-08-05T00:00:00",
      "story": "blue whote lights rotating sometimes stays still. This object has been circling around the area for over 30 min.  Lights are blue and white seem to be rotating, thought it might be a helicopter but hasn't left.",
      "link": "http://www.nuforc.org/webreports/091/S91034.html",
      "state": "MO",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3bd1fb",
      "summary": "Large dark object with two bright headlights",
      "city": "stlouis",
      "shape": "changing",
      "date": "2012-10-30T00:00:00",
      "story": "I was on the phone with my sister and went out on my balcony to smoke a cigarette.  I am looking forward and here appears this large dark object with two bright headlights flying above the trees, it then turned into three bright lights and as it floated by the back of it had blinking orange and white lights.  Two rows of three blinking lights. It made no sound at all!!  There is always helicopters and airplanes flying over my house but this thing I saw was nothing I have ever seen before.  I was a little freaked out but very cool.",
      "link": "http://www.nuforc.org/webreports/093/S93349.html",
      "state": "MO",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bd2fc",
      "summary": "chased by 3 foot silver cylinder in sky.",
      "city": "stlouis",
      "shape": "cylinder",
      "date": "2012-05-13T00:00:00",
      "story": "chased by 3 foot silver cylinder in sky. I went down to my dad's garden on a very bright day which is about 200 feet from his house.  I looked up in the sky and probably about 300 feet in the air I saw a silver cylinder shape that looked about the size of a baton falling in my direction.   As fast as I could I headed to the house thinking this might have fallen out of a plane.  It started overtaking me as I started zig zagging.   Right before I reached the porch it overtook me and was maybe 15 feet above me and then just disappeared.  It was silver and made no noise. 35 years later and this still bothers me.  Thought you might have some ideas. Thank you, ((personal information deleted)) after 1 p.m. ((NUFORC Note:  We spoke with the witness, who corrected the date to July 1976.  Date is approximate.  PD)) ((NUFORC Note:  Witness indicates that date of sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/088/S88775.html",
      "state": "MO",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3bd6a7",
      "summary": "4-6 white lights circling in the southeast and east sky over St. Louis, above the clouds.",
      "city": "stlouis",
      "shape": "light",
      "date": "2012-10-30T00:00:00",
      "story": "4-6 white lights circling in the southeast and east sky over St. Louis, above the clouds. In southeast sky, four white lights circling separately, but intersecting in the middle. Sometimes I saw 1 or  2 lights flying away into the east sky. The lights seemed chevron-shaped, and moved very quickly.  They described smooth circles/paths, and did not change direction quickly or dart.  Very cloudy.  There was no beam(s) of light coming from the ground and shining ONTO the clouds, so I don't think they were advertising spotlights.  These lights were shining THROUGH the clouds.",
      "link": "http://www.nuforc.org/webreports/093/S93375.html",
      "state": "MO",
      "duration": "20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bd71b",
      "summary": "Glowing orange balls of light moving silently throught the sky",
      "city": "stlouis",
      "shape": "fireball",
      "date": "2012-08-05T00:00:00",
      "story": "glowing orange balls of light moving silently throught the sky At about 9:30 pm., July 12, 2012,  I saw a large, glowing, orange fireball in the sky.  It was traveling at a moderate speed.  It approached from the southeast, and continued across the sky in a northwestern  direction.  I watched until it was out of sight.  Not a sound was heard. This is not the first time I have seen this.  At about 12:10 am. July 5, 2012, my husband and I both witnessed the following:   Two large balls of light, one glowing orange, and the other, white, approached from the southeast.  They appeared to be traveling together (but clearly not connected physically).   We rushed to our front yard to get a better look as they were passing directly overhead.  The white one was now in the lead slightly. It passed over in total silence.  Then the orange one passed overhead.  The glowing orange light seems to come from within.  We both noticed that it had a slight teardrop shape.  This one also passed over in complete silence.  They both went off in a northwesterly direction.",
      "link": "http://www.nuforc.org/webreports/090/S90817.html",
      "state": "MO",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bdaf8",
      "summary": "A cluster of 10-12 metal orb-like objects hovering above the street.",
      "city": "stlouis",
      "shape": "cylinder",
      "date": "2012-10-30T00:00:00",
      "story": "A cluster of 10-12 metal orb-like objects hovering above the street. Sighting happened October 15, 2012: About 6:20 pm, I was on a street in the middle of South St. Louis City. I saw about 10-12 brushed nickel colored metal orbs, with red lights on the front-reminded me of a red flood lamp, only thicker in the back-hovering in a cluster about 30-40 ft above the street (maybe 5-7 ft above the stoplight). I have never seen anything like it.  I am still stunned. I called a few of the businesses located at this intersection and asked if maybe they had some sort of floating lights/ lanterns as a promotion (I was thinking red for the Cardinals), but none of the people at these locations said they had lights like this and they hadn’t seen anything.  I know I sounded completely crazy calling them, but I am very intrigued by what I saw!   I consider myself a professional person. I have a college education. I am a skeptic, but this has made me incredibly curious.  It may have been a government/ military thing, or perhaps some really talented person(s) built these remote controlled objects.  However, I have no idea and I would love to get an answer.",
      "link": "http://www.nuforc.org/webreports/093/S93612.html",
      "state": "MO",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3bdffe",
      "summary": "Black cylinder flying at altitude of airline within reaching distance.",
      "city": "stlouis",
      "shape": "cylinder",
      "date": "2012-03-13T00:00:00",
      "story": "Black cylinder flying at altitude of airline within reaching distance. Black cylinder in bright daylight  I was traveling back to Kansas City on a Southwest flight during the middle of the day.  The sun was at full shine with no cloud coverage at top average airline altitude.  I looked out the window as I often do on flights and saw this black cylinder shaped object flying within reaching distance to the airline window.  This black cylinder had a semi-sphere head that resembled a basic security camera gloss, possibly made out of glass.  This object was no bigger than half the size of my forearm in both length and width.  As I was watching it fly just a bit faster than average airline speed covering an extra foot every 2 seconds, I had no quick access to a camera or possibly alerting another individual fast enough before it was gone. I have no evidence of this event as far as other witnesses or footage.  This object was seen years ago and I only have my word to back this claim.  I will say knowing I was lacking witnesses and camera footage, I kept telling myself to fully memorize the moment.  I didn’t take my eye off of it for a second and studied every visible thing I could.  This object was also in no way attached to the airline, but clearly had the confidence of flying so close on the brightest of days.   I fully believe what I saw was far more advanced as far as flight technology than anything I have ever seen, even as basic as it looked.",
      "link": "http://www.nuforc.org/webreports/087/S87485.html",
      "state": "MO",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3be112",
      "summary": "Silent Black Triangle.",
      "city": "stlouis",
      "shape": "triangle",
      "date": "2012-11-19T00:00:00",
      "story": "Silent Black Triangle",
      "link": "http://www.nuforc.org/webreports/094/S94626.html",
      "state": "MO",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3be15a",
      "summary": "Two black circular objects flying through storm clouds in rotating flight pattern.",
      "city": "stlouis",
      "shape": "disk",
      "date": "2012-10-30T00:00:00",
      "story": "Two black circular objects flying through storm clouds in rotating flight pattern. The sighting occurred within the hour. It was just before a rain storm. I was standing at the top of my street since it has a pretty good view over Manchester Road and out West towards Weidman and Mason Road. Black clouds were gathering and so I was watching. Something caught my eye to the right and I focused on what it was. It appeared to be two black objects flying in a circular pattern, almost parallel to each other. It wasn’t birds, it wasn’t clouds and it wasn’t just something caught in the wind. At least one of them I could tell had a definitive disk shape. It was hard to keep a steady view of the objects because they were flying through the low lying storm clouds. Just before they disappeared completely from view, one of them peaked directly through the clouds and it was then I could see the disc shape. I did not notice any lights, I did not notice any type of rotation of the objects, only that they were flying in a circular pattern. Their movement wa! s fast, about the speed of a helicopter circling an area. It definitely was not something natural. Right after they disappeared from view the wind picked up and the rain started to fall. I tried to look further, but could not see anything any more. It was a very shocking experience. It only lasted 30 seconds to 1 minute.",
      "link": "http://www.nuforc.org/webreports/093/S93872.html",
      "state": "MO",
      "duration": "30-60 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3be497",
      "summary": "Circling lights in sky above St. Louis.   ((NUFORC Note:  Advertising lights??  PD))",
      "city": "stlouis",
      "shape": "formation",
      "date": "2012-08-05T00:00:00",
      "story": "Circling lights in sky above St. Louis My wife woke me at 0400 to see if I saw the same thing in the sky that she was seeing.   A pattern of lights in the clouds rotating and focusing at a lower point in the horizon.  No beam of light was visible from below to give an indication that it was a search light array.  Over the course of time the focus point moved lower to the horizon as if moving away and became harder to detect.    At one point it seemed like more than four lights, moving around in the sky. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/091/S91421.html",
      "state": "MO",
      "duration": "45 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3be78c",
      "summary": "A light in the sky, go figure.",
      "city": "stlouis",
      "shape": "light",
      "date": "2012-04-18T00:00:00",
      "story": "A light in the sky, go figure. I went outside to light a smoke.  It was so calm.  I usually look up every night...nice view of the stars considering not too far away from the city.  I look up, and I see an orange light.  Just hovering...very high, super high, out of atmosphere high.  I figured it was a planet.  I kept staring. It seemed to be moving to the right, as I kept studying it, it seemed as if it has a very long object of some sort sticking out of it, could just be my eyes doing it from squinting, but as I did squint...that seemed to even get more defined...not sure whats going on here.",
      "link": "http://www.nuforc.org/webreports/088/S88039.html",
      "state": "MO",
      "duration": "on going"
    },
    {
      "_id": "64d005f478aba2ec5a3be81c",
      "summary": "Very high space craft moving extremely fast and jogging across sky, horizon to horizon in a less than a minute.",
      "city": "stlouis",
      "shape": "triangle",
      "date": "2012-03-13T00:00:00",
      "story": "Very high space craft moving extremely fast and jogging across sky, horizon to horizon in a less than a minute. We were  going to look at the moon and two planets, jupiter and venus-i think, in the western sky and look for the northern lights.  The local news NBC 5 St. Louis said they would all be out tonight and the sky would be very beautiful.  As we walked out the door and looked up we saw an odd airplane way up in the sky and thought look at how fast they are going.  It was moving from the southeast to the north west. (our front door faces south)  This was way up in the sky headed toward the big dipper. It was moving very fast, and was way, way up in the sky. We thought it might be the russian kosmos satellite, because kosmos was suppose to be out tonight also, so we looked at the thing on our i phone and it was not available or identifiable and it was not a satellite. This thing was triangle in shape with a thin line around the triangle and also had white and red lights flashing on it. Man it was moving super fast from s.e. to n.w then it looked like it shifted or b! lurred and it took a direct norht path. then another immediate jog to the due north. then it shifted back to the left or the west and right back to the north and then back to the northwest again. we watched it dissapear into the northern sky. we could see it until it went behind the horizon.  This was big, fast and way up there.  Moved much faster than the space station when it comes over. We have never reported a ufo we look at the sky often on with our i phone apps because we know what we are looking at now, most of the time.  This thing was big, fast and simply fantastic.  I think it was very special. I kept saying to my friend, this is something very special until it disappeared.",
      "link": "http://www.nuforc.org/webreports/087/S87373.html",
      "state": "MO",
      "duration": "1 Minute maybe"
    },
    {
      "_id": "64d005f478aba2ec5a3be82b",
      "summary": "20-30 glowing orange orbs travelled slowly across I-55 near the Meremec River.  ((NUFORC Note:  Report from STL policeman.  PD))",
      "city": "stlouis",
      "shape": "sphere",
      "date": "2012-06-05T00:00:00",
      "story": "20-30 glowing orange orbs travelled slowly across I-55 near the Meremec River While driving home, I and my family observed 20-30 orange glowing balls travel slowly through the sky across I-55 and the Meremac River from SW to NE.   The altitude is not known, but the event lasted some 10 minutes.  My wife was able to video record most of the incident.   Others stopped to view the happening, which actually led to a multiple vehicle accident.  The objects where absolutely silent and sequentially disappeared at a certain point in the sky when they finally reached it.   Was NOT and airplane or helicopter!  Seemed to be far to high to be chinese lanterns. ((NUFORC Note:  Report from STL policeman.  PD))",
      "link": "http://www.nuforc.org/webreports/089/S89338.html",
      "state": "MO",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3be998",
      "summary": "Bright blue light moving west to east at high speed, stopped instantly hovered and zigzaged then moves further east toward st. louis su",
      "city": "stlouis",
      "shape": "unknown",
      "date": "2012-04-18T00:00:00",
      "story": "bright blue light moving west to east at high speed, stopped instantly hovered and zigzaged then moves further east toward st. louis suddenly stopped again hovered zigzaged for about 10 seconds. moved toward space very fast.   I watched it till the light became smaller and dimmer untill it disappeared. ((NUFORC Note:  The time of the sighting was not indicated by the source of the report.  We have assigned an arbitrary time, until we hear back from the witness.  PD))",
      "link": "http://www.nuforc.org/webreports/088/S88335.html",
      "state": "MO",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3beb19",
      "summary": "Two separate instances of three orange lights moving west to east.",
      "city": "stlouis",
      "shape": "triangle",
      "date": "2012-02-03T00:00:00",
      "story": "Two separate instances of three orange lights moving west to east. Noticed an orange light against the night sky outside a window.  When we went outside there were three orange lights I would describe as floating across the sky from the west to the east.  There was no sound.   My husband said he saw each was a triangular shape with a light at each point.   In the distance the line up in a straight line for a minute and then separated again.  As we lost sight of them I went to the front yard to see if the were still visible.   A neighbor was walking his dogs when I saw two more come over the rooftops.  I yelled to my husband who came out as I pointed to them.   There were three lights again.   The neighbor said he came out when he saw the lights also.  He asked the same question we had, \"What the hell are those?\"",
      "link": "http://www.nuforc.org/webreports/086/S86889.html",
      "state": "MO",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3becde",
      "summary": "Orange Uidentified Light STL Sky.",
      "city": "stlouis",
      "shape": "fireball",
      "date": "2013-08-30T00:00:00",
      "story": "Orange Uidentified Light STL Sky. I went outside to let my dogs out and move my sprinkler when I noticed an orange ball in the sky.  It immediately caught my attention, especially since it was something I've never seen before.  I work for an airline and I am VERY familiar with aviation so I was immediately curious as to what this was since it did not resemble any aircraft (no flashing becons, wing lights) and most aircraft in either a approach or takeoff phase are white in color not orange. I watched it in awe for a moment then ran inside to get my phone to try and record the occurrence. I was able to record about 30 seconds of the light move from one direction then the opposite direction then literally disappear.  I noted the position and information in the sky and have this information available.  I will submit this information in an email (subject STL07252013).",
      "link": "http://www.nuforc.org/webreports/100/S100482.html",
      "state": "MO",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3bf0ea",
      "summary": "Orange Red formation of 7 craft hovering over St. Louis, Mo.",
      "city": "stlouis",
      "shape": "formation",
      "date": "2013-07-03T00:00:00",
      "story": "Orange Red formation of 7 craft hovering over St. Louis, Mo. Red circles in a patterned formation hovering over St. Louis, I have pictures and video of this event.  They were two triangle formations and one in the center.  Since we were on the highway, we took a lot of photos and two videos of these craft.  They are NOT flares.",
      "link": "http://www.nuforc.org/webreports/098/S98352.html",
      "state": "MO",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bf1ce",
      "summary": "Spheroid obj executes vert. climb to 25,000 ft. in less than 3 mins.  ((NUFORC Note:  Exceptionally reliable and capable witness.  PD))",
      "city": "stlouis",
      "shape": "sphere",
      "date": "2013-07-03T00:00:00",
      "story": "St. Louis, Missouri - June 4, 2013: Spheroid object executes vertical climb to 25,000 ft. in less than 3 minutes On Tuesday, June 4, 2013, at approximately 1:30pm, I was sitting in my car in the parking lot of  a St. Louis fast food restaurant for lunch located on Oakland Blvd. just east of Hampton Ave. and south of Interstate 64 and something to the northwest of me caught my eye. Looking through the windshield, I saw something move rapidly in a circular motion and it vanished quickly.  As a result, I thought I was looking at a remote control model airplane or a bird.  The object was very dark against a fairly bright sky, below a scattered overcast. The object appeared to be very low over the distance treetops when in view, but momentarily vanished and I thought it went down below the tree line or the horizon.  I could not determine how far the object was laterally, from my position.  There was nothing behind it that it crossed to get a distance estimate. I looked down to my sandwich and when I looked back up to the same location, (which was to my northwest), I saw an object, roughly spherical in shape, very dark, which began an immediate vertical ascent. What put me into a sudden \"What the hell\" moment was that the object was moving straight up and pretty fast.  I leaned down toward the dash and crooked my neck to watch the sphere continue its vertical ascent as it kept going until it reached what appeared to be the cloud base (the cloud ceiling). At that moment, the object then stopped moving and held stationary at the cloud base.  It remained stationary for approximately 2 minutes.  It could have been moving slowly to the right, or perhaps the clouds were moving slowly to the left, but after about two minutes, the object merged into the cloud above it and became obscured. At its highest observed altitude (as it moved into the cloud), the object could be distinguished as a spherical shape, a black dot at this point. As I observed the object , I was so captivated by what I was seeing that I failed to do a simple time count as it ascended; but the total time from near ground level to the cloud base at 25,000 ft. was not more than 3 minutes maximum, but could have been as little as 30 seconds. Following the event, I placed phone calls to the nearby Forest Park administrative office as well as a local university's science departments and inquired if any kind of balloon had been launched. All inquiries came of negative. I inquired into how to find the accurate cloud ceiling for the date and time of the sighting and was referred to the National Weather Service where I found the Three Day Weather records and June 4, 2013, data established the cloud ceiling at OVC250, which means overcast at 25,000 Feet, and that matched what I observed. Using a speed and time calculator, I found the following possible indicated speeds of the object.  The following speeds are based on three estimated times for the object to travel from near ground level to 25,000 feet. 30 seconds, 1, 2, and 3 minutes. 3 Minutes: 94.69 MPH  2 Minutes: 142.04 MPH  1 Minute: 284.09 MPH 30 Seconds: 568.18 MPH   Having seen a variety of balloons in the air, I’ve never seen a balloon ascend at these rates of speed, and although I cannot state exactly “what” this object was, it must have possessed considerable size because I was able to observe the object at the cloud ceiling, or 25,000 feet. If anyone else in the St. Louis area observed this object on June 4, 2013, I would very much like to see additional details. ((NUFORC Note:  The source of the report is well known to NUFORC, and we consider him to be both exceptionally capable, and exceptionally reliable.  We would welcome other reports from anyone who may have been witness to the event.  PD))",
      "link": "http://www.nuforc.org/webreports/098/S98493.html",
      "state": "MO",
      "duration": "5-6 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bf27e",
      "summary": "Six white  lights above St. Louis.",
      "city": "stlouis",
      "shape": "formation",
      "date": "2013-08-30T00:00:00",
      "story": "Six white  lights above St. Louis. Six lights in two semi-triangular formations above telegraph.  Pulled over to get a closer look, by the time we got out of the car, four of the lights were gone, one disappeared shortly thereafter, and the final   one contined flying north and eventually disappeared into what seemed like thin air.  Never seen anything like it.   I'm an extreme skeptic, but my brother in law and I already ruled out any kind of mechanical aircraft.  There was no noise and it was moving way too fast to have been at a very high altitude. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/101/S101017.html",
      "state": "MO",
      "duration": "~2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bfe3f",
      "summary": "I sent a similar e-mail to Debbie Ziegelmeyer and Margie Kay (MUFON)but thought I should post it here as well. Maybe there is an explan",
      "city": "stlouis",
      "shape": "disk",
      "date": "2013-10-03T00:00:00",
      "story": "I sent a similar e-mail to Debbie Ziegelmeyer and Margie Kay (MUFON) but thought I should post it here as well.  Maybe there is an explanation for this event?????  I stepped out onto my back deck, (evening of Saturday, September 14th) started to sit down on a chair but looked up before doing so.  Coming from the direction of the southeast there is a bright orange round object moving over my house. Higher then a helicopter but much closer then an airplane.  It is bright orange on the outside/underside but a deeper orange in the center.  The color in the center seemed to be moving but that might have something to do with the atmosphere.   I stepped into the house and the clock reads 9:40 pm.  About 30 seconds later a second one appears coming from the same direction, displaying the same thing as the first.  About 30 seconds after that another orange one goes over my house but still at a level that I could see the darker orange moving around inside the center.  All three objects move out of sight into the northwest sky.  I went back outside and have been watching but I do not think any more will come tonight. I am not very good at trying to judge size and distance but they were close and big enough that I could see the variance of the orange colors inside the spheres/UNDERSIDE.  I believe if I would stretch out my arm, the objects would be about the size of the palm of my hand.  This is the first time I have seen anything like this.  I did have trouble sleeping; I kept seeing images of them in my mind all night long.  All I can say is, it might be explained away but I can see the stars in the sky, so it is a clear night.  There are no other lights like an airplane would have and they were completely SILENT but moved at about the same speed as an airplane would travel.",
      "link": "http://www.nuforc.org/webreports/102/S102863.html",
      "state": "MO",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c0147",
      "summary": "Slow moving bright orange light with differnt muffled engine noise that turned red before dissappearing off the horizon.",
      "city": "stlouis",
      "shape": "light",
      "date": "2012-12-20T00:00:00",
      "story": "A slow moving bright orange light with differnt muffled engine noise that turned red before dissappearing off the horizon. I was watching tv when I heard a engine noise that sounded like a muffled airplane engine, different then anything I have heard. I go to the back door and look and I see a bright Orange light like planet Mars in color, but brighter, I thought at first it looked like a satellite but moving much slower than one,   Also I notice there was a hazy sky and the object appeared lower than the hazy clouds. And there was a full moon.  I call my wife and say check out this light in the sky, she looks out and says what the hell is that, I don't know I grab my binoculars, I have two pairs my good pair is 25x100 I use for astronomy.  Even in the binocs I cant see any detail, just a Orange light, no flashing lights, no outline of a typical aircraft at night.   Too think it passed directly overhead of my home, with the engine noise I know it wasn't a satellite and with no flashing lights it wasn't a plane or helicopter.  We live on a hill and watched it for almost ten minutes, slow moving, steady heading south in a straight line, then when it was a good two miles away it turned red my wife yelled to me did you see it just change color I said yes,. I can't believe we are watching this thing. We watched it for about 10 min before it disappeard off the horizon. We can see about 6 miles with our hilltop view.  I thought maybe its a drone of some kind so the next day I reported it to the police and they said they have no drones in the county so they tell me to report it to the FAA. I called and they say they don't know of any drones operating in Missouri at all. I don't know if they are telling the truth or not. All we know it wasn't any normal aircraft we have ever seen.",
      "link": "http://www.nuforc.org/webreports/094/S94909.html",
      "state": "MO",
      "duration": "~10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c0549",
      "summary": "Orange glowing circle moving across sky, no noise.",
      "city": "stlouis",
      "shape": "circle",
      "date": "2013-04-12T00:00:00",
      "story": "Orange glowing circle moving across sky, no noise. Orange glowing circle moving silently across sky in straight line at steady pace, light went out and appeared to be silver in color, mabye 100-200 ft. high. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/097/S97051.html",
      "state": "MO",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c056e",
      "summary": "triangle lights moving in a counter clockwise motion a yellow/orange color.",
      "city": "stlouis",
      "shape": "triangle",
      "date": "2013-02-28T00:00:00",
      "story": "triangle lights moving in a counter clockwise motion a yellow/orange color At 17:45 in St. Louis, MO, I witnessed a unidentified flying object.  My location was Hampton ave and Eichleberger.   I noticed the car passenger next to me driving off pointing up, I looked up and pulled my vehicle over.  I was looking west, it was three bright yellow/orange lights rotating counter clockwise and shifted 90° and now looked like it was rotating vertical.   Then it seemed to fade away gradually.   I tried to record it, my phone only has an eight mega-pixel camera.  It didn't come out well, but if you look at it you could see some lights. I'm a veteran of the USAF and a mechanic now.  I've never seen anything move like this what so ever.  I know mechanics well this was something very different.",
      "link": "http://www.nuforc.org/webreports/096/S96412.html",
      "state": "MO",
      "duration": "1-2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c06a6",
      "summary": "Diamond Shaped Object with Three Distinct Circles over Saint Louis, MO during Geminid Meteor Shower",
      "city": "stlouis",
      "shape": "diamond",
      "date": "2012-12-20T00:00:00",
      "story": "Diamond Shaped Object with Three Distinct Circles over Saint Louis, MO during Geminid Meteor Shower Six of my friends, and myself stayed up late to watch the Geminid Meteor Shower.  Three of them are in my Masters program in Athletic Training at Saint Louis University;  Two were my neighbors, and one was my fiance.   Four of us, me and my 3 classmates, were laying on the concrete saw the object flying North to South.  I pointed to it the same time a second person next to me saw the object.  Two others on the concrete saw it as well, making it four observers, including myself (all in my Masters program).  It had no lights.  It did, however, have 3 visible circles in a triangular pattern, and a faint fourth circle in the back, making a diamond shape.  The circles looked like, what I would describe, a suction cup.  They were dark on the edges, become lighter towards the center, and were darkest in the center.  It gave the appearance like these circles, we were seeing were cone-like, and we were seeing them from below the cone, from wide end to the tip. What could be seen on the object was only due to the reflection of the city.  It was flying at a medium speed at a lower level from North to South.  It left no trail behind the object.  There was also no sound. We had it in view for about 45 seconds.  I'm assuming it was a lower level because of the reflection of the city lights off its exterior.  What I found most intriguing was that there were no lights on the object as a plane would have on its wings.  There were no red or white lights. The only colors we could make out were shades of gray.  There was only one object.   We tried to get the other three people with us to see the objects, so we stood up, and pointed at it.  However, we lost it in the street lights as our eyes adjusted to the lights.  As we went upstairs, I drew a picture of the object and asked the others if it was what they saw.  All three observers exclaimed, \"YES! That's EXACTLY it!\"  We did not feel threatened by it. It is important to note that each of us had had two drinks each, but were under the legal limit to drive safely.",
      "link": "http://www.nuforc.org/webreports/095/S95357.html",
      "state": "MO",
      "duration": "45 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c078e",
      "summary": "Just watch the video.",
      "city": "stlouis",
      "shape": "light",
      "date": "2014-01-10T00:00:00",
      "story": "Just watch the video http://youtu.be/9SCKrVUQ4zU   Wouldn't have believed it if I didn't see it.",
      "link": "http://www.nuforc.org/webreports/106/S106058.html",
      "state": "MO",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c082d",
      "summary": "Triangular craft with solid red, blue and green lights at the corners and a bright white light in the middle over hwy 40 and 170",
      "city": "stlouis",
      "shape": "triangle",
      "date": "2014-03-18T00:00:00",
      "story": "Triangular craft with solid red, blue and green lights at the corners and a bright white light in the middle over hwy 40 and 170 Heading south on 170 from Page at about 5 am, still middle of the night dark with a clear sky, noticed a very bright light ahead.  It first appeared to be a very bright star, like a planet, flickering and low towards the horizon.  Looking ahead it was a immediate eye catch. About a minute later I could tell it was local and moving, we were heading towards each other.  The light then in my mind resembled a landing gear light on a plane.  I could tell it was flying very low.  There is a airport in it's direction about 7 miles away, way too low for that distance, about 500-700 ft. I reached Hwy 40 and when I was close to the interchange to go west it was just reaching hwy 40 from the south side, on a path heading north still just west of the interchange.  I then noticed three additional lights, red, green and blue in a triangle pattern, red leading.  The moment I realized this object was unusual was when I realized the marker lights were not blinking, no tail light, the bright white light was in the middle of the craft, not shining in just the forward direction but in every direction. By this time I was on the ramp for 40 west.  The craft just crossed hwy 40. With the height seeming to be 500-700 ft or about a little higher than a cell tower, I could not make a outline of the craft.  Just the four lights.  Heading towards the side of it getting on 40 it seemed to be moving very slowly at this point and by time I was passing it's path behind it it seemed to have rapidly picked up speed and changed direction to northwest. Now when telling the very same people I talk to everyday, including my wife, immediately there's a look like uh huh yeah right.  So with that in mind... when I was on the on ramp for hwy 40 and I was heading towards the side of the craft, I saw what appeared to be a small rectangular door opening.  It was behind the middle white light and off centered.  I took it as a door because the dim glow grew as such from a door opening.  I could not make any details out from what was inside just that the dim glow was indirect.  I don't tell anyone anymore but figured I should atleast report it. I was captivated at first as much as anyone is by a low flying plane but when realizing something is different about what I was seeing, I didn't want to pull over, fumble with my phone for a pic... all I wanted to do was observe and figure it out. ((NUFORC Note:  Witness indicates that the date of the event is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/107/S107800.html",
      "state": "MO",
      "duration": "~5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c089b",
      "summary": "Let my dog outside, when trying to get dog back inside Green object with blinking green light and white lite did nose dive and then van",
      "city": "stlouis",
      "shape": "circle",
      "date": "2014-01-10T00:00:00",
      "story": "Let my dog outside,  when trying to get dog back inside, green object with blinking green light and white lite did nose dive and then vanished. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/105/S105737.html",
      "state": "MO",
      "duration": "15 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c0fa4",
      "summary": "6 Orange balls of light, St. Louis.",
      "city": "stlouis",
      "shape": "light",
      "date": "2014-03-21T00:00:00",
      "story": "6 Orange balls of light, St. Louis. I came out of the building after a delivery.  There was 4 orange lights moving north.  They were not moving in a perfect line looked very erratically.  If you held your hand out at arms length and used your index finger and thumb to gauge distance, there was about 2in. between the top 2 and bottom 2. When they all reached a certain point they faded out.  They didn't turn out like a switch, it was a slow fade out.  After the first 4 all disappeared, 2 more followed.  These 2 were side by side about 3-4in. apart.  Same exact thing, they faded out at exactly the same point the first 4 did. I tried to record with my phone, however I was in an industrial park.  The building across the street had lights along the roof.  They were barely visible on the phone recording. At first I thought they may have been a plane coming into a landing pattern.  A plane came in approx. 30-45 sec. after the last 2 disappeared it had 5 white lights and a red/green flashing.  Also you could hear the plane. ((NUFORC Note:  We have corrected the date above.  We spoke with the witness on the evening of March 20, so we're sure of the date.  The witness seemed to us to be quite serious-minded and sincere.  We suspect that he is a very capable witness.  PD))",
      "link": "http://www.nuforc.org/webreports/107/S107999.html",
      "state": "MO",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c110e",
      "summary": "Long cigar object, 3 lights in back one in front. loud humming sound as it moved slowly.",
      "city": "stlouis",
      "shape": "cigar",
      "date": "2014-02-14T00:00:00",
      "story": "Long cigar object, 3 lights in back one in front. loud humming sound as it moved slowly Noticed a loud humming sound on the backside of the house.  Dog was barking, and went outside to check.  Long cigar shaped object with three red lights in back, and one white light in front.  Thought initially the white light was a star, but was moving along with the object indicating the front of the object.",
      "link": "http://www.nuforc.org/webreports/107/S107080.html",
      "state": "MO",
      "duration": "2-3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c11b8",
      "summary": "5 boomerang lights over STL on 1/3/2014.",
      "city": "stlouis",
      "shape": "chevron",
      "date": "2014-01-10T00:00:00",
      "story": "5 boomerang lights over STL on 1/3/2014 Two friends of mine were driving in chesterfield, mo on January 3, 2014, at 10:00 p.m. roughly.  They were picking me up to head to the bar.  They were heading east on Olive blvd. at the intersection of Appalachian Trail Dr.   2 extremely bright lights were observed in the sky to the NE of their position.  It took them a 2 mins of studying them hovering high in the atmosphere flickering, rapidly changing direction and altitude, and trading places in the sky for roughly 5 mins.  Both witnesses took mulitple photographs of the two lights.  It wasn't until they showed me the pictures of the 2 lights i immediately said theres 5 in the the last couple pictures.  They were taken just a couple mins after spotting them still heading east on Olive blvd.  Now at the intersection of Woodsmill Rd. looking east over the 7-11.  The last photo was taken on olive just before highway 141.   Both witnesses have said they are reporting this incident with the full story soon.  These pictures are from the driver of the vehicle iphone.   The passenger has more photos he will include in his report.",
      "link": "http://www.nuforc.org/webreports/106/S106047.html",
      "state": "MO",
      "duration": "4 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c15d9",
      "summary": "Cluster of silver orbs fading in and out of view.",
      "city": "stlouis",
      "shape": "formation",
      "date": "2013-10-23T00:00:00",
      "story": "Cluster of silver orbs fading in and out of view \tAt approximately 3:00 P.M. on Saturday, October 12th, a cluster of spherical objects were observed in the Eastern skies of the Sunset Hills area of South St. Louis County.  My boyfriend's family and I were preparing to leave a local school after a soccer game, when one of his relatives pointed out these weird balloons in the sky.  As we watched closer, we noticed that unlike helium balloons, these objects were not gaining altitude.  They appeared to be hovering and slightly moving southward in the sky.  I would estimate that there were at least 50 small silver spherical objects. \tAs we stared at them, they faded in and out as if the sun was reflecting off and on.  The sky was clear, so there was no obvious reason for this discrepancy in reflection.  As they faded in and out, they seemed to make new formations.  To me, the fading in and out was like a star that you can only see through peripheral vision, but not when looking straight at it.  This incident occurred for 10 or 15 minutes.  They were still in the sky as we were leaving the school.  Numerous others saw the objects in the sky.  One person commented that it was behaving like a school of fish in the sky.",
      "link": "http://www.nuforc.org/webreports/103/S103257.html",
      "state": "MO",
      "duration": "15+ minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c1695",
      "summary": "I have been noticing a very bright light just S of Clayton in early evenings. The obj. usually appears to the south and west of S.",
      "city": "stlouis",
      "shape": "triangle",
      "date": "2013-10-23T00:00:00",
      "story": "I have been noticing a very bright light just south of Clayton in early evenings.  The object usually appears to the south and west of St. Louis.  Driving down I-170 at the connection of I-64 I noticed the same object but this time it was west of Clayton and near I-64.  It seemed like a very slow moving or hovering bright light.  But this time it was close to the highway.    The full moon was up it was 9:30 p.m. and I had my moon roof open on my car.  I actually drove under the object west of McKnight road and east of Clayton road exit.  It turned out to be a triangle shaped object like a flying wing hovering about 300-500 feet above the trees.  It made no sound.  It actually had 3 bright lights and one green light.  It looked a little like one of the military type of flying wings except it wasn't flying and this thing was very low and about the size of a small aircraft almost like the size of drone craft.",
      "link": "http://www.nuforc.org/webreports/103/S103404.html",
      "state": "MO",
      "duration": "Minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c16d7",
      "summary": "Red fireball light orb seen high up in neighbors yard in Maplewood of St. Louis County.",
      "city": "stlouis",
      "shape": "fireball",
      "date": "2014-05-08T00:00:00",
      "story": "Red fireball light orb seen high up in neighbors yard in Maplewood of St. Louis County. Red fireball type light orb in neighbors backyard.  It was up as high as their 3rd story/pitched attic near the corner of Greenwood and St. Elmo.  It fell or moved downward. Approximately 1 foot or smaller diameter.  I was sitting in our yard with my husband around 10:30 p.m. facing towards their yard.  Unfortunately he was facing the other direction.  I walked over to the edge of our yard afterwards and checked out their yard for a bit.  No one was out there, no bon fire, nothing.  Was excited I got to see it.  Unsure where it went.  Previously at around the age of 10 or so (1992) witnessed a white glowing orb 1 foot in diameter.  It \"pulled up\" to my passenger side window as we were driving down the highway and it followed along side us for a few moments.  This was on highway 44 near where the old gas reservoirs used to be near Maplewood and Shrewsberry.  My mother was driving and also witnessed it.",
      "link": "http://www.nuforc.org/webreports/109/S109259.html",
      "state": "MO",
      "duration": "2 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c177f",
      "summary": "3 glowing orange spheres travel slowly and silently before extinguishing.",
      "city": "stlouis",
      "shape": "sphere",
      "date": "2014-06-04T00:00:00",
      "story": "3 glowing orange spheres travel slowly and silently before extinguishing. We saw 3 spheres of orange light floating slowly, and silently across the night sky.  One was following the other, heading east and the third one was further away and heading north.  The one traveling north sped up, and then extinguished.  The two heading east traveled silently for a while then the one in the lead extinguished.  The last one continued on for just a few more minutes before it too went out.",
      "link": "http://www.nuforc.org/webreports/109/S109349.html",
      "state": "MO",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c1b8c",
      "summary": "Stars that formed an equilateral triangle that disappeared simultaneously.",
      "city": "stlouis",
      "shape": "triangle",
      "date": "2014-06-20T00:00:00",
      "story": "Stars that formed an equilateral triangle that disappeared simultaneously. While watching an outside Shakespeare play in St. Louis, Missouri, my attention was mostly on the play until I glanced up and took notice of the equilateral triangle of stars.  I saw three stars geometrically in line they formed an equilateral triangle.   At first, I thought that they were just stars, but then I noticed how equal the lines were.   So I started watching them instead of the play, just for a about 4 minutes.  Then they all disappeared right before my eyes, simultaneous all at the same time.   I thought that maybe there was a cloud.  So I waited to see if they would reappear, they did not.   And the sky was pretty clear, with some wind and a few clouds. I know that in the constellations there are Summer and Winter star triangles.  I told my husband and he said that it was the Summer Triangle.  Why would they all disappear at the same time and not return.  I looked for them later and did not see them again. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/110/S110245.html",
      "state": "MO",
      "duration": "4 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c1b8e",
      "summary": "Very bright cool white lights, 5-7 moving in PERFECT formation - no visible connection.",
      "city": "stlouis",
      "shape": "light",
      "date": "2014-06-20T00:00:00",
      "story": "Very bright cool white lights, 5-7 moving in PERFECT formation - no visible connection. Multiple bright “cool” bluish white lights, all in a line – not sure how many, approx. five to seven – just a short window in which to view.   Initially thought it was from fireworks, but quickly became aware that the lights were moving in unison heading west towards sunset – it was still light enough in the western sky to see there was no visible structure between the lights – the lights were not connected and were moving forward in perfect unison. We were driving south on Laclede Station Road in Webster Groves, Mo –a suburb of St. Louis, Missouri.  We tried to get to a better vantage point, but were not able to find them again.   We’re not sure about the spacing of the lights.  They did not appear to blink or strobe.  No vapor trail or tail.  Could not determine sound because we were in a car.  The overall span approx. 600 ft.",
      "link": "http://www.nuforc.org/webreports/110/S110276.html",
      "state": "MO",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3c1b52",
      "summary": "Equilateral triangle of stars, simultaneously disappear on 6/14/2014 over St. Louis Missouri.",
      "city": "stlouis",
      "shape": "triangle",
      "date": "2014-06-20T00:00:00",
      "story": "Equalateral Triangle of stars, simultaneously disappear on 6/14/2014 over St. Louis, Missouri. While watching a Shakespeare Play at Forest Park, I noticed in the night sky some stars.  It was a pretty clear night and very windy.  I took special notice of three stars that were equilaterally aligned and formed a perfect triangle.   I watched them for about four minutes thinking how crazy it was that they were so evenly distanced apart.  Then simultaneously they all went out.   I thought wow that’s really weird so I’ll just wait to see if they reappear, maybe clouds went over.  But they did not reappear and this was about 9:45 pm.  And the other stars that were in the sky did not go out. I whispered to my husband that I thought I saw a UFO and he said maybe it was a summer Triangle.  Why did they all go out at once?   I was curious if anyone else reported this sighting.   I did not notice any other colored lights.  I simply thought that these were stars, until they all went out. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/110/S110340.html",
      "state": "MO",
      "duration": "4 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c1bfa",
      "summary": "Saw a bright metallic object floating in the sky",
      "city": "stlouis",
      "shape": "cylinder",
      "date": "2014-06-24T00:00:00",
      "story": "Saw a bright metallic object floating in the sky.   Pulled over and snapped a pic.  When I looked around the camera it was gone. Photo can be seen at: https://www.facebook.com/photo.php?fbid=10204137441741637&set=a.1621259816734.90065.1393612198&type=1&theater&notif_t=photo_comment ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/110/S110469.html",
      "state": "MO",
      "duration": "<1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c1e0a",
      "summary": "Orange Glow Thing.....",
      "city": "stlouis",
      "shape": "teardrop",
      "date": "2014-06-20T00:00:00",
      "story": "Orange Glow Thing..... Here is a report as seen by my neighbor who lives directly in back of my house.   Posted at the bottom of this report are two other reports that occurred in September of last year and then in May of this year.  Both have been reported on your site and witnessed by me. ----- Original Message -----  From: Neighbor To:  Me  Sent: Monday, June 16, 2014. 10:27 PM  Subject: Orange Glow Thing  I just saw the orange in the sky. Not perfectly round but shaped like a hot air balloon.  Also seemed to have flame at one end like a balloon. It wasn't too high up in the air like a plane but it went over your house from south to north.  It was moving pretty fast.  By the time i went in to get binoculars by back door I couldn't find it but there are a lot of trees in the way. What is it? It's a real object. I think it's a balloon of some sort.  Went overhead about 10:15 tonite.  I don't think it was high enough for a weather balloon.  It was moving fast and straight like it was being controlled and had power of its own. If you find out or have any ideas let me know.  …..MY RESPONSE TO THE E-MAIL….. Thank you sooo much for this.  Finally someone else has seen it.  Since you are right in back of me, it should always be visible to you as well.  No matter what time of the night, if you see it again, PLEASE call me.  Again, thank you. Occurred : 9/14/2013 22:00 (Entered as : 09/14/2013 22:00)  Reported: 10/1/2013 5:30:32 AM 05:30  Posted: 10/3/2013  Location:  Saint Louis, MO  Shape: Disk  Duration: 10 minutes   Occurred : 5/1/2014 19:35 (Entered as : 05/01/2014 19:35)  Reported: 5/2/2014 3:11:27 PM 15:11  Posted: 5/2/2014  Location:  St. Louis, MO  Shape:  Fireball  Duration:  5-6 minutes",
      "link": "http://www.nuforc.org/webreports/110/S110372.html",
      "state": "MO",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c1f8c",
      "summary": "Black circular object, no lights, traveling across sky slowly, unaffected by wind currents.",
      "city": "stlouis",
      "shape": "disk",
      "date": "2014-06-13T00:00:00",
      "story": "Black circular object, no lights, traveling across sky slowly, unaffected by wind currents While swimming my friend and I noticed a circular-disk like object.  It was dark black and seemed unaffected by the wind.   As we watched it go by it stayed about the altitude and speed as far we could discern.   Several people were there on their respective boats and pointed it out in the sky.   Many were jokingly speculating a drone or UFO.  We are unsure which it is, and unable to find any information on the object.   Once it disappeared over the tree line, we didn't see it again. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/110/S110072.html",
      "state": "MO",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c20f0",
      "summary": "Delta shaped object hovering over flatbed truck in St. Louis.",
      "city": "stlouis",
      "shape": "triangle",
      "date": "2014-04-18T00:00:00",
      "story": "Delta shaped object hovering over flatbed truck in St. Louis. Driving home from theater.  Going to cross train tracks.  An eighteen wheeler flat bed with supplies was located on a road that paralleled the train tracks.  The craft was located over the flat bed and hovered by it.  It looked black and was light up only by three white lights on the corners.  One was located in the center.  It turned from Southwest to Westward direction.  Kept going didn't want to stop my friend from driving.",
      "link": "http://www.nuforc.org/webreports/108/S108721.html",
      "state": "MO",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c21ff",
      "summary": "Bright orange spheres/fireballs passing over my house.",
      "city": "stlouis",
      "shape": "fireball",
      "date": "2014-05-02T00:00:00",
      "story": "Bright orange spheres/fireballs passing over my house. Tonight (May 1st, 2014) I had friends over.  After they all left and I straightened up a bit, I stepped outside onto my deck.  My neighbor moved out of her house yesterday so I was curious to see if there were any lights on in the back of the house which would indicate that the new neighbors were there.  (It was between 10:33 and 10:35 PM).   I look up and passing over my house there is a bright round orange orb/light.  This night is cloudy so perhaps the object was distorted?  BUT as crazy as this might sound, it looked like it had something attached to the backside of it (as I viewed it going past my line of vision).  The something looks like an orange transparent sack/bubble; like the UFO/ORB was pulling or dragging it.   I ran inside the house to call my kids but decided it was too late THEN went back outside only to see another one passing over my house.  This time I did call my daughter-in-law on the cordless phone.  She went outside but was not able to see it.  The first one to pass over my house looked like something was attached but the second one did not.  Both are a glowing orange.  The first one was so bright I thought it was going to crash and that the appendage was actually fire.  Apparently, I was wrong since I watched it move out view.    Both were silent and moved at the same speed as an airplane.  I would say they were airplanes distorted by cloud coverage BUT they were such a bright burning orange, completely silent and with orange being the only visible color...  There might have been one before I stepped outside but missed it.  Tonight their direction went from WEST to EAST (both of them).",
      "link": "http://www.nuforc.org/webreports/109/S109108.html",
      "state": "MO",
      "duration": "5-6 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c24cd",
      "summary": "A dozen fire colored lights move in straight pattern 6 at a time like a squadron, then fade away.",
      "city": "stlouis",
      "shape": "fireball",
      "date": "2014-11-06T00:00:00",
      "story": "A dozen fire colored lights move in straight pattern 6 at a time like a squadron, then fade away. I was with a few family members outside at the fire pit in back yard.  When I looked up above my house and saw very bright reddish almost fire light.  Object was moving straight in my direction, coming from downtown.   Then I saw another, and another.  In about 10 seconds, there was a straight line of 6 of these \"lights.\"   I yelled and pointed, \"What is that\"?  My 3 family members all saw the objects.   The objects were equidistant away from each other moving at a steady pace right overhead, about the height of a plane coming in for a landing, but kept their pattern true.  The objects slowly \"faded out\" at about the same spot in the sky.   A minute or two later, 5 or 6 more \"fiery objects\" came moving in, almost same straight pattern, but slightly askew.  There was no noise from these objects.  They just kept there course.   This time I watched very closely to see when they faded out and noticed when the light faded, a black silhouette in the shape of a triangle seemed to ascend out of sight.   A few minutes later, 2 more appeared and quickly disappeared.   We didn't know what to think.",
      "link": "http://www.nuforc.org/webreports/114/S114474.html",
      "state": "MO",
      "duration": "7 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c2941",
      "summary": "Swirling lights following me, but as if to be chasing each other at same time.",
      "city": "stlouis",
      "shape": "other",
      "date": "2014-11-26T00:00:00",
      "story": "Swirling lights following me, but as if to be chasing each other at same time. Swirling lights seem to be chasing one another as they followed me down the highway along I-55 for a period of about 4 to 5 miles.   They seemed to slighty change in color, from time to time. ((ADDENDUM FROM WITNESS)) it was around 6:30 pm im sure other motorist saw them as they too where slowing to watch. my son was able to watch the whoe thing while i was driving. ((END ADDENDUM))",
      "link": "http://www.nuforc.org/webreports/115/S115521.html",
      "state": "MO",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c2cfc",
      "summary": "4 large Diamond shaped Ufo's with flame in front corner  moving fast south to north on still night. video",
      "city": "stlouis",
      "shape": "diamond",
      "date": "2014-08-29T00:00:00",
      "story": "4 large Diamond shaped Ufo's with flame in front corner moving fast south to north on still night.  Video. Saw 4 large very bright Ufo's cross the sky form south to north. one would go horizon to horizon then the next would come. So I stepped outside around 10:45 and noticed a very large bright \"halo\" coming towards me.   It came straight overhead and was probably 2x the size of the moon at that point, (clear hot humid night with no moon) no sound! so i was looking up trying to take this thing in. it was a defined diamond shape,yellow orange, with a \"burning/flickering\"  \"flame\", white, in the forward corner of the diamond.   The diamond shape around the flame seemed to jump and dance around leading me to believe it was not a solid thing, rather a diamond shaped halo. Tthese things moved fast... horizon to horizon in about 3 min. no sound, no change of direction.   I looked straight up at this thing which almost looked like a hot-air balloon in the jet stream...but there was no basket... looking straight up could still see the flame and diamond halo. very crazy experience.  Here's the video  http://youtu.be/w-l3_SWCm2U",
      "link": "http://www.nuforc.org/webreports/112/S112810.html",
      "state": "MO",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c2f50",
      "summary": "I was on I 55 going south bound, I had just passed a major storm on i-55 going south I passed through St Louis went through this city,",
      "city": "stlouis",
      "shape": "triangle",
      "date": "2014-08-29T00:00:00",
      "story": "I was on I 55 going south bound, I had just passed a major storm on i-55 going south I passed through St Louis went through this city, and was passing a power plant.   I had looked up and noticed a craft with a red, and green lights in the sky.  Don't know of any aircraft that has green and red lights.  The red light was as red as a stoplight, and the green light was as green as a green light at a traffic stop.  It look like the front of the craft have the green light on it.  As I went further south I was watching the craft move about in the ssky.  It moved tightly.  I believe its all me, or notice that I seen it.  It had seemed to follow me for a while then turned away.I had flashed my lights from the vehicle to see if it would follow it had caught up to me quite quickly.   I am not sure on what I scene. ((NUFORC Note:  We have amended the date to August 26th, 2014.  PD))",
      "link": "http://www.nuforc.org/webreports/112/S112941.html",
      "state": "MO",
      "duration": "30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c3089",
      "summary": "Formation of yellow lights in the sky.",
      "city": "stlouis",
      "shape": "light",
      "date": "2014-08-08T00:00:00",
      "story": "Formation of yellow lights in the sky Network of a dozen or so yellowish lights just hanging in the sky, sort of in a net shape.   Then proceeded to move slowly until sis appearing in the clouds.   We saw them from our car as we drove southwest on Gravois Rd. Toward Baptist church Rd in the 63123/63126 area of St. Louis county",
      "link": "http://www.nuforc.org/webreports/112/S112127.html",
      "state": "MO",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c325b",
      "summary": "The rapid blinking and bright color of the object.",
      "city": "stlouis",
      "shape": "diamond",
      "date": "2015-04-03T00:00:00",
      "story": "The rapid blinking and bright color of the object. On Friday night March 27 2015, around 11:30 p.m. I spotted a unidentified object in the sky.  It was shaped like a star.  I would say the color of this object was a red orange.  It was the rapid blinking that was so impressive.   No more than 2 minutes was it appearing in the west sky in the city of St. Louis, MO before vanishing into the sky.   As I was engaged in what I was seeing, it appeared to stay in the same location.  Not being able to share this experience with a neighbor was unfortunate.  I knew time would not allow me go and get someone and I was right.",
      "link": "http://www.nuforc.org/webreports/118/S118114.html",
      "state": "MO",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c382a",
      "summary": "One witness experiences strange, and loud, rumbling sound from home.",
      "city": "stlouis",
      "shape": "unknown",
      "date": "2015-01-16T00:00:00",
      "story": "One witness experiences strange, and loud, rumbling sound from home. I was just wondering if anyone has reported a situation that happened twice, approximately 20 minutes ago, of a loud rumbling coming from the sky.   It lasted both times too long for it to be a low flying jet.  It was so loud and low that I went outside to see what was flying so low or close to my home, only to feel the rumble and hear the noises but never finding anything.   This lasted about 7 minutes the first time, and the second was about 6 minutes.  Same sound.   It was really eerie and even though I live close to the St. Louis Airport, this was NOT a normal plane or jet sound… Thanks, ((name deleted)) ((ADDENDUM FROM WITNESS)) My location is on Shackleford, off of McDonnell Blvd., off 270 North County.   ((END ADDENDUM))",
      "link": "http://www.nuforc.org/webreports/116/S116647.html",
      "state": "MO",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3c3ed5",
      "summary": "Black discoid object flying from E to W, observed early afternoon from residential rooftop during clear sky over N side, St. Louis, Mo.",
      "city": "stlouis",
      "shape": "disk",
      "date": "2015-06-19T00:00:00",
      "story": "Black discoid object flying from E to W, observed early afternoon from residential rooftop during clear sky over N side, St. Louis, Mo. Black discoid object flying from E to W, observed early afternoon from residential roof top during clear sky over north side St. Louis city, Mo.  No wings, no lights, just steady trajectory across sky until out of view over western horizon.  There were many local black birds in the windy sky directly over neighborhood, but none at ufo's altitude.   It wasn't moving at extreme speed, but should've at least been traveling a few hundred mph due to the lack of time it took to cross the entire visible sky over head.  It was gone in at least 10 seconds after gracefully soaring right across the open sky.   I thought it was a big black bird (or hawk possibly) sailing a high wind current at first, but as I watched without distraction it never exposed any wings or showed any obvious biological identifiers or movements.  From my visual perspective, the ufo flew in a straight line at a steady speed.  I was not a gigantic object, but couldn't have been any smaller than a car.  No identifying marking or designs, at least from my distance.   While watching I tapped on window to attract my nephew, but he had just left the house.  My wife came by, but didn't come on roof as she was preoccupied and I still wasn't sure what I was witnessing.   I reluctantly did not pull my cell phone out quick enough to access the camera once I realized i was witnessing an anomaly.  As soon as it disappeared over the western horizon, I went back inside + informed my wife why I had nocked on the window.   This is the 2nd sighting I have witness from my roof which technically is the 4th floor of our house + permits an awesome view over the surrounding neighborhoods and metro city downtown. *My 1st sighting from this location was at night, a glowing orb like ship appeared (ironically) over the western horizon from behind some clouds heading west and then redirected its corse into a sharp decent down to earth and out of view.  That account took place about 2 years ago, the same week my step son took pictures of an entire mass fleet of glowing orb like ufos moving out across the night sky from an unknown location he witnessed with many other residents at his fathers previous apt complex way out in O'fallon, Mo.  We still have the picture he took with his cellphone.  There were no other airplanes in sky, as usually there are as we are under the direct path all airplanes take to taxi Lambert Airport.  The ship also did not glow or perform any other apparent actions/activities. These accounts are  astonishing even if they are all just drones or black military vehicles.  They are apparently becoming more obvious publicly. I am an US military veteran.  As a child I studied all kinds of jets, vehicles + technologies into my adult life.  In the field of creative arts I have also studied much structure, anatomy and behaviors of many things.  I am extremely positive I have witnessed these specific anomalies + anticipate more disclosure +/or public observations.  Hopefully, I could not have been the only one who witnessed this last event.  You never see this stuff over the city, ever.  I've been waiting to see them for myself a long time, but am not convinced these are directly alien, even though I do not rule out the possibility due to all cultural histories.",
      "link": "http://www.nuforc.org/webreports/119/S119592.html",
      "state": "MO",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c3f69",
      "summary": "I didn't see it myself, but someone posted this on You Tube. This is very near my house, at the grocery store I go to.  See &quot;Stran",
      "city": "stlouis",
      "shape": "unknown",
      "date": "2015-06-19T00:00:00",
      "story": "I didn't see it myself, but someone posted this on You Tube. This is very near my house, at the grocery store I go to.  See &quot;Stran I didn't see it myself, but someone posted this on You Tube. This is very near my house, at the grocery store I go to.  See \"Strange Lights in the Sky\" on Fox 2 News You Tube page.  Here is the link. https://www.youtube.com/watch?t=181&v=66-4f5-b9Bk ((NUFORC Note:  The video is very high quality, and shows 5-6 small lighted objects, moving from right to left in the camera's frame.  NUFORC has requested that the actual witnesses submit reports, and we are seeking wind data, to determine whether the objects might have been moving with the wind, or in another direction.  PD))",
      "link": "http://www.nuforc.org/webreports/119/S119625.html",
      "state": "MO",
      "duration": "unknown"
    },
    {
      "_id": "64d005f478aba2ec5a3c40c4",
      "summary": "12:05 am huge rectangular craft seen over mississippi river in east carondelet illinois area",
      "city": "stlouis",
      "shape": "rectangle",
      "date": "2015-05-13T00:00:00",
      "story": "12:05 am huge rectangular craft seen over mississippi river in east carondelet illinois area at 12:05 am rectangular craft over Mississippi river in east carondelet Illinois area. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/118/S118908.html",
      "state": "MO",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c4120",
      "summary": "UFO over St. Louis, MO, May 21.",
      "city": "stlouis",
      "shape": "",
      "date": "2015-05-22T00:00:00",
      "story": "ufo over st. louis mo may 21 I was outside tonight in front of my house.  I looked up and saw a dark object flying thru the sky.  The object was kind of shaped round but not perfect circle. It was up very high i thought as high as jet liners fly.  But it was much bigger.  Probably 3 times bigger. There was no sound or lights on it.  It kept going south east at same height until i couldn't see it anymore.  Before it disappeared from sight i had my wife come out and look at it.  It was easily visible and like nothing we ever saw.  I guess it was moving as fast as a jetliner.",
      "link": "http://www.nuforc.org/webreports/119/S119086.html",
      "state": "MO",
      "duration": "5"
    },
    {
      "_id": "64d005f478aba2ec5a3c4806",
      "summary": "The object was boomerang shaped (half U Shaped) no sharp angles except for the wing tips which were also more rounded.",
      "city": "stlouis",
      "shape": "other",
      "date": "2015-11-20T00:00:00",
      "story": "Sighting of two \"boomerang\" shaped craft, from the intersection of South Kingshighway Blvd. and Chippewa Street, St. Louis, MO:   The object was boomerang shaped (half U-shaped) no sharp angles, except for the wing tips, which were also more rounded and also in between the wing tips looked to be another smaller boomerang, but looked to be one solid mass (one object)   The craft was \"silent, no sound emitting, but the most impressive was the camouflage\" hardly visible, resembling smoke coming off a fire.  I was able to make out the shape and that is was indefinitely a solid mass as it was blocking out the sky on the other side as it was traveling East South East.   And I would approximate the speed at about 35-40 mph if were in my car trying to track it and also at a pretty low altitude.   As the craft looked to be quite large.  The moon was in the back ground, and the object surpassed its size. ((NUFORC Note:  We have spoken via telephone with the witness on two occasions, and he seemed to us to be quite sober-minded and sincere.  We suspect that he is a quite reliable witness.  PD))",
      "link": "http://www.nuforc.org/webreports/124/S124197.html",
      "state": "MO",
      "duration": "15 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c4abc",
      "summary": "((NUFORC Note:  No information provided by witness.  PD))",
      "city": "stlouis",
      "shape": "light",
      "date": "2015-10-16T00:00:00",
      "story": "((NUFORC Note:  No information provided by witness.  PD)) ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/122/S122853.html",
      "state": "MO",
      "duration": "currently"
    },
    {
      "_id": "64d005f478aba2ec5a3c4d4d",
      "summary": "Eight orange spheres over St. Louis.",
      "city": "stlouis",
      "shape": "sphere",
      "date": "2015-08-27T00:00:00",
      "story": "Eight orange spheres over St. Louis My son and I along with a neighbor witnessed eight orange spheres traveling SW to NE.   The first three that we saw traveled separately, but along the same path, approximately 2 minutes apart.   The fourth one that we saw stopped and remained stationary for roughly one minute, before ascending straight up until it disappeared.   The fifth light that we saw followed the same path as the first three but seemed to travel faster and was much brighter.   The last three traveled one right after the other and formed a triangle, then separated as they traveled out of view.  The elevation was that of the helicopter traffic that we see, but the speed was much faster. While we watched the fourth sphere hover we heard and saw a military jet.",
      "link": "http://www.nuforc.org/webreports/121/S121298.html",
      "state": "MO",
      "duration": "20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c519e",
      "summary": "Confirmation of previous report in Nevada, Mo., 1976.  This really happened.",
      "city": "stlouis",
      "shape": "light",
      "date": "2016-01-05T00:00:00",
      "story": "Confirmation of previous report in Nevade, Mo., 1976.  This really happened I want to comment on a report that happened to a group of people in Nevada, Missouri. \"Nevada \tMO.  \tLight\t 30 minutes\t   We were star gazing on a beautiful summer night at approximately midnight.  Many stars where visable and after perhaps an hour...probab\"  I also cannot confirm the date since it was so long ago, but I too remember waking up in the middle of the night and was looking out of the window up into the sky.  Very clear night.  Stars were everywhere.   Then suddenly in the span of 1 - 2 seconds, I saw a \"star\" fly into view, make an immediate 90 degree turn, fly a short distance, make another 90 degree turn; and continued making 2 more 90 degree turns before flying out of view in the exact same way it flew in.  (Basically drew a big square in the sky and was gone in under 2 seconds.)  I say it was a \"star\" because it was the same light and intensity of the other easily seen stars.  No special shape, just a light. I'll always remember seeing that.  I feel blessed that I was able to witness it.  It enlightened me to believe that there maybe something out there. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/124/S124896.html",
      "state": "MO",
      "duration": "1-2 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c5244",
      "summary": "Bright ball coming from large star.  ((NUFORC Note:  We suspect the object may have been a \"twinkling\" star.  PD))",
      "city": "stlouis",
      "shape": "light",
      "date": "2016-01-29T00:00:00",
      "story": "Bright ball coming from large star. On January 27, 2016, at around 6:00p.m., my brother-in-law called me and told me to look toward the East for a bright star that was twinkling a lot.  I walked outside, looked to the East and saw a large, bright star changing from white to blue to red.   My brother-in-law said he thought he saw what were spotlights coming off of it for a brief moment.  Then I saw a bright ball, smaller than the star, shoot away from it, change directions and then the bright ball was gone.   I kept going outside all night to look at it and never saw anything else coming from the “star.” ((NUFORC Note:  We suspect the object may have been a \"twinkling\" star.  PD))",
      "link": "http://www.nuforc.org/webreports/125/S125487.html",
      "state": "MO",
      "duration": "2 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c528c",
      "summary": "Large UFO over St. Louis (Creve Coeur).",
      "city": "stlouis",
      "shape": "unknown",
      "date": "2016-01-23T00:00:00",
      "story": "Large UFO over St. Louis (Creve Coeur).  It was July 28th, 2014.  I was at work at a car dealership in Creve Coeur, Mo. I went to the very top of our 6 story car garage to look for a car.  Out the corner of my eye, I saw a very large craft flying very low & slow traveling north over highway 270 which is less than a mile from the garage I was at.   As I took a double take at this craft, I realized that this was not a airplane i was seeing.  The craft was jet black it seemed only the top was reflective to the sun the sides of the craft was not reflecting from the sun on a bright sunny day which was odd.  The craft was also oddly shaped the center seemed to be flat almost disk like but the front and rear seemed to be rounded.   The craft was completely silent it did not admit any noise I could hear.  I have heard many airplanes fly over that parking garage from much further distances.  This craft I seen was the closest I have ever seen a craft near that garage so it should have been very loud and yet the only noise I could hear was cars on the highway.  This craft looked to be possibly bigger than a 757.   I took screenshots of the video that I took and zoomed In the pictures and some people I showed this to thought it was a Chinook helicopter but there is no way it was in my opinion for the fact a Chinook is very loud and what I was seeing was silent.  I am just looking for answers of what this was it could be military, or could be unknown.. Thanks, ((name deleted))",
      "link": "http://www.nuforc.org/webreports/125/S125364.html",
      "state": "MO",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c5363",
      "summary": "I believe I was abducted for a short period of time.  I have a new scar on my armpit.",
      "city": "stlouis",
      "shape": "fireball",
      "date": "2016-01-14T00:00:00",
      "story": "I believe i was abducted for a short period of time. I have a new scar on my armpit. Two of my friends and I were walking to one of our friends house when i looked up and saw the big dipper.  Then just a little farther to the left i saw a glowing ball of light moving across the sky.  Then i said look and both friends looked up.  The one of them said its another.  As we watched them, one stopped and another bypassed as if it thought the other one was a star. Then when the second ufo as ahead about 10 ft. away, the first ufo changed directions and went the opposite way of the second one.  Then they both disappeared. As we continued on i looked up in a different direction, I saw a huge grey triangle in the sky with a red light in the middle of the bottom and three blue lights on the tips.  It was moving across the sky quietly, then another appeared farther to the right.  It looked the same as the first triangle one, but instead of silence it as loud like a jet.  My two friends went inside, then both ufo hovered for about two minutes.  One disappeared, ! while the other hovered above me.  I then fell asleep.  Then my friends came back outside and said I was inactive (non responsive) for the first 30 seconds when they came back outside.  I dont remember being inactive but i remember going to sleep. Now i have a new scar on the under part of my armpit. I still have the scar.",
      "link": "http://www.nuforc.org/webreports/125/S125219.html",
      "state": "MO",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c5694",
      "summary": "We discovered what appeared to be a huge floating city directly above us about 30 to 50 feet. (Not sure of exact date in 1993)",
      "city": "stlouis",
      "shape": "other",
      "date": "2016-06-24T00:00:00",
      "story": "We discovered what appeared to be a huge floating city directly above us about 30 to 50 feet. (Not sure of exact date in 1993) I am 52 years old, and it has been many years since I have even thought of this.   One day in 1993 on a clear sunny day my brother who was 26 at the time and I, who was 28, had a sighting.  As stated earlier it was during the day when my brother and I was standing in our driveway, in a heavy populated part of the city.  When we noticed that the sounds of everyday life had vanished and the day became shaded prompting us to look up.  At that moment we discovered what appeared to be a huge floating city directly above us about 30 to 50 feet, with no distinctive geometric shape.  That approached without making a sound.  There was no visible points of engines exhausts.  It was dark in color, not smooth in shape, with unknown markings, and what appeared to be closed areas that may have been entry points.  It hovered above us for about 60 seconds before we witnessed it streaking across the sky and disappearing with no effort for something that large.  We stood there in amazemen! t for another minute before two twin propelled helicopters came through on the same path.  That had no chance at all and was no where near being close to the craft because of the clumsy and awkwardness of our military aircraft.",
      "link": "http://www.nuforc.org/webreports/128/S128037.html",
      "state": "MO",
      "duration": "60 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c57b8",
      "summary": "4 small dots in square formation next to 3 small dots in triangle formation in the sky. All of these dots moved.  ((anonymous report))",
      "city": "stlouis",
      "shape": "light",
      "date": "2016-06-16T00:00:00",
      "story": "4 small dots in square formation next to 3 small dots in triangle formation in the sky.  All of these dots moved over the course of a few minutes and were gone within 30 minutes. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/127/S127801.html",
      "state": "MO",
      "duration": "21:00"
    },
    {
      "_id": "64d005f478aba2ec5a3c5b3c",
      "summary": "Several orange lights in the shape of a triangle.  Form disappeared quickly in sothern evening sky.",
      "city": "stlouis",
      "shape": "unknown",
      "date": "2016-04-15T00:00:00",
      "story": "Several orange lights in the shape of a triangle.  Form disappeared quickly in southern evening sky. On April 2, 2016, I observed several orange lights in the shape of a triangle form in the evening sky.  The lights were not connected on an object.  This event lasted only seconds.  I was not able to count the orange lights as they appeared to be speeding away toward the southern sky.  The sky was blue without a cloud to be seen.  The stars were not visible yet.  The time of observation was after 7:00pm.  I did not look at a clock. After this experience, I quickly tried to explain this to my husband.",
      "link": "http://www.nuforc.org/webreports/126/S126687.html",
      "state": "MO",
      "duration": "seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c6259",
      "summary": "Flashes of Light",
      "city": "stlouis",
      "shape": "flash",
      "date": "2016-09-30T00:00:00",
      "story": "Flashes of Light Around 9pm Central time, I was outside looking up at the sky, when I saw a very quick flash of a greenish transparent circular in shape light, swipe across the clear night sky.   I continued to watch the sky and turn towards the North East and then saw a fireball tipped light followed by a trail of white, flash cross the sky in about a 7 second time frame.   Nothing else was seen for the next 15 minutes as I waited for anything else.",
      "link": "http://www.nuforc.org/webreports/130/S130291.html",
      "state": "MO",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c62f6",
      "summary": "Triangular object with white and red lights flying low, very quiet.",
      "city": "stlouis",
      "shape": "triangle",
      "date": "2016-09-09T00:00:00",
      "story": "Triangular object with white and red lights flying low, very quiet. Traveling along Interstate 270 I saw a low flying triangular aircraft.  It had a strange pattern of lights with large white circles and red flashing lights. It could have been a plane landing but I don't think I was near Boeing or the Airport. Just seemed strange and quiet. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/129/S129675.html",
      "state": "MO",
      "duration": "brief"
    },
    {
      "_id": "64d005f478aba2ec5a3c6326",
      "summary": "Unusual light over the STL Arch; eyewitness reports the light to be about 100 ft. above the top of the structure. ((anonymous report))",
      "city": "stlouis",
      "shape": "light",
      "date": "2016-08-16T00:00:00",
      "story": "An unusual light appeared over the STL Arch, eyewitness reports the light to be about 100 ft. above the top of the structure.  The light appears to move oddly and blink rapidly, while hovering in one location.   Debunkers would like to explain this as a sun dog, yet the happening was at 2:30 a.m. footage can be found online.  STL Ufo. ((NUFORC Note:  The videos can be seen via the following links:  Surveillance camera video from Malcolm W. Martin Memorial Park:  https://www.youtube.com/watch?v=ehzVYFSdVMs&feature=youtu.be Video taken by Mr. Chase Rhoads: https://www.youtube.com/watch?v=TIJoITcXxYg&feature=youtu.be    We at NUFORC have looked at the video footage, and we cannot divine a logical explanation for the incident.  Please see our posting of August 4th, 2016, for the same links.  PD)) ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/129/S129123.html",
      "state": "MO",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c639c",
      "summary": "Around 8:00 pm I noticed a low, but bright (slightly orange) light near the horizon, yet above the tree line. Somehow it got my attenti",
      "city": "stlouis",
      "shape": "light",
      "date": "2016-09-02T00:00:00",
      "story": "Around 8:00 pm I noticed a low, but bright (slightly orange) light near the horizon, yet above the tree line.  Somehow it got my attention; I swore it moved.  I watched for a minute--nothing.   Then it suddenly jerked to the lower right.  I watched for another minute and it did not move.  Then I ran inside to grab my phone so I could tape it.   When I went back it was still there.  Again it seemed to move (down), this time not as far and at a slower speed.  As  I was fumbling for my phone settings, it then it (slightly faster then your typical airplane) dropped below the level of trees in a straight line.  The light also appeared to have a very faint flashing light attached to it.",
      "link": "http://www.nuforc.org/webreports/129/S129573.html",
      "state": "MO",
      "duration": "~3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c6636",
      "summary": "Strange lights hovering near the gateway arch.  Fox2now.com has the video footage.",
      "city": "stlouis",
      "shape": "",
      "date": "2016-08-04T00:00:00",
      "story": "Strange lights hovering near the gateway arch.  Fox2now.com has the video footage. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/128/S128993.html",
      "state": "MO",
      "duration": "30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c668c",
      "summary": "Green fireball over St. Louis.",
      "city": "stlouis",
      "shape": "fireball",
      "date": "2017-03-23T00:00:00",
      "story": "Green fireball over St. Louis My partner and I were out driving at around 8:15pm last night (March 22nd, 2017) when we both witnessed and unexplainable object fall through the sky.  It started off with my partner seeing what they claim to be a bright flash in the sky.   Less than two minutes later, we both watched what appeared to be an orb of some kind falling through the sky above us, heading south at a fast pace.  It was glowing bright green and the emitted light increased in intensity until it seemed to just burn up and fade away, leaving no real trail behind it, or any evidence that it was ever there to begin with.   This all happened within a matter of five to ten seconds, leaving us searching for similar objects for the rest of the night.   There was no sign of anything ever hitting the ground, and no reports of anything have come up throughout today.   Neither of us have ever seen anything remotely similar to this, though I have seen other unexplainable objects they never fell this quickly.   Unfortunately, because of the randomness of this event, we did not capture any photos.",
      "link": "http://www.nuforc.org/webreports/133/S133264.html",
      "state": "MO",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c68e5",
      "summary": "Two bright lights near Milky Way traveling north in St. Louis, MO.  ((anonymous report))",
      "city": "stlouis",
      "shape": "light",
      "date": "2017-03-17T00:00:00",
      "story": "Two bright lights near Milky Way traveling north in St. Louis, Missouri. My brother and I last night where coincidentally are not so coincidentally discussing a recent report that came out from some Harvard scientists claiming that radio frequencies from deep space could be the signature of alien space travel.  Just minutes after we talked about this, I looked up towards the Milky Way and song ((sic.  saw)) two bright stars that I had never seen before near the bowl of the Milky Way.  I realized that they were travelling together heading north.  I told my brother to look and he saw them as well.  They didn't make any erratic movements but they slowly dimmed until they were invisible to the naked eye. ((NUFORC Note:  Satellites, being illuminated by the Sun, would not dim, as they traveled to the north.  PD) ((NUFORC Note:  Source of the report elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/133/S133062.html",
      "state": "MO",
      "duration": "20 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c6939",
      "summary": "Saw 2 bright white orbs while driving.",
      "city": "stlouis",
      "shape": "formation",
      "date": "2017-04-07T00:00:00",
      "story": "Saw 2 bright white orbs while driving. At approximately 7:40 p.m., Central standard time, while driving, I witness 2 bright orbs flying in formation. I initially thought that the orbs were the lights of an aircraft, but I did not see the flashing red usually located beneath commercial aircraft.   As I proceeded to drive down the road, I had stopped at a stoplight.  At the stop, the orbs became obstructed from my view for less than 30 seconds, but during the seconds the orbs disappeared.   There is a field along the road past the stoplight that provides an unobstructed view of the sky.  I looked around for the orbs or any aircraft that could be the cause of the sighting, but I saw nothing in the sky.",
      "link": "http://www.nuforc.org/webreports/133/S133449.html",
      "state": "MO",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c72ae",
      "summary": "Odd light seen over St. Louis.  ((anonymous report))",
      "city": "stlouis",
      "shape": "sphere",
      "date": "2017-06-22T00:00:00",
      "story": "Odd light seen over St. Louis. UFO Report filed 06/16/17:    On 06/15/17, at 9:05 pm, standing on our deck preparing to barbeque, I saw a light in southeastern sky that was moving toward my position gradually.  I noticed that it looked different from an aircraft (we live south of St. Louis airport so airplanes are common and frequent) and had an orange/red glow much like a flame so my first guess was that it could be a hot air balloon.   As it got closer, I tried to listen for the familiar sound of gas burners but was surprised at its total silence.  It soon lost the light and moved to more of a north course as a very dim sphere.  It seemed to speed up and soon was beyond the trees on our horizon to the north.   The entire siting lasted approximately 10 minutes.   Upon reflection, I don’t recall ever seeing a hot air balloon past sunset and never saw one move so fast.   Also, I could not discern a fast wind to propel a balloon. ((NUFORC Note:  Source of the report elects to remain anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/134/S134608.html",
      "state": "MO",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c73d3",
      "summary": "Was on the porch to check the weather.  Saw what I thought was a helicopter, but was TOTALLY silent.  Reddish in color. Moving S to N.",
      "city": "stlouis",
      "shape": "light",
      "date": "2017-06-15T00:00:00",
      "story": "Was on the porch to check the weather.  Saw what I thought was a helicopter, but was TOTALLY silent.  Reddish in color.   Moving South to North, when object turned and went 180 degrees (going South again). STOPPED.   Started blinking bright yellow, and quickly descended toward the ground.  A minute later a jet went slowly over the object's flight path (South to North).    Could not judge distance  of object, or distance in sky. ((NUFORC Note:  Source of the report elects to remain anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/134/S134582.html",
      "state": "MO",
      "duration": "~12 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c7b8e",
      "summary": "White lights with a red pulsating strobe in a linear formation over St. Louis, MO.",
      "city": "stlouis",
      "shape": "unknown",
      "date": "2017-11-09T00:00:00",
      "story": "White lights with a red pulsating strobe in a linear formation over St. Louis, MO. At 0430, I took my dog outside for a walk.  I looked up into the sky and noticed 3 bright white lights in a \"V\" shape off to the SE.  From my perspective, I would prognosticate that they were about 2-3 miles away.  At first, it looked only moderately out of the ordinary and no sound was heard.  About 30 seconds later the lights flashed a very bright pulsating red strobe light which last for about 5 seconds.  I did not have my phone, so I ran to my apartment which was only 30 feet from my location at the time.  I grabbed my phone and ran back outside.  Upon return, the lights had traversed a significant distance South (estimate 15-20 miles) and maintained that distance for 1 hour.  I did take pictures and video, however the lights were too far to render any valuable imagery.  I continued to watch the lights hover and no additional strobe lights were observed.  During this time a total of 5 white lights could be seen in a linear pattern and would turn on and o! ff intermittently.  At 0530, the lights dissipated and were no longer visible.  No other individuals in the area were present to my knowledge.",
      "link": "http://www.nuforc.org/webreports/137/S137177.html",
      "state": "MO",
      "duration": "1 hour"
    },
    {
      "_id": "64d005f478aba2ec5a3c8791",
      "summary": "2 objs flying dark black colored with red or off yellow white lights on for few sec., disappeared then appeared. ((anonymous report))",
      "city": "stlouis",
      "shape": "triangle",
      "date": "2018-07-13T00:00:00",
      "story": "There were two objects flying dark black colored with red or off yellow white lights on for few seconds then disappeared then appeared  again for few seconds same area flying around. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/142/S142126.html",
      "state": "MO",
      "duration": "20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c8936",
      "summary": "&quot;Cat paw&quot; UFO encounter on WI44 in St. Louis, Mo.",
      "city": "stlouis",
      "shape": "teardrop",
      "date": "2019-09-06T00:00:00",
      "story": "&quot;Cat paw&quot; UFO encounter on WI44 in St. Louis, Mo. I was driving West on I44, around 9 pm, towards Eureka, Mo.  It was dark.  A green light came from behind me.  I watched it in my rear view mirror.  I was in the left lane.  It came down and traveled alongside my car - same speed for approx. 1 mile. I looked over at it.  There were no windows.  \"Cat paw\" shape.  Green effervescent color.  A little smaller than the car I was driving.  It seemed as though it could see me looking at it, I felt it was looking at me.  At that point it shot up into the sky, there was a white flash, and it was gone. The entire incident lasted 3 minutes. The prior morning , I had been driving East on I44, and I saw what seemed like \"erratic flares\" over the highway not far from my sighting.  Probably 4-5 of them.  One of them went over the highway and seemed to have landed in the Soccer field on left side of highway.  At the time I didn't pay close attention, but believe they were related.",
      "link": "http://www.nuforc.org/webreports/148/S148672.html",
      "state": "MO",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c89cc",
      "summary": "While doing my normal spying ( neighborhood watch ) I went to sit in the room seen my neighbors car leaving then I happened to look up",
      "city": "stlouis",
      "shape": "unknown",
      "date": "2019-09-19T00:00:00",
      "story": "While doing my normal spying (neighborhood watch), I went to sit in the room seen my neighbors car leaving then I happened to look up and see this light in one spot around 10pm  it started to move just a little bit, it disappeared at 10:12 while I was writing this",
      "link": "http://www.nuforc.org/webreports/148/S148830.html",
      "state": "MO",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3c8ec7",
      "summary": "One elongated, rectangular, drone-like UFO with red and green blinking lights traveling West well above the treeline.",
      "city": "stlouis",
      "shape": "rectangle",
      "date": "2019-01-04T00:00:00",
      "story": "One elongated, rectangular, drone-like UFO with red and green blinking lights traveling West well above the treeline. Moments after putting my car in park after coming home (having used no substances and being well rested), I glanced out of my window and saw one rectangular, drone-like object with red and green lights throughout the body traveling West well above the treeline.  Lights flickered but no quicker than the tick of a clock.   I opened my car door and refocused my eyes while standing and watched the craft travel at a constant speed until it was out of sight in the suburban landscape.  I could see one steady trail via the lights of the UFO.  Its shape was an elongated rectangle--perhaps a 1:4 ratio length to width traveling nose first.",
      "link": "http://www.nuforc.org/webreports/144/S144287.html",
      "state": "MO",
      "duration": "20 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c8f3f",
      "summary": "Enormous strobing rectangle lights moving across the sky at extremely high speed.  ((anonymous report))",
      "city": "stlouis",
      "shape": "rectangle",
      "date": "2018-12-06T00:00:00",
      "story": "Enormous strobing rectangle lights moving across the sky at extremely high speed Huge.  I mean absolutely enormous.  The light flashing appeared to be as large as 15-20 Tower beacons.  White not red.  It flew in from the direction of S. Louisiana St. towards S. Compton.  Was extremely loud, and sounded like a missle.  Was flashing like a strobe light and moved faster than any jet or airplane I've ever seen.  It took literally seconds to move from out of sight in one direction to out of sight in the other direction.  It is cloudy outside.  No stars to be mistaken, and the light was still so bright it was blinding, making it hard to even see the shape.  Immediately afterwards, you could hear aircraft in the sky, as if trailing it. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/143/S143955.html",
      "state": "MO",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c8fec",
      "summary": "Bright light hovering in the sky. I opened my Astrology App and it was not a star or planet bit it was higher than the few airplanes th",
      "city": "stlouis",
      "shape": "circle",
      "date": "2018-11-24T00:00:00",
      "story": "Bright light hovering in the sky.  I opened my Astrology App and it was not a star or planet bit it was higher than the few airplanes that passed by.  In the dark the light was to bright to observe directly.  It was Southeast of my location.",
      "link": "http://www.nuforc.org/webreports/143/S143855.html",
      "state": "MO",
      "duration": "On going"
    },
    {
      "_id": "64d005f478aba2ec5a3c956f",
      "summary": "Bright light! seen about 5 too 7,Only 2 are still seen,One very faint light and one very bright light, the last 2 are moving very slow,",
      "city": "stlouis",
      "shape": "light",
      "date": "2019-12-19T00:00:00",
      "story": "Bright light! seen about 5 too 7,  Only 2 are still seen,  One very faint light and one very bright light, the last 2 are moving very slow, flashing white lights, a pear off and on.(other lights seen) Green, white,red,yellow.",
      "link": "http://www.nuforc.org/webreports/151/S151257.html",
      "state": "MO",
      "duration": "40-50 (still there)"
    },
    {
      "_id": "64d005f478aba2ec5a3c95c6",
      "summary": "MADAR Node 70",
      "city": "stlouis",
      "shape": "",
      "date": "2019-12-19T00:00:00",
      "story": "MADAR Node 70",
      "link": "http://www.nuforc.org/webreports/151/S151558.html",
      "state": "MO",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3c965e",
      "summary": "Bright blue orb of light high in sky and within seconds it took off and created a streak of light that faded to green before completely",
      "city": "stlouis",
      "shape": "light",
      "date": "2019-10-04T00:00:00",
      "story": "Bright blue orb of light high in sky and within seconds it took off and created a streak of light that faded to green before completely disappearing.  Happened on 2 occasions. Once standing in the walmart parking lot facing west towards 270/Saint Charles.  The other incident was very close in proximity occurring a few months prior while driving east on 270 between st charles rock road and 370/missouri bottom.  It was directly ahead of me looking east. Both occurrences were brief and photos were unable to be captured.",
      "link": "http://www.nuforc.org/webreports/149/S149472.html",
      "state": "MO",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c9955",
      "summary": "I spotted a circular object in the sky far away with white and red blinking lights going from slow speeds to light speed.",
      "city": "stlouis",
      "shape": "unknown",
      "date": "2019-10-04T00:00:00",
      "story": "I spotted a circular object in the sky far away with white and red blinking lights going from slow speeds to light speed. It began when I was playing video games, then all of a sudden all of my power went out.  I turned my flashlight on and checked the light switches in the hallway which also didn’t work and before I thought to do anything the power came back on by itself.  As I was trying to turn my Xbox back on I glared out the window and saw something that made me report this.  There was something that almost looked like an oval but taking in that what I saw was extremely high in the air I couldn’t see it all that well.  The only thing that stood out to me were the red and white lights formed in a circle as they were flashing continuously.  I tried to take a video of it but my eyes could only see what my camera couldn’t I put my phone down and looked back up.  When I first saw the “ufo” it was moving pretty slow I thought it was a plane or maybe a helicopter.  Finally, I saw the object increase it’s speed immensely, disappearing out of my line of sight within 12 seconds.",
      "link": "http://www.nuforc.org/webreports/149/S149379.html",
      "state": "MO",
      "duration": "10 minutes"
    }
  ]
}