{
  "city": "stockton",
  "fetch_timestamp": "2025-07-12T14:34:30.052400",
  "record_count": 58,
  "pages_fetched": 2,
  "api_calls": 3,
  "source": "ufo_aficionado_api",
  "records": [
    {
      "_id": "64d005f478aba2ec5a3b4171",
      "summary": "ball of fire in summer sky",
      "city": "stockton",
      "shape": "fireball",
      "date": "2006-05-15T00:00:00",
      "story": "ball of fire in summer sky fireball was 500 feet elevation traveling north to south and had spark shooting from it. lit up our entire neighborhood like it was day. ((NUFORC Note:  Witness indicates that the date of the event is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/049/S49802.html",
      "state": "CA",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b5c86",
      "summary": "A truly great service. . .",
      "city": "stockton",
      "shape": "",
      "date": "2008-03-04T00:00:00",
      "story": "A truly great service. . . Peter, I have been a fan of your site for many years now.  You have performed an invaluable service for a countless number of people who are fascinated by the subject of your work.  I have been increasingly disturbed by the number of negative comments that you have received regarding the \"timeliness\" of your postings.   For any of your readers who might feel compelled to complain, let me say to them \"don’t do it.\"  The data that you compile and disseminate is of such importance that I am fearful that too much of those uninformed comments will cause you to throw in the towel and give it up.  To those who might wish to complain, please know that this effort is made for your benefit and entertainment on truly \"shoestring resources\" (both financial and manpower).  To my knowledge, Mr. Davenport receives no compensation at all for devoting his life to this cause.  Before you file a complaint, think about the effort that must go into receiving, reading, cataloging, and posting the 400+ reports that I’m sure he receives every month.  If you still feel justified in complaining, don’t bother checking the site.  Peter, thanks for all you do. ((NUFORC Note:  This is the type of comment that keeps me working at what, most of the time, seems to be a thankless task.  Thank you for the comment in Stockton!!  PD))",
      "link": "http://www.nuforc.org/webreports/060/S60131.html",
      "state": "CA",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3b5ee1",
      "summary": "Witnessed numerous UFO's along I-5 from Stockton south to Tehachipi on busy holiday weekend.",
      "city": "stockton",
      "shape": "changing",
      "date": "2008-02-14T00:00:00",
      "story": "Witnessed numerous UFO's along I-5 from Stockton south to Tehachipi on busy holiday weekend. This event took place in 1973. I was 21 years old and traveled from San Diego County to Portland Ore with my brother and his wife on 4th of July weekend.   My brother was in army aviation at the time and I was a student pilot.  Another brother was an air controller for the SAC, a close cousin an army pilot and his brother an Air Force kicker.  We grew up adjacent to air bases: Kirkland, Biggs, Mira Mar and Camp Pendleton. We are very familiar with aircraft and their abilities.  On the return trip from Portland we were at the cloverleaf of I-5 and I-580 in the Stockton California area at dusk. (perhaps 8PM). The freeways were very busy. My brother and I saw a craft coming from our 10 o'clock position very low. Our first assumption was that it was a crop duster as they are common in that vicinity and they prefer to work right up to sunset. The craft had three lights, red, green and amber, not unlike any aircraft except that they were in the wrong positions and the anti-collision lamp did not blink.  The craft came in right over our windshield at about 60 -100 ft AGL!  We looked directly up at it but only saw a blur. It appeared to be transparent. It past over us to our 2 o'clock position and only about 300 ft lateral and 100 ft altitude. I got a good look at it. It was tubular with a simple frame for a fuselage. The craft was transparent as if made from see through covering. It had short stubs protruding from its sides that were not sufficient to be wings or airfoils. It had no engines.  It immediately, without turning, returned in our direction while descending.  An impossible maneuver for any aircraft that I know of. It's speed was slow, perhaps 45mph. The stubs turned out to have bright lamps attached and they were activated nearly blinding us. The craft flew down to the deck illuminating the field of wheat (or rice) and pushing it aside as it moved a few feet above it. I again got a close look and the craft was not a duster or helicopter. I have never known dusters to use lights as dusting is too dangerous at night.  We looked at other motorists at they seemed not to notice. We followed the progress of the crafts as it continued to crisscrossed I-5 in a similar fashion as we moved south at about 80 mph. Complete darkness fell swiftly. We then saw many craft with two lights performing the same maneuvers amongst the fields. They were acting as if they were looking for something on the ground by \"strafing\" it with their lights which were too close together to be mistaken as autos in the distance. We also noticed that at times they would stop and hover over the California Aqueduct and shine their beams downward. We stopped several times to witness the events. Though many times the hovering objects were close they made no sound.  Again other motorists seemed to notice nothing. There were usually three in sight at all times. We tried to rationalize that it was helicopters, agricultural machinery or autos in the distance. However, in the following years i made that same trip many times at night and never saw anything like it again. Our only rational thought was that it was police looking for someone. We listened to the radio in ernest hoping for a news announcement. Of course there was none. The object(s) began following us at fence top level along the opposite side of the freeway, about 100 yards behind. We tested them several times by speeding up to 140 mph and then slowing to about 20mph. The craft(s) kept pace with us! When they seemed to be bored with this game they would fly off laterally at high speed but still stay within sight. Often they would be replaced by another in their former position.  After the initial first sighting near Stockton, my sister-in-law fell asleep in the back seat. We attempted several times over the next few hours to awake her to witness the show but were unable to. She was clearly alive but slapping and shaking could not wake her.  We were totally confused and decided to stop in at a truck stop a few miles off the freeway near the bottom of the Grapevine. We had witnessed this phenomenon for about three hours at this point. We made casual inquiries in the restaurant of the staff and truckers but no one saw anything. My sister-in-law remained unconscious. We continued on our trip south and had no more sightings.  Upon awaking the next day my brother and I went over what had transpired. We discovered that we were missing somewhere between 90 and 180 minutes of time. We checked our gas receipts which were dated and time stamped and new our speed averaged 80 mph except for the few times we stopped which we accounted for. We had no sensation that we were abducted then or since and suffered no ill effects.  Many years later I read a book by a UFO investigator that stated that 1973 was a big \"flap\" year in California and the Central Valley in general.",
      "link": "http://www.nuforc.org/webreports/061/S61253.html",
      "state": "CA",
      "duration": "3hrs"
    },
    {
      "_id": "64d005f478aba2ec5a3b61e8",
      "summary": "Saucer hovers three stories above car, lights around rim, no sound,",
      "city": "stockton",
      "shape": "disk",
      "date": "2008-01-21T00:00:00",
      "story": "Saucer hovers three stories above car, lights around rim, no sound, Suddenly there was a huge gray saucer with colored lights around the rim that flashed circularly around it.  It was coming down lower and lower and closer to the car lower than the 3 story Pac Bell building on March Lane.  It seemed as wide as the goodyear  blimp.  I was cutting behind the building to get to the aparment complex next door.  I rolled down the window to hear a motor and it was completely silent.  That was when i got scared.  The car almost stalled.  At that point I panicked and prayed to God that we not get taken up as I have heard that happens to people.  I checked my clock to make sure no time would had been lost.  I took my adult friend and her 2 children home (in the complex) and then raced back home.  When I got home I went to my backyard and could see it in a distance moving toward UOP.  I was also shocked at the boldness of it moving so slowly and so low.  My back yard was on Brookside Road at the levy.  I watched my clock and arrived home without losing any time.  I was stunned to the point of not seeming able to speak about it and my friend was as well.    A couple of years later I brought it up and asked her and her children exactly what they saw and it was the same.  Just recently I have felt able to tell others.   I still cannot even believe we saw it and I really do believe  that had I not prayed we would have been taken up.  I am now a 55 year old woman and at the time was managing properties in Stockton for a developer out of Roseville.  I had been with them for close to 3 years.  I am a professional woman and at that time my children were enrolled in private school.  My friend was in her late 20's at the time and  the  children were 10 and 8 years old.  Neither of us used drugs or alchohol.  Needless to say it was very frightening and I still look over my shoulder in  fear.  When I was about 6 years old I had seen a saucer very low moving fast across the horizon in Bay City, Michigan.",
      "link": "http://www.nuforc.org/webreports/060/S60647.html",
      "state": "CA",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b636f",
      "summary": "A triangle shaped object with three orangish red lights,  was silent and large, that was low to the ground.",
      "city": "stockton",
      "shape": "diamond",
      "date": "2008-02-14T00:00:00",
      "story": "A triangle shaped object with three orangish red lights,  was silent and large, that was low to the ground. My Brother and a group of four friends were walking back to our house about four or five blocks away following a large craft that went from being glowing bright light to turning off the light, by that time they had arrived at my moms place were they startled us out of my house with screams of bloody murder, me and my youngest brother ran out to a black craft that lit up with three large orangeish red lights one light on each end of the triangle shaped craft. The completely,silent object had absolutely no sound and was so low to the ground that I felt as though I could throw a rock at it. I won't forget seeing the orangeish red lights come on one at a time it was so scary they were giant I had two brothers and three family friends that saw it and were so scared they won't even talk about it. Oh and when I came outside they were screaming about something falling out of the back of it. I watched it and followed it as it went off into the distance. I lived in the middle of a densely populated city of Stockton I can't believe no one reported it to the media I was only seventeen at the time and was pretty shook up and scared they were coming back. Oh and Hail-Bop comet was visible in the sky at that time which was scary enough to look at. I will try and have one of the others come forth and tell their story about that night in 1997 they may have a better way of explaining what they saw. Thank you very much for this opportunity to tell my story.",
      "link": "http://www.nuforc.org/webreports/061/S61350.html",
      "state": "CA",
      "duration": "25 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b639e",
      "summary": "Black huge triangle craft with chevron shape of lights on her belly with a larger red light in the center of the chevron shape travelin",
      "city": "stockton",
      "shape": "triangle",
      "date": "2006-07-16T00:00:00",
      "story": "Black huge triangle craft with chevron shape of lights on her belly with a larger red light in the center of the chevron shape travelin At the time of the sighting , I was a 34 year old father of a 3 year old daughter. Married for 8+ years with a stable happy life. Ironically, we had just moved back to the Stockton address (my home growing up)nearly three years previous in December 1984 from Roswell, N.M.. We moved to Roswell by chance. Placed an application at the local sign company while I helped a couple good friends move to Roswell. Not Once did any of my super good partners who were born and raised in Roswell mention/utter a word about the Roswell Incident 40 years earlier. Anyway--- at that time and probably ever sense I was in my late teens I've always had the attitude that \"anything is possible\". I can only say for sure that the date an year can only be 1987 or 1988 in early to mid November. Why I remember that it was in November, we were having an \"Indian Summer\" that year. I was watering the edges of my front lawn by hand when for no reason I looked up into the sky above me and all I could see is a black. No stars, no blue-black color that one see's normally as the color of night sky unless you live away from city lights etc.The whole entire sky was filled with this huge black opaque object as far as I could see in all directions. Then through the branches of the tree that I was standing under,set of lights appeared in a chevron shape with a larger reddish orange with a glimpse of yellow lite was in the center of this chevron shape of different colored lights. It was so huge and looked as though it was traveling no more than 30-40 miles per hour. I remember thinking to myself as to what's keeeping this ship from just falling out of the sky. Going way to slow to not fall out of the sky. THEN ALL OF A SUDDEN I could see the real actual night sky with all the stars in the drk-blue black setting. As it continued passing over, I could see the enormity of this thing as it traveled in a north west direction towards the city of Antioch, Fairfield, Vacaville, Santa Rosa and eventually to the Pacific coast. As it was leaving my area, I was estimating the altitude with the telephone poles in the area. This \"Mothership or whatever took up at least a 3-4 block sq. area and maybe more at an altitude no more than 300 - 400 ft in the air  and was so quiet (not a peep)it was noisy. I don't know what made me look up. My address at that time was very close to where the Calaveras river dumps into the deep water channel. ((NUFORC Note:  Witness indicates that the date of the event is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/051/S51131.html",
      "state": "CA",
      "duration": "7 - 10 min"
    },
    {
      "_id": "64d005f478aba2ec5a3b6e83",
      "summary": "30 objects in an hour.",
      "city": "stockton",
      "shape": "light",
      "date": "2007-06-12T00:00:00",
      "story": "30 objects in an hour. We began seeing these objects in the stars on the 9th and have appeared in the sky in the same manor till today on the 11th. They appear to be stars, but they move around. They fly straight at times and other times in lurching motions. They can be dim in light or very bright--brighter than the stars. We saw 30 in an hour on the first night. I tried to video tape them, but my video camera wouldn't pick them up. On the second night, we counted 40 in two hours and they didn't seem to stop, they just kept on coming across the sky. We did notice an anomaly with the sightings. We could almost predict when one was coming because it became very still, there would be no breeze, then we would hear a slight \"whoosh\" sound and a falling star would fall. Then a few more would come across the sky. The secound night I caught a split second of one on my video camera because it was so bright that it was blinding if you looked at it. We even saw one change course to chase a plane in the sky. This was a very strange thing for us to witness, we felt like we where being invaded and will probably see more tonight. Maybe these are just sattelites, but we dont think that is the case. We also see 2-3 white cigar shaped objects during the day, that appear to be incorperated into the seeding programs in our area. We don't know what they are, but hopfully others are seeing them in kansas. ((NUFORC Note:  Witness elects to remain totally anonymous;  provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/056/S56625.html",
      "state": "KS",
      "duration": "3 days"
    },
    {
      "_id": "64d005f478aba2ec5a3b7591",
      "summary": "\"V\" shaped object with white or blue lights on the rear of the wings, traveling across the night sky",
      "city": "stockton",
      "shape": "triangle",
      "date": "2007-02-01T00:00:00",
      "story": "\"V\" shaped object with white or blue lights on the rear of the wings, traveling across the night sky Watched a \"V\" shaped object cross the sky. The object had 5 or 6  white or blue lights on the back of each wing. The light stayed on during the duration on the sighting.  The object was flying lower than a commercial aircraft but higher than a small plane.  At ground level the object was about 1 inch long with my hand extended. The object was traveling from the south to the north, about the same speed as a commercial aircraft.",
      "link": "http://www.nuforc.org/webreports/054/S54757.html",
      "state": "CA",
      "duration": "10 sec"
    },
    {
      "_id": "64d005f478aba2ec5a3b7be4",
      "summary": "commercial plane veeres off course to avoid possible collision with ufo",
      "city": "stockton",
      "shape": "sphere",
      "date": "2006-07-16T00:00:00",
      "story": "commercial plane veeres off course to avoid possible collision with ufo I was unloading some material off my work trailer and looking up as i do alot now after having seen several ufos in the past three years or so,but this is my first report. I have many commercial aircraft that flies overhead, that night wasnt any different.A large airplane fliing a northeasterly heading had a bright shiny object rapidly approaching from behind it maybe a mile or so and slightly to the planes south side as the object approached to nearly along side the airplane,it veered to a due north course and the object stayed on the northeasterly heading until it went out of sight or dissappeared,was unable to locate plane as to whether it stayed on a new coarse or back to a northeasterly heading",
      "link": "http://www.nuforc.org/webreports/051/S51188.html",
      "state": "KS",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b7ee7",
      "summary": "Lights in the sky  ((NUFORC Note:  Student report.  PD))",
      "city": "stockton",
      "shape": "light",
      "date": "2009-12-12T00:00:00",
      "story": "Lights in the sky I was sneaking out of my house , to go to my girl friends house . I wentto her house I stay in front on the side Walk , I sat down on side walk. Just then I saw a distant big bright light . It was bigger than the street lights light from wer I was sitting . I was still . It was not moveing at all just then I started to focus on it then it shoot away at a very fast speed. The speed of this objct was amazing I was so started that I just went home. ((NUFORC Note:  Student report.  PD))",
      "link": "http://www.nuforc.org/webreports/073/S73054.html",
      "state": "CA",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b8aff",
      "summary": "UFO DANCING IN THE SKY",
      "city": "stockton",
      "shape": "light",
      "date": "2009-12-12T00:00:00",
      "story": "UFO DANCING IN THE SKY I was just getting back from my job and decided to take a shower.  After doing so I went outside to walk my dog with my wife.  I was busy looking at my dog when my wife just said, \"What is that in the sky\".  At first I just gave it a quick look and told her it was just a star. I ignored it and looked at my dog again.  She said no its not a star because its moving.  So I look up at the \"star\" again but this time it was moving to the right from my point of view.   Again I ignored it and told her it was a helicopter, but as I was about to look away i saw it move quickly to the left and then it caught my attention.  As it moved around in the sky my wife and I stared at this object just moving so fast from left to right.  I asked my wife if she knew what it was but she didnt reply to me.   What me and my wife saw that night, I dont know but it was not any airplane or helicopter.",
      "link": "http://www.nuforc.org/webreports/072/S72838.html",
      "state": "CA",
      "duration": "10 secs"
    },
    {
      "_id": "64d005f478aba2ec5a3b8d97",
      "summary": "Spherical black UFO over Stockton",
      "city": "stockton",
      "shape": "sphere",
      "date": "2008-10-31T00:00:00",
      "story": "Spherical black UFO over Stockton Well I was outside of work, outside the security gate, when I saw what I thought was a blackish purple mylar spinning balloon. I would say it was perhaps 500-1000 feet off the ground, but its hard to say, because, well I know this sounds weird, but its shape was hard to make out the closer it got. It looked spherical, and was scintillating, and curiously, the air around it seemed to shimmer - it was hard to see its edge, that's the only way I can describe it. It moved silently from my left, and I was thinking to myself that if it stopped it would have be a UFO. And then, as if it heard my thought, it stopped directly in front of me! I just stared at it, and I had the most curious feeling of being watched, hard to describe, just felt as if it realized I was looking - so I waved at it.  It then started to slowly go up into the sky. As it was going up, its color seemed to change to a whitish metallic, almost like sodium. And then, it began to flash. A bright, neon green, then pink, and yellow. It also - sounds weird again - seemed to phase in and out of the air. It would seem to disappear, then I would see one of the flashes, and it would appear again at some distance and disappear. This continued until it was a tiny speck in the sky and then I couldn't see it anymore. Interesting day. If you can help me identify what I saw, or let me know if other people have seen similar craft, I would be very appreciative. Thank you for your time.",
      "link": "http://www.nuforc.org/webreports/065/S65649.html",
      "state": "CA",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b98b7",
      "summary": "White object flying overhead.",
      "city": "stockton",
      "shape": "circle",
      "date": "2010-04-13T00:00:00",
      "story": "White object flying overhead. Randomly looked up in the sky and noticed a solid  bright white circular object moving from NNW to SSE.  The object was in sight for approx. 15 seconds before going behind my neighbor’s house.  The object was flying within our atmosphere approx. 5000 feet and flying fast.  No sound came from the object when it flew overhead.",
      "link": "http://www.nuforc.org/webreports/074/S74778.html",
      "state": "CA",
      "duration": "15 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b9a18",
      "summary": "2 Lights In The Night Sky",
      "city": "stockton",
      "shape": "light",
      "date": "2010-04-13T00:00:00",
      "story": "2 Lights In The Night Sky It was around 10:15pm last night on the date of 03/24/10 when the three of us friends were outside talking about going to a lake tomorrow, then one of us noticed that a light was moving across the sky very fast with a trail of light behind it.  At first we just thought of it as an airplane or a shooting star but when we saw another one go in the opposite direction we payed close attention to them and then we saw the two lights appear out of no where and they just were sitting there and not moving but they were glowing and we all just were stuck thinking in our heads of what these lights could be. Then we looked at each other in \"aw\" and we were just flabbergasted.  After about 3 minutes the light just flew across the sky again in the same direction but it seemed like as the both melted together and disappeared into the dark night sky.  All three of us after that just started talking about what it could be and everyday we try to figure out what it was.",
      "link": "http://www.nuforc.org/webreports/074/S74784.html",
      "state": "CA",
      "duration": "5-6 mins"
    },
    {
      "_id": "64d005f478aba2ec5a3ba5c3",
      "summary": "On 08/02/2008 at approximately 2AM, my passenger and I witnessed a large burning object falling SW near Cal State Univ. - Stockton",
      "city": "stockton",
      "shape": "fireball",
      "date": "2008-08-12T00:00:00",
      "story": "On 08/02/2008 at approximately 2AM, my passenger and I witnessed a large burning object falling SW near Cal State Univ. - Stockton While driving NE on a Hwy 4 connector road on Friday, August 2nd at approximately 2AM, my passenger and I witnessed a large burning object falling SW from the sky and seeming to land near the campus of Cal State University, Stanislaus-Stockton in the city of Stockton, California   Since we were en route to our destination, we did not exit to observe where this object landed, but instead called 911 to file a report the incident while continuing to drive on Hwy 4. At first we thought it was a falling star and then I said falling stars skim the atmosphere! Then we thought possibly a meteor, but did not see any explosion or fire from the landing. As we continued to drive, we did a relative size comparison such as: bigger than my Honda CR-V  car tire, bigger than a merge sign, bigger than the small bushes lining the highway. From the distance that we saw the object, we agreed that it was approximately as big as a small car such as a Metro or similar. The shape was hard to determine due to the trail of fire. The flames were coming up from the head and there was a short flame tail behind it. The color was bright white when we first saw it at approximately 1,000 feet up and then became a greenish color (which my passenger commented was the color of a hot object cooling down). I have been unable to locate any news reports of this incident on the internet, newspapers or local TV news websites.",
      "link": "http://www.nuforc.org/webreports/065/S65003.html",
      "state": "CA",
      "duration": "6 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bac0e",
      "summary": "A white/blueish circle flying toward East then fades out.",
      "city": "stockton",
      "shape": "circle",
      "date": "2010-11-21T00:00:00",
      "story": "A white/blueish circle flying toward East then fades out. White/blueish circle heading East/South East.  I seen it overhead going straight east then it swerved toward South East.  It quickly faded out after it swerved.  It was about the size of a cheerio.  It was white and had a blueish circle in the middle.",
      "link": "http://www.nuforc.org/webreports/078/S78255.html",
      "state": "CA",
      "duration": "1 second"
    },
    {
      "_id": "64d005f478aba2ec5a3bae2e",
      "summary": "unexplainable.",
      "city": "stockton",
      "shape": "light",
      "date": "2011-05-02T00:00:00",
      "story": "unexplainable. went outside to smoke a cigarette and i seen a light (bright) just hoovering in air. it looked as it was at a distance, but seemed close. the light started to move up and then disapeared. i thought i was seeing things then i seen a blinking light moving straight up, the light was that of an airplane. it took off, at normal speed, over the house, and i flicked my lighter a few times but no response. i thought it was an airplane at first until it went out of sight, and then my neighbor walked up and i told him what i seen,  then we both seen a light in the same spot that i seen the last light at, but it wasn't as bright. we stared at it sitting in the same spot and it just vanished. ((NUFORC Note:  Witness elects to remain totally anonymous; provides little contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/080/S80832.html",
      "state": "CA",
      "duration": "15 min."
    },
    {
      "_id": "64d005f478aba2ec5a3bb5b0",
      "summary": "Possible UFO sighting in Northern Ca.",
      "city": "stockton",
      "shape": "light",
      "date": "2010-11-21T00:00:00",
      "story": "Possible UFO sighting in Northern Ca. My friends had reported that they had seen a light in the sky, that was stationary, and then would bounce around, then returning to its stationary position.  This was a week before the sighting that we saw.  He showed me the light, which I insisted is probably a satellite or the International Space Station. They insisted that it moved.  I did not see it move that night, but they continue to say that it moves. It is clearly visible from where we were at.  We had to go away from where we were at to get a clear view, as we are in a city. Here are the coordinates and direction we saw it. NE 47 deg  n 37d 57' 35.7\"  w 121 d 17' 47.7",
      "link": "http://www.nuforc.org/webreports/078/S78905.html",
      "state": "CA",
      "duration": "1 hour"
    },
    {
      "_id": "64d005f478aba2ec5a3bb723",
      "summary": "Light streak then flashing blue light getting dimmer and dimmer each time",
      "city": "stockton",
      "shape": "flash",
      "date": "2010-07-19T00:00:00",
      "story": "Light streak then flashing blue light getting dimmer and dimmer each time Thought it was a close shooting star.   Streaked across sky like sparks flying off of it then stopped and starting flashing blue, each time getting dimmer and further away. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/076/S76626.html",
      "state": "CA",
      "duration": "5 sec"
    },
    {
      "_id": "64d005f478aba2ec5a3bc290",
      "summary": "It simply vanished Right in front of my eyes.",
      "city": "stockton",
      "shape": "disk",
      "date": "",
      "story": "In 1968 Stockton, Ca.  I witness a huge UFO , the light from the craft caught my attention while walking one summer evening about 9 p very dark night no moon, but this huge UFO hovering above me about 200ft. When I Notice the UFO It was amazing , the craft was covered in a luminescent glowing cloud which was rapidly covering the entire UfO, when the luminescent  smoke reached the very top of the craft if completely disappeared from sight.  It simply vanished Right in front of my eyes. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/086/S86710.html",
      "state": "CA",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bd477",
      "summary": "Orange orbs hovering over Stockton Lake traveling from SW to NE hovering then disappering.",
      "city": "stockton",
      "shape": "sphere",
      "date": "2012-08-05T00:00:00",
      "story": "Orange orbs hovering over Stockton Lake traveling from SW to NE hovering then disappering. While fishing at Stockton lake by dam facing south witnessed an Orange ball traveling from SW to NE seemed to be moving at variable speeds.  Watched Orb travel from SW to NE and disappear. As soon as it disappeard another Orb would appear at the same place the first on started and continue same flight path, as soon as that one disappeard the third one did same thing.  Forth orb was spotted N of dam it traveled SW to NE hovered momentarily and disappeard.",
      "link": "http://www.nuforc.org/webreports/090/S90639.html",
      "state": "MO",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bd541",
      "summary": "Change from a rectangle to a old screaming 707 airliner balactica",
      "city": "stockton",
      "shape": "rectangle",
      "date": "2012-07-04T00:00:00",
      "story": "change from a rectangle to a old screaming 707 airliner balactica June 22, 2012 In the summer of august 1981, my wife and son were traveling in the area of Stockton airport Stockton California. When we saw a bright light to the east above the horizon about 15 deg the size of the light was twice that of a landing light of a common commercial airliner.  It was about 70 miles away from us.  I worked for a major airline at the time. So I know what a large transporter would look like. So I deceited to park at the end of the run way and watch a touch and go of aircraft because pilots from major airlines use Stockton airport to training.  Anyhow as the craft approached the control area I figured that the aircraft would do a regular base and final approach,  and touch and go but what happen was this.  The craft was at the same height as the control tower and it looked like the ship was going to crash into the control tower and went on the other side of the tower and across the small aircraft hangars still heading west. As its approached us about 5 cars were a! t the end of the runway and we all got out of our cars and I saw the rectangle black metallic, with lights flashing all around it ufo approach us all going across the highway airport boulevard at 25 feet off the ground moving at a speed of 3 miles per hour. Very very slow its length of a football field, height 40 feet, width 75 feet. As it slowly move in front of all of us there was port holes of 3 where you can see being inside that resembled tall thin looking figures looking at us.  I had a strong flash light and I shined the light into the port hole and gave a delta sign with my light.  As the ship was in front of us a old type of Buick 1951 sedan black car approached the ship with a person inside it drivers side with looked like a man in black and he didn’t even see the ship.  He was gone after that.   We watch the ship make a long round approach into the delta for about 10 minutes.  After that I went to the control tower and reported a ufo as I was doing this other peo! ple were calling up the tower and reporting the same thing.  I! asked t he tower if any aircrafts had come into this area in the last 10-15 minutes and they said no aircraft came through at all.  It is impossible for the tower not to see the large spot light 70 miles away and than the tower high craft passing behind the tower.  After that we left the area a headed south on hwy 99 towards modest California and there we saw the bright light again. It had made a large circle around the the Stockton , Manteca, lathrope.   I saw it coming very fast and low maybe 30 feet .  I went under the over pass of Manteca 99 hwy and saw the ship change shape from a rectangle to a old 707 aircraft and screaming very low and very old looking battle ship.  We were shocked in its new appearance.  After that I went home and call blue book and reported it.  Many years later mufon people wanted to hear our story and put my wife and I under hipnotics because my wife said she saw  the ship at Stockton airport went on top of her and I saw it to the side.   That the story.",
      "link": "http://www.nuforc.org/webreports/089/S89943.html",
      "state": "CA",
      "duration": "30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bd993",
      "summary": "Bright light with large light aura. NE of my location. might have a trail.",
      "city": "stockton",
      "shape": "light",
      "date": "2012-08-05T00:00:00",
      "story": "Bright light with large light aura. NE of my location. might have a trail.",
      "link": "http://www.nuforc.org/webreports/090/S90935.html",
      "state": "CA",
      "duration": "on going"
    },
    {
      "_id": "64d005f478aba2ec5a3bdc0e",
      "summary": "Not a shooting star, comet, or flare.",
      "city": "stockton",
      "shape": "light",
      "date": "2012-10-30T00:00:00",
      "story": "Not a shooting star, comet, or flare. Object caught the eye as it traveled south to north. It looked like a shooting star only much brighter and closer.  Object was visible for about 1 plus seconds then picked up speed and disappeared. ((NUFORC Note:  Witness elects to remain totally anonymous; provides little contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/093/S93651.html",
      "state": "CA",
      "duration": "1 second"
    },
    {
      "_id": "64d005f478aba2ec5a3be2e8",
      "summary": "At 10:03 pm saw a Flashing red, blue, white light. Hovers in same spot for around 35-40 minutes. Flickering three different colors. Hea",
      "city": "stockton",
      "shape": "light",
      "date": "2012-05-13T00:00:00",
      "story": "At 10:03 pm saw a Flashing red, blue, white light.  Hovers in same spot for around 35-40 minutes. Flickering three different colors.  Headed west around 10:45 pm towards Tracy/Discovery Bay area. Then faded away. ((NUFORC Note:  Possible sighting of Sirius in the southwest sky??  PD))",
      "link": "http://www.nuforc.org/webreports/088/S88627.html",
      "state": "CA",
      "duration": "35-40 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bea13",
      "summary": "Large bright light shrinks and flies away quickly.",
      "city": "stockton",
      "shape": "light",
      "date": "2012-03-13T00:00:00",
      "story": "Large bright light shrinks and flies away quickly. My roommate and I stepped out of our house and sat down.  I looked into the sky and saw a very large bright light moving slowly away, almost like a plane with a spotlight, the light suddenly shrunk to a small faint dot, and zoomed off extremely fast.",
      "link": "http://www.nuforc.org/webreports/087/S87564.html",
      "state": "CA",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bfcdd",
      "summary": "10 total craft spotted all orange fireball and all completely silent",
      "city": "stockton",
      "shape": "fireball",
      "date": "2013-02-04T00:00:00",
      "story": "10 total craft spotted all orange fireball and all completely silent",
      "link": "http://www.nuforc.org/webreports/095/S95706.html",
      "state": "CA",
      "duration": "12 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bfeba",
      "summary": "Trinagular object flying low, slowly across sky with alluminated outline.",
      "city": "stockton",
      "shape": "triangle",
      "date": "2013-02-04T00:00:00",
      "story": "Trinagular object flying low, slowly across sky with alluminated outline ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/096/S96042.html",
      "state": "CA",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c0bc2",
      "summary": "Stockton UFO 2014.",
      "city": "stockton",
      "shape": "formation",
      "date": "2014-01-10T00:00:00",
      "story": "Stoxkton UFO 2014 6 orange/ red lights flying in  formation. over spanos area in Stockton ca. All seperated, at some point.3 followed each other till the first of the thee turned the lights off an left. 2 moved north very slowly about 1000 ft in elevation. Them disappeared  turning of orange/ red lights. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/105/S105847.html",
      "state": "CA",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c0cd5",
      "summary": "Saw them before in Florida.",
      "city": "stockton",
      "shape": "light",
      "date": "2014-02-27T00:00:00",
      "story": "Saw them before in Florida. Ten or twelve white lights in various formation.  Very low to the ground.  Moves very slow and smoothly.  Hovering at times with absolutely no sound.   Vanished one by one instantly.",
      "link": "http://www.nuforc.org/webreports/107/S107419.html",
      "state": "CA",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c0cd6",
      "summary": "Red Lights In the sky.",
      "city": "stockton",
      "shape": "circle",
      "date": "2014-02-27T00:00:00",
      "story": "Red Lights In the sky Was walking home as I got closer to my apartment building I normally always look up at the building.  As I look up I noticed 4 red lights in a line formation kind of look like circles but bright red like a light buld shine they had like a blinking to th lights.  I thought to myself what is that.   So I hurried into the apartment building I ran up the stairs to the third floor which is the floor I live on and got my mom and told her to hurry and come outside to the fire escape.  I told her to look and tell me if she could see what I was seeing.  I didnt want to look like I was crazy.   At this time the objects were closer together in a circle shape and stared to just move around slowly in diferent directions.   My mom said she was gonna run in and grab her phone cause my phone was dead.   When she came back out most of them just vanished.  I did get to capture 2 of the objects one photo is kind of fuzzy.  These objects were observe facing west.  I will try to email or send regular mail the picture I have.  If I cant send them I will have them printed out and put away in case u send someone out to get them.",
      "link": "http://www.nuforc.org/webreports/107/S107387.html",
      "state": "CA",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c0dea",
      "summary": "UFO over Pacific Ave Stockton, CA.",
      "city": "stockton",
      "shape": "circle",
      "date": "2014-02-21T00:00:00",
      "story": "UFO over Pacific Ave stockton ca It appeared to change form looked like a spider in the sky moving slowly looked black in the sky was heading north could be seen clearly by off of pacific ave was flying relitively slow and lower than normal aircraft.  I was able to take a video of it.",
      "link": "http://www.nuforc.org/webreports/107/S107184.html",
      "state": "CA",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3c13ba",
      "summary": "Observed a bright brilliant red light sitting low and still in the night sky. The community that it was hovering over was Weston Ranch.",
      "city": "stockton",
      "shape": "light",
      "date": "2013-12-23T00:00:00",
      "story": "Observed a bright brilliant red light sitting low and still in the night sky.  The community that it was hovering over was Weston Ranch.   I was fumbling with my iPhone to capture a picture.  By the time I was able to retrieve my camera phone the light had disappeared.",
      "link": "http://www.nuforc.org/webreports/105/S105456.html",
      "state": "CA",
      "duration": "35 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c16ad",
      "summary": "10/20/13 UFO sighting in Stockton. .?",
      "city": "stockton",
      "shape": "light",
      "date": "2013-10-23T00:00:00",
      "story": "10/20/13 UFO sighting in Stockton. .? That night we were driving to my mother's house.. My husband looked up into the sky screamed for me to look, and there were 8 orange to red lights in a row horizontally and they just started moving making, perfect alignment shapes, from left to right and back a again we stopped in the middle of the street to see the whole view as well as our co-worker behind us.. And they at last made a triangular shape then went back into a straight line this time straight across all lined up and just disappeared in a flash and that was it!  No sign of anything being there; just the lights went off!   By this time we were standing out of our car just dumbfounded, amazed and everything else all in one??  Co- worker says it's the government testing__ but me I'm not too sure.. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/103/S103447.html",
      "state": "CA",
      "duration": "16 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c1904",
      "summary": "I have three pichers i would like to text you ..in the cloulds and in only one spot ....we're all kinds of colors..... and all i had wa",
      "city": "stockton",
      "shape": "oval",
      "date": "2014-06-04T00:00:00",
      "story": "I have three pichers i would like to text you ..in the cloulds and in only one spot ....we're all kinds of colors..... and all i had was my cell phone .....frist pic is just of the cloulds ...then the next pic i seen this....an upright ovil shape !!!!!!!!  And one pic that I was able to see it in a negative way...you will see the shadows around the ovil shape...... Or What ever it is ......",
      "link": "http://www.nuforc.org/webreports/109/S109387.html",
      "state": "CA",
      "duration": "1 second"
    },
    {
      "_id": "64d005f478aba2ec5a3c297d",
      "summary": "Flying saucers seen in Stockton.",
      "city": "stockton",
      "shape": "disk",
      "date": "2014-11-21T00:00:00",
      "story": "Flying saucers seen in Stockton. Late at night, dogs in neighborhood were barking up a storm, went outside to check what was going on.  Shined flashlight around property and couldn't see anything.   Went back inside to relax, and all dogs started going crazy again, look out window and see these three objects with lights on them flying around neighborhood.   At first my wife thought it was a helicopter or airplane so I watched it and I know how a helicopter and airplane look and what kind of lights they have and how long it takes for them to accelerate I to air.  So I waited and watched these things go up in the sky and  accelerate and go up fast and disappear in the sky not like an airplane or a helicopter.   Then about  3 minutes later I went out to sit on front porch they came out of nowhere again and hovered over our neighborhoods house across the way from us, I used my binoculars this time and see a saucer shaped flying object with red lights around it like a ring a glass shaped top and silver color type ship, watched it about  30 seconds, then it drifted up in sky again and disappeared.",
      "link": "http://www.nuforc.org/webreports/115/S115426.html",
      "state": "CA",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c2cdc",
      "summary": "Bright white/blue flash w/tail streak.",
      "city": "stockton",
      "shape": "flash",
      "date": "2014-09-25T00:00:00",
      "story": "bright white/blue flash w/tail streak Bright blue/white streaking flash just above high school traveling eastbound I just happened to go outside to my car and looked up and seen a bright flash",
      "link": "http://www.nuforc.org/webreports/113/S113819.html",
      "state": "CA",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c3013",
      "summary": "Came from southbound Stockton, heading towards the northeast. Flew couple hundred feet above apartment complexes, at a slow steady pace",
      "city": "stockton",
      "shape": "rectangle",
      "date": "2014-08-22T00:00:00",
      "story": "Came from southbound Stockton, heading towards the northeast.  Flew couple hundred feet above apartment complexes, at a slow steady pace.  Its side view seem to glare from city lights, giving it a shape that was gigantic.  At least two stories in height and close to 4 stories in length.  Seemingly blending in with night sky, making it hard to identify.   As it was leaving 4 lights on the backend shining white shaped like a square, lights were on each corner.  It sounded similar to planes flying overhead with slightly deeper tone.   I had 2 minutes before it flew out of sight.  I can't believe how low something that big was flying above my apartments.  I'm not making this up, I saw this object and couldn't believe my eyes!!!   Watching the lights on it back end almost completely resembling 4 planes perfectly aligned in a square formation.",
      "link": "http://www.nuforc.org/webreports/112/S112672.html",
      "state": "CA",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3c3a8d",
      "summary": "Saw a red glowing sphere while fishing with friend.",
      "city": "stockton",
      "shape": "sphere",
      "date": "2015-07-17T00:00:00",
      "story": "Saw a red glowing sphere while fishing with friend. Hi, i also saw a UFO. well it was a friend and i who saw it.  in Stockton,Ca in mid June of 1990, we were fishing.it was a red glowing sphere that was sort of rotating,there was no noise at all.if any one else remembers this day,please comment, i know someone else had also seen it.it was around 2:00 AM and 3:30 AM approx. but it only lasted around 20 minutes before flying away,to be honest i didnt see it fly, it was too fast.Im not sure how far it was, but i know it was no plane or nothing i have ever seen before.i didnt have any camera at that time.The Naval Base was located north west of were i was fishing and behind me i beleive was a water treatment plant or some type of plant,to my right was the bridge. the date is approximate it was a long time ago, it was my sophomore summer break in high school. ((NUFORC Note:  Witness elects to provide no contact information.  PD)) ((NUFORC Note:  Witness indicates that the date of the event is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/120/S120358.html",
      "state": "CA",
      "duration": "20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c3a9e",
      "summary": "I also saw a UFO.  Well it was a friend and i who saw it,in Stockton,Ca in mid June of 1990 we were fishing.it was a red glowing sph",
      "city": "stockton",
      "shape": "sphere",
      "date": "2015-07-17T00:00:00",
      "story": "Hi, i also saw a UFO. well it was a friend and i who saw it,in Stockton,Ca in mid June of 1990 we were fishing.it was a red glowing sphere that was sort of rotating,there was no noise at all.if any one else remembers this day,please comment, i know someone else had also seen it.it was around 2:00 AM and 3:30 AM approx. but it only lasted around 20 minutes before flying away,to be honest i didnt see it fly, it was too fast.Im not sure how far it was, but i know it was no plane or nothing i have ever seen before.i didnt have any camera at that time.The Naval Base was located north west of were i was fishing and behind me i beleive was a water treatment plant or some type of plant,to the right is the bridge.",
      "link": "http://www.nuforc.org/webreports/120/S120356.html",
      "state": "CA",
      "duration": "20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c3ab0",
      "summary": "Seven Beautiful luminous orange orange orbs dance away above Stockton California",
      "city": "stockton",
      "shape": "sphere",
      "date": "2015-08-06T00:00:00",
      "story": "Seven Beautiful luminous orange orange orbs dance away above Stockton California I was looking at the moon around 11pm, and immediately noticed about 7 massively bright orange/amber \"orbs,\" perfectly aligned in almost a triangle shape.  They were still at first, and then started to dance around each other, and some even merged into one another to form a bigger and brighter ball of light.  They were pretty far away, but massively luminously bright and pulsating.  I yelled for my girlfriend to grab her phone but by the time she grabbed it and opened the video app, we only managed to film the last one that was fading away in the distance.  It was like nothing I've seen before.  So beautiful! No air craft or drone that far could emit such massive light, travel so fast, and move in the different directions, that I witnessed.   They disappeared headed northeast from Stockton, toward Highway 99, maybe more toward Lockford, CA.   So beautiful and majestic and defied laws of physics in my humble non-expert opinion.",
      "link": "http://www.nuforc.org/webreports/120/S120789.html",
      "state": "CA",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c40f0",
      "summary": "I have no idea what i wittnessed, but it was not natural.",
      "city": "stockton",
      "shape": "light",
      "date": "2015-05-13T00:00:00",
      "story": "I have no idea what i wittnessed, but it was not natural. Looking into the sky on the hood of my car.  In the south east sky over Stockton, Ca.  I thought I had seen a bright flash of white light about the size of a bright star.  No big deal \"right.\"  I rubbed my eyes and continued to look thinking maybe I saw a plane.  After that thought I starred into a fixed spot between 2 stars.  Then every 5 to 10 seconds, I was able to see this same light over and over.  Only differance being that it would appear from the southeast to the northeast over and over.   I thought maybe a sattalite....until the last 30 or 45 seconds of my experiance.  In those last seconds, 2 white lights blinked next to each other a few times stationary.  Then 2 seperate like shooting stars going in seperate directions left the sky.  Wow!!!  That is all I can say!!  I have heard the stories....read alot of stuff.  But this was the first time i ever questioned what did I just see.",
      "link": "http://www.nuforc.org/webreports/118/S118880.html",
      "state": "CA",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c436f",
      "summary": "Bright sphere, star looking object; had a foggy dome around it with a blue ray of light. ((NUFORC Note:  US Navy missile launch.  PD))",
      "city": "stockton",
      "shape": "other",
      "date": "2015-11-19T00:00:00",
      "story": "The &quot;Ufo&quot; was a bright sphere, star looking object. It had a foggy dome around it with a blue ray of light shining down towar The \"Ufo\" was a bright sphere, star looking object. It had a foggy dome around it with a blue ray of light shining down towards the ground. The light lasted about 2-5 minutes. It started out small in the middle of no where then expanded within time. It was beautiful but creepy because of it fading slowly and the bright light disappearing. ((NUFORC Note:  US Navy missile launch.  PD))",
      "link": "http://www.nuforc.org/webreports/123/S123658.html",
      "state": "CA",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c4be0",
      "summary": "Triangular formation of white blurry lights over venetian park Stockton Ca",
      "city": "stockton",
      "shape": "triangle",
      "date": "2015-08-27T00:00:00",
      "story": "Triangular formation of white blurry lights over venetian park Stockton Ca I was at Venetian park in Stockton Ca last night with some friends and as we were conversating one friend all of a sudden shouted ((deleted--\"what\")) is that!  I scanned around to see what he was talking about and when i looked up i saw a triangular formation of 3 blurry white lights.  I could not tell if it was a solid triangular craft or 3 seperate orbs butthey looked like they were eminating heat difracting the light around it. sadly it went out of view behind some trees before I could pull out my phone and attempt to record anything on my shitty camera.  As I chased after it to get a better view it was just gone but it was at low altitude and only looked like it was going roughly 60 mph southbound.   Afte ra few minutes of looking around for more objects another friend of mine pointed a similar formation out but higher and going north possibly the same craft/orbs which just appeared flew for a short distance and suddenly was gone. My initial thought was mabey it was a triangu! lar craft with a partial cloaking device as it did appear to come from nowhere it might have been in the process of cloaking and as I chased it was completely invisible or it sped up I really don't know. I thought I would be more prepared for such a sighting but it actually shook me up a little though I thought I had seen a few,once before for sure but that was a while ago.  There did seem to be an influx of helicopter traffic after the sighting over the amount of airplanes flying by which where very distinguishable it was a clear night.  The object/s where completely silent.",
      "link": "http://www.nuforc.org/webreports/121/S121245.html",
      "state": "CA",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c5d1d",
      "summary": "2 disk shaped objects drop from the skyline vertical and accelerate horizontal to the clouds.",
      "city": "stockton",
      "shape": "disk",
      "date": "2016-12-05T00:00:00",
      "story": "2 disk shaped objects drop from the skyline vertical and accelerate horizontal to the clouds. I stimmediat of the house to get an item from the vehicle and observed chem trails in front of me.  I immediately grabbed my phone and started to describe what I was seeing.  I gave my best explanation of what I was seeing.   About a week later, I was viewing the clip with a a friend and discovered for just a fraction of a second there was a blip on the screen.  I took several screen shots of the section.   I then enlarged the image to find 2 disk shaped objects drop from a spiraling vertical and accelerate southwest below the clouds over the horizon. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/131/S131604.html",
      "state": "CA",
      "duration": "3 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c65f7",
      "summary": "Slow moving, gradually descending bright white light with trail that broke up into 2 red objs.  ((NUFORC Note:  Space debris.  PD))",
      "city": "stockton",
      "shape": "fireball",
      "date": "2016-08-02T00:00:00",
      "story": "Slow moving, gradually descending bright white light with trail that broke up into two red objects over Stockton, CA First appeared as bright white light with green trail on a gradual descent.  Then the object broke into two red objects with much smaller trails, also red.  Video started after the object turned into the two red objects.  The objects ultimately descended out of sight.  Object was seen by my household of three and a neighbor who we have never met, but struck a conversation with when we ran to be front yard to see the object once it descended out of sight and saw the same exact thing we did. ((NUFORC Note:  Space debris.  PD))",
      "link": "http://www.nuforc.org/webreports/128/S128824.html",
      "state": "CA",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c6605",
      "summary": "Ufo over stockton plane crash?  Meteor? Drone? video disappeared on one camera.  ((NUFORC Note:  Space debris.  PD))",
      "city": "stockton",
      "shape": "fireball",
      "date": "2016-08-02T00:00:00",
      "story": "Ufo over stockton plane crash? Meteor? Drone?video disappeared on one camera Photo & video of lights 2 separating green trail slow moving horizontal  Not falling but rather creeping along   First thought drone but for trail  Next thought meteor but motion Was not falling next thought a plane  Crashing but very tough to figure  Silent disappeared low on horizon  Helicopter way up high spotted trailing This object… ((NUFORC Note:  Chinese rocket re-entry.  PD))",
      "link": "http://www.nuforc.org/webreports/128/S128831.html",
      "state": "CA",
      "duration": "1 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c75d1",
      "summary": "Points of white light parallel to the horizon; converging then diverging in fan a formation.  ((anonymous report))",
      "city": "stockton",
      "shape": "formation",
      "date": "2018-01-12T00:00:00",
      "story": "Points of white light parallel to the horizon; converging then diverging in fan a formation. Points of white light in the western sky.  Evenly spaced, near to and parallel to the horizon. Seemed to be hovering/traveling slowly away from me.  Hovering lasted about a minute. Points of light converged in a space of 2 seconds, rose slightly as one, and flew apart at great speed in a fan formation. Viewed through a window.  Not at all sure of the date, but it must've been winter for me to be able to see the horizon clearly. ((NUFORC Note:  Witness indicates that the date of the event is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/138/S138148.html",
      "state": "MO",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c77c4",
      "summary": "Orange red sphere over Stockton Ca on Thanksgiving dusky",
      "city": "stockton",
      "shape": "sphere",
      "date": "2017-12-04T00:00:00",
      "story": "Orange red sphere over Stockton Ca on Thanksgiving dusky On Thanksgiving dusk, I was with my inlaws in the back yard of their house in Stockton Ca.  I was telling them oddly enough about a documentary about aliens - when I stopped mid sentence having noticed the orange orb in the sky that seemed to appear out of nowhere.   I alerted my inlaws and they got up and saw the same thing.   It was glowing brightly and was orange red.  It was maybe 15000 feet, silently moved across the sky for about 1 minute.  My inlaws and myself watched it until it suddenly disappeared.  It seemed to be heading south west.   I fumbled trying to get my phone out and take a picture or video, but I couldn’t get it out in time before the Orb was gone.",
      "link": "http://www.nuforc.org/webreports/137/S137399.html",
      "state": "CA",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c79c1",
      "summary": "This evening, I witnessed two bright, stationary lights in the Eastern sky that faded simultaneously!",
      "city": "stockton",
      "shape": "light",
      "date": "2017-10-19T00:00:00",
      "story": "This evening, I witnessed two bright, stationary lights in the Eastern sky that faded simultaneously! At approximately 8:00 P.M. this evening (10/7/17), I saw two bright lights in the Eastern sky.  Being a keen observer of the night sky, I noticed that they looked out of place.  They were like stars, stationary, but they quickly faded, simultaneously!  I thought this  very strange.   Even though my wife was outside as well, I was the only one to witness this phenomenon.",
      "link": "http://www.nuforc.org/webreports/136/S136625.html",
      "state": "CA",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c79ef",
      "summary": "This evening, I witnessed two bright, stationary lights in the Eastern sky that faded simultaneously!",
      "city": "stockton",
      "shape": "light",
      "date": "2017-10-19T00:00:00",
      "story": "This evening, I witnessed two bright, stationary lights in the Eastern sky that faded simultaneously! At approximately 8:00 P.M. this evening (10/7/17), I saw two bright lights in the Eastern sky. Being a keen observer of the night sky, I noticed that they looked out of place.  They were like stars, stationary, but they quickly faded, simultaneously!  I thought this  very strange.   Even though my wife was outside as well, I was the only one to witness this phenomenon.",
      "link": "http://www.nuforc.org/webreports/136/S136626.html",
      "state": "CA",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c7c5e",
      "summary": "I'm a carpenter and married father of 2.5 kids (one's still in the oven). The kids and I were out for a bike ride on the D&R Canal path",
      "city": "stockton",
      "shape": "light",
      "date": "2017-10-05T00:00:00",
      "story": "I'm a carpenter and married father of 2.5 kids (one's still in the oven).  The kids and I were out for a bike ride on the D&R Canal path and we stopped at the playground in Bull's Island Recreation Area around 3pm in the afternoon.  It was bright and sunny without any clouds in sight, and I noticed a single, extremely bright, but small, white to pale yellowish light at very high altitude.   At first I assumed it was a high flying plane that was reflecting sunlight.  I thought it was odd but didn't think much of it really.   After a few minutes I looked up again, not expecting to still see it there, but it was, and seemed like it had barely moved at all.   So at that point I started really paying attention to it and noticed it was slowly getting brighter then dimmer and even disappearing from sight completely sometimes.   Over the next hour or so it very slowly moved across the sky from the northeast toward the south, never actually reaching the horizon.  The kids eventually got bored at the playground, so we moved on to go walk across the foot bridge, and by the time we made it through the trees and into clear skyline, again, I couldn't relocate it.   I did attempt to take a few pictures with my iPhone, because it is all I had, but nothing can be seen in the photos.",
      "link": "http://www.nuforc.org/webreports/136/S136522.html",
      "state": "NJ",
      "duration": "60 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c7cf3",
      "summary": "Orange balls of light.  ((anonymous report))",
      "city": "stockton",
      "shape": "circle",
      "date": "2017-09-21T00:00:00",
      "story": "Orange balls of light Spotted two orange color balls of lights traveling East at a very high speed.  The lights merged and disappeared. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/136/S136181.html",
      "state": "CA",
      "duration": "Few seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c7fac",
      "summary": "I have pictures of this rectangle shaped thing in the clouds about 450 ft long by 150 ft wide.  ((anonymous report))",
      "city": "stockton",
      "shape": "other",
      "date": "2018-04-19T00:00:00",
      "story": "I have pictures of this rectangle shaped thing in the clouds about 450 ft long by 150 ft wide I was taking pictures that day and night.  I stopped on the side of the road to get a picture of a tree in silhouette of some lighted clouds behind it.  It was not until the next day that I was able to see what it was that move across the sky.  There are three pictures of something first taken at 20:03:22 a blur can be seen flying into the cloud, the 2nd taken at 20:03:23 the blur is gone now there is a shape in the cloud that resembles a reptile with wings silhouetted.   Then I seen something move and took the 3rd picture at 20:03:27 and something is flying into another cloud.  And that the only thing I seen that night was movement from one cloud to another against the storm gust of 25mphr.  I can vaguely remember talking to someone there and in 8 pictures later I can see car tail lights can be seen in the 8th picture 30 secs from the first. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/139/S139489.html",
      "state": "CA",
      "duration": "1 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c8023",
      "summary": "Yellowish orange triangle flying very low and completely silent",
      "city": "stockton",
      "shape": "triangle",
      "date": "2018-04-05T00:00:00",
      "story": "Yellowish orange triangle flying very low and completely silent Looked out my window and saw a triangular shaped object flying silently thru the sky from the west moving south east.  Moving very fast and did not make a sound.  Kinda looked like flames coming out of the top.  After about 3 minutes it flashed and than flashed a few more times and than it was gone.",
      "link": "http://www.nuforc.org/webreports/139/S139318.html",
      "state": "CA",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c8304",
      "summary": "Yellowish star-like light traveling in a bouncy, uneven motion through the sky.",
      "city": "stockton",
      "shape": "light",
      "date": "2018-09-27T00:00:00",
      "story": "Yellowish star-like light traveling in a bouncy, uneven motion through the sky. I was driviing south on a neighborhood street when I noticed a light in the sky ahead of my car.  It was traveling in the same direction and almost on the same track.  My first thought was a shooting star but it was moving too slow.   Then I thought a an airplace or helicopter but it was a yellowish color, kind of fuzzy, and didn't have navigation lights.  My windows were up so I couldn't tell if it made any noise.  It moved with  a bouncy, staggering kind of moviement like it was traveling on an invisible bumpy road or traveling against a heavy wind..    I would estimate its altitude at aout 5000 feet.  I lost sight of it when I drove under some trees and made a left turn to my destination.",
      "link": "http://www.nuforc.org/webreports/143/S143169.html",
      "state": "CA",
      "duration": "15 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c83d0",
      "summary": "Big light able to maneuver.  Made no sound.  ((NUFORC Note:  Launch of the Falcon 9 rocket.  PD))",
      "city": "stockton",
      "shape": "other",
      "date": "2018-10-12T00:00:00",
      "story": "Big light able to maneuver.  Made no sound. looks like SpaceX rocket but it was able to maneuver and made no sound. ((NUFORC Note:  Launch of the Falcon 9 rocket.  We have amended the time.  PD)) ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/143/S143393.html",
      "state": "CA",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c979f",
      "summary": "Just saw at 6AM CST a line OF UFOS HEADING NORTH EAST FROM STOCKTON, MO.  ((NUFORC Note:  \"Starlink\" satellites?  PD))",
      "city": "stockton",
      "shape": "formation",
      "date": "2019-12-01T00:00:00",
      "story": "Just saw at 6AM CST a line OF UFOS HEADING NORTH EAST FROM STOCKTON MISSOURI.  APPROXIMATELY 50 OF THEM LASTING SEVERAL MINUTES.  I AM 75 YEARS OLD AND AM A COMMERCIAL MULTI ENGINE FLIGHT INSTRUCTOR 10,000 + FLIGHT HOURS.  No noise just white lights IRREGULAR SINGLE FILE APPROXIMATELY 1/2 APART Event lasted approximately 10 minutes.",
      "link": "http://www.nuforc.org/webreports/150/S150989.html",
      "state": "MO",
      "duration": "10 minutes"
    }
  ]
}