{
  "city": "tempe",
  "fetch_timestamp": "2025-07-12T14:36:56.257789",
  "record_count": 78,
  "pages_fetched": 3,
  "api_calls": 4,
  "source": "ufo_aficionado_api",
  "records": [
    {
      "_id": "64d005f478aba2ec5a3b458d",
      "summary": "Blinking lights south east of Tempe.",
      "city": "tempe",
      "shape": "light",
      "date": "2019-08-23T00:00:00",
      "story": "Blinking lights south east of Tempe There were four lights hovering above the ground just South East of my apartment building, my roommate and my neighbors were all out on our balconies taking videos.  Cars slowed down on the highway.  Four lights hovered and occasionally blinked in unison.  I listened to air traffic control from Phoenix Sky Harbor, but heard nothing unusual, which was strange considering that no airplanes landed or took off in this ~30 minute period.",
      "link": "http://www.nuforc.org/webreports/148/S148060.html",
      "state": "AZ",
      "duration": "30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b4e23",
      "summary": "Egg-shaped, and also white, but it wasn't solid white, it looked like a ball of bright, white illuminated cloud light.  ((anonymous))",
      "city": "tempe",
      "shape": "egg",
      "date": "2019-05-09T00:00:00",
      "story": "Egg-shaped, and also white, but it wasn't solid white, it looked like a ball of bright, white illuminated cloud light. I saw this white, egg shaped craft just cruise over Tempe Town Lake.  I was in one of the high buildings and saw it go passed, while I was looking out of the window.  It staying at a consistent speed and did not move up or down, just kept heading straight.  It was egg shaped and also white like an egg, but it wasn't solid white, it looked like a ball of bright, white illuminated cloud light. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/145/S145910.html",
      "state": "AZ",
      "duration": "5 second"
    },
    {
      "_id": "64d005f478aba2ec5a3b4fe1",
      "summary": "2 small circles zipping and floating.  ((anonymous report))",
      "city": "tempe",
      "shape": "light",
      "date": "2019-03-29T00:00:00",
      "story": "2 small circles zipping and floating 2 small white circles, one slightly larger, smaller circle encountered larger circle at rapid speed then matched pace.  pulled sever maneuvers together before drifting apart and increasing elevation. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/145/S145324.html",
      "state": "AZ",
      "duration": "20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b53ca",
      "summary": "Two nights in a row...bright light hovering near Sourth Mountain and then rapidly jetted away then disappeared.",
      "city": "tempe",
      "shape": "light",
      "date": "2008-06-12T00:00:00",
      "story": "Two nights in a row...bright light hovering near Sourth Mountain and then rapidly jetted away then disappeared. Two nights in a row, saw the exact same thing.  Driving home on I-10 around 6:00 pm noticed a bright light in the sky that was hovering and then jetted away at a VERY high rate of speed to the south and up and then disappeared.  First time, thought it was my imagination, but saw the EXACT same thing the next night on the drive home.",
      "link": "http://www.nuforc.org/webreports/063/S63629.html",
      "state": "AZ",
      "duration": "3 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b5a8c",
      "summary": "((HOAX??))  Large triangle shaped object with several lights on the bottom flew over tempe",
      "city": "tempe",
      "shape": "triangle",
      "date": "2007-11-28T00:00:00",
      "story": "Large triangle shaped object with several lights on the bottom flew over tempe While siting in the backyard a triangle shaped object with 3 or 4 lights lights on the bottom of the craft glided silently from north to south at about 1000-2000 feet above.  The object moved quitley and was quite large.  It moved at a fast pace and was out of sight in a matter of a minute or two.  Very amazing. ((NUFORC Note:  Witness provides very little information about himself.  Possible hoax, I believe.  PD))",
      "link": "http://www.nuforc.org/webreports/059/S59311.html",
      "state": "AZ",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b5a91",
      "summary": "saw a small blinking cloudlike object fly directly overhead from my backyard at night.",
      "city": "tempe",
      "shape": "other",
      "date": "2007-11-28T00:00:00",
      "story": "saw a small blinking cloud like object fly directly overhead from my backyard at night. I was out in my backyard when I had an urge to look straight up overhead into a cloudless calm starry night sky.  I was a witness to the \"Phoenix Lights\" on 3/13/97 and for the last 10 years since then, I have been scanning the sky nightly without with camera close by, but have not seen anything since then... until this night.  What I saw is unlike anything I'd seen or heard of before.  It was certainly unexplainable.  It was way about 5 to 8 thousand feet and moving about as fast as a fixed wing aircraft would be flying.  The difference that set it apart from any aircraft is that it looked like a small cloud that was lit up from behind by a white  light.  As I watched it travel high in the center of the sky, it faded to black and then lit back up again. As it flew over it faded out and again and lit up again in perfect rythem as it headed straight southwards.  I ran inside to get my camera but by the time I got back (about 30 seconds) it was too far away to get a shot off.  There was no other light other than the one that blinked on and off from behind this cloudlike object.  As I watched it fly awy from me, it made a manuver unlike anything I\"ve ev.er witnesse then went out of sight as it was heading into the southward sky.",
      "link": "http://www.nuforc.org/webreports/059/S59485.html",
      "state": "AZ",
      "duration": "2 min."
    },
    {
      "_id": "64d005f478aba2ec5a3b602a",
      "summary": "Numerous incidents over the last few months occuring over Sky Harbor International Airport in Phoenix, AZ",
      "city": "tempe",
      "shape": "disk",
      "date": "2007-02-01T00:00:00",
      "story": "Numerous incidents over the last few months occuring over Sky Harbor International Airport in Phoenix, AZ I reported this incident to MUFON at the time of the occurance on November 27th, 2006...I am re reporting here in leiu of the Chicago O'Hare airport story. I work on the Tempe/ Phoenix line at the corner of Priest and Washington Streets. This location is approximatley 3-4 miles East Northeast of Sky Harbor International Airport in Phoenix. My office and viewing location are directly under the landing flight path of westbound landing flights at Skyharbor. This particular occurance is a repeat and has been repeated for a total of at least 10-12 occurances at this location. On this day at approximatley 2:15 pm I was in my car in my parking lot at work. I was skywatching as I have been seeing various orbs ( black and white ), strobing cylinders , and one saucer like object for the previous 2 months. When I say 2 months that is only when I started looking at this location. The first object was a definite saucer shape..white on top and black on the bottom. The object drifted and wobbled Northeast for about 10-12 minutes at a fairly slow clip before it faded away in the sky. No sooner had the first object faded away when it was followed by a larger, white orb which was traveling slightly faster going more due east, vs northeast as the first object was going. Due to the clear sky and no reference objects in the sky..ie other planes or clouds..I could not judge the distance of the objects. They are either quite large and quite high up, or relatively small at low altitudes. They produce no noise. The are very similiar to the objects seen in CNUFOS.COM..which is done by local Phoenix resident. I have had at least 10 days observing these objects over a course of a few months. This is only given that I go out and watch one hour and day at the same time of day and even then I don't go watch every day. On any given day I will see one to three objects within a few minutes of each other. I have not seen any travel together or tandem. Since these events occur so very close to the flight paths..either takeoff or landing at one of the nations busiest airports, I am surprised there is not more investigation from local FAA authorities simply for the sake of passenger safety alone. I make no claim that these objects are extraterristial, however they do not appear to resemble any manmade objects that I am familiar seeing. Even in the event that these objects are simply \" balloons \" ..the frequency and proximity to a major US airport should alert someone in a position of authority to keep an active watch on the skies to avoid a potential air tragedy.  I hope this summary is helpful to other residents or aviators in the area, either on the basis of interest in the subject or minimally for air safety as a precaution.",
      "link": "http://www.nuforc.org/webreports/054/S54486.html",
      "state": "AZ",
      "duration": "20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b62f0",
      "summary": "Star like objects flickering and flying very fast in the day time. No sound.",
      "city": "tempe",
      "shape": "changing",
      "date": "2007-08-07T00:00:00",
      "story": "Star like objects flickering and flying very fast in the day time. No sound. Before work, I was sitting out side when I felt light headed and dizy (it was about 110 out side) when I just happened to look up at the moon that was out during the day. It was bright and sunny with a few light clouds. I saw what appeared as a star. It flickered with no pattern and was sometimes very bright.I thought It was my dizyness but Another appeared and moved from the high southern sky to the east. It started out above the clouds and swooped below them. A jet was traveling near by and gave me a good idea of how fast it was going. The object was much further than the jet but was traveling much faster. More star like objects appeared and flew in different directions disappearing and reappearing, flickering and flashing. It seemed like they where reflecting the sun light cause no light can be seen in the daylight that brightly. There were no wings or noticeable shape. When it didn’t reflect the sun, it seemed to disappear. This I think would be something you wouldn’t see without light reflecting on it. I ran inside my office and grabbed some co workers. They laughed at me and asked what I was smoking. I just pointed up and said look. They ALL 7 saw them and we stood staring and pointing for a good 15 mins. They were hard to see till your eyes adjusted to them in the bright Arizona sun. But everyone knew they where NOT any aircraft we knew of. I can’t say how many there where do to the fact they would disappear. But at least 5. The objects didn’t seem any bigger than a small plain or hellicopter.When they finally went away, they followed the fist one that took off to the east. Moving from the high mid sky to the horizon and out of sight in about 20 seconds!",
      "link": "http://www.nuforc.org/webreports/057/S57335.html",
      "state": "AZ",
      "duration": "30 min"
    },
    {
      "_id": "64d005f478aba2ec5a3b6645",
      "summary": "low vapor sound in sky, accompanied ground rumbling",
      "city": "tempe",
      "shape": "other",
      "date": "2007-04-27T00:00:00",
      "story": "low vapor sound in sky, accompanied ground rumbling I was standing outside my house.  I heard a low, vapor sounding noise.  It was accompanied by the ground rumbling under my feet.   But, NO visible object seen. Minutes later, helicopters were circling the direction I heard the noise heading to (North).",
      "link": "http://www.nuforc.org/webreports/055/S55617.html",
      "state": "AZ",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b6856",
      "summary": "Night sky flashes in Tempe illuminating entire sky. 6 total flashes. All occured within a minute. There was no sound.",
      "city": "tempe",
      "shape": "",
      "date": "2007-06-12T00:00:00",
      "story": "Night sky flashes in Tempe illuminating entire sky. 6 total flashes. All occured within a minute. There was no sound. My girlfriend and I were hanging out in my car on Friday April 27 around 11:45pm. We are both 18, in honors classes, and have never seen something like this before. We don’t believe in UFO’s but like to keep an open mind. She was laying on the backseat when she told me to look at the sky. I didn't quite understand what she was talking about, but she repeated herself and when I looked up through the window, the sky flashed and the whole sky was illuminated, but there was no sound. It lasted for almost a second and it appeared that the eastern part of the sky was where the illumination’s origin was from. The light wasn't as bright as daytime illumination, but was a little dimmer, most closely resembling the lighting conditions found not quite at dusk, but around 5pm when the sky begins to dim. It looked exactly like sheet lightening but there was no sound of thunder and it illuminated the entire night sky. After this last flash, emergency vehicles sirens seemed to appear all around us, gradually moving east. This period of constant sirens lasted for between 5-10 minutes. When I further asked her about the flash, she said that the first time she told me to look, there had been three flashes in quick succession, with the first two flashes having a shorter interval than the interval between the second and third. Three flashes again occurred after this, with a gap of around 15-30 seconds between the two sets. The flashes were again irregularly spaced according to her, but occurred very quickly. She said that I had seen the very last flash in the last sequence. The flashes illuminated the entire night sky and for this reason other people on the road must have seen them. I'm curious as to if anyone has reported night sky flashes on April 27, 2007 to your establishment or if you know what could have caused these flashes. I would be very grateful if you could email me any information that you know or have on this subject as my girlfriend and I are very puzzled as to what could have caused this and why nothing about was reported in the media (we checked the following two days and found nothing).",
      "link": "http://www.nuforc.org/webreports/056/S56532.html",
      "state": "AZ",
      "duration": "2-3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b71e5",
      "summary": "Tempe Az  Black Dot 10 seconds traveling N to S very fast and quite",
      "city": "tempe",
      "shape": "sphere",
      "date": "2006-07-16T00:00:00",
      "story": "Tempe Az  Black Dot 10 seconds traveling N to S very fast and quite As i was out on my patio looking at airplanes taking off from Phx int. airport I noticed a black dot in the sky.  I was looking almost straight up and observed it traveling from north to south, it was above a plane taking off and below a plane traveling from east to west at about 35000 ft.  It left no contrail nor did it seem to make any noise.  I called for my wife to come out and see it, but she didn't make it in time.  It was moving faster than any aircraft in the sky judging by the other aircraft speeds.  I'm prior military and have seen F-14's at mach 2, this is the only comparison i can make to the speed. It was about the size of this dot \"o\" from my vantage.  The sighting lasted about 10 seconds from zenith to 45 degrees until I lost it over the roof top of the apartment building next to ours.  It was unusual enough to raise the hairs on my arms.  This will be the third object I have seen in the Arizona sky's that I cannot explain and would have been the second for my wife.  Let me know if any body else seen this please.  Thanks ((name and e-address deleted)).",
      "link": "http://www.nuforc.org/webreports/050/S50655.html",
      "state": "AZ",
      "duration": "::15"
    },
    {
      "_id": "64d005f478aba2ec5a3b743d",
      "summary": "Stark white object flying over Tempe Arizona in strange non-linear aeronautical movements.",
      "city": "tempe",
      "shape": "cylinder",
      "date": "2007-08-07T00:00:00",
      "story": "Stark white object flying over Tempe Arizona in strange non-linear aeronautical movements. July 22, 2007 2:00 PM  Winds Aloft: @6000: 70F/ 9000: 63F/ 12000: 50F FT  3000    6000   9000    12000   18000   24000  30000  34000  39000 PHX 9900  9900+19 0512+13 0709+08 0912-04 1112-14 091129 990040 221752 High Level Clouds: Cirrostratus and Cirrus Clouds Wind Direction: West: Six mph  At approximately 2:00 PM on July 22, 2007, I saw a strange object in the sky. At first glance, it appeared in its flying “behavior”* to be almost kite like, moving very slowly in a very mild zigzag type of formation slowly rising upwards. The objects shape was somewhat circular** and its color was stark white. The object’s location was NNE in the sky and about 65 – 70° from the horizon. The size of the object in the sky was about as big as the head of a large nail, or the circumference of a regular drinking straw.  Event: As I was standing outside smoking a cigarette, I noticed in the sky an object that appeared upon first glance to be drifting in the wind. The movement of the object appeared to be in a gentle upward rising zigzag motion towards the NNE direction. Upon 10 seconds of observation, the object made what appeared as a semi-circular loop type of movement sending it further upwards toward a small cloud in the sky. The object passed behind the cloud, hesitated, did another semi-circular loop changing direction towards the NNW again yet maintaining an upward rising movement. The movements of the object itself were not in any way angular, jarring, or sudden; all of its movements were extremely gentle and graceful. At about 25-30 seconds of observation, after coming out from behind the cloud (the cloud itself was dense, yet allowed enough light to pass through it allowing a fairly unobstructed view of the objects flight through the cloud itself) the object appeared to pick up speed moving in a more distinct westerly direction in a more linear flight pattern. It was after that that I ran into my home to grab my camera, by the time that I came back outside the object was completely gone.  * By behavior, I am referring to the way the object moved through the sky itself.  ** The shape of the object appeared to be circular with other features that seemed to be somewhat angular. Unfortunately, the object was far enough in the air that a detailed description of its features are difficult to describe.",
      "link": "http://www.nuforc.org/webreports/057/S57795.html",
      "state": "AZ",
      "duration": "40 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b7a79",
      "summary": "Fast flying triangle shaped object with blinking lights over South Phoenix, and Tempe, AZ.  ((NUFORC Note:  Probably flares.  PD))",
      "city": "tempe",
      "shape": "triangle",
      "date": "2007-02-24T00:00:00",
      "story": "Fast flying triangle shaped object with blinking lights over South Phoenix, and Tempe AZ In the western sky over Tempe, AZ, this object appeared to fly back and forth at a rapid rate of speed, mostly over South Mountain, where the TV and radio station towers are located. It was white, appearing to blink to shades of red and orange....visible contrails were seen, first appearing as pencil thin lines.....radiating out into wide \"smoke trails\"....widening by the minute until they dissipated. Object was seen to disappear to the north....reappearing again to the south of South Mountain. White lights seemed to blink fairly constantly....like strobes. ((NUFORC Note:  Because of both the location, and nature, of the bright objects, we strongly suspect that the bright objects may have been aerial flares, launched from aircraft over the Barry M. Goldwater Firing Range, located near Gila Bend, AZ.  That is what official military sources apparently reported, shortly after the event had occurred, and we have no reason to doubt that claim.  PD))",
      "link": "http://www.nuforc.org/webreports/055/S55175.html",
      "state": "AZ",
      "duration": "30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b8208",
      "summary": "Nothing WE have, could have done what we all saw that night.",
      "city": "tempe",
      "shape": "light",
      "date": "2009-03-19T00:00:00",
      "story": "Nothing WE have, could have done what we all saw that night. I was a witness of the famous \"Phoenix lights\" mass sighting back on the eve of March 13th 1997. This event changed everything for me...  Later that year my wife left with the kids, followd by a nasty divorce.  I tried to forget what I know I saw...  for 10 years I made it, working nightly in the same outdoor welding shop that I was working in, on THAT night. The guy on the radio starts talking about the upcoming 10 anniversary of the \"Phx Lights\" mass sighting, and it was like a switch in my head came on.  I was instantly awakened...  no longer can I hold back on what I saw, and it has become an obsession.  I then reported my story on any ufo website that had the ability.  That's been a few years now and I have yet to be interviewed on what I saw. The vision of the massive yet elegant airshow that was displayed to those who were watching that night, will continue to play on my head like no other memory I can think of.  As I watched it silently make a banked turn as it glided gracefully at the same elevation (or below) as the South Mtn range that it was effortlessly floating along as it flew away from me.  When I first saw it, it was floating over the S.East end if the airport area, and it was in a semicircle pattern about 5 miles wide.  Each of the orbs that made up the outline could move individually (and a few did).  The light of each orange/red orb came from within and didn't radiate out (like molten metal).  The orbs started moving and formed into a V shape with one side lopsided by on or 2 orbs.  when it pivoted to start moving the orb in the middle became the nose of the now V craft and when it pointed as if it were going to come my way...  I panicked and turned to run...  I then realized that this thing my be 9 miles away from me.  I turned back around and instantly my fear was gone and as I watched it for the next 15 minutes, I tried not to blink, as I didn't want to miss a second of it.  I then told a few people and mentioned it to my wife, and it lay dormant in my head until t! he hype of the 10 year anniverssary of it brought it all back. The \"flare\" explaination is insulting to my intelligence...  I've lived here in the Phx valley all my 52 years and have seen my share of flare drops...  Not even close.  We have nothing on this earth (maybe inside it or interdimentionally) that could put on a show like we saw in Phx that night.",
      "link": "http://www.nuforc.org/webreports/068/S68109.html",
      "state": "AZ",
      "duration": "20 min"
    },
    {
      "_id": "64d005f478aba2ec5a3b868a",
      "summary": "Bright white light in the Phoenix evening sky.",
      "city": "tempe",
      "shape": "sphere",
      "date": "2009-08-05T00:00:00",
      "story": "Bright white light in the Phoenix evening sky I was driving through Phoenix at about 20:00 June 11th, 2009.  Immediately after heading Westbound, I saw a very large sphere in the sky, that was emanating a bright white light.  It was maybe 20 degrees above the horizon, in the West-Northwest direction.  I pulled over onto a neighborhood street to watch the object and get on the phone!  I called my dad in Tempe, he had seen it in the sky about 15 minutes earlier and was watching it.  I called my mom, and after she spotted it, she grabbed the neighbors and they all watched it.  I called another friend, she and her boyfriend plus entourage all watched it while on the phone with me.  Witnesses are not a problem!  I watched the object for about 15 minutes before it disappeared.  It was far too large and bright to be a star or a planet, and it was completely motionless.  I was parked, and by comparing it to other stationary objects, houses, poles, etc, it didn’t drift or anything.  The white light was very bright, creating a sort of aura of light around it that was maybe double or triple the circumference of the central object.  In the center, it was looked like just a solid sphere of light.  After perhaps 15 minutes of watching the object, it suddenly began to look like it was moving away from my point of view.  It appeared to be moving slightly, and the white aura of light faded rapidly.  It became a bright orange color, like the color of Mars, and it’s size continued to diminish quickly.  Within about one minute, it was nothing more than a small point of light, now much like a star, and then it disappeared from sight.",
      "link": "http://www.nuforc.org/webreports/070/S70457.html",
      "state": "AZ",
      "duration": "20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b8688",
      "summary": "extremely bright balloon-like object at high altitude, drifting west for 45 min. ((NUFORC Note:  Possible high-altitude balloon.  PD))",
      "city": "tempe",
      "shape": "teardrop",
      "date": "2009-08-05T00:00:00",
      "story": "extremely bright balloon-like object at high altitude, drifting west for 45 minutes/tiny lights appeared below at times At 7:30 local I saw a very bright (twice as bright as Venus at it's brightest)light about 25 degrees in altitude, to the Northwest. I use a pair of binoculars to see that it was actually spherical...sort of shaped like a hot air balloon, but not nearly that exact in shape. It was extremely bright even in the setting sunlight. There were scattered high clouds, likely 30 to 40 thousands feet high and this object was behind them at times. While the clouds were moving briskly towards the NE this blob-like light was slowly drifting westward. After about 15 minutes it dimmed somewhat and (again through binoculars) then tiny little lights, almost like embers started appearing below the blob. Each one only lasted for 4 to 10 seconds. These lights seemed to \"fall\" from the blob, but some moved laterally...they were very small, but a couple seemed to move upward briefly, before dimming out. I continued to watch as this bright blob for almost 45 minutes as it slowly drifted west and dimmed to a pale blue color as the dusk became night time. Only after a deck of clouds obscured it, did I give up the watch. I have to imagine thousands of people in central and west central Arizona saw this thing. Again, it had to be very large, because it was above the high clouds and at a very low angle for me. At it's brightest period it was not homogenous, it seemed to have some motling (sp?)some variance in it's brightness or on its surface. If it was some huge balloon. I don't understand why it was so bright and more importantly, how the heck it was going west when the upper air flow was out of the southwest. I did take video of this object, but my zoom wasn't great enough to reveal any shape. ((NUFORC Note:  Possible high-altitude balloon.  PD))",
      "link": "http://www.nuforc.org/webreports/070/S70460.html",
      "state": "AZ",
      "duration": "45 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b876e",
      "summary": "Bright circular light travels quickly and silently from NW to SE becomes brighter turns oval shapped zigzags abruptly and disappears.",
      "city": "tempe",
      "shape": "circle",
      "date": "2009-12-12T00:00:00",
      "story": "Bright circular light travels quickly and silently from NW to SE becomes brighter turns oval shapped zigzags abruptly and disappears. I was standing outside at 7:18 pm and the sky had been dark for just under an hour by that time. I had been relaxing and just watching the sky. I noticed a bright circular light coming from the North-West area as I was able to view it as it peaked over my house off in the distance. Normally I see air traffic (lots of airplanes) coming in from the north but this one was coming from a different area and look nothing like the other lights. This light was about 3 times brighter and bigger than the planes I usually see and not once did it blink. At first it was really bright but then it dimmed a bit. I thought I was looking at a plane at first but then as it dimmed it looked as if it were really high and I began to think it was a satellite. Almost immediately after that thought the light became very bright and was bigger than when I first spotted it. I immediately called my wife outside to see it as to see if maybe she could make out what it is. When my wife came! outside the circular light was just about overhead roughly 85 degrees above the horizon line. The object was very close and bright but made no sound as it traveled quickly through the sky. It took about 1 minute to go from when I spotted it peaking out from behind my house off in the NW distance to far off in the South East. When the light was far in the South East area my wife and I noticed the light became much brighter and a bit bigger than before, taking on more of an oval shape. The light then slightly dimmed made a zigzag pattern and disappeared at the end of its pattern, ending right where it would have been the line of travel had it not zigzagged. We don’t know if it went up or just simply disappeared. Up until just before the object made the zigzag movement it had traveled in a direct straight line from the NW area to the SE area, once again with no sound and at a high rate of speed.",
      "link": "http://www.nuforc.org/webreports/072/S72632.html",
      "state": "AZ",
      "duration": "1 Minute"
    },
    {
      "_id": "64d005f478aba2ec5a3b89b8",
      "summary": "A fireball spotted in southern Arizona 6/23/09 at about 8 pm",
      "city": "tempe",
      "shape": "fireball",
      "date": "2009-08-05T00:00:00",
      "story": "A fireball spotted in southern Arizona 6/23/09 at about 8 pm We are in Tempe  On the night of 6/23/09, my family and I just arrived home back from the grocery store around 8 pm or so.  I looked southeast and noticed what appeared to be a shooting start only a whole lot bigger.  It looked like a huge ball of fire with a tale.  We were facing south and the ball was going downward in the east direction.  I lost site of the ball as it went further down pass the brick wall in the parking lot of my apartments.",
      "link": "http://www.nuforc.org/webreports/070/S70686.html",
      "state": "AZ",
      "duration": "2 sec"
    },
    {
      "_id": "64d005f478aba2ec5a3b8faf",
      "summary": "It appeared to be a large white star, but it was slowly moving NNE.  It sped up, changed into 2 smaller red lights, then vanished.",
      "city": "tempe",
      "shape": "light",
      "date": "2008-10-31T00:00:00",
      "story": "It appeared to be a large white star, but it was slowly moving NNE.  It sped up, changed into 2 smaller red lights, then vanished. I thought it was a planet because it looked too large to be a star.  However, it was moving very slowly to the NNE.  Initially it was white but as it got farther away it changed to 2 very small, close together red lights.  Shortly after changing, it was gone; it didn’t fade out of sight, it just disappeared.  Total time elapsed:  approximately 2 minutes.  It was close to 8:30pm.",
      "link": "http://www.nuforc.org/webreports/065/S65782.html",
      "state": "AZ",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b94da",
      "summary": "High altitude night flare over residential area?",
      "city": "tempe",
      "shape": "",
      "date": "2010-06-03T00:00:00",
      "story": "High altitude night flare over residential area? I am reporting this nearly a year after the experience, but due to online messaging logs I can tell precisely when it was.   I was out in my backyard smoking when all of a sudden, my surroundings became illuminated as if in daylight, or at least a very strong overhead light.   Frozen in fear, I looked up at the sky, seconds after the illumination began, and witnessed only what appeared to be a white burning horizontal column moving across the sky, appearing to be very high in altitude, and casting off white embers.   There was no sound, nor detectable smells, and the white column appeared to \"burn out,\" in any event going away with the illumination receding.   Some type of aerial flare or what? ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/075/S75441.html",
      "state": "AZ",
      "duration": "20 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b9568",
      "summary": "Tiny neon blue light ufo wittnessed by three in Tempe, Arizona",
      "city": "tempe",
      "shape": "changing",
      "date": "2010-06-03T00:00:00",
      "story": "Tiny neon blue light ufo wittnessed by three in Tempe, Arizona Myself and two friends of mine were traveling southbound on McClintock approaching the US 60 overpass when our friend driving stopped the car in the middle of the road and instructed us to look up at the blue light descending from the night sky in front of us.  There was hardly any traffic on the road because of the hour.  This neon blue light moved downward toward as if coming down a staircase.   The object stopped in front of a business park just to the left of us, approximately 25 yards away, and changed from a blue light orb to three neon blue squares linked together in a vertical rectangle tilted forward from the top.  The neon blue light pulsed at a very high rate and radiated from the the blue squares but the object itself made no sound.  The object itself appeared to be slightly smaller than the light on the light post next to it, approximately 10\" in length.  It hovered from side to side and up and down, turning sideways and back again; remaining in an a! rea of about 2-3 cubit feet.   As it turned sideways to reveal it's profile there didn't appear to be anything behind the blue light bar that we could see.   At first we thought it must be a toy.  There was not a single person around the object or in the parking lot of the business park.  Our driver said it could not be a toy because no transmitter could reach that far, given the fact that it descended from a visual point out of the night sky high above us.  A car coming from behind us also stopped to watch this intriging object as well as a man in a truck coming from the other direction.  The object then returned to the blue light orb and began traveling NE just above the roof tops.  It seemed to be traveling very slow at first so I told my friend driving to follow it.  Before we could get the car turned around the object acceleratled in a straight line NE and disappeared. I believe whatever it was came with an objective and that it traveled so low to the roof tops so that it could travel without much detection.  I also believe that it's destination were somewhere reasonably close or else it would have made it's descention elsewhere.  Northeast from where we were located is a military reserve base, Northeast Mesa and Fort McDowell Mtns.  I live right next to the military reserve base where there is a jet and pilot ready 24/7 for take off in case of an intrusion.  In the three months that I've lived here I've heard the jet take off just after midnight twice within the last week. Thank you for allowing me to share our experience.",
      "link": "http://www.nuforc.org/webreports/075/S75626.html",
      "state": "AZ",
      "duration": "5 mins"
    },
    {
      "_id": "64d005f478aba2ec5a3b9640",
      "summary": "At approximately 4:45 PM on Tuesday March 16th 2010, I was in my work parking lot in Tempe Arizona, when I noticed two very white objec",
      "city": "tempe",
      "shape": "unknown",
      "date": "2010-04-13T00:00:00",
      "story": "At approximately 4:45 PM on Tuesday March 16th 2010, I was in my work parking lot in Tempe Arizona, when I noticed two very white objects very high in the sky.  They were nearly directly above the flight path for jets landing at Sky Harbor Airport, and appeared to be at an elevation that aircraft would need to be pressurized or at least would leave a vapor trail.  Although they seemed directly above the flight pattern for landing, I expect they were slightly north/northeast. My sense were that these objects could have been parachutes as they may seemed rectangular in shape, and since they didn't appear to be moving laterally, that's all I could think of.  While watching them for about 15 seconds, a third object appeared to the east of them but was a bright blue and of the same shape.  This third object reinforced my reasoning for thinking they were parachutes, because I could imagine that being a parachute color.  The only thing that baffled me about the parachute theory was who would attempt, or get permission to parachute in this area with such heavy airline traffic. About 10 seconds after I first noticed the blue object, it disappeared.  I didn’t see it move or actually disappear, as I was talking to a passerby about it, but when I looked back up it was gone. The remaining two objects maintained their altitude, and moved to the west at what seemed to be a relatively slow speed.  I observed them for about 50 seconds, and there were no sounds, vapor trails, etc. That's it.",
      "link": "http://www.nuforc.org/webreports/074/S74695.html",
      "state": "AZ",
      "duration": "50-70 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b9938",
      "summary": "Orange, glowing, floating circular object over Tempe.",
      "city": "tempe",
      "shape": "circle",
      "date": "2010-02-14T00:00:00",
      "story": "Orange, glowing, floating circular object over Tempe. From our balcony located at Apache and Terrace Ave in Tempe Arizona looking East my daughter and I saw an object floating upwards, looked like several circular and pulsating forms, glowing orange. Reminded me of a cluster of balloons - my daughter thought it looked like a jellyfish - it definitely pulsated and glowed as bright as the stars in our view.  It originated at about the same level as where the jets fly in over our apartment.  The airport is about 10 miles from here.  It continued to glow and pulsate at a constant rate and finally left our view in a South-Eastern direction until it was out of our sight. Unfortunately, the only camera I have is my cell phone and I was unable to capture it on film.",
      "link": "http://www.nuforc.org/webreports/074/S74095.html",
      "state": "AZ",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3ba18b",
      "summary": "Saucer shape, flying over Tempe, 6-7 white lights making a pattern as flew south. June 2, 2010 at apx, 9:10pm.",
      "city": "tempe",
      "shape": "disk",
      "date": "2010-06-03T00:00:00",
      "story": "Saucer shape, flying over Tempe, 6-7 white lights making a pattern as flew south. June 2, 2010 at apx, 9:10pm. I live near Rural Road and University, in proximity to ASU’s Tempe campus.  As two friends of mine were leaving, one got in his car and drove off, the other called for me to quickly come over and look up.  As we can only see the \"aircraft\" from one angle, below us, the object was a circle shape, so likely some kind of saucer/disk.  It’s altitude was near what typical, large commercial passenger planes reach as they are approaching landing, near Mill Avenue bridge.  The aircraft proceeded to head mostly south, in a slightly west direction.  When I witnessed the aircraft, it appeared to be 1-2 miles from me, over head.  It silently floated in the sky, as it traveled down over the rest of Tempe (until it was out of my sight). As my friend and I were watching it slowly drift away, another neighbor came outside to go to their car as well.  We called to her immediately, notifying her if she wanted to see a UFO to come quick.  She came over and watched with us, as she called her roommate to come outside.  By the time the roommate (4th witness) came outside to meet us, all he could see was the red light in the far distance (unable to tell the difference between this and another local Sky-Harbor related aircraft). To describe the object:  It had no color, maybe black, and had a red light at the tail of it that occasionally turned quickly on and off (slight flash). The front lights were a series of lights, between 6-8 white, circular lights that were all on, but one. This is hard to describe, but one light would turn off, in the row of lights, and turn back on as the next one turned off.  It repeated this pattern, across the entire row, and back again.  Resembles the kind of lighting effects that are used on games we see at the fair, or Peter Piper Pizza, for example. As I have lived in direct sight of Sky Harbor’s flight path for landing/taking off over the last 4 years, I have watched aircraft during the day and at night time.  I know what helicopters look like, and how aircraft are supposed to have one red and one green light (to indicate which direction they are flying to other aircraft) and this did not have these lights.  Like I said, the only red light was at the tail. The object moved slowly, similar to that of a police helicopter, using their search light to find a criminal.  The bright white lights making a pattern, as the object flew, was very usual, let alone unsettling.  The object made little sound, very slight puttering sound, but almost nothing at all. I am a 21 year old female, just graduated from ASU.  The other observers are one male, 22 year old, current ASU student.  The other witness, another resident at this apartment complex off 8th street and Dorsey, is about 19-20 years old.  Her roommate is male, between 21-24 years old.",
      "link": "http://www.nuforc.org/webreports/075/S75667.html",
      "state": "AZ",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3ba580",
      "summary": "Three \"star-looking\" crafts flying in random directions in the middle of the day.",
      "city": "tempe",
      "shape": "light",
      "date": "2009-06-09T00:00:00",
      "story": "Three \"star-looking\" crafts flying in random directions in the middle of the day. I was looking at the clouds when an luminestent craft that from where I was looked like a star (this was the middle of the day) appeared. It flew straight for awhile then stopped for a couple of minutes. Then it proceeded to fly in random directions (up, diagnally, straight). Another one of these crafts popped out of nowhere for awhile. The first object hovered out of my sight but then a 3rd one of these appeared and just sat in the sky for awhile. I watched for a good 20 minutes but then left so these things could have been there for awhile.",
      "link": "http://www.nuforc.org/webreports/070/S70346.html",
      "state": "AZ",
      "duration": "15 min+"
    },
    {
      "_id": "64d005f478aba2ec5a3bb05b",
      "summary": "Bright siver inverted pie-shaped craft flying above Tempe, AZ vanishes completely on bright sunny day.",
      "city": "tempe",
      "shape": "other",
      "date": "2010-11-21T00:00:00",
      "story": "Bright siver inverted pie-shaped craft flying above Tempe, AZ vanishes completely on bright sunny day. It was a bright, clear, sunny day in Tempe, Arizona. I left my apartment riding my bicycle directly eastward just after crossing the street to ride on the sidewalk.  In the eastern sky about 40 degrees up, I noticed a silver inverted pie-shaped craft gliding across the sky for about 15 seconds. Then I went under a tree which obscured my view for about 2 seconds.   After I emerged from my blocked sight, the craft was completely gone.  Disappeared.  The object was about the size of the moon in the sky.  I happened to notice this easily because I live in the flight path of Sky Harbor Airport in Phoenix.  The craft was flying north to south, which I’ve never really seen before.  The planes usually fly east to west.  The craft might have been in Phoenix flying space going in the wrong direction",
      "link": "http://www.nuforc.org/webreports/078/S78675.html",
      "state": "AZ",
      "duration": "20 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bb4fe",
      "summary": "Loud pulsating \"woor...woor\" noise shook apartment complex walls and set off car alarms at night in Tempe AZ",
      "city": "tempe",
      "shape": "unknown",
      "date": "2011-01-31T00:00:00",
      "story": "Loud pulsating \"woor...woor\" noise shook apartment complex walls and set off car alarms at night in Tempe AZ On January 17 2011 My girlfriend and I were watching a movie on our computer in my two story apartment complex (we live on the first floor) and around 22:00-23:00 hours we heard a faint throbbing noise that sounded as if it was getting closer and closer. The best I can describe the noise is like a fluctuating “woor...woor....woor...woor...woor”  At first we thought it was a car with a loud speaker system but the noise got so loud that it shook the walls and windows of the apartment complex and it caused the alarm systems in the cars in the  huge parking lot to go off. After the noise reached its peak it got faint within 2 minutes and then it was gone. Our next theory was that it might have been a train but that was unlikely as the train passed by an hour after we heard the loud noise and I have never heard a train sound like that. We also thought of a low flying plane but we have never experienced that before in the 4 years we have lived at our apartment and in all the years prior to that when I lived under a flight path right by LAX . We quickly checked the news because we were concerned  about what we had experienced but neither the local news or national news reported anything. We didn't see any craft as we were so bewildered and concerned by what was going on that we didn't dare to look outside the windows. The name of the apartment complex is called Solara at Mill Avenue, Tempe, AZ",
      "link": "http://www.nuforc.org/webreports/079/S79754.html",
      "state": "AZ",
      "duration": "1-2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bba73",
      "summary": "Globes of light in sky over tempe arizona, moving in a quickly repeating pattern but staying in one area.",
      "city": "tempe",
      "shape": "unknown",
      "date": "2010-07-19T00:00:00",
      "story": "globes of light in sky over tempe arizona, moving in a quickly repeating pattern but staying in one area. My husband and I were outside on our deck we watched white lights in a cloud in the sky.  There were maybe six or more.  When the cloud moved off, we couldn't see anything.   As soon as there was cloud cover again, in the same spot, the lights returned.   At first the lights moved quickly but randomly, never out of the cloud area that we could see.  Then they started a pattern, like an x or a cross pattern.  They would meet in the middle like a bump, then back out to edge of clouds then around edge to return to center over and over. They moved very quickly but stayed in same spot in the sky.  There was no noise at all.  This lasted quite awhile, off and on again, for maybe an hour.  Then when the sky had no more clouds and we couldn't see anything more and went inside.",
      "link": "http://www.nuforc.org/webreports/076/S76641.html",
      "state": "AZ",
      "duration": "45 mins."
    },
    {
      "_id": "64d005f478aba2ec5a3bbc20",
      "summary": "Unexplained light cast into otherwise dark area blasts out of sight.",
      "city": "tempe",
      "shape": "sphere",
      "date": "2011-12-12T00:00:00",
      "story": "Unexplained light cast into otherwise dark area blasts out of sight. Was sitting between a large two story house,and a twelve foot high block wall with two other persons.  Decided to play some cards. played for a few minuites before realizing for the first time that we were playing by light that was being cast out from behind a large cottonwood tree situated 10 yards away from our position. It's usually dark...but we had light to see by.   Looking up to where the light was comming from i witnessed a lighted sphere, that as my friends and i looked up at it began to wobble back and forth before shooting off to the northeast, and arching upwards out of sight in less than 2 seconds since starting to wobble.   We played cards by the light it gave off for about 20 minutes. ((NUFORC Note:  Witness elects to provide no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/084/S84834.html",
      "state": "AZ",
      "duration": "20+Min"
    },
    {
      "_id": "64d005f478aba2ec5a3bc263",
      "summary": "Green Illuminated disc hovering over Tempe,AZ in front of Aircraft",
      "city": "tempe",
      "shape": "disk",
      "date": "2011-10-10T00:00:00",
      "story": "Green Illuminated disc hovering over Tempe,AZ in front of Aircraft On the evening of 9/22/2011 at Approximately 10:15 P.M.,  I was sitting over at a friends’ house, when I looked up in the sky and saw a disc shaped object just hovering to the south in the sky.  This is actually the 4th time in the past 10 years I’ve seen this same Phenomenon, and each time I’ve seen this particular object, it radiates a bright green light, and seems to move from 0-1,000 MPH in a mere second.  On this particular evening, it was hovering in the sky just miles away from an incoming passenger Aircraft (due to the fact that Sky Harbor Airport is only a few miles away). When I noticed it, it was completely stopped in mid-air.  As I watched it for a few more seconds, it started flying south bound, radiated a very bright green light in full motion, and as the green light increased in brightness, the object sped to an unbelievable speed and was completely out of sight in mere seconds.  This is in-fact the 4th time I’ve seen this Phenomenon in my lifetime! in Arizona, and I’m very convinced that these are legitimate encounters I’ve had with Extra-Terrestrial Technology.  I would really like a chance to explain my other encounters, but I thought since this was my most recent encounter (being only last night), I thought this would be a very good place to start.",
      "link": "http://www.nuforc.org/webreports/084/S84093.html",
      "state": "AZ",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bc8b9",
      "summary": "DARK YELLOW ORANGISH BALL",
      "city": "tempe",
      "shape": "sphere",
      "date": "2011-10-19T00:00:00",
      "story": "DARK YELLOW ORANGISH BALL I was home outside my apartment in Tempe AZ near University and Hardy. looking to the north and saw what i first thought was an Airplane on fire, it was flying from the north to the south at a rate of speed that would be considered normal for a small private aircraft.  I looked at my friend asked her what that was, she looks up and says airplane, i look at it again and asked is it on fire? we both looked at it for a  while at the same time aircraft were moving east to west landing at KPHX sky harbor. So this was considerably higher than the aircraft in the pattern. As i was watching it it went from a bright orange, to a dull yellow started as a large \"ball\" as it transistioned from an angle to overhead it became more of a pin point, with a light \"orb\" that seemed transperent in nature. i couldnt take my eyes off it, it passed then outside my visual range because it went behind the structure of my apartment. I'm ex military, current airline employee i know what should be in and out of sky harbor and i have no idea what that was, i checked mufon and there was one sighting that seemed to describe what i saw but the pics they posted were not it.  would love to know if there was any other sightings of this.",
      "link": "http://www.nuforc.org/webreports/084/S84556.html",
      "state": "AZ",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bd06b",
      "summary": "Photos of an unknown creature resembling both an amphibian and an armadillo who is seen holding a wand in his left hand at the end of w",
      "city": "tempe",
      "shape": "diamond",
      "date": "2012-09-24T00:00:00",
      "story": "Photos of an unknown creature resembling both an amphibian and an armadillo who is seen holding a wand in his left hand at the end of w My name is ((name deleted)) from Tempe, Arizona.  I have been shooting photographs and videos of some very strange extraterrestrial phenomena here near my home ever since my first UFO sighting in July of 2010.   I began publishing my experiences and content first on YouTube and then finally on my own website Alien Reality (www.alienreality.net).  Normally I do not submit my experiences to reporting sites like yours or Mufon. This particular sighting however was so significant to me that I simply felt compelled to not only publish it but to officially report it to the appropriate agencies. Mid week last week I submitted an official report to MUFON (as I had done only one other time on another matter) and they have thus far completely ignored me.  Unreal. Contact me at your convenience.  This is an absolutely true and factual retelling of what happened to me and the media I shot is entirely genuine. ((personal information deleted)) This last Saturday, August 18 at about a quarter till one in the afternoon I managed to witness and record what to me is among the most amazing things I have ever had the privilege to view. I had made arrangements to go over to a friend’s house that afternoon and right prior to leaving I was doing some chores in my backyard and noticed that the clouds that day were particularly thick and many were shaped very oddly. I went inside to retrieve my camera and once outside again I began snapping photos. Suddenly, a bit behind me to the west I saw what appeared to be a flying or tumbling black object.  The moment it registered in my head that this was all sorts of unusual, the object was directly overhead. It was traveling rather quickly despite its awkward tumbling and occasional diving motions.  Soon afterwards it was to the east of me and that is when I began to snap photographs of this thing that I had just seen in the sky.. My first thought was that this was a trash bag or some other sort of debris flying in the sky which sometimes happens on a windy day.    However, that thought quickly left as I continued photographing.  The shape and structure of this thing was not at all like a trash bag or other paper or plastic trash.  It appeared to be box-like to some extent or it seemed more rigid than a bag would be blowing in the wind.  It also tumbled as it flew past and onward and dove occasionally but not very far or for very long.  The entire time it flew it was actually escalating in altitude. I managed to shoot about six shots that afternoon and towards the end of my encounter I shot about 15 seconds or so of video using the MPEG setting on my still camera.  Reviewing my shots on my camera’s LCD I was excited that I had managed to capture something that was clearly unusual at a minimum and potentially monumental on the far side of that equation. I had captured it seemed a low flying alien craft that was no more than 200 feet off the ground and if it wasn’t alien in origin it certainly had to be some sort of secret governmental drone device.  But as I stated earlier I was expected at a friends house in the neighboring town and I was already late so I left my things alone and went off till early evening to do something else. When I got back I put my card in the card reader and extracted the photos that I had taken earlier.  As I was able to blow up the photos I took extremely closely I was shocked at what I saw.  The photos that I had the good fortune to capture earlier that afternoon were not of any debris or trash flying in the sky.  That is clearly the case as even if a case could be made for that as the object in the photos there was barely any wind that day at all.  A slight breeze of 5 mph was what was recorded for Saturday.   That was not enough wind to carry around anything let alone catapult a large squarely shaped trash bag ever upward.  I was mistaken earlier that was for certain in describing the object as some sort of craft or ship. It was not. Photo reveals a living creature flying in the air that resembles an amphibian. The photos reveal that what I saw and photographed that day was a living being; seemingly as alive as me or you and he was clearly not from here.  The being in the sky that I photographed had an amphibian or reptile-like appearance with a very large mushroom shaped head, large eyes and a large mouth.  His head was disproportionately larger than his body which I saw clearly was comprised of a pair of legs and arms.  His back seemed to be sheathed, resembling an armadillo of sorts and as the pictures indicate he is capable of enfolding himself into himself potentially for protection or possibly navigation.  In his left hand he held what must be a wand or stick with a very bright light ball at the end.  Finally, this creature had a tail that was visible and pointed downward even when he was folded into his sheath as you can see in the later photos. I am still in awe of this experience and count it to be among the most profound of my now 49 years.  As I write this it is my birthday and I simply couldn’t have asked the universe for a better present.  The profound nature of these photos is what astonishes me and even now I simply cant’ put my mind around it.  We are indeed no longer alone in the cosmos. This is direct photographic proof that alien creatures exist and that as I have been stating all along; they are here.  I understand that there will be naysayers and those who seek to poke holes in this material and in me and to them I say “bring it on.” I will meet you at any time or any place to debate not only the veracity of my experience but also of the pristine condition of these photographs the originals of which have been safely backed up offline.  These photos are not and were not altered in any way with the exception of enlargement in order to see this low flying creature.  I will make copies of these master photos available to anyone who wishes to view them as I did initially.  They are real and as sure as I am alive and present this is the truth. May the truth of this information and the profundity of its ramifications resonate in your heart and all of our hearts.  May this not cause anyone to be afraid or angry or war-like in their approach.  The time for that old paradigm is past and will shortly be forever buried as we embark on a new era of understanding of ourselves and the universe around us.",
      "link": "http://www.nuforc.org/webreports/092/S92402.html",
      "state": "AZ",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bd5ae",
      "summary": "Amber/Red-colored Chinese lanterns",
      "city": "tempe",
      "shape": "cylinder",
      "date": "2012-05-13T00:00:00",
      "story": "Amber/Red-colored Chinese lanterns Roughly around 10pm, I was driving west on I-60. Either just east or west of I-101, I looked out my driver's side window (which was closed at the time) and spotted 2 amber/red cylinders floating above the 15ft+ barrier wall that aligned outer edge of east-bound lanes.  I opened my window to get a better look while I slowly began to pass them.  They looked like small (~2 ft diameter) Chinese lanterns. Light emitted from an orb-like mass in the middle of each lantern; the outter cylinder-shaped body seemed to be lit by this orb. I could tell neither the orbs nor the lanterns were made-up of no ordinary light because they were radiant yet soft, dense hi-def but misty. Hard to explain. They gently floated along and shifted positions (in relation to each other). Then I saw one lantern float into the other, merging into 1 cylinder (which maintained its  size). I continued to keep my eye on them/it (and the road...) but eventually the rubbernecking reached an uncomfortable angle. I turned off at the next exit and flipped around, but they/it were/was gone. The reason why I'm not sure if they were amber or red is because I remember them being both of those colors (together, i.e. they matched) yet I have no recollection of noticing them change; one second they were amber and the next they were red, and I have no idea how they pulled off that fast one. They were pretty. Seemed to have an air of intelligence about them. Just got that kind of vibe.",
      "link": "http://www.nuforc.org/webreports/088/S88875.html",
      "state": "AZ",
      "duration": "15 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bd660",
      "summary": "Very fast moving red and blue orv over Mesa, AZ",
      "city": "tempe",
      "shape": "circle",
      "date": "2012-05-13T00:00:00",
      "story": "Very fast moving red and blue orv over Mesa, AZ Witnessed a blue and red blinking craft moving west from Mesa toward Tempe; possibly over the Reservation.  Craft moved normally and then went into a diving and rising pattern, very much against the laws of physics as I know them.  Slowly continued until it finally dipped below the horizon.  Two or three ordinary aircraft gave chase. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/087/S87825.html",
      "state": "AZ",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3be780",
      "summary": "Object with fiery tail shot off into the sky",
      "city": "tempe",
      "shape": "unknown",
      "date": "2012-06-05T00:00:00",
      "story": "Object with fiery tail shot off into the sky I noticed dawn was just starting to fall upon the area as I looked out through my patio doors. I was looking north through two French doors, which face east, and saw an object with an ENE or NE trajectory shoot off into the sky just above the tree line.  It looked rather similar to a meteor or firework with a very bright and rather thick orange, fiery tail (which had a bright orangish-yellow band within its core) that tapered out roughly 30 feet from the object itself. It was not a meteor, however, due to the fact that its trajectory was upward (as opposed to towards the ground); it shot into the sky at about a 45 degree angle.  I'm positive it was not a firework; its tail was an extremely vivid, almost fluorescent orange, unlike anything I've seen before.   The air was still and dead silent. Its path was also slightly arched, which seemed to mimic the shape of a nearby tree canopy's silhouette. My view was obstructed by a few trees, but I got a clear shot of th! e object through a pocket of clear space between trees.   I was not able to see the object that produced the fiery tail, however, as it was much smaller than the tail itself, and traveled away much too quickly.  It seemed to be rather close though; between 50-200 yards away and only 40-60 feet off the ground.   And though I cannot say with 100% certainty, I also feel the object disappeared when I lost sight of it (as opposed to me losing visibility); it just vanished, much like shooting stars do as they fall toward the ground. This occurred near sky harbor airport, beneath incoming/outgoing flight lines, yet at this early hour no incoming red-eye planes were present. The roads were quiet as well. ",
      "link": "http://www.nuforc.org/webreports/089/S89321.html",
      "state": "AZ",
      "duration": "Second"
    },
    {
      "_id": "64d005f478aba2ec5a3beaf4",
      "summary": "Fireballs turn into jelly-saucers",
      "city": "tempe",
      "shape": "fireball",
      "date": "2012-02-10T00:00:00",
      "story": "Fireballs turn into jelly-saucers I was backing out of my driveway with my girlfriend and sister in the car when we noticed what appeared to be a fireball directly to the west, about halfway between the horizon and looking straight up.  We immediately pulled back into the driveway and got out of the car (which I left running). The object continued to ascend higher and higher into the atmosphere while a second object appeared slightly closer to the horizon compared to where the first object initially appeared.  A few seconds later the first object disappeared leaving the second object headed east.  Then what appeared to be a third object (or the return of the first) tailed the second object. At this point the two objects lost their firey appearance. They could still be seen on their easternly trajectory but now as soft, white objects with no illumination.  They almost had the appearance of white party balloons but they moved like jellyfish. They appeared to be spinning, but not in a perfect circle, a very wobbly circle. We watched them until they passed us to the north and disappeared over the horizon to the east. We actually saw a very similar object moving the opposite direction (west from east) over our house just a weeks ago, but did not report it.  We live very close to Sky Harbor and are quite familiar with standard aircraft.   I am a musician and videographer, my girlfriend is a painter and graphic artist, and my sister is a recent graduate of U of A.",
      "link": "http://www.nuforc.org/webreports/087/S87040.html",
      "state": "AZ",
      "duration": "3-5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bebd8",
      "summary": "Huge pearl-like object over South Mountain",
      "city": "tempe",
      "shape": "changing",
      "date": "2013-08-30T00:00:00",
      "story": "Huge pearl-like object over South Mountain On June 28, 1996, I was 17 and riding passenger-side by my mother. It was 7PM and still very sunny and clear. We came out of the grocery store and got in the car. We were driving west down Guadalupe Rd. in Tempe, AZ. My mother gasped, leaned forward to look into the sky and pointed at something. I leaned forward too. We saw a silvery streaked object falling southwesterly at a 120° angle against the blue sky. It was leaving a small tail behind it but not falling as fast as a meteorite and much bigger and duller than a meteorite. My first thought was space debris or a missile. But then it stopped suddenly about 50° above the horizon. When that happened, the tail ended, the shape changed to spherical and the color went to a lustrous pearl color. It appeared to be over South Mountain, maybe 5 miles away.  My mom managed to drive home. A few minutes later, we drove into our parking lot, having never lost sight over the treeline. From the parking lot, I ran into the apartment to grab my binocs, at which point I informed my dad and sister that there was a UFO outside.  I ran back out, rejoining my mom. All four of us watched it.  The bottom had opened up into a “V” shape and it seemed like hot gases were coming out of the bottom, like the steam rising from car hoods in the summer. It was soundless. I was the only one who saw it through the binocs and when I looked, I saw little sparks flying off the pearly surface, which flew chaotically around the UFO and would fizzle out, as if composed of electricity.  I also saw more specifically clear-colored heat waves coming out of the “V” shape. The UFO hovered there while people on the street were calmly driving their cars past us. It seemed to hover in exactly the same place in the air while the Earth turned underneath it. Sunset approached and after thirty to forty minutes, it was getting further away and more back against the horizon.  It seemed to be over Estrella Mountain at this point.  It was going to disappear soon. The sun was already down below the horizon so we just turned and left at around 7:30 PM. We watched the news that night expecting it to make the news.  We were frustrated that it didn't. Certainly in a city the size of Phoenix, people are not that busy. I did write down all these details that very night and I called Luke Air Force Base, spoke with a secretary and asked her if anything strange was seen on the radar.  She was nonplussed about my UFO sighting.  I have since learned that on that day, there was a funeral procession for a fallen soldier at Luke Air Force Base at appr. 7PM and so somebody at the base must have seen it.  Personally, I think it was experimental unmanned aircraft out of the NASA testing facility south in Maricopa.",
      "link": "http://www.nuforc.org/webreports/101/S101461.html",
      "state": "AZ",
      "duration": "30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bf0b0",
      "summary": "When I looked up in the sky, it looked like oval shaped big green mint color flash dropping and going straight down. Last about ten sec",
      "city": "tempe",
      "shape": "flash",
      "date": "2013-05-15T00:00:00",
      "story": "When I looked up in the sky, it looked like oval shaped big green mint color flash dropping and going straight down.  Last about ten seconds then dissappeared.  It was so bright and unexplainable.  I have seen many falling stars and it was not a falling star.  Amazing sight to see. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/096/S96786.html",
      "state": "AZ",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bfa5b",
      "summary": "Ascending lights seen over east valley.",
      "city": "tempe",
      "shape": "unknown",
      "date": "2013-10-14T00:00:00",
      "story": "Acending lights seen over east valley At about 1:15 am I walked out of my front door to smoke a cigarette. I live just off of the loop 202 and scotsdale road about a half mile north of the freeway.  My front door faces southeast and I am directly in the planes landing path to sky harbor in Phoenix.  I can sit on my front patio and watch planes decend all day. In my two years I have never seen a plane traveling east at the altitude and direction of the object I saw tonight.  The object was traveling east and hand a series of lights on the rear that would flash in an ascending order from left to right.  It caught my eye because, like I said, I have never witnessed a plane traveling that direction in that location before.  I quickly called my 17 year old cousin outside to look.  He was just as fascinated as me.  The lights were clearly visible and bright. I quickly hopped in my car with him and started driving east.  We followed the object for about 10 minutes and then turned around.  I have never experienced something like this in my life.",
      "link": "http://www.nuforc.org/webreports/103/S103074.html",
      "state": "AZ",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bfbd2",
      "summary": "Fireball shaped object flying from east to west then took a sharp turn south before heading back east then just disappears into the sky",
      "city": "tempe",
      "shape": "fireball",
      "date": "2013-02-04T00:00:00",
      "story": "Fireball shaped object flying from east to west then took a sharp turn south before heading back east then just disappears into the sky.   It then did this exact formation 2 more times.",
      "link": "http://www.nuforc.org/webreports/095/S95701.html",
      "state": "AZ",
      "duration": "30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c0ae0",
      "summary": "Strange red-orange spherical objects travelling in single file formation in the night sky.",
      "city": "tempe",
      "shape": "sphere",
      "date": "2013-12-02T00:00:00",
      "story": "Strange red-orange spherical objects travelling in single file formation in the night sky. I am a 39 year old female with a bachelor’s degree in nursing and one in human biology and on this approximate date of 09/15/2013 I was picking up two clients (male ASU students around the age of 21 years old) at their apartment complex.  As I was waiting outside for them to come out, I noticed several red-orange spherical lights in the sky to the south (they appeared to be in the city of Chandler, just south of Tempe).  They were traveling in sort of an arc, heading first west and then toward the north and finally north-east, at which point they just disappeared.  They moved in a single file line in almost perfect formation.  There was a helicopter traveling along with them.  I watched this for about 3 to 5 minutes before my clients came out.  When the first one came out I pointed it out and we just watched them come up on the horizon, travel in the arc motion and then disappear. By this time we could no longer see the helicopter.  The second client came out after about two minutes and we continued to watch for about 2 minutes as the last lights came and disappeared.  I took three pictures, which are very poor quality, but photographic evidence nevertheless.  We then departed the apartment complex and continued to talk about our experience for about 10 minutes until we arrived at our destination.  We thought that maybe they were Chinese lanterns and that maybe there was a wedding or some type of festival or something.  But the question of why there would be a helicopter travelling with them kept coming up and didn't make sense to any of us. About a month later, I picked up the same clients and we discussed whether any of us had researched the incident but none of us had.  We were still baffled.  On 11/28/13, I turned on Coast to Coast am on 550 AM out of Phoenix. A s soon as I turned it on they were talking about similar incidents throughout the county and identical descriptions.  Listeners were encouraged to report their incidents on the ufocenter.com website, so I thought I should.   The incident was just too strange to ignore. ((NUFORC Note:  Witness indicates that the date is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/104/S104914.html",
      "state": "AZ",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c1369",
      "summary": "Orange light formation.",
      "city": "tempe",
      "shape": "formation",
      "date": "2013-12-02T00:00:00",
      "story": "Orange light formation. Eleven objects in total photographed at 6:10 p.m. in Mesa AZ. by my friend ((name deleted)).  I did not witness this but he is a very credible family man.   I will forward his pic labeling it mesaaz1 for reference to this report.  I am a coast insider. ((NUFORC Note:  Witness elects to remain semi-anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/104/S104895.html",
      "state": "AZ",
      "duration": "driving"
    },
    {
      "_id": "64d005f478aba2ec5a3c158e",
      "summary": "Dark silent oval craft that was silhoutted against the white clouds lit by the full moon over Tempe AZ.",
      "city": "tempe",
      "shape": "oval",
      "date": "2013-11-20T00:00:00",
      "story": "A dark silent oval craft that was silhoutted against the white clouds lit by the full moon over Tempe AZ. A friend and I were up late listening to some music when I went outside to get some air and look at the full moon and I noticed a lit up reddish object traveling east to west slowly at about 10,000 ft which kind of looked like an airplane but at a certain area of the northwestern sky it passed in front of some white clouds that were illuminated by the full moon.   As it started to move in a southwesterly direction I noticed that the craft became completely dark and was only a dark oval silhouette against the white clouds and was not making any sounds at all. It continued on a southwesterly path and then kind of just vanished as it got in front of the moon.  And that was all.",
      "link": "http://www.nuforc.org/webreports/104/S104559.html",
      "state": "AZ",
      "duration": "12 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c1793",
      "summary": "\"W\"-shaped erratically flying at low level is \"unidentified\" with anything prior seen in thousands of flight hours.",
      "city": "tempe",
      "shape": "other",
      "date": "2014-06-04T00:00:00",
      "story": "\"W\"-shaped erratically flying at low level is \"unidentified\" with anything prior seen in thousands of flight hours. The Tempe Arizona sky was clear with many stars and planets visible and moon at 74% illumination. Suddenly at very low level (just above tree tops) a flight was observed moving from southwest to northeast, proceeding in a \"rounded\" zig-zag pattern with quick turns and slight variations in altitude. Initially it looked like a blurry/hazy white \"W\" and I wondered if it were an owl initially.  As it quickly came closer it clearly was not a flight of birds or bats not an identifiable bird; and the \"W\" resemblance was assured, moving with the \"W\" parallel to the ground and moving toward the two points at the bottom of the W.  No typical banking maneuvers were noticed, meaning the object did bank and/or pitch up, just not with the co-ordination nor symmetry associated with fixed-wing aircraft nor fowl. As it neared, still flying erratically, the object looked a muted white even translucent.  The \"W\" was not with sharp lines/edges, rather more rounded and muted/hazy with visible striations fore to aft along its entirety every 5% or so.  The flying \"W\" appeared as one unit, no flapping, no noticeable moving parts, no exhaust or trail of any sort, no lights nor glowing and no noise. The object proceeded to nearly overhead the open patio and as I stood up it quickly altered course and went over/behind a 30' tree (which provided perspective & parallax, so I report it at low level). I walked over under the tree and observed the object completing a turn back toward the tree. As I walked toward it, it turned away and proceeded back on a zig-zagging northeasterly track.  Observer has seen some very large white owls in Arizona, and this was not that.  If it was organic, nothing distinguished it as such.  Observer had previously observed what were deemed \"The Phoenix Lights\" on more than one occasion, including during daylight hours.  This \"W\" is quite unlike those phenomena.   Observer's background includes many thousand hours of commercial piloting experience.",
      "link": "http://www.nuforc.org/webreports/109/S109579.html",
      "state": "AZ",
      "duration": "20 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c1f1d",
      "summary": "I have aircraft training backround.",
      "city": "tempe",
      "shape": "rectangle",
      "date": "2014-06-13T00:00:00",
      "story": "I have aircraft training backround. Yellow 75 percent Red 25 percent bright light climbing object at 30 degree angle stoppped to hover reverse direction short hover then traveled southwest light got progressive smaller then came back to full illumination in a northeastly direction.  Object started over McKellips and College in Tempe arizona.  No sound.  No aircraft red and green lights.  Questioning possible uav.",
      "link": "http://www.nuforc.org/webreports/110/S110070.html",
      "state": "AZ",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c202b",
      "summary": "I saw a Cigar shaped space craft hovering above for about 5 minutes. It zig zagged all throughout the sky and then zoomed off into the",
      "city": "tempe",
      "shape": "cigar",
      "date": "2014-06-13T00:00:00",
      "story": "I saw a Cigar shaped space craft hovering above for about 5 minutes.   It zig-zagged all throughout the sky and then zoomed off into the distance.   No space craft that I have ever seen is capable of doing the maneuvers that I witnessed. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/110/S110159.html",
      "state": "AZ",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c2e2f",
      "summary": "Two unusual crafts above Tempe, Arizona.  Very bright!",
      "city": "tempe",
      "shape": "unknown",
      "date": "2014-08-29T00:00:00",
      "story": "Two unusual crafts above Tempe, Arizona.  Very bright! I was walking him from the grocery store, when I noticed a bright orange object in the sky.  I saw what looked like two streaks of light on either side but it trailed behind not changing length at all.  I thought it was a plane on fire but then thought it was flying towards the ground at a weird angle and there were no trails of smoke, or anything.  I also noticed a small object that wasn't moving.  There was a single white light with orange around it.  Not nearly as bright as the other.  The first passed the second one and then stopped flying midair and became less bright.   The smaller one then got brighter and started flying back up.  They both eventually disappeared into mid air. I was so dumbfounded that I was only able to get a couple of pictures.   They are from a distance and only seem like small bright blurry things in the sky.  But I believe I saw two UFOs.   I also saw a plane fly towards where one object disappeared a few minutes later there were lots of lights in the sky, but I can't tell if it was lightning but there were lots of lights in the same spot back to back.",
      "link": "http://www.nuforc.org/webreports/112/S112901.html",
      "state": "AZ",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c2f1c",
      "summary": "Blinking, star sized object over Tempe, AZ.",
      "city": "tempe",
      "shape": "unknown",
      "date": "2014-08-08T00:00:00",
      "story": "Blinking, star sized object over Tempe, AZ. I was laying on my back in the Tempe beach park waiting for the fireworks show and looking at stars and planes flying over head.  The sky was relatively clear with scattered clouds but clear near the event I witnessed.  I noticed a blinking star in a fixed point almost directly above me.  It reminded me of the size of a satellite traveling.  The object however, did not move.  It blinked for a few seconds and went dark.   I watched around the area expecting to see it blink again in a different place as when a plane is visible or again, a satellite.  After a second or two, it began blinking again in the same spot.  It blinked for less time than when I first noticed it, then it was gone for good.  I have been a sky watcher for almost forty years and can confidently say it was too high up to have been a helicopter.",
      "link": "http://www.nuforc.org/webreports/112/S112156.html",
      "state": "AZ",
      "duration": "10-15 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c2fac",
      "summary": "Pulsating bright white light formation take off at amazing speed.",
      "city": "tempe",
      "shape": "light",
      "date": "2014-08-08T00:00:00",
      "story": "Pulsating bright white light formation take off at amazing speed Driving from Southern and McClintock drive in Tempe, AZ, towards US 60, we saw an intense almost glittery pulsating bright white light formation hovering, almost over Freeway towards the end of Rush hour.   It did this for a couple of minutes, we couldn't believe our eyes thinking maybe it was a helicopter, then flew off at light speed north and was gone!  Others had to have seen this!  We've been looking for news, but so far nothing. ((NUFORC Note:  Source of report elects to remain totally anonymous; provides no contact information.  The witness didn't see anything in the news, probably because he/she did not report it to the news.  PD))",
      "link": "http://www.nuforc.org/webreports/112/S112191.html",
      "state": "AZ",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c365e",
      "summary": "We were out smoking a cigarette when we saw this craft cover across the sky It did not have a sound but it had a vibration.",
      "city": "tempe",
      "shape": "teardrop",
      "date": "2015-02-20T00:00:00",
      "story": "We were out smoking a cigarette when we saw this craft cover across the sky.  It did not have a sound but it had a vibration kind of like a base with red lights all over it. ((NUFORC Note:  Witness indicates that the date is approximate.  Possible helicopter??  PD))",
      "link": "http://www.nuforc.org/webreports/117/S117362.html",
      "state": "AZ",
      "duration": "4 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c3696",
      "summary": "Out smoking a  cigarette  when we noticed the craft hovering without sound across the sky and out of sight",
      "city": "tempe",
      "shape": "teardrop",
      "date": "2015-02-20T00:00:00",
      "story": "Out smoking a  cigarette  when we noticed the craft hovering without sound across the sky and out of sight.",
      "link": "http://www.nuforc.org/webreports/117/S117363.html",
      "state": "AZ",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c36d7",
      "summary": "I live in Tempe, AZ, a city in the Phoenix metroplex area.  As you are probably aware, the Super Bowl was hosted here in Pho",
      "city": "tempe",
      "shape": "triangle",
      "date": "2015-02-06T00:00:00",
      "story": "Hello.  I live in Tempe, Arizona, a city in the Phoenix metroplex area.  As you are probably aware, the Super Bowl was hosted here in Phoenix (Glendale, specifically) yesterday evening. It was during this time that this sighting occurred at approximately 7:40 PM Arizona time. I had returned from Tucson earlier that evening with my fiancé and was cleaning up our house.  The game was on the television, but I was not watching it, as I’m not a huge sports fan.  At approximately 7:40 PM, I went outside to the backyard to take some trash out.  On my way over to the trash can, I looked up at the moon which, at the time, was in the upper eastern part of the sky.  It was at this moment that I saw a curious-looking craft heading north some degrees above of the moon. This stood out to me immediately because this craft was not following the flight path which nearly every plane follows on its approach into nearby Sky Harbor Intl. Airport.  Planes flying into Sky Harbor at night typically fly in from east-to-west as our runways run in this orientation.  If a plane does fly over this airspace, its altitude is typically very high as to not disturb the lower traffic.  This craft’s altitude appeared to be relatively low, around 10,000 feet or so and no more than a mile away from me to the East, making it very unusual from the start. As I observed this craft going north-bound, I tried to logically make out what it was. I was looking at it from below.  It had one unblinking white, slightly yellow light on the bottom of it, generally in the middle of the craft.  This light appeared to illuminate other parts of the craft, which had a reddish-orangish tint to it.  I could see what appeared to be actual structure rather than a series of lights. As I stared at this object, transfixed, I tried to logically see it as a plane, thinking that the illuminated areas were perhaps the tail section and/or wings of a Southwest jet, which are commonly painted with orangish colors.  However, this object didn’t fit the description of a jet.  There were no navigation lights, it made no sound, and the shape that I could make out seemed to be triangular in shape.  The illuminated areas seemed to perhaps be the points of this triangle.  The object was slightly smaller than the moon that night, however it didn’t cover as much surface area in the sky as the moon did because of its triangular-looking shape (triangles covering less surface area than circles do). Once I ruled it out as an aircraft, I thought that perhaps I was viewing a large satellite and that the illuminated areas were solar panels.  Many images that I have seen of satellites show their solar panels to be of a rusty orangish color, similar to what I was seeing.  This, too, just did not fit.  At this moment, I noticed that the object was beginning to turn.  It made a smooth 90 degree turn in a sharp arc going from north to west in seconds. It was at this point that I noticed how fast this thing was going and how fast it had made the turn.  A normal jet would have needed much more distance to make such a sharp turn.  I remember thinking that a typical commercial jet would probably have fallen apart turning at such a speed. As it was turning, my view of it changed.  Before turning, I was looking up at it, seeing it from the bottom with one light.  Now, as it was turning (and more north of me at that point) I was seeing it from the side.  It was at this view that I could see two lights (both still unblinking and the same white-yellowish color).  I am not sure if this was actually an additional light on the craft, or if it was part of the same light I saw on the bottom.  Perhaps because of the new view point, I was seeing the bottom and top of the light, split horizontally by the craft itself.  I am not sure. But as soon as it leveled off, I could only see the one light again from the bottom. It was at this moment that I heard the thunderous sound of jet engines behind me from the South.  As soon as I looked above, two military jets zoomed right overhead, heading northwest from the South.  I could tell they were military jets because they were not on the Sky Harbor flight path, they had a distinctly different sound than the commercial jets, and were flying low for that area (approx. 10,000 feet).  They too were turning towards the West in pursuit of the object, but made a much wider turn than the object had.  They each had a sole very bright white blinking strobe light that I remember thinking looked kind of ominous in a way.  They did not appear to have the red and green navigation lights that I see on countless jets flying into Sky Harbor. At first I thought that this could be an escort of some sort, but it was clear that these jets were trying to catch up and pursue this object.  I have seen strange things in the sky before, but seeing jets literally chasing this thing made me realize that I wasn’t “seeing things.”  I was amazed and somewhat frantic and called out to my mother who lives with my fiancé and I (my fiancé had just left the house and was not home to see this).  She ran out and saw the object with the jets in trail as they all zoomed westward, coincidentally heading directly towards the Glendale Stadium where the Super Bowl was being played at the time.  To my estimate, it seemed that the object and the jets had to have flown right over Sky Harbor, which astonished both my mom and I.  At this time we heard what may have been the jet's afterburners because the jet noise became significantly louder once they were flying in a straight line again after they had turned. Although my mother did see the object, she only saw it as a light being chased by the jets.  She did not see any structure or detail like I had seen when it had flown past less than 30 seconds before.  We watched the jets and the object till they were out of view, and it appeared that they had turned slightly south before again continuing west. Some further information:  I am a graphic designer, 28 years old, and have lived in Phoenix (specifically Tempe) for five years.  Both of my parents are licensed pilots, and I practically grew up at the municipal airport in the town where I grew up.  I have spent hundreds of hours flying with my dad in his planes (both single and twin engines) throughout my life.  Although I am no expert, I feel that I am somewhat knowledgable in identifying things in the sky and feel confident that this craft was something truly unusual. I will also add that military aircraft (helicopters and jets) have been flying around the Phoenix area for the past week because of the heightened security surrounding the Super Bowl.  These military aircraft were discussed on the news before the Super Bowl so that all of us citizens would be aware of their presence and purpose in case we saw them flying around that week.  The news media stated there would be two Blackhawk helicopters and two jets patrolling airspace during the Super Bowl. Over the week, everyone in town, including myself, saw and became familiar with the helicopters and jets as they did their rounds.  However, I believe that the jets that I saw were not necessarily related to these aircrafts flying around for security reasons.  Very shortly after the sighting, I actually saw the two patrol jets in formation flying nearby from north to south in the vicinity of Sky Harbor.  These jets had dim, yet visible, red and green navigation lights, along with their white strobes.  The jets that I saw chasing the objects were not the two patrol jets because they were far out to the West at the time when I saw the patrol jets. I got the feeling that the jets I saw pursuing the object may have been scrambled from Luke Air Force Base or other nearby military base. Thank you so much for your time in reading my long report about this event. I wanted to be thorough and cover as much information as I could.  I will be emailing a map with the path of the object and jets based on my observation. I will also try to put an illustration together.  I really do appreciate that there is a place where this kind of thing can be reported.   Thank you for you work! ((ADDENDUM #1 FROM WITNESS)) This is ((name deleted)) whom you spoke with yesterday afternoon.  My apologies for directly sending this to your email address. Thank you for taking the time to call yesterday.  I wanted to send you a map graphic that I put together.  In this graphic, I have illustrated the approx. paths of the object, the jets, and have also noted the Sky Harbor flight paths.  All of this has been superimposed onto a map of the area to give you context.  I hope it provides some useful information. ((END ADDENDUM #1)) ((BEGIN ADDENDUM #2 FROM WITNESS)) My name is ((name deleted)) and I submitted a report last night detailing a strange craft I saw on Sunday night (February 1st, 2015) that was being pursued by two military jets. I am attaching a pdf file of a map graphic that I created to show the paths of the object and jets as well.  The paths are superimposed on a map of the area to give context.  I hope it provides useful information and further insight to my report. Please feel free to contact me if you need further information.  Thank you so much! ((END ADDENDUM #2)) ((BEGIN ADDENDUM #3 FROM WITNESS)) I am attaching hand drawn sketches that I made, along with computer drawn sketches made in Adobe Illustrator.  Not the most beautiful sketches ever, but generally convey what I saw.  Please let me know if you have any issues with the files. I have contacted local media and received a response from Fox.  I provided them with the sketches, map graphic, and description.  I will keep your center updated on any further developments if interested. ((END ADDENDUM #3))",
      "link": "http://www.nuforc.org/webreports/117/S117121.html",
      "state": "AZ",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c37eb",
      "summary": "Two red lights on north Tempe horizon.",
      "city": "tempe",
      "shape": "light",
      "date": "2015-01-16T00:00:00",
      "story": "Two red lights on north Tempe horizon. Two red lights on the Horizon, I went inside to grab my buddy to show him and when I came back they were gone.  Direction was straight north from Tempe.",
      "link": "http://www.nuforc.org/webreports/116/S116630.html",
      "state": "AZ",
      "duration": "2 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c3ab5",
      "summary": "Formation of about 8 to 10 dim reddish lights.",
      "city": "tempe",
      "shape": "formation",
      "date": "2015-08-06T00:00:00",
      "story": "Formation of about 8 to 10 dim reddish lights. Traveling northbound on the 101, I spotted about 8 to10 dim red lights fly slowly overhead in a wide delta formation.  The lights were small and spaced far apart traveling in an west to east direction over the US 60 interchange in between Tempe and Mesa, Arizona.   The majority of the lights faded from view by the time my vehicle passed underneath, leaving only two lights visible from my vantage point.  Very reminiscent of the Phoenix lights back in 1997.",
      "link": "http://www.nuforc.org/webreports/120/S120804.html",
      "state": "AZ",
      "duration": "~4 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c3acb",
      "summary": "Ten points of light flying formation in the sky over Tempe, AZ, 21:21 hrs 1 AUG 2015.",
      "city": "tempe",
      "shape": "light",
      "date": "2015-08-06T00:00:00",
      "story": "Ten points of light flying formation in the sky over Tempe, AZ, 21:21 hrs 1 AUG 2015 We turned onto Country Club Way in Tempe, AZ, going south from Balboa, looked up, and saw an irregular formation of 10 red lights in the sky moving east.  We got an iPhone photo that caught 4 or 5 (one dot is questionable) of them.  The others had gone beyond our field of view before we could get a photo.   While their formation wasn't a regular shape, like our military pilots fly, they were moving in sync with each other.  They were small red dots, but not blinking like an aircraft's lights.  We followed as best we could, but within ten minutes, we could no longer see any.   Because Country Club Way is a residential street, we could see them much better than people driving on a main street, because of relatively less light pollution.   One of us is a retired Army Intelligence Officer, with service at NASA on the Apollo Program, and a lot of other aerospace industry experience, and a graduate (masters) engineer.  The other witness isn't trained in engineering, ! but reports the identical situation. ((CORRECTION FROM READER)) Hi, Report on 8-1-2015, time 21:21, Tempe. Looks like two versions with punctuation corrected on second one. Regards,  ((name deleted)) ((END CORRECTION)) ((NUFORC Note:  We deleted the second copy of the same report on 06FE16.))",
      "link": "http://www.nuforc.org/webreports/120/S120902.html",
      "state": "AZ",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c3b28",
      "summary": "Lights over North Tempe.",
      "city": "tempe",
      "shape": "light",
      "date": "2015-07-31T00:00:00",
      "story": "Lights over North Tempe My best guess is a drone.  Three steady red lights and a blinking green with an erratic flight path.  Clearly not a fixed wing or helicopter.  Difficult to tell distance, it was seen over North Tempe, south of Continental St. and east of 68th St.  It descended rapidly and vertically after a flight of about 4 minutes.",
      "link": "http://www.nuforc.org/webreports/120/S120651.html",
      "state": "AZ",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c3c14",
      "summary": "Two red orbs hovering over the firework display appered around 9:15 pm and lasted 25-35 min. Multiple people saw the object and couldnt",
      "city": "tempe",
      "shape": "light",
      "date": "2015-07-06T00:00:00",
      "story": "Two red orbs hovering over the firework display appered around 9:15 pm and lasted 25-35 min.  Multiple people saw the object and couldnt explain.   The object appears to move and stop suddenly and then fly away.  It was in the flight path of Sky Harbor Airport.",
      "link": "http://www.nuforc.org/webreports/120/S120104.html",
      "state": "AZ",
      "duration": "30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c3c44",
      "summary": "Craft under intelligent control, flying in Tempe, AZ.",
      "city": "tempe",
      "shape": "sphere",
      "date": "2015-07-06T00:00:00",
      "story": "Craft under intelligent control, flying in Tempe, AZ. Myself and a few family members went to the Tempe Town Lake festival for the fourth of July 2015.  We are enjoying our time and being very proud to be American.   About 30 seconds before the fireworks stared we noticed a red light floating around where the fireworks are about to take place.  While the show was taking place the light was stationary, then the light started moving from east to west.  The object then stopped, and changed course and headed back to its original location.   It then proceeded to move directly up and directly down, the object then started moving towards superstition mountains then disappeared.   This craft was unlike anything I have seen and I was an aircraft rescue firefighter for the United States Marine Corps.  I have seen very many aircraft from our military and other countries' military.  This was neither, nor was it civilian, and I say that because, where the craft was located was directly in the flight path of Sky Harbor Airport.   I have v! ideo",
      "link": "http://www.nuforc.org/webreports/120/S120107.html",
      "state": "AZ",
      "duration": "30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c4890",
      "summary": "5 lights fy beside each other.",
      "city": "tempe",
      "shape": "fireball",
      "date": "2015-09-25T00:00:00",
      "story": "5 lights fy beside each other. There are very clear 5 fireballs in the sky.  It was moving beside each other then each one went to different direction for a while then thay meet again to fly beside each other.   I have photos and video was recorded using a professional camera.",
      "link": "http://www.nuforc.org/webreports/122/S122202.html",
      "state": "AZ",
      "duration": "30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c5260",
      "summary": "4 bright circular lights in sky over South Phoenix.",
      "city": "tempe",
      "shape": "circle",
      "date": "2016-01-29T00:00:00",
      "story": "4 bright circular lights in sky over South Phoenix. Live in Tempe, looking toward S. Phoenix, 4 very bright lights in a line (bottom to top), not moving.  Planes in distance passed by.  I have photos. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  Witness does not send photos, and we have no way to contact him/her.  PD))",
      "link": "http://www.nuforc.org/webreports/125/S125508.html",
      "state": "AZ",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c540a",
      "summary": "Mothership UFO in Tempe probed by airforce helicopters and jets. Very strange sighting.",
      "city": "tempe",
      "shape": "changing",
      "date": "2016-01-05T00:00:00",
      "story": "Mothership UFO in Tempe probed by airforce helicopters and jets.  Very strange sighting, and my only sighting. If people are interested, I will go into more detail, but for now I will keep it short and sweet.  Was up early for one of my 2 required Saturday shifts for work.  Happened to go sit on my balcony to stargaze and relax, before heading in to work in a few hours.   Saw what initially resembled the usual airplanes that come through to go to the Phoenix Airport nearby, however, this object quickly approached and I could tell it was much too large to be an airplane.   It started out roughly saucer like with your typical yellowish white light, but then literally started to morph green, blue, red, orange, etc in a fashion such as fiber optics would look like.  Still not that shocked, I continued to watch it approach from the north and it eventually completely stopped and just hovered, only making a few impossible maneuvers for any (declassified) man-made tech.  To make things really interesting, as it hovered, it twice descended while dropping what seemed to be small disc like crafts with the similar cycling of lights the \"mothership\" had.  The only reason I wasn't sure of how many came from it was because I was too focused on all of the helicopters and airforce jets sneaking up to get a closer look.   The object hovered a good 30 minutes before this happened and I never took my eyes off it.  It would morph and change from the saucer like shape to almost a crown or diamond type shape, but the color now stayed mostly yellowish white.  When approached by what I believe to be a helicopter (that or a jet) it appeared to playfully recede at any probe too close to it.   As the sun was beginning to come up, it lowered what looked like a few hundred foot \"ropes\" of light, 3 to be exact.  The smaller craft that were closer to the ground sort of just hovering as well then slowly ascended up and merged back with the \"mothership\", all the while the jets and helicopters were EVERYWHERE.  I mean they weren't making it obvious, but I could hear the helicopters and see the jets.   Finally, the object made some crazy \"skipping\" like maneuvers and as it did so, one of the tiny little clouds that were in the sky came as if it was called over, and the object slowly dimmed and went higher and higher.  It was the most insane thing I have ever seen.   I am a college educated male, 25 years of age, and only drink on the rare occasion.  Wide awake for a good 3 hours of witnessing all of these strange events.  I really would like to see if anyone else witnessed something similar!  I have always been somewhat of a believer, but still do not know if I am witnessing new experimental aircraft, or ET phenomenon.  I am open minded and will not jump to conclusions, but this has me very, very intrigued.  I will continue to watch that area of the sky in the same hours now to see if I can catch any more glimpses of what went on.  Thanks for reading,",
      "link": "http://www.nuforc.org/webreports/125/S125058.html",
      "state": "AZ",
      "duration": "3 hours"
    },
    {
      "_id": "64d005f478aba2ec5a3c58ec",
      "summary": "Bright flash followed by fireball falling from sky seen over PHX INT airport restricted air space.  ((NUFORC Note:  Meteor??  PD))",
      "city": "tempe",
      "shape": "fireball",
      "date": "2016-06-03T00:00:00",
      "story": "bright flash followed by fireball falling from sky seen over PHX INT airport restricted air space My girlfriend and I were about to walk into our house, after smoking a cigarette, when suddenly, and without any prior sounds or notions of aircraft, suddenly a bright flash light up the sky north east of our back yard and in a trail of bright yellowish white flames with blue to yellow flame at the point of whatever the object was came souring down at a rapid rate towards the direction of mill ave I'd say at about rio saldo possibly tempe town lake no explosion was heard no sounds at all in fact except a car alarm in the distance at about the moment i thought it would have landed and dogs barking all the way up to my neighbors dogs about 5 to ten minutes later i heard the sound of low pitch booms 3 of them i do not know if that is relevant.even now the strange trail that the object left can barely be seen in the sky. Honestly if it werent for the fact that my tags expired 5/31/16 i would have driven to site ((NUFORC Note:  Object reported by the news as a probable meteor.  We agree.  See photos of smoky trail left high in the sky above Arizona.  PD))",
      "link": "http://www.nuforc.org/webreports/127/S127651.html",
      "state": "AZ",
      "duration": "30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c5dfb",
      "summary": "Three orange/amber orbs silently floating above Tempe neighborhood around Baseline and Kyrene",
      "city": "tempe",
      "shape": "light",
      "date": "2016-11-11T00:00:00",
      "story": "Three orange/amber orbs silently floating above Tempe neighborhood around Baseline and Kyrene. On November 4th, right about 1 a.m., I walked outside to smoke and immediately saw these three amber orbs coming in my direction from the north-northeast.  They were eerily silent and must have been about 100 feet off the ground.  They felt quite close.  One of the orbs was a lot more independent and was away from the other two; it jerkily, but yet subtly (if that makes sense), zig-zagged up and down.  The other two were constantly side by side and floated in a smooth manner. They must have changed direction when I was desperately trying to get my phone camera out (I managed to get a decent video) and began going west down my street until the lights disappeared from my view.",
      "link": "http://www.nuforc.org/webreports/131/S131079.html",
      "state": "AZ",
      "duration": "90 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c5fb6",
      "summary": "Three fire balls appear in the nights sky.  Do there little dance and then disappear into the night.",
      "city": "tempe",
      "shape": "fireball",
      "date": "2016-11-04T00:00:00",
      "story": "TEMPE, AZ and ASU host fire side ball.  Three fire balls appear in the nights sky.  Do there little dance and then disappearinto the night. (My Wife and I are homeless.  She is a long time house wife and I amTonight my wife and I were setting outside of Arizona State University climatology lab Lab we were looking to the east-northeast when we saw two fireballs appear over the mountains to the east of the ASU complex they were floating flying to wards West Northwest in a erratic pattern they weren't going for a straight line A to B they were more like insects they hovered a couple of times in places and finally one of them went backwards and vanished.  another one appeared over the mountain Southeast and almost the same path.  Evant nay the last two Vanished and the night Was empty again.     One thing I forgot to mention is Not more than 20 Min Before the appearance Of these UFO's a local Pack of Coyotes started Yipping, Howlwg and Baying like it was a Full Moon. I also have a video of this its about 5 min.",
      "link": "http://www.nuforc.org/webreports/130/S130928.html",
      "state": "AZ",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c61ca",
      "summary": "My girlfriend and I saw two lights hovering over the Tempe area.  We were looking south to southwest.",
      "city": "tempe",
      "shape": "light",
      "date": "2016-09-09T00:00:00",
      "story": "between 9:45 and 10:01 p.m. on 8/30/2016. my girlfriend and I saw two lights hovering over the tempe area. we were looking south to southwest.  two orangeish red ish lights side by side with one slightly higher than the other hovered for about 10 mins then flickered off... then reappeared but seemed to be further away this time... I have cell phone video and would like to send it in.",
      "link": "http://www.nuforc.org/webreports/129/S129743.html",
      "state": "AZ",
      "duration": "16 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c640f",
      "summary": "At around 9:40 pm went outside and saw two bright orange fireballs side by side heading towards south mountain.  ((anonymous report))",
      "city": "tempe",
      "shape": "fireball",
      "date": "2016-09-02T00:00:00",
      "story": "At around 9:40 pm, went outside and saw two bright orange fireballs side by side, heading towards south mountain.  within about 5 minutes, they both faded out and disappeared.  went back outside 5 minutes later and there were two more identical fire balls heading in same direction and as the first two watched one disappear and then the other within 5-10 minutes.  at one point the first set appeared to get real close together and then separated.  the second set of lights seem to be real bright, then dim out and then got bright again before disappearing.  as we live near the airport i have seen many planes which this was not.  again just at 10:18 two more headed same direction, same color and circular in shape.  seemed to be further away this time or closer to the mountain.  oddly they keep appearing within 5-10 minutes apart and in pairs of two. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/129/S129602.html",
      "state": "AZ",
      "duration": "5-10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c6795",
      "summary": "Green/White Orb in the East Valley.",
      "city": "tempe",
      "shape": "circle",
      "date": "2017-04-07T00:00:00",
      "story": "Green/White Orb in the East Valley 2 of my friends and I were heading east down Baseline Rd. in two separate cars, about a mile in distance apart.  While one of my friends insists it appeared white, I beileved it to be green, a craft heading in a small arc coming towards the ground in the east valley.  I could only make it out to be a small circle, for I was not close enough to decide the shape.",
      "link": "http://www.nuforc.org/webreports/133/S133293.html",
      "state": "AZ",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c6925",
      "summary": "First was 3 lights in triangle formation. Then 2 more came - one went over to the other and shown a bright white light.",
      "city": "tempe",
      "shape": "light",
      "date": "2017-03-23T00:00:00",
      "story": "First was 3 lights in triangle formation.  Then 2 more came - one went over to the other and shown a bright white light then that one blinked red and green.   They stayed in the same spot for 90 minutes while the two that joined them kept leaving and coming back.  Helicopters came and kept circling them they started to move farther away.   We have pictures.",
      "link": "http://www.nuforc.org/webreports/133/S133266.html",
      "state": "AZ",
      "duration": "90"
    },
    {
      "_id": "64d005f478aba2ec5a3c69cc",
      "summary": "Unusual military helicopter activity over east Phoenix, AZ, valley.  3-16-17.   8:12 pm.  ((anonymous report))",
      "city": "tempe",
      "shape": "other",
      "date": "2017-03-17T00:00:00",
      "story": "Unusual military helicopter activity over east Phoenix, AZ, valley.  3-16-17.   8:12 pm. Two military helicopters flying rectangular paths around the East Valley of Phoenix AZ. Lead aircraft was a Cobra with lots of armor looking items hanging off each side of the aircraft.  Second helicopter was a military type, id unknown, passenger type.  Both aircraft were painted in a light gray color.   I got a good look at the cobra with my binoculars, it was about 200 feet off the deck above my home in Mesa AZ.  Both helicopters were flying at high speeds compared to the normal speed of police and medical helicopters that frequent the area.   At the same time a prop driven aircraft was circling our part of the city at about 8 to 12 thousand feet during this 45 minute period of time.   When the helicopters left the area the prop plane at high altitude left to the west.  Unknown which way the 2 military helicopters left due to there low altitude.   I realize this is not a UFO sighting but, unless this is an unannounced military exercise over a large city, something is going on.  I have sat in my back yard a lot over the last 20 years, this situation is very unusual. ((NUFORC Note:  Source of the report elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/133/S133146.html",
      "state": "AZ",
      "duration": "50 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c6b5e",
      "summary": "Four orange lights Tempe.",
      "city": "tempe",
      "shape": "light",
      "date": "2017-02-03T00:00:00",
      "story": "Four orange lights Tempe. Four orange/red orbs over south mountain area of phoenix.  Seen from 3rd balcony in Tempe.Orbs of orange light suddenly appeared.  At first two..  Then two more.  They stayed in same area about 10 minutes, then each orb light slowly faded away. ((NUFORC Note:  We assume a nighttime sighting, and have amended the time above.  However, source of report elects to remain anonymous, and provides no contact information, so we have no was of confirming the time.  PD))",
      "link": "http://www.nuforc.org/webreports/132/S132425.html",
      "state": "AZ",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c721f",
      "summary": "Low Flying Helicopter Chasing Lighted Object",
      "city": "tempe",
      "shape": "other",
      "date": "2017-06-02T00:00:00",
      "story": "Low Flying Helicopter Chasing Lighted Object Was in my home in South Tempe near Baseline and the 101 Freeway, when I heard the sounds of one or more large helicopters passing overhead.  I remained indoors, when about 5 minutes later the event was repeated.   On the third occasion, I ran outside and observed a single helicopter with navigational lights on at a very low altitude (under 500 feet) passing from north to south.  It was tailing an object which appeared to be longitudinal and tapered of about the same length as the helicopter.  The object had a string of approximately 20-25 small white unvarying lights arranged along its length.  The object displayed no other lights.   The helicopter appeared to be a Blackhawk, although that is just a guess as it was difficult to see due to darkness.  Previously, we have in the past had Marine helicopters occasionally perform similar maneuvers in our area when practicing urban combat training.  However those occasions were marked by that was always announced well in advance and there was no such announcement on this occasion.",
      "link": "http://www.nuforc.org/webreports/134/S134260.html",
      "state": "AZ",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c7220",
      "summary": "Low Flying Helicopter Chasing Lighted Object",
      "city": "tempe",
      "shape": "other",
      "date": "2017-06-02T00:00:00",
      "story": "Low Flying Helicopter Chasing Lighted Object Was in my home in South Tempe near Baseline and the 101 Freeway, when I heard the sounds of one or more large helicopters passing overhead.  I remained indoors, when about 5 minutes later the event was repeated.   On the third occasion, I ran outside and observed a single helicopter with navigational lights on at a very low altitude (under 500 feet) passing from north to south.  It was tailing an object which appeared to be longitudinal and tapered of about the same length as the helicopter.  The object had a string of approximately 20-25 small white unvarying lights arranged along its length.  The object displayed no other lights.  The helicopter appeared to be a Blackhawk although that is just a guess as it was difficult to see due to darkness.  Previously, we have in the past had Marine helicopters occasionally perform similar maneuvers in our area when practicing urban combat training.  However those occasions were marked by that was always announced well in advance and there was no such announcement on this occasion.",
      "link": "http://www.nuforc.org/webreports/134/S134261.html",
      "state": "AZ",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c724c",
      "summary": "Rose pinkish orbs in Tempe, Arizona.",
      "city": "tempe",
      "shape": "circle",
      "date": "2017-06-02T00:00:00",
      "story": "Rose pinkish orbs in Tempe, Arizona. I have a view to flight path of Sky Harbor airport and often watch incoming planes from my upper deck.  On this day, I noticed a rose/pink colored orb in the area where planes are normally in a holding pattern.  I watched it head south in my direction, then made an ubrupt turn to east (opposite direction from airport) and watched until it disappeared.  I then looked back to where I originally saw this, and saw two more coming!   I ran downstairs to get binoculars and by the time I got back upstairs, those two orbs went into same pattern/direction as the previous one.  Then, again, two more come into view - from the same direction and eventually disappeared into the eastern sky.  I did manage to get a picture.  I didn't know what to make of it, but what I find most interesting that no planes landed or were in holding during this time.  Once the orbs were gone, planes were again in view and started landing.  Very strange.",
      "link": "http://www.nuforc.org/webreports/134/S134358.html",
      "state": "AZ",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c729e",
      "summary": "Recurring white flashes.  ((anonymous report))",
      "city": "tempe",
      "shape": "flash",
      "date": "2017-07-07T00:00:00",
      "story": "Recurring white flashes Second experience bright white flash of light, original was on 4th of July at or around 8:55pm.   Today, 7/6/17, 7:55 am another white flash. ((NUFORC Note:  Source of the report elects to remain anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/134/S134973.html",
      "state": "AZ",
      "duration": "2 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c7528",
      "summary": "I was 7 years old when it happend.",
      "city": "tempe",
      "shape": "changing",
      "date": "2017-04-28T00:00:00",
      "story": "I was 7 years old when it happend. me and my friend where on a feld trip in first grade and on the bus and we saw it at first it was like a backwards airplane and then it looked like a log and then like a chevron and the clour was a silverish brown and after about 10 minutes it just disapeird like a flash of lightning. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/133/S133866.html",
      "state": "AZ",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c77ce",
      "summary": "Orange/yellow orb near Sky Harbor.  ((anonymous report))",
      "city": "tempe",
      "shape": "circle",
      "date": "2017-11-03T00:00:00",
      "story": "Orange/ yellow orb near Sky Harbor. Facing North on roof top near Sky Harbor air port to the NW orange/yellow Orb dropped out of the sky and stopped about 100ft high then moved to the north toward Camelback Mountain.  There was no sound or air movement.  Lost site after a min behind a wall walked around wall and did not see any craft on that same course. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/136/S136898.html",
      "state": "AZ",
      "duration": "1 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c85d6",
      "summary": "The 26th and 27th my husband and daughter have witnessed a very bright light in the sky. At first it looks like a star but you notice i",
      "city": "tempe",
      "shape": "light",
      "date": "2018-08-31T00:00:00",
      "story": "The 26th and 27th, my husband and daughter have witnessed a very bright light in the sky. At first it looks like a star but you notice its too close to be a star.  It shines very bright then dims. It hovers for quite awhile then moves so slow you can safely tell it has moved.  It stays beside the path of the airplanes .",
      "link": "http://www.nuforc.org/webreports/142/S142866.html",
      "state": "AZ",
      "duration": "30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c996e",
      "summary": "4 lights in formation over Tempe appear while driving",
      "city": "tempe",
      "shape": "formation",
      "date": "2019-10-04T00:00:00",
      "story": "4 lights in formation over Tempe appear while driving At about 8PM on Wednesday October 2nd, I was driving westbound on Elliot rd passing Dobson. I noticed a formation of 3 white lights equal distance apart.  At first it seemed as they might have been planes but they were just too close to each other.  Then I thought maybe flares,  but they didn’t seem to appear to be moving.  Approaching the 101, I noticed a 4th light appear to the left side.  As I turned northbound on the 101, I looked back to take one more look, but they seemed to be gone. . . I couldnt find them in the sky. Took video evidence of the sighting.",
      "link": "http://www.nuforc.org/webreports/149/S149463.html",
      "state": "AZ",
      "duration": "3 minutes"
    }
  ]
}