{
  "city": "toledo",
  "fetch_timestamp": "2025-07-12T14:34:56.281235",
  "record_count": 61,
  "pages_fetched": 3,
  "api_calls": 4,
  "source": "ufo_aficionado_api",
  "records": [
    {
      "_id": "64d005f478aba2ec5a3b549f",
      "summary": "Faint blurred distant points of light traveling through the sky in Toledo, Ohio",
      "city": "toledo",
      "shape": "light",
      "date": "2008-06-12T00:00:00",
      "story": "Faint blurred distant points of light traveling through the sky in Toledo, Ohio We were outside in front of my friends house and looked up and saw a distant point of faint-blurred light moving fast through the sky. It stopped quickly and went backwards for a quick second and turned back in the direction it was going and curved very quickly to a North Eastern heading.  Also a little later after this incident (maybe a half an hour) we saw two glowing lights side by side traveling verrrry fast through the sky to the north and were saw again later on coming from east to west. ((NUFORC Note:  Original date was flawed.  We have amended it above.  PD))",
      "link": "http://www.nuforc.org/webreports/062/S62841.html",
      "state": "OH",
      "duration": "4 Seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b5b98",
      "summary": "Round brightly lit object that changed in size.",
      "city": "toledo",
      "shape": "light",
      "date": "2007-11-28T00:00:00",
      "story": "Round brightly lit object that changed in size My wife and I were on our front porch with 4 neighbors and I looked towards the sky and saw this amazing  bright colored light. It was about the size of a distant full moon and the lights were changing in intensity and size. Sometimes you could see a change in shape as in a fireworks shower. An expansion!  Then it would  go back to it’s original size and the intensity of the lights would dim just a bit.  For a while we were stunned!  But I grabbed the binoculars and got a better look and passed them around the porch. Everyone there saw the same thing.  I ran and got my video camera and started to record. I zoomed it to get the best possible view and proceeded to tape over 25 minutes of footage.  During the time we watched, we saw it morph shape (size and volume) erratic movements never seeming to move far from it’s original position.  The lights,blue,green,red,yellow and white were also changing.",
      "link": "http://www.nuforc.org/webreports/059/S59183.html",
      "state": "OH",
      "duration": "25-30"
    },
    {
      "_id": "64d005f478aba2ec5a3b5bf1",
      "summary": "very bright light in sky fades out.",
      "city": "toledo",
      "shape": "sphere",
      "date": "2007-11-28T00:00:00",
      "story": "very bright light in sky fades out. A BRIGHT LIGHT ABOUT 4X THAT OF A STAR IN BRIGHTNESS AND SIZE. THE OBJECT GREW BRIGHT THEN FADED RAPIDLY.",
      "link": "http://www.nuforc.org/webreports/059/S59168.html",
      "state": "OH",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b62ed",
      "summary": "Unidentified Object Sighted",
      "city": "toledo",
      "shape": "disk",
      "date": "2007-08-07T00:00:00",
      "story": "Unidentified Object Sighted   It looked like a frisbee and had circular lights around with 1 light on top. The saucer, was hovering over the field in front of our apartment. We observed it going very slow moving to the right then to the left then back over our way. It was moving in circular motion and was very quiet. When we went to go chase it, it disappeared, when we returned to our apartment we could instantly see it again. we have been observing it for over 1 1/2 hrs and it is still in the same area and position",
      "link": "http://www.nuforc.org/webreports/057/S57301.html",
      "state": "OH",
      "duration": "90 min"
    },
    {
      "_id": "64d005f478aba2ec5a3b6d2c",
      "summary": "Blinkers and one white light  ((NUFORC Note:  Stars??  PD))",
      "city": "toledo",
      "shape": "light",
      "date": "2007-06-12T00:00:00",
      "story": "Blinkers and one white light Occuring several evenings the past month, there have been flashing lights in the sky.  On May 7th, these events seemed to have hit a climax.  There were 20 plus blinkers, all seeming far away, except for one that hung very low in the sky and did not blink, but when a picture was taken with a digital camera, it seemed to be moving in an erratic pattern.  To the naked eye, it just looked like a huge white star, just above the treeline.  It's brightness made it suspect, so that is when we got out the camera. The blinkers flashed blue and white and there were some that flashed with a bit of red.  We noticed several other aircraft (small planes and helicopters) constantly intercepting their path.  The blinkers did not move when confronted.  The blinkers did move somewhat, but almost like they were in their own little orbit.  Several zoomed in pictures of the blinkers appeared to be a circular craft with 6 lights and one in the center. Each consecutive picture of one blinker showed a different light on the craft lit up, as if rotating lights.  I am interested to see what happens next, over the past month, there have been more and more blinkers present, and last night was really unbelievable. ((NUFORC Note:  Stars??  PD))",
      "link": "http://www.nuforc.org/webreports/056/S56574.html",
      "state": "OH",
      "duration": "all night"
    },
    {
      "_id": "64d005f478aba2ec5a3b7002",
      "summary": "triangular formation of l.e.d.-like blue lights seen in sky over maumee river by large group of people.",
      "city": "toledo",
      "shape": "triangle",
      "date": "2007-10-08T00:00:00",
      "story": "triangular formation of l.e.d.-like blue lights seen in sky over maumee river by large group of people. friends were having a bonfire out on the maumee river (on broadway st. toledo, ohio- very close to the toledo zoo) one noticed a strange triangular formation of electric blue lights which resembled L.E.D lights. the group proceeded to watch as the lights hovered for some time, blinking in some type of pattern, and then moved off into the distance. days later another friend reported that she (jackie), her boyfriend and at least 20 other people on her street had been out the same night, watching the exact same formation. she described the incident entirely before I had even mentioned what the group at the bonfire had seen. a friend of jackie's also reported a few days after the sighting that she a group of her friends had been out in the wilderness near the quarry on lime city road (which is on the other side of the maumee river, in rossford ohio) and encountered what she described as \"an 8 foot tall black, anthropomorphic creature that walked very slowly several feet in front of [her], as if it purposefully wanted to be seen.\"",
      "link": "http://www.nuforc.org/webreports/059/S59001.html",
      "state": "OH",
      "duration": "3 hours"
    },
    {
      "_id": "64d005f478aba2ec5a3b7669",
      "summary": "Unknown Lights above The Maumee River",
      "city": "toledo",
      "shape": "light",
      "date": "2007-10-08T00:00:00",
      "story": "Unknown Lights above The Maumee River I had gotten a phone call on 9-04-07 at 9pm from my cousin who was down at the Maumee river behind Marshall School(near 75). He had told me to come outside and look above Marshall school and tell him if I see weird lights floating in the sky. Sure enough I was looking at the same thing he was. It was a slanted line of about 9 lights all flashing red,green,blue, and white. I ran back to the front door and called my Grandma and Grandpa  to come outside to see what we were looking at. Sure enough they seen it to. I ran back to the house and got the camera. When I came back outside 4 of our neighbors heard us saying \"Oh my god what is that?\" and came outside. They were right along with us with there cameras taking pictures. Nothing showed up on our cameras. All of a sudden the object started to lower very slowly and all of a sudden vanished. We were all just stunned. I came back into the house and downloaded the pictures. Nothing was on them. I Redid the contrast and lightened the pics and sure engough weird lights and speckles were on the pictures. I have some pictures I will be sending you.",
      "link": "http://www.nuforc.org/webreports/059/S59118.html",
      "state": "OH",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b7fa9",
      "summary": "Fire Ball",
      "city": "toledo",
      "shape": "fireball",
      "date": "2009-12-12T00:00:00",
      "story": "At about 8pm on 9-1-09 I was sitting on my porch and looking to the north sky I noticed a large bright white fire ball moving from west to east and it looked to drop to the earth. It lasted about 15 seconds. It also had a long tail. It was about ¼ in diameter at arms length.",
      "link": "http://www.nuforc.org/webreports/072/S72007.html",
      "state": "OH",
      "duration": "15 sec"
    },
    {
      "_id": "64d005f478aba2ec5a3b85f9",
      "summary": "A white circle in the sky just right of the moon.",
      "city": "toledo",
      "shape": "cone",
      "date": "2009-08-05T00:00:00",
      "story": "a white circle in the sky just right of the moon. It was a circle and then turned in to a oval.  The color was a white ring.",
      "link": "http://www.nuforc.org/webreports/070/S70885.html",
      "state": "OH",
      "duration": "4th of july"
    },
    {
      "_id": "64d005f478aba2ec5a3b88de",
      "summary": "i saw a ufo in toledo that i cant explain",
      "city": "toledo",
      "shape": "disk",
      "date": "2008-10-31T00:00:00",
      "story": "i saw a ufo in toledo that i cant explain i was driveing down monroe st at 2.25 in the afternoon.I stop at a light to go over the I-475 highway and i saw a chrome or stainless steel color disk .it had to be abought 1/2 mile up but was strange abught it that when the light turn green i keep looing at it for a 1/2 mile and it never move but when i went to turn to go in the bank at korger store and when i looked up  it was gone and the cloud that was next to was gone it must have been there abought 10.mins .i dont know how long it was there befor i seen it but it did not have any comtrail .so it was not a plane or hellocopterbecaues there was no soung i have not told anyone because i did not want to be pick on and be call something  thanks",
      "link": "http://www.nuforc.org/webreports/065/S65656.html",
      "state": "OH",
      "duration": "4 min"
    },
    {
      "_id": "64d005f478aba2ec5a3b94d0",
      "summary": "I saw bright multi-colored lights hoovering over downtown Toledo.  ((NUFORC Note:  Possible twinkling star.  PD))",
      "city": "toledo",
      "shape": "light",
      "date": "2009-12-12T00:00:00",
      "story": "I saw bright multi-colored lights hoovering over downtown Toledo. It all started when I went outside to quiet my barking dogs. That's when I noticed a bright multi-colored light. It was flashing white,blue and red. It appeared to be hoovering over downtown toledo.The lights were southeast of my location,so it is actually difficult to pin point the actual location.The brightest light appeared to be hoovering and flickering multi-colored lights. There were two similar lights that went in opposite directions and by the way they moved I could tell they were not typical aircraft like helicopters or airplanes. At one point the brightest light went completely out for a period of what seemed a minute or two. The other lights eventually came back towards the main light and then moved away again. It was totally strange. I watched them for atleast a half an hour before the main light faded off into the distance. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD)) ((NUFORC Note:  Possible twinkling star.  PD))",
      "link": "http://www.nuforc.org/webreports/073/S73293.html",
      "state": "OH",
      "duration": "half hour or so"
    },
    {
      "_id": "64d005f478aba2ec5a3b9c2f",
      "summary": "UFO spotted over Toledo, OH, USA. Arc shaped and semi-tranparent.",
      "city": "toledo",
      "shape": "other",
      "date": "2009-05-12T00:00:00",
      "story": "UFO spotted over Toledo, OH, USA. Arc shaped and semi-tranparent. I was standing outside with my mom and fiance.  My mom was in the car already and by the time she got out it was gone.  But my fiance saw it first, she looked up and said \"What’s that?\". I thought she was talking about the big dipper because that's where she was pointing, so I said \"That’s the Big Dipper.\" and she said \"no that\".  Then I saw it looked huge, it was semi-transparent it was arc shape, like  this ( but huge. I couldn't judge well its height very well id say 3000ft up.  It looked like if sat on the ground it would have been several football fields in length at least.  Despite its size it made no sound I could hear, I have good hearing, and so does my fiance.  I'm 20yrs old, and she’s 18. It was quiet outside as well.  It was moving slowly compared to normal aircraft. My mom started the car and the car lights came on, I yelled at her to turn the car off and she did but by the time I turned back around it was gone. My fiance says she thought it kind of flapped slightly like a large slow moving bird mind you she agreed on its size, she said \"If it was a creature it was still the size of several football fields.\" The best way I can explain it is if you took a paper plate, cut out the middle leaving only the curved edges, then cut out a quarter section of the edge giving you a rainbow arc shape, now make it see through, like glass. I could even see the stars through it. I kept looking for it hoping to see it again, but I doubt I will it looked pretty set on its course. I didn’t see it flap and she said it wasn’t very noticeable movement, I think since it was transparent the way it moved in front of the stars did give an appearance of it rippling, I think that might have been what she saw. I hope someone else besides us saw it, it was an amazing sight. Even if it didn’t last long.  As for us, I am a 20 year old Male. I have lived in this city most of my life. I have very good vision, and hearing.  My Fiance is 18 years old, and has also lived here most of her life.  She also has excellent vi! sion and hearing. I'm a normal adult, I spend my time taking care of my dad and hanging out with my friends. My fiance is a senior in High school, and will be graduating this year. We live in a normal city, and I have never seen anything like this as long as I’ve lived here. This is no joke or hoax, if I wanted to make something up id write a book, this was the first site I found to report this so that’s what im doing. Thank you for you time whoever reads this.",
      "link": "http://www.nuforc.org/webreports/069/S69671.html",
      "state": "OH",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3ba2cf",
      "summary": "Redish Glowing Light Moving Across Sky",
      "city": "toledo",
      "shape": "unknown",
      "date": "2009-08-05T00:00:00",
      "story": "Redish Glowing Light Moving Across Sky Red glowing light, looked almost like a red flame flickering.  Moving across the sky from west to east.  Covered 5-10 miles in about 10 seconds or so. Made no noise.",
      "link": "http://www.nuforc.org/webreports/071/S71349.html",
      "state": "OH",
      "duration": "30-45 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3ba738",
      "summary": "Round craft with big bright lights near Toledo,  OH.",
      "city": "toledo",
      "shape": "circle",
      "date": "2009-04-14T00:00:00",
      "story": "Round craft with big bright lights near Toledo Ohio I am a truck driver for UPS and I pull doubles from Richfield, Oh to Chicago, Ill. At 9:55 pm while going west on Route 80 which is the Ohio Turnpike, 28 miles west of Toledo on a clear night with a full moon I saw a large bright light that was stationary and about 2,000 feet up in the northwest sky. It hovered for about 4-5 minutes and in a blink of an eye it was gone. The UFO looked round in shape and had only 1 big bright light.",
      "link": "http://www.nuforc.org/webreports/069/S69581.html",
      "state": "OH",
      "duration": "5 mins"
    },
    {
      "_id": "64d005f478aba2ec5a3baab7",
      "summary": "Triangular UFO with red/blue lights hovering for 3 hours, moving in zig zag motion every 2-3 minutes",
      "city": "toledo",
      "shape": "triangle",
      "date": "2010-11-21T00:00:00",
      "story": "Triangular UFO with red/blue lights hovering for 3 hours, moving in zig zag motion every 2-3 minutes At approximately 23:00, I let my dog outside before we went to sleep.  Someone earlier in the night had reported this as well, but I looked up to the sky and saw exactly what they did.  The aircraft was triangular in shape with red and blue lights that blinked, and every 2-3 minutes it would zig zag and return back to it’s original position. I walked back inside the house after about 10 minutes and returned about 5 minutes later, and it had moved further west.  Still rotating and hovering, the lights still blinking, I called the non-emergency hotline for Toledo, OH and reported it.  Once I walked back outside, it had moved even further west/southwest and was hovering. This object is still out there at 2:59.  I attempted to take a photograph with my camera (Canon Rebel), but was unable to capture the image.",
      "link": "http://www.nuforc.org/webreports/077/S77756.html",
      "state": "OH",
      "duration": "3 hours"
    },
    {
      "_id": "64d005f478aba2ec5a3bb72a",
      "summary": "5 amber lights in a V-shape seemed stationary then dissapeared",
      "city": "toledo",
      "shape": "triangle",
      "date": "2010-07-19T00:00:00",
      "story": "5 amber lights in a V-shape seemed stationary then dissapeared Around 11:00- 11:30 pm, I was laying in bed, turned to place an item on my nightstand.  I noticed through my blinds in the sky 5 amber lights hovering from my vantage point approximately where the I-75, I -475 interchange occurs.  It disappeared within a minute of me noticing it.  My wife did not make it in time to see it.  It really freaked me out, because I know my view from my side of the bed, a whole lot of nothing, no trees, no houses, no anything.",
      "link": "http://www.nuforc.org/webreports/076/S76528.html",
      "state": "OH",
      "duration": "1 Minute"
    },
    {
      "_id": "64d005f478aba2ec5a3bb76b",
      "summary": "3 horseshoe appearing lights attached to a military type aircraft",
      "city": "toledo",
      "shape": "other",
      "date": "2010-07-19T00:00:00",
      "story": "3 horseshoe appearing lights attached to a military type aircraft I saw what looked to be red glowing horseshoe shape lights coming from the northwest about tree top level.   It flew over the garage and appeared to be some military type aircraft shape flying at a high angle of attack (almost vertical) maybe the flaps were arranged for slow flight.   The only sound it made blended in with the natural sounds of wind only it was like a woooosh , but soft.  It was heading in a southeasterly direction.   My first thought was  it was from the 180th, but maybe it wasn't one of ours.  Or maybe it was a training mission...do not know.   It did appear to have some way of being hidden from veiw and at times all you could see was the red lights (3) and occasionally, I did see the shape of the aircraft because of the contrast in the sky...the aircraft appered to have no other lights on but the 3 red ones in the back which could have been maybe heat from the engines.",
      "link": "http://www.nuforc.org/webreports/076/S76652.html",
      "state": "OH",
      "duration": "20 sec"
    },
    {
      "_id": "64d005f478aba2ec5a3bbdfa",
      "summary": "White light in NW ohio",
      "city": "toledo",
      "shape": "light",
      "date": "2011-10-10T00:00:00",
      "story": "White light in NW ohio At approx 23:25 I turned off the tv and lights to go to bed. I live on the 12th floor and had sat down by the window to smoke a cigarette before going to bed.  I then noticed a light in the distance. At first I thought it was a plane because it looked similar in size and had flashing lights.  I then thought to myself that the object, if a plane, was moving at an enormous rate of speed across the sky and then suddenly it came to a complete stop and just hovered there for approx 10min before suddenly disappearing.    Growing up near an airport I've seen prob 1000's of planes and have never seen anything with that kind of speed nor have I ever seen anything come to a complete stop like that.",
      "link": "http://www.nuforc.org/webreports/083/S83559.html",
      "state": "OH",
      "duration": "15min"
    },
    {
      "_id": "64d005f478aba2ec5a3bca13",
      "summary": "Spinning cluster of very bright red, blue and yellow lights in the Western sky.",
      "city": "toledo",
      "shape": "cylinder",
      "date": "2011-08-07T00:00:00",
      "story": "Spinning cluster of very bright red, blue and yellow lights in the Western sky. Toledo, Ohio  At about 1:30 am...the father of a child my daughter was babysitting, came to pick his son up. While the dad was putting the car seat in, I noticed a very bright \"spinning\" light in the Western sky which appeared to have red, blue and yellow lights. My 16 year old daughter observed the object as did my 14 year old daughter and my 83 year old mom. I had my daughter run in and get my binoculars but the object was so far away that all I could see were very bright spinning lights...very intensely bright lights tightly packed and spinning. (As I was focusing the binoculars on the object...my 16 year old said she saw  a \"Shooting Star\" zoom across the sky, North to South and that it looked like shooting stars she had seen before.)  The object moved upward, then to the North at a very steady and very slow  pace.  I  went in the house to get my good camera....when I returned outside, the object  was gone. This is the first time I have reported a sighting of this kind but I have seen this same exact type of object before...I recognize the lights and the spinning nature of them.  Previous sightings were closer and Eastward and I could make out that the shape of the object, emitting the lights, was a vertical spinning capsule shape.",
      "link": "http://www.nuforc.org/webreports/082/S82798.html",
      "state": "OH",
      "duration": "15-20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bca49",
      "summary": "Amber lights seen in the distant sky, moving together before \"flying\" away.",
      "city": "toledo",
      "shape": "light",
      "date": "2011-08-07T00:00:00",
      "story": "Amber lights seen in the distant sky, moving together before \"flying\" away. Driving down a road last night, I witnessed a series of round amber lights in the sky.  These lights were not directly overhead, but were in the sky, in the distance (northeast direction - towards Michigan).   These lights were large enough to guarantee they were not stars / planets, and then they began to move in the air, converging towards one another.   Since we were driving, some trees obstructed our view until we reached a place where we could continue to see the lights and actually exit the vehicle.  Once we parked, the lights began to move futher away, and within 10 seconds were no longer visible to our eyes (indicating they were moving at a significant speed).  I have never witnessed anything like that before, and I cannot speculate what else it could have been.",
      "link": "http://www.nuforc.org/webreports/082/S82857.html",
      "state": "OH",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bd1b8",
      "summary": "Orange/red no sound pulsating, moves fast and smooth",
      "city": "toledo",
      "shape": "fireball",
      "date": "2012-10-30T00:00:00",
      "story": "orange/red no sound pulsating, moves fast and smooth 2 objects, orange/red, pulsating light, moves fast and smoothly, no sound heard, suddenly disappeared",
      "link": "http://www.nuforc.org/webreports/093/S93169.html",
      "state": "OH",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bd7a6",
      "summary": "Once again seeing star like objects traveling through the sky, some going south to N,others going north to S in the same path.",
      "city": "toledo",
      "shape": "light",
      "date": "2012-08-05T00:00:00",
      "story": "Once again seeing star like objects traveling through the sky ,some going south to north,others going north to south in the same path.  We also saw two get really bright for a moment then return back to normal star like size.  One last night changed direction two times.Two were traveling very fast,the others slower,taking a minute to pass us.  And we also saw something pulse 4 times like a electric  haze looking type of light blue-green in color,but dim, then nothing,that was a first of that kind of sighting.  When viewing these in binoculars they appear to be slightly orangeish in color. I have checked satellite info,and these dont match up,plus some travel in the same path it seems in different directions. Also, we have noticed an increase in planes in our are lately too,maybe just a coincidence.It seem some are just flying back and forth alot,these are much higher in the sky. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/090/S90868.html",
      "state": "OH",
      "duration": "1 hour"
    },
    {
      "_id": "64d005f478aba2ec5a3bdb7f",
      "summary": "Bright red and green lights se of toledo ohio",
      "city": "toledo",
      "shape": "circle",
      "date": "2012-08-05T00:00:00",
      "story": "bright red and green lights se of toledo ohio we where traveling south on i 75 south out of toledo ohio.  when the passenger in my truck said did you see those red and green lights in a circle . and i reply you mean those cell towers  at that time they where obscured by trees close to the highway  about that time we passed the woods and i saw several green and red very bright lights to the east. there where 2 lights at aprox 4 to 5000 k feet one red and one green then below aprox 12 to 14 alternating red and green lights forming a large circle below desending to ground then rising to the two at the top we stop to video the event but neither of our cell phones would work these lights were very clear and bright.  the traffic was heavy so we had to keep moving if any one seen these lights and can explain them please post what that they where thanks.....",
      "link": "http://www.nuforc.org/webreports/091/S91061.html",
      "state": "OH",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3be009",
      "summary": "2 Orange lights moving South",
      "city": "toledo",
      "shape": "light",
      "date": "2012-07-04T00:00:00",
      "story": "2 Orange lights moving South Saw an Orange globe moving South, from the North, at moderate speed, no noise, and steady light, about the size of a fist, extended arm. 30 seconds to a min., later another appeared from the same location moving South, no noise and steady light. Open area, few trees.",
      "link": "http://www.nuforc.org/webreports/090/S90140.html",
      "state": "OH",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3be100",
      "summary": "White star in sky flashing blue and red lights staying in one spot",
      "city": "toledo",
      "shape": "circle",
      "date": "2012-10-30T00:00:00",
      "story": "White star in sky flashing blue and red lights staying in one spot ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/093/S93837.html",
      "state": "OH",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3be2aa",
      "summary": "Orbs in a circle and star like objects",
      "city": "toledo",
      "shape": "sphere",
      "date": "2012-10-30T00:00:00",
      "story": "Orbs in a circle and star like objects My neighbor was outside and noticed some lights in the sky.  There were 5 orbs flying above our street,at times over my house.  I was on my way home at the time but they had gone by the time I arrived home.    She said the 5 were in a circular formation about 200 ft high, sometimes an orb would cross to the opposite side of the circle.   Then she noticed 5 objects higher in the sky that looked like 5 pointed stars.   They travelled from south to north and disappeared.",
      "link": "http://www.nuforc.org/webreports/093/S93945.html",
      "state": "OH",
      "duration": "45 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3be454",
      "summary": "Star like ufo",
      "city": "toledo",
      "shape": "light",
      "date": "2012-07-04T00:00:00",
      "story": "Star like ufo We have witnessed these the last two days.  They appear to be stars,but move across the sky in different directions,and appear to at very high altitudes.  Some are so high they are barely visible.We witnessed them on 06/29/12 where we saw 3 in one half hour.  Last night we saw 6 in a half hour. They move quite fast for being so high up.  They are white in color just like stars. We often sit out and watch the sky ,relax in the evening,we have never seen this before at all. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/090/S90297.html",
      "state": "OH",
      "duration": "30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3beb2c",
      "summary": "Bright sphere of white light above the Moon moving North, changed to point of light & disappeared while moving North in Eastern sky.",
      "city": "toledo",
      "shape": "light",
      "date": "2012-02-10T00:00:00",
      "story": "Bright sphere of white light above the Moon moving North, changed to point of light & disappeared while moving North in Eastern sky. At 7:52 pm EST Looking East at the Moon two fists above the Moon I saw a sphere of bright white light. It looked liked it rotated and glowed brighter for a second when I first noticed it.  The sphere then started moving North (left) towards and directly in the middle between the two stars Mabsuthat and Maculosa.  Half the distance from the Moon and the two stars it turned into a dim point of light moved a little more left (North) and then disappeared before reaching the two stars.  There seemed to be a round patch of sky that I couldn’t see through that it disappeared into.",
      "link": "http://www.nuforc.org/webreports/087/S87065.html",
      "state": "OH",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3becb2",
      "summary": "Lights circling over Iowa.",
      "city": "toledo",
      "shape": "light",
      "date": "2013-08-30T00:00:00",
      "story": "Lights circling over Iowa. Ok this is a freaky and true story:  We decided to have a hot dog roast tonight so my brother started a little fire out back. We were telling stories and such then all of a sudden Willie was looking in the sky... The sun had gone down by now and the stars were bright .... He was saying \"look.at that plane...\" And telling us where to look .... Pretty soon we were all looking up and just to the northeast of where we were sitting we saw this plane and we watched it go past this bright star... Except it wasn't a star.... It was a bright light but it was going in circles....not rotating but moving in circles.... Soon another light appeared beside the rotating light and started moving away!!!!!!  I tried to capture with my phone but its no good in the dark.... My bro took out his binoculars and we could see the light moving to the south and it had two smaller companions beside it moving in the same fashion.  Idk if the plane that passed by it noticed it or not but it was freaky.",
      "link": "http://www.nuforc.org/webreports/100/S100443.html",
      "state": "IA",
      "duration": "15"
    },
    {
      "_id": "64d005f478aba2ec5a3bee72",
      "summary": "2 bright orange lights.",
      "city": "toledo",
      "shape": "fireball",
      "date": "2013-08-30T00:00:00",
      "story": "2 bright orange lights Noticed a bright orange light as it cleared the trees to the west of my position.   Visually tracked the object as it traversed the entire visible portion of the sky until my view was obscured by trees to the east of my position.   Object next passed directly above me and made no sound and did not display any navigational lights.   Approximately 2 minutes later a second object appeared in the west and followed the same flight path as the first object.   The objects were orange in color and reminded me the the same orange hue of a pressure sodium bulb.  The light of the objects didn't appear emanate from their  center, but appeared to surround the center like a halo.",
      "link": "http://www.nuforc.org/webreports/101/S101591.html",
      "state": "OH",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3befec",
      "summary": "Star like objects",
      "city": "toledo",
      "shape": "light",
      "date": "2013-08-30T00:00:00",
      "story": "Once again, sitting outside ,nice clear night,first sighting was two star like objects following each other, then dimmed at the same point, and I could not see them, we then saw 5 more, 2 got brighter for a moment, then dimmed back to small star size. We have not seen them following each other until this year, and we have been following them for 2 years now.  I have our kids ,and some neighbor kids now watching too, and my daughter told me, her friend and her saw one going fast across the sky,get brighter ,then dim to barely noticeable. Last weekend we spotted 3 in an hour or so while having a bonfire.We see these almost every night,and I don't know if nobody else is seeing them,or they just haven't or don't want to report it.We have seen the orange/glowing ones that are reported in Michigan too, as have my kids and their friends. Last night there were a good amount of planes in the air too,one of these star objects zoomed right in front of one.But they do appear as stars, as seem just as high, I'm working to get a good camcorder and will be making videos soon to document this even further. I've seen the other reports north of me and west, and they are being spotted, but why not more people?  I'm beginning to believe most of society is too distracted to notice these.",
      "link": "http://www.nuforc.org/webreports/100/S100877.html",
      "state": "OH",
      "duration": "30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bf375",
      "summary": "Orange orb type object-Star like objects almost daily.",
      "city": "toledo",
      "shape": "oval",
      "date": "2013-07-03T00:00:00",
      "story": "Orange orb type object-Star like objects almost daily We have been seeing star like objects and reporting them since last year,and it seems they are using the north star for navigation or a guide,we live almost directly under the north star,depending on the time of year of course. None ever flash,look just like a small star,move at different speed.  Most are traveling north and south and east to west in the path of the north star,just like sailors use it.  Most seem to be going north.  Saturday we were out having coffee, barely watching the sky, and an orange orb/light came out of the east ,pulsing and emitting an orange light like a candle would in the dark,It turned 90 degree,and we saw it had two lights,both were pulsing,not flashing,no other lights could be seen,but the whole thing was glowing it was so bright,it then headed north in the path of the north star .It also appeared to get larger the more we watched it as it headed north.We could not make out a body on the object,although it wasnt far from us,it appeared slightly oval due to where the lights were positioned.As soon as it was too far too see,due to the clouds,and &quot;airplane&quot; coming from the the north to the south appeared ,and seemed to be in the same location/elevation,and it headed back the same way the lights came from.We could see the FAA lights on the &quot;airplane&quot;. Also we seen one star like object that night in a short time that we were out,and poor visibility.",
      "link": "http://www.nuforc.org/webreports/098/S98551.html",
      "state": "OH",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3bf3d2",
      "summary": "Very bright blue light lit up the night and a huge orange fiery glowing object that hovered over the house.",
      "city": "toledo",
      "shape": "oval",
      "date": "2013-10-14T00:00:00",
      "story": "Very bright blue light lit up the night and a huge orange fiery glowing object that hovered over the house. We were all sitting outside saying goodbye after my twin daughters birthday party.  Then we all noticed that the area was lit up a bright blue.   So, we walked across the street to the football field to see if the big football lights were on, but they were not.   We then turned around to go back across the street and saw a huge orange glowing object hovering over our tree and neighbors house.   We were all amazed; then it shot off in the one o clock direction and instantly gone as soon as we noticed it.",
      "link": "http://www.nuforc.org/webreports/102/S102922.html",
      "state": "OH",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bf41b",
      "summary": "Star like objects",
      "city": "toledo",
      "shape": "light",
      "date": "2013-07-03T00:00:00",
      "story": "We spotted 7 &quot;star like objects &quot; 4 going south to north,2 east to west, 1 north to south.  Once again these seem to be following the path of the northstar,and as usual they head north towards Michigan/Canada.  The ones traveling east to west also are very close to the north star.  All were about 5 minutes apart,and at different speeds.They look just like a small star,and can travel very fast  to a slow pace. No other blinkng lights ever on these. Last night 06/11/13 we only saw 1 in about a 20 minute time frame.  Most nights we see them every 5 minutes,sometimes not so many even with good visibility from time to time.  These objects would be traveling almost parallel with I-75 and I-80 when going east /west.We less than a mile from I-75,and maybe 1.5 miles from I-80.",
      "link": "http://www.nuforc.org/webreports/098/S98597.html",
      "state": "OH",
      "duration": "45 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bf6df",
      "summary": "3 lights in large triangle formation hovering and a 4th travelling west to east.",
      "city": "toledo",
      "shape": "light",
      "date": "2013-09-09T00:00:00",
      "story": "3 lights in large triangle formation hovering and a 4th travelling west to east I was standing on my porch facing west and saw a red light with a blue light on top travelling from the west to east.  I could also see a rotating white light on this object.  I went outside and looked to the north and high in the sky about 90 degrees was a large triangle formation with 3 of the same lights.  Where I stood viewing these lights the garage blocked my view from the original light.  I moved back to where I could see that light and it was gone.",
      "link": "http://www.nuforc.org/webreports/101/S101922.html",
      "state": "OH",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bf888",
      "summary": "A large  rotating UFO over the coast of Oregon with smaller orb like lights",
      "city": "toledo",
      "shape": "light",
      "date": "2013-05-15T00:00:00",
      "story": "A large  rotating UFO over the coast of Oregon with smaller orb like lights last night at 10:15 p.m.  My husband stepped outside for a smoke. In the sky above the ridge line was an enormous pulsing light. Red, yellow, blue, orange.... It kept flashing. My husband grabbed the binoculars to see if he could get a better view. He positioned the binoculars on the railing of the porch and took a look.  The lights were rotating around, the object was spinning.  Then a small light began to drip (Like melting wax on a candle) a singular droplet of light started to descend to the tree line. It moved so very slowly.  Slow like 1/10 the speed of a feather falling  When it reached the level of about half the height of the trees trunks height it zoomed to the west.  Still visible the light flickered as it passed between the trees.  Then another began to fall from the ship, as slow and steady as the last. They looked like white glowing orbs.   The size of baseballs to me.  Then the lights shot through the trees in many directions, before returning back to! being beneath the big rotating lights, which had been steadily moving North (the size of 2 basketballs).  This continued until I had visually counted 6, my husband watching along side me. Then just as they had descended, like rewind but very very slowly the lights ascended back to the bright rotating lights. When the last white glowing orb was absorbed the entire thing vanished. This lasted over 20 minutes. We called a friend to see if he could see it or come to watch from our house because the view was so astonishing. We were on the phone with him almost the entire time. Then about 30 minutes later we stepped back out to see if it was back, and we watched what we thought was possibly a satellite move slowly over the house, but just as my husband was explaining why he thought this was a satellite it swerved very quickly and vanished.",
      "link": "http://www.nuforc.org/webreports/097/S97348.html",
      "state": "OR",
      "duration": "25-30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bfacc",
      "summary": "Seven Fireball-like objects spotted in Toledo, Ohio",
      "city": "toledo",
      "shape": "fireball",
      "date": "2013-05-15T00:00:00",
      "story": "Seven Fireball-like objects spotted in Toledo, Ohio On the evening of April 26, 2013, Myself along with three other adults and five children were enjoying an evening on the neighbor's porch.  At approximately 10:15 p.m. one of the children yelled, \"UFO!\"  We all looked into the sky (Southeast) and saw what appeared to be a fireball making a straight line from the horizon.  Directly behind it, another appeared and then another, until there were six.  Eventually, a seventh emerged, following the same path.  They moved slowly, about the pace you would expect a very high jet to move across the sky.  They followed a straight path moving in a Northward direction and then one by one rose up into the sky and disappeared.  None of us could come up with any explanation of what these could be.  Initially, I thought they were Chinese lanterns but they were far too precise in their path and coordination.  Oddly, no sound was observed as these objects crossed the sky.",
      "link": "http://www.nuforc.org/webreports/097/S97456.html",
      "state": "OH",
      "duration": "3-4 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c07a8",
      "summary": "Radiant glowing indigo orb seen dancing near I-5 in southern Washington state, 12/23/13.",
      "city": "toledo",
      "shape": "light",
      "date": "2014-01-10T00:00:00",
      "story": "Radiant glowing indigo orb seen dancing near I-5 in southern Washington state, 12/23/13. HD video posted here: http://www.youtube.com/watch?v=YPAJJd2XPds   My wife and I were driving north in Washington State on I-5 toward Seattle when we saw a bright indigo light--about as bright as airplane landing lights--ahead of us in the night sky at approximately 9:38pm, Monday, 23 December 2013.  I initially thought it might be a tower light on a hill, but it wasn't blinking, and as we got closer it became apparent that there were no hills; a large, radiant orb hovered high above the freeway against a clear and starry sky.  As I kept driving toward it, the light moved slowly toward the southeast and out of my field of view, though my wife could still see it from the passenger's seat.  She watched it for a minute and then told me to pull the car over (as we passed through Toledo, WA, because the object was getting closer and was definitely anomalous. For the next three minutes, as caught on video, we watched it from the side of I-5, facing northeast, where it silently floated around Jupiter to the left of the Orion constellation, putting on quite a show.  Our limited iPhone cameras did a poor job capturing what we actually witnessed, missing the star-filled backdrop, the nearby farm house, trees, and horizon, and not really capturing how pretty and bright it was, which was significantly brighter than Jupiter and maintained a steady luminosity throughout the duration of the sighting, apart from its slow color changes (mostly blue, violet, and green, with a bit of red and yellow appearing briefly as it shifted colors).  It also seemed to emit two very faint searchlights pointing downward a couple of times, though I couldn't be certain.   After a couple of minutes, it floated down toward the earth and drifted slowly toward the southeast behind some trees, perhaps disappearing into the nearby river valley, or perhaps simply disa! ppearing. I took some still photos, included at the end of the video, though they all look different, suggesting either the limitations of the iPhone 4S camera (such as one photo that looks like blurred movement) or that the object was changing shape as it moved. This is my third UFO sighting since 1995, and my first nighttime sighting. I don't know if it was manmade or not, though I suspect most UFOs are.  All I know is that it seemed big given the apparent height and distance (judging by the tree line that it floated behind), was brighter than most aircraft lights appear at such heights (and certainly more colorful), and made no sound as it slowly and surreally looped about, dancing in the sky.",
      "link": "http://www.nuforc.org/webreports/105/S105669.html",
      "state": "WA",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c09f6",
      "summary": "Black triangle slowly flew over us, almost silent, and directly changed course, descended into wooded area",
      "city": "toledo",
      "shape": "triangle",
      "date": "2013-11-11T00:00:00",
      "story": "Black triangle slowly flew over us, almost silent, and directly changed course, descended into wooded area We saw an aircraft with bright white lights hovering in this distance. We stood and watched it for a couple min and it flew over top of us, not too far above the trees.  It was a black triangle with blue and white lights.  We felt the wind as it passed.   It was mostly silent; only a slight hum could be heard. It flew in the pattern of an \"L\" shape and started to descend in the distance in a wooded area.  We actually took a drive to try to find it but was unsuccessful.  When we arrived home after not being able to locate the UFO,  We noticed two fighter jets and a black helicopter flying in the direction the UFO had gone.",
      "link": "http://www.nuforc.org/webreports/104/S104319.html",
      "state": "OH",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c0b30",
      "summary": "",
      "city": "toledo",
      "shape": "oval",
      "date": "2014-01-24T00:00:00",
      "story": "Sitting on porch at night - 4-5 fighter jets circling neighborhood at extreme low levels - - than see out of corner of my eye a ball of light dripping sparks-do not remember anything after that.",
      "link": "http://www.nuforc.org/webreports/106/S106493.html",
      "state": "OH",
      "duration": "2:00"
    },
    {
      "_id": "64d005f478aba2ec5a3c0b72",
      "summary": "Objects in sky move at incredible speed",
      "city": "toledo",
      "shape": "light",
      "date": "2014-02-07T00:00:00",
      "story": "Objects in sky move at incredible speed. My wife and I were out in my front yard getting some air after watching a movie.  I noticed some odd lights very high in the sky moving as if deciding where to go next.  There was one directly over us and two off in the distance circling one another as if the two of them were watching something on the ground.  You could tell they were moving in circles because of the pattern the lights were following as far as brightness and speeds of movement.  These two circled each other for a while and the other disappeared for a minute.   It then reappeared near the same spot as if the light went out then came back on a minute later. It moved forward, made a ninety degree turn, moved a bit farther then shot off in the direction of the other two at an unbelievable speed.   As it reached the other two it made a half circle around them at speed and moved on in that direction for a good distance.  We lost sight of it and as fast as it left sight it reappeared again behind us crossin! g the sky very very fast. It made no sound and left no trail.  It proceeded towards the other two again at speed and as it approached them it stopped on a dime just outside of the other two.  The two that were circling just sort of stopped and were suddenly gone.  The third again shot off at a speed that just seemed unbelievable to us.  This lasted about 8 – 10 minutes. ((NUFORC Note:  Witness indicates that the date of the incident is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/106/S106971.html",
      "state": "OH",
      "duration": "8-10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c33bc",
      "summary": "Green lights over the sky of Toledo, Ohio.",
      "city": "toledo",
      "shape": "flash",
      "date": "2015-03-20T00:00:00",
      "story": "Green lights over the sky of Toledo, Ohio. I deliver food for a company in Toledo, Ohio, and I saw a bright flash of light in the sky twice in about 10 seconds or so and it was green in color I have never seen anything like it before it was also reported on the news the same day and I heard someone got the flash on camera so me and my girlfriend weren't the only ones that saw it",
      "link": "http://www.nuforc.org/webreports/117/S117839.html",
      "state": "OH",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c3847",
      "summary": "Moving objects in the sky.",
      "city": "toledo",
      "shape": "",
      "date": "2015-01-16T00:00:00",
      "story": "Moving objects in the sky. I was laying in bed when I see out the corner of my window what looks like a blinking star, but then it starts to move, so I wake up my mom and even she can see it,  it starts to move from side to side back and forth hiding behind clouds and we are still seeing it now it's just blinking and it's really bright not like any star I have ever seen, and we can see another one not to far away doing the same thing blinking it's like there in some sort of line and there just blinking moving back and forth side to side",
      "link": "http://www.nuforc.org/webreports/116/S116684.html",
      "state": "OH",
      "duration": "30- NA"
    },
    {
      "_id": "64d005f478aba2ec5a3c3906",
      "summary": "Bright orange light moved back and forth over toledo 4 to 5 times then disappeared.",
      "city": "toledo",
      "shape": "light",
      "date": "2015-01-07T00:00:00",
      "story": "Bright orange light moved back and forth over Toledo 4 to 5 times, then disappeared. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/116/S116504.html",
      "state": "OH",
      "duration": "15 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c39b2",
      "summary": "Dripping sparks.",
      "city": "toledo",
      "shape": "fireball",
      "date": "2014-12-12T00:00:00",
      "story": "OrBall light dripping sparks  no sound - fighter jets so low thought they would crash … ((NUFORC Note:  We are uncertain as to whether this is a serious report.  PD))",
      "link": "http://www.nuforc.org/webreports/115/S115933.html",
      "state": "OH",
      "duration": "2:00"
    },
    {
      "_id": "64d005f478aba2ec5a3c3b62",
      "summary": "Watched 2 fireballs disappear/reappear, turn red then vanish.",
      "city": "toledo",
      "shape": "fireball",
      "date": "2015-07-06T00:00:00",
      "story": "Watched 2 fireballs disappear/reappear, turn red then vanish. I was turning into my shop parking lot when I noticed 2 extremely bright lights/fireballs in the sky, they were both slowly heading east, to my amazement one of them disappeared for a few seconds the reappeared then turned red in color, it sped up going east then vanished.   The 2nd fireball did exactly the same thing except it headed north then disappeared.  I am a ((fifty-ish year old male, work ((deleted)) emergency and ((deleted)) at ((college)), I have been employed by for ((several decades)).",
      "link": "http://www.nuforc.org/webreports/120/S120000.html",
      "state": "OH",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c403f",
      "summary": "What seemed like a star blinked twice then a bright redish orange orb like light appeared from other side of the sky heading towards th",
      "city": "toledo",
      "shape": "light",
      "date": "2015-05-29T00:00:00",
      "story": "What seemed like a star blinked twice then a bright redish orange orb like light appeared from other side of the sky heading towards the blinking star at a steady pace then vanished after about two minutes. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/119/S119139.html",
      "state": "OH",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c463d",
      "summary": "Too close to be shooting star and too bright and close to be landing plane.",
      "city": "toledo",
      "shape": "light",
      "date": "2015-11-06T00:00:00",
      "story": "Too close to be shooting star and too bright and close to be landing plane. Saw a big bright light just appear and fall out of the sky.  No crash, no sound, nothing.  Not one word of a plane crash on the news. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/123/S123304.html",
      "state": "OH",
      "duration": ":30"
    },
    {
      "_id": "64d005f478aba2ec5a3c46f3",
      "summary": "Pulsating red, green blue hovering objects. Watched them for over and hour.",
      "city": "toledo",
      "shape": "unknown",
      "date": "2015-11-06T00:00:00",
      "story": "Pulsating red, green blue hovering objects. Watched them for over and hour. We have been seeing UFOs over our area for the last several weeks.  They are hovering to the north, south and west.  There were 12 a few weeks ago and 6 tonight.  They have a pulsating red, green and blue light flashing.  We also saw one moving for the first time.  Was moving in a straight path very quickly.  We see them clearest right after the sun has completely set.  A few weeks ago I saw a white object touch multi-colored object then move away. ((NUFORC Note:  Witness elects to provide no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/123/S123283.html",
      "state": "OH",
      "duration": ">1 hour"
    },
    {
      "_id": "64d005f478aba2ec5a3c55b9",
      "summary": "There was a circle white light moving slowly in sky. Then 3 jets after another circled after it and then right by one of the jets when",
      "city": "toledo",
      "shape": "circle",
      "date": "2016-07-08T00:00:00",
      "story": "There was a circle white light moving slowly in sky.  Then 3 jets after another circled after it and then right by one of the jets when we were watching it movie it shot really fast like a shooting star and disappeared.  So then the jets left.  Then again from a different area the white circle appeared again moving and three more jets again.  This is our first sighting and it's scary and amazing at the same time.",
      "link": "http://www.nuforc.org/webreports/128/S128144.html",
      "state": "OH",
      "duration": "60 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c581f",
      "summary": "Shape looked like a snake.  It changed form several times.  Definitely not a balloon.  I have photos.  No explanation for this.",
      "city": "toledo",
      "shape": "other",
      "date": "2016-06-10T00:00:00",
      "story": "Shape looked like a snake.  It changed form several times.  Definitely not a balloon.  I have photos.  No explanation for this, it was well over 2 thousand feet easily.   Changed form over and over but remained stationare at that altitude",
      "link": "http://www.nuforc.org/webreports/127/S127677.html",
      "state": "OH",
      "duration": "30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c665a",
      "summary": "Swarm of jet-black spheres near Lake Erie darting around in broad daylight.",
      "city": "toledo",
      "shape": "sphere",
      "date": "2016-08-02T00:00:00",
      "story": "Swarm of jet-black spheres near Lake Erie darting around in broad daylight. I have a similar sighting from one in Toronto.  I thought they might be buzzards or black balloons caught in an updraft.  Too freakin weird though.  We were driving in a restricted lane construction zone southbound and I started looking around because our two 3G devices jammed simultaneously.  The jammed phone is my camera, otherwise I would have photographed them, even though they disappeared after 10 seconds.  Saturday evening on I-75 just south of the I-280 ramp, east of the highway over some industrial buildings or perhaps further away, looking over near the old Jeep Parkway. 20 -30 swirling and darting jet-black spheres slowly rising like a moving swarm.  In the foreground I saw birds of similar relative apparent size that were much closer.  My thoughts went from birds, to balloons, to \"I don't know what they could be besides balloons, it must be a tangle in the wind\".  I called attention to them, and looking back, they were gone.  I thought maybe the! y were obscured by clouds, but the way they moved it didn't make sense already because there was minimal wind at the time.",
      "link": "http://www.nuforc.org/webreports/128/S128954.html",
      "state": "OH",
      "duration": "12 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c6a56",
      "summary": "A faint line of light was moving east to West,in the northern sky, at a fairly high rate of speed. It got slightly to the west of my po",
      "city": "toledo",
      "shape": "other",
      "date": "2017-02-22T00:00:00",
      "story": "A faint line of light was moving east to West,in the northern sky, at a fairly high rate of speed.  It got slightly to the west of my position and approximately 8-10 objects appeared in the line of light.  All were in a straight line except one of them.  The other was along the lead one in the line.  The light was more like a glow around the formation.  The objects seemed to have sort of a hex shaped front end with straight sides with rounded off corners in back of objects.",
      "link": "http://www.nuforc.org/webreports/132/S132730.html",
      "state": "OH",
      "duration": "4 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c746b",
      "summary": "Looking at at the sky watching a couple hawks circling the air. I noticed a slow moving bright object in the sky.",
      "city": "toledo",
      "shape": "other",
      "date": "2017-05-15T00:00:00",
      "story": "Looking at at the sky watching a couple hawks circling the air.  I noticed a slow moving bright object in the sky.  Since we were watching hawks, I had a pair of binoculars and tried to get a better look.  I saw a circular shape center with what appear as two arms out with small object attached reflecting in the sun.  Object was to the east with the sun to the west.   I could not get a good photo with my iPhone, but did take a photo of the sky if anyone can clean up the image.   In the evening we can see satellites going overhead, but this looked too low.  With the amount of airplanes that fly overhead this looked too high.  It was hard to judge without another object in the vicinity.  My only thought is that it is a balloon, a satellite or something else.  I was hoping that someone else may have saw it.  Just seemed to float by for roughly 10 minutes.  Conditions were sunny, clear skies, light breeze.  Just hope that someone else saw it, and can give a good explaination.",
      "link": "http://www.nuforc.org/webreports/134/S134112.html",
      "state": "OH",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c76f3",
      "summary": "7 orange crafts in formation with Sonic like boom sounds around the same time of sighting",
      "city": "toledo",
      "shape": "formation",
      "date": "2018-01-12T00:00:00",
      "story": "7 orange crafts in formation with Sonic like boom sounds around the same time of sighting 7 orange low altitude craft flying in close formation.  Sonic booms were heard in the area around the same time of sighting by different witnesses. ((ADDENDUM FROM WITNESS)) Hi there, sorry for the delay.  I am attaching pictures for you.  I unfortunately was not a witness but was told of the event as I went the opposite way home as the witnesses.  The booms were heard from my daughter and family, and the timing was spot on. As for the pictures, my friend who took them said objects were orange and low in the sky. When she saw pictures they look far away and are white.  She said they looked like they had tails.  She doesn't remember any sounds. I hope this helps and I'd like to know if any other sightings we're reported in the area. ((END ADDENDUM))",
      "link": "http://www.nuforc.org/webreports/138/S138331.html",
      "state": "OH",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c80ff",
      "summary": "Fake plane.  ((NUFORC Note:  Possible military transport aircraft at low altitude??  PD))((anonymous report))",
      "city": "toledo",
      "shape": "other",
      "date": "2018-03-08T00:00:00",
      "story": "Fake plane. My wife child and I were leaving church and the car started and had other cars behind us forcing us to wait for a minute.  I was facing East, when looking up for no reason other than just to to see if there were any clouds.  I didn’t see a shadow, hear a noise, see anyone else looking up, or anything to cause me to look up or expect to see anything other than blue sky. I saw a flat “battleship-gray” dual-engine military cargo plane banking from a southwesterly direction to a westerly heading.  I would not have thought anything about it if not for the fact it was obviously very low, slow, and miniature in scale.  It was also silent. Flight radar 23 screenshot proves new planes were in the vicinity. ((NUFORC Note:  Possible military transport aircraft at low altitude??  PD)) ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/139/S139047.html",
      "state": "OH",
      "duration": "0:15"
    },
    {
      "_id": "64d005f478aba2ec5a3c81eb",
      "summary": "Brilliantly shiny and white dome outside of Toledo, OH",
      "city": "toledo",
      "shape": "other",
      "date": "2018-01-25T00:00:00",
      "story": "Brilliantly shiny and white dome outside of Toledo, OH Driving on I-80 West outside of Toledo, OH, noticed an object hovering at about 5 times the height of a large communications tower in the dark night sky. It was a dome with a rod emanating out of the top.  The rod was about 1/6th the height of the dome portion.  At the top of the rod, there were two smaller curved rods pointing in opposite directions. The outside of the dome was brilliantly shiny.  The outline of the dome itself was so bright, it almost appeared to be electrified.  Inside the dome, the composition appeared to be milky in color and without a defined shape.  The whole affair reminded me of something you might observe under a microscope. Four times before in my life, I have seen what I truly believe were UFOs (either from the beyond or perhaps made here).  This one, however, I seriously wonder if it was something manmade (communications apparatus?) that I just do not have the knowledge to identify.",
      "link": "http://www.nuforc.org/webreports/138/S138488.html",
      "state": "OH",
      "duration": "3-4 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c882d",
      "summary": "Large silver cylinder shaped object flying over swan creek area in Toledo, Ohio.",
      "city": "toledo",
      "shape": "cylinder",
      "date": "2018-07-05T00:00:00",
      "story": "Large silver cylinder shaped object flying over swan creek area in Toledo, Ohio. I was watching a bird fly over head and noticed a shiny, cylinder shaped object with a darker ring in the center flying over head.  It was very high up in the air, yet seemed as large as a commercial sized plane.  It was also going across the sky in a fairly fast rate of speed.  It also produced no sound and had no visible wings.  Where I assumed the wings should be, there was a dark ring around the object.  I did get 20 seconds of video as I stood there trying to figure out what I was watching before realizing that I needed to get my phone out to record.",
      "link": "http://www.nuforc.org/webreports/141/S141972.html",
      "state": "OH",
      "duration": "45 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c92dc",
      "summary": "Driving down the road as the passenger while looking out of window, i seen odd shapes in the sky.",
      "city": "toledo",
      "shape": "triangle",
      "date": "2019-12-01T00:00:00",
      "story": "Driving down the road as the passenger while looking out of window, i seen odd shapes in the sky.",
      "link": "http://www.nuforc.org/webreports/150/S150161.html",
      "state": "OH",
      "duration": "35 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c9446",
      "summary": "I was sitting in my car watching what seemed like a lighthouse light or circling airplane above the tree and when I got out of the car,",
      "city": "toledo",
      "shape": "light",
      "date": "2019-12-01T00:00:00",
      "story": "I was sitting in my car watching what seemed like a lighthouse light or circling airplane above the tree and when I got out of the car, An orb circling above the trees. Light yellow, circular, and relatively small. I mistook it for a circling airplane at first. Couldn’t make out any details of the craft itself. Hazy/foggy looking.",
      "link": "http://www.nuforc.org/webreports/150/S150524.html",
      "state": "OH",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c9879",
      "summary": "Strange rotating lights in the sky.  Followed what seemed like source but in middle of woods.Also airport is not in the same direction",
      "city": "toledo",
      "shape": "circle",
      "date": "2019-12-01T00:00:00",
      "story": "Strange rotating lights in the sky.  Followed what seemed like source but in middle of woods.  Also airport is not in the same direction of the 3 rotating lights in sky.",
      "link": "http://www.nuforc.org/webreports/151/S151144.html",
      "state": "OH",
      "duration": "5 minutes"
    }
  ]
}