{
  "city": "tulsa",
  "fetch_timestamp": "2025-07-12T14:32:56.791761",
  "record_count": 121,
  "pages_fetched": 6,
  "api_calls": 7,
  "source": "ufo_aficionado_api",
  "records": [
    {
      "_id": "64d005f478aba2ec5a3b433c",
      "summary": "5 glowing objects sighted in Tulsa. One of the five objects splits off into three seperate objects.",
      "city": "tulsa",
      "shape": "changing",
      "date": "2006-05-15T00:00:00",
      "story": "5 glowing objects sighted in Tulsa. One of the five objects splits off into three seperate objects. Unbelievable!  My son and I sighted 5 objects in the night sky that were independant of each other over a 40 min. span.   We had sighted a vapor trail from an airliner moving east to west and noticed a glowing object approaching the airliner at high speed and accelerate around the airliner and disappear off in the distance. 3 times we observed this from one location.  We then drove home got out the binoculars and lawn chairs and sighted a 4th object moving at high speed east to west, we tried to get a bead on the object with the binoculars but, had a hard time getting a focus because of the velocity at which the object was traveling when all of a sudden it splits off into 3 seperate objects!  One of them appeared to bank off to a due south direction, and accelerate out of sight in seconds, looked like it jumped time. While the other two maintained there same velocity and banked off the northeast \"Stacked on top of each other.\"  We could never determine a shape or clean lines to the objects, they appeared as if they had an ullumination surrounding them that you couldn't make out a distinctness. Sky was exceptionally clear, no wind, probly 68 deg. F. Really neat sighting! Really nice machines!",
      "link": "http://www.nuforc.org/webreports/049/S49747.html",
      "state": "OK",
      "duration": "40 min. per."
    },
    {
      "_id": "64d005f478aba2ec5a3b4401",
      "summary": "A object like the moon, but the light of the Sun with a blue glow around it , it did not move some said there was a boom sound X3",
      "city": "tulsa",
      "shape": "oval",
      "date": "2006-05-15T00:00:00",
      "story": "A object like the moon, but the light of the Sun with a blue glow around it , it did not move some said there was a boom sound X3 This was seen on the 1st of this mo.and on the 6 of this Mo the 1st one was seen by persons all over this area but was not reported around here in Tulsa but was talk about on a radio show but the talk was what it could be they allso said that it was seen in other County's as well. My Son did see it and said it made a boom sound X3 and was like the Moon, with a blue glow about it.  I was told by someone that lives about a mile from Me that this same light was seen on the 7th of this mo. the time was 5:00am, She told Me that her Mom got her up about 5:00 and they watch it for about 10mins it was right above there Home and was the size of the moon with light that was from the Sun with a blue around it She allso said that on her AM radio she could not get anything but a buzz sound all that night,I as well that night did not get good AM stations(we have a 50KM that You can hear in 17 states all the time KFAQ)I could hear the buzz it was EMI from something.but I don't know what,there is not anything around here like that and We live somewhat away from the city. ((NUFORC Note:  Other reports.  Possible meteor?  PD))",
      "link": "http://www.nuforc.org/webreports/050/S50084.html",
      "state": "OK",
      "duration": "10 to 20 min"
    },
    {
      "_id": "64d005f478aba2ec5a3b4c77",
      "summary": "Flat white cylindrical disc shape moving N through cloud cover over N Tulsa.  Observed from E Tulsa.",
      "city": "tulsa",
      "shape": "unknown",
      "date": "2019-06-20T00:00:00",
      "story": "Flat white cylindrical disc shape moving north through cloud cover over north Tulsa.  Observed from east Tulsa (46th St North and Highway 169) object on west side of Tulsa (north of downtown).  Entered cloud bank and did not appear on the other side of  cloud.  3000-7000 ft (est) altitude moving fast and silently.  Estimated 10 miles east from object. Air National Guard was doing touch and goes at the time when object was observed. I am a pragmatic realist  and don’t believe anything unless I see it.  I can not explain what I saw but it was real.",
      "link": "http://www.nuforc.org/webreports/146/S146814.html",
      "state": "OK",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b4ccd",
      "summary": "At least three lights in the sky and vanish.",
      "city": "tulsa",
      "shape": "light",
      "date": "2019-06-20T00:00:00",
      "story": "At least three lights in the sky and vanish. I saw a light moving really fast for only a matter of of seconds in the sky from East to West and vanish.  A second later another light going from North West to South East and vanish and several seconds later another this time from South to North and vanish.",
      "link": "http://www.nuforc.org/webreports/146/S146816.html",
      "state": "OK",
      "duration": "approximately 1-2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b53c6",
      "summary": "((HOAX???))  Wedding Cake Ship Sound was heard.",
      "city": "tulsa",
      "shape": "unknown",
      "date": "2007-10-08T00:00:00",
      "story": "Wedding Cake Ship Sound was heard 51st and Memorial Drive, South West corner behind what would someday be Skaggs/Albertsons but at the time was an open undeveloped field boarding my neighborhood.   It was very early in the morning, approximately 5AM.  I was awakened by a female presence from my bedroom and I had this desire to get my bicycle out of my parents garage and go riding. The sun wouldn't be up for another hour.   It was the summer.  It was in the 70's, within a month or two of the June 8th, 1974 Tornadoes which destroyed Tulsa, Oklahoma, my home town.  I was outside riding my bicycle in my neighborhood, just 300 yards from my house.  The sun was just coming up.  There was this very unusual popcorn shrimp like cloud formations in the sky.   Just thousands of clouds which were white and puffy alto cumulus like clouds which were spaced out widely in the shape of curled up popcorn shrimp.   The local media weather personality on Channel 8, Don Woods, commented on how rare this day was because Tulsa had never had this kind of weather clouds before in it's recorded history.  I am to believe that this incident may have been just before June 8th, before the T.V. stations were knocked down by the tornadoes.  I have searched and searched for the exact name of these clouds and their exact date and history has buried it.  I can't find it.  Anyway, I'm riding my bike on dark streets back and forth, back and forth, until the sun rises for one hour when I see these clouds.   Their startling clouds.  I can barely find information on the June 8th 1974 triple twister storm which almost took my life and my family's life and left us in ruin for the balance of the year of 1974.  It was truly an awful time with not running water, no gas, no electricity, no phone and no T.V.   All we had was KRMG AM radio to inform the community for quite a while.   AM radios and batteries and lots of kerosene burning Coleman products to make light and cook our food.  As I rode my bike, the sun came over the horizon and you could see all these very strange shaped clouds.   And there were no cars running nor jet aircraft landing.  It was as if Tulsa was frozen. No noise outside at all, not even birds.  And I heard this one noise growing and growing as if it was coming from an aircraft or something up in the air and I began to point my eyes to the direction of this very unique, unearthly noise.  I would hear where it was coming from and move my eyes to the noise as it moved through the skies above me yet I saw nothing.  It flew right over me I would guess at the altitude of a landing jet aircraft and proceeded off to the east.   I kept peddling my bike eastward following the sound and looking up and continued to see nothing as the sound faded away.  This whole encounter did not take just 3 minutes, it was like 25 minutes. It moved as slowly as a Goodyear blimp from the sound as the sound moved in the skies as my ears could track that sound yet I saw nothing and it didn't wake anybody up in the neighborhood. When the sound finally disappeared in the east, I was standing on the ground straddling my bike. Not 5 minutes passed and the entire neighborhood woke up and came to life.   People went out to get their paper, started mowing lawns, dogs started barking, tire sounds of cars were heard on Memorial drive, all the noise of life returned as if somebody just threw a switch.  It was really weird as a 13 year old I actually recognized this and knew major things were wrong here.....  And for some reason, I forgot about this sound.  I just shelved it in my mind and never ever thought about it again.  I never spoke with anybody about it.  Never made it a bid deal.   I also had at the time dreams of being a bird and being able to fly in my own back yard.  I used to dream somebody taught me to flap my wings and I would actually fly around up to 1000 feet high.   And this female person would talk to me then and was like my foster mother if you will. I was encouraged to fly and remember topping the chimney on my parents house and actually flying just above the cloud cover of the town and hovering there for hours at night.  It was always at night. It was a female but I never could remember her face.   But she took a liking to me as a child. And then I never heard anything more from her again.   This whole thing probably spanned just 4 months as I remember.   But I shelved the entire thing and never told anybody.  I also remembered looking into the neighborhood houses for open windows of known Rock and Roll stereo freaks who might have a stereo playing but all windows were shut that I could see and besides, the sound was from above me and slightly to the south heading west to east in direction as it moved.  It also wasn't the kind of sound which was played back from a recording with hiss or scratch sounds like a record does, it was the REAL THING SOUND.  It had the decibels of a powerful engine or something like that.   There was no stereo which could make a noise that loud which was obviously far up in the air somewhere up there.  It also gave me the feeling that somebody was looking down on me, the one kid outside with the bicycle chasing this sound and not being able to catch it and I felt this terrible, awful sorrow coming from somewhere as if a family member was either just abandoned or died or perhaps the feeling you get when your best pet dog is killed in a violent way.  A very sorrowful, sad feeling which actually made tears come to my eyes finally as the sound finally went away to the east and was never heard from again.  I had the feeling that I was just abandoned like a mom would say goodbye to here child for the last time never to see him ever again.   There was a sense of concern and fear and I remembered now, at the time I was led to believe I was going to have a very hard and challenging life.  I was 13 years of age at this time.  Lost in space had been on T.V. and the sound of that spaceship in that T.V. series was Erie but not similar to this sound.   This sound was not man made it was real.  And so I grew up, and time just buried all of this.  I never heard this sound again and forgot about all this until recently.  I'm 46 years old now.  I'm driving across country and the AM radio is on.   Coast to Coast AM is playing and George Noory.  He's interviewing Michael Horn.   Michael Horn is supposed to be the U.S. press representative of Billy Meier from Switzerland.  And I listened to this interview they did and somewhere in the middle of it they played the wedding cake ship sound.  I said to myself as soon as 10 seconds of this sound was played that I've heard this before somewhere??? And I began to ask myself which T.V. show or Movie did I hear this sound on before so I could know where these guy's ripped this sound off from.  I eventually went to the website and downloaded this sound and played it a few times and it all started coming back to me.  I was asking same question back in 1974.  I remembered that morning.  I remembered the weird bicycle ride I took that summer morning.  Asking the question is this sound was coming from a neighbors house, what T.V. show or movie  did they get it from.  Yet I knew it wasn't coming from a neighbors house or some passing car's 8 track.   This is 1974 you see, not even the cassette tape was popular then.  Microwave ovens and cable T.V. were years off.  Color T.V. was just getting popular.  FM stereo existed but not widely used in cars yet.  Cars still typically had noisy AM radio with 8 track players bolted on.    We didn't even have synthesizers in that era to manufacture a noise like this.  But I heard this damn noise.  I felt those feelings.  I had those dreams in my sleep of flying with my other mom.  I felt some love from this person.  And I have some post comments to make to this female person, whoever it was. After having done some years research on Billy Meier and the Pleiadians and finding out that these people frequent all of our media and are somewhat experts on Human current events. If what I have read and felt are indeed true, then I'm dealing with an emotional being who's not learned to separate herself from her science projects....    And I'm sorry you never had a child. And while it's sad that you people actually read the contact reports from this very website, maybe you'll read this one and remember what you did back in 74.  I know it was you and I shake my head and ask the question if you leave that much concern in a 13 year old childs mind how are your possibly going to help mankind?  It was the certain knowledge and admission that this sound was the Wedding Cake Ship. That the Wedding Cake ship was commissioned at around this time.  And I'm left with the question, why Tulsa, Oklahoma?  Was it the knowledge we were about to be greased by a large group of Tornadoes?   Was there something special about me? All I'm personally left with is she decided to adopt me as her son for a few months and perhaps study me, I guess...  I dunno....  But I did hear that Wedding Cake ship sound on that popcorn shrimp cloud day which we have never had again, ever.... ((NUFORC Note:  Source of report indicates that date of the event is approximate.  PD)) ((NUFORC Note:  Witness elects to remain totally anonymous;  provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/058/S58855.html",
      "state": "OK",
      "duration": "25 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b59c3",
      "summary": "October, 1961, Tulsa Oklahoma: low altitude, slow, disk object(s); high speed turns, v. high accelleration.",
      "city": "tulsa",
      "shape": "disk",
      "date": "",
      "story": "October, 1961, Tulsa Oklahoma: low altitude, slow, disk object(s); high speed turns, v. high accelleration. I was delivering newspapers at approximately 3:30 AM, October 1, 1961, (plus of minus a week), on North Braden Avenue at the corner of East Marshal Street.  It was cold (30-35F) and the sky was clear of clouds. Two circular, saucer-shaped objects flew over me in a North-East direction, generally headed toward the Tulsa airport approximately two and a half miles away.  My estimate at the time was that they were flying at about 250 feet altitude, and were about 80 feet across.  It was relatively easy to judge the distance, as the edges of the saucers were crisply in focus.  There was very faint scoring or scratching on the bottom surface of the saucers, giving a slight textured appearance, which also allowed me to judge altitude better.  They flew at approximately 15-20 MPH (very slowly), and in line (one behind the other, same altitude).  The bottom of the saucers glowed with a golden light that pulsed slowly, in about a 2-3 second cycle from dimmer to lighter and back to dimmer.  The pulsing was very distinct, but not the cycle was not \"wide,\" in that it was never particularly bright, and always a bit dim.  The saucers were completely silent.  There were no \"point\" lights, or particular light emitting locations except for the whole of the under surface. The location was very slightly hilly, and the saucers proceeded in a direction directly in line with the street.  I would watch clearly them until they had flown about a mile and a half away.  As they receded, it became apparent that the main bodies of the saucers had the appearance of two thin spherical surfaces, one above and one below, meeting at the edges.  Given the estimate that the saucers were 80 feet in diameter, I estimate that the main body of the saucers were 8 feet thick. The main body of each saucer was surmounted by a translucent (opaque) white dome, rising approximately 4 feet above the main body.  The dome was only a little brighter than the golden bottoms.  There were no \"point\" sources of light on the dome.  I do not recall that the top surface of the saucers, apart from the domes, glowed; however, it is likely that they did glow only a little dimmer than the bottoms or I would have noticed either that they were dark or that the saucer bodies were uniformly bright, top and bottom.  I do not recall that the dome lighting pulsed. It is possible that my size estimates are too small.  It is possible that the saucers were instead, 125 feet across and 12 feet thick in the main body with a 6-7 foot dome, flying up to but not exceeding 400 feet in altitude.  These sizes are an upper limit and unlikely. At the time I was skilled in aircraft recognition, having been growing up with a parent who was employed at the Tulsa Airport and who kept me well informed about airplanes and air flight mechanics.  I was also a relatively skilled hunter, with a good sense of distance for estimating bullet trajectories for high powered rifles. Naturally, I thought this to be an extraordinary incident, and so I kept my eyes on the sky for many mornings thereafter.  Subsequently, within two or three weeks I saw another saucer, which I will report here as part of the same incident. I was standing at the corner of East Pine and North Yale, approximately half a mile North of the previous sighting, and saw a saucer fly overhead in a South-West direction toward downtown Tulsa, 4 miles away.  The location was elevated sufficiently so that I could see the downtown skyline.  The saucer was the same size and shape, but this time flying silently at 750-1000 feet altitude at perhaps 200-250 MPH.  It glowed with a golden pulsing light, as had the two saucers in the previous sighting. Within perhaps 1 to 1-1/2 minutes, the saucer passed just even with or to the other side of the downtown region and turned Northward at probably the same speed.  From this distance it was a little easier to estimate the altitude, as the profile of the saucer was relatively clear, although distant and therefore a small visual object.  The saucer flew Northward for about a mile, until more or less directly East of me, then abruptly changed both direction and speed.  The saucer abruptly veered upward at about 25 degrees -- a \"point-turn\" with no curvature to it that I could detect from where I was.  It abruptly increased in speed to what I would estimate to be about 1500 MPH.  I judge this to be the speed from the prior assessment that it was going 250 MPH, and was not going 6-8 times that speed, upward at the 25 degree angle.  It seemed that the saucer accelerated from 250 to 1500 in not more than a few hundred feet, if it took even that distance.  For all I knew, it was instantaneous, since one or two saucer-body lengths in acceleration to that speed would have been indistinguishable from instantaneous.  The saucer continued upward rapidly until I could no longer see it. Within one week more, I saw something that I presumed to be a saucer, also.  From the same location at Pine and Yale, I looked into the sky Southward and a little East, and saw high into the sky (about 55-60 degrees elevation) what appeared to be a meteor entering the atmosphere -- a not uncommon sight.  However, this meteor began to glow, then streaked down at about 150-160 degrees downward Upper Left to Lower Right in my vision, then abruptly slowed and stopped in place, still glowing brightly from what I thought to be heated entry into the atmosphere.  After remaining completely still for approximately 10 seconds, it flew off horizontally to the horizon, Eastward (probably South-East from its stopped position) and disappeared into the distance.  I could not see features on this object, nor its shape.  The event was probably 8-10 miles distant, perhaps in an area 1-3 miles West of Broken Arrow, Oklahoma. These three events were the only ones I saw. ((NUFORC Note:  Witness indicates that the date of the incident is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/056/S56354.html",
      "state": "OK",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b59eb",
      "summary": "slightly dim gold light, not blindingly bright.",
      "city": "tulsa",
      "shape": "light",
      "date": "2007-10-08T00:00:00",
      "story": "slightly dim gold light, not blindingly bright. On the way back into our suburban neighborhood that I have lived in for the past year now, me and my roommate both immediately noticed a gold light completely out of place hovering higher than any tree or the obvious orange(obvious as in the street lights are a completely different color as well as brightness and size) colored street lights. View became obstructed by trees driving into the neighborhood, in shock immediately turned around going opposite direction while I viewed from behind trying to catch the object but it was not in site. I would say it was probaly about 150-200 yards at 1'oclock ahead  of us and hovering maybe 120 feet above the ground.  Please if you have ever received a report similiar to this email me at dust.tor@gmail.com, I've never witnessed anything in my life that was out of place and neither has my friend.",
      "link": "http://www.nuforc.org/webreports/058/S58224.html",
      "state": "OK",
      "duration": "10-15 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b5dd4",
      "summary": "Three objects traveling North to South over Tulsa/Jenks, OK",
      "city": "tulsa",
      "shape": "circle",
      "date": "2008-06-12T00:00:00",
      "story": "Three objects traveling North to South over Tulsa/Jenks, OK Me and my wife stepped outside at about 23:00 CST last night and saw three objects flying North to South over South Tulsa/Jenks, Oklahoma.  Two smaller objects led a slightly larger object.  The speed of the front two, seemed to stay consistent, while the trailing one matched the speed of the front two for about half of the time that we viewed.  After that, it slowed while the others continued on. The trailing object seemed to stop, just as it was going to fly out of our view which would have been blocked by a tree and buildings.  I ran through the house to get to a better vantage point, but by that time all three objects were gone. The speed - honestly appeared to be about the speed I have seen satellites cross the sky, however I do not believe these were satellites - I have never seen three fly together...nor had ever seen one \"stop\".  The larger trailing object, was much bigger than a satellite through the naked eye --  and actually appeared to be round.  The front two, though smaller, appeared to be round also. They made no sound at all.",
      "link": "http://www.nuforc.org/webreports/062/S62980.html",
      "state": "OK",
      "duration": "15 Seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b60d5",
      "summary": "Mother's Day Night Fireball!",
      "city": "tulsa",
      "shape": "fireball",
      "date": "2008-06-12T00:00:00",
      "story": "Mother's Day Night Fireball! May 11, 2008 11PM Tulsa, OK   At appr. 11pm, Central, I was in my bedroom looking out the window to the north. I saw a fireball with a short tail streak from the upper right to the lower left part of my field of view...towards the horizon. I would guess that it was moving to the northwest from a great distance away but I can't be sure. This thing was BRIGHT and made a swooshing sound.........like something out of a movie. As quickly as it burned out, it still lit up the yard and the bedroom like daylight. It appeared white with a slight yellow tinge to it.  It did not change directions from what I could tell so I am sure it was just space junk or a slow meteor. I am most curious to know if anyone else saw it because I can't find anything online to corroborate what I saw. I have searched for \"\"Tulsa fireball, UFO, space debris, etc. Nothing.",
      "link": "http://www.nuforc.org/webreports/063/S63131.html",
      "state": "OK",
      "duration": "1-2 sec"
    },
    {
      "_id": "64d005f478aba2ec5a3b6928",
      "summary": "A strange, changing shape UFO over Tulsa.",
      "city": "tulsa",
      "shape": "changing",
      "date": "2008-03-31T00:00:00",
      "story": "A strange, changing shape UFO over Tulsa. \tOkay, it all started when I was on my rooftop.  I had my binoculars with me (if it weren’t for the binoculars, I wouldn’t have seen this object.)  I was viewing a large plane with them that was high in the sky (either a Boeing 767 or 777).  As I was following it, then it happened.  The time was approx. 2:50 PM. I spotted this weird looking circle craft in the sky (it looked like it was supposed to be a disk) but it was changing because the outline of the craft had wrinkles in it.  It continued to make these weird outlines by wrinkling the outline of the craft.  The craft had no sound (that’s the common thing for all UFOs).  The color looked like a silver color.  The size, well, if it was on the edge of space, then it must have been something pretty massive for me to only see with my binoculars.  I checked the binoculars for debris, but none was present.  It wasn’t a reflection because this “craft” entered my binoculars.  I am familiar with the way weather balloons look in the sky (perfectly circle, white, going up pretty fast).  But this was no weather balloon.  It wasn’t a perfect circle or completely white.  It was what I said up there.  I also know it was not a shopping bag because even a slight bit of wind could not carry it that high or keep it hovering like that.  It was way up there because when the plane passed by it, then the object was behind the plane.  It came from behind the plane (not by itself, but by the plane moving).  I took the binoculars off my eyes, and I couldn’t see the object with my naked eye.  I tried to find it again, but I lost the object.  It wasn’t a balloon because later, for another 10 seconds, I saw it.  A balloon wouldn’t stay for another 15 minutes (I had come outside later). Later, at approx. 3:15PM (25 minutes later), I went back outside and looked in the sky with my binoculars at another, smaller airliner.  The smaller airliner was just as high as the other plane was earlier.  The object came into the screen again, only this time, much higher.  It was in the same spot as it was earlier.  It was doing pretty much the same things as it was earlier.  It looked like it was slowly but surely going up.  The sighting ended after that.  \tI never thought that I would see anything like this.  I have heard many things on the news, but I didn’t believe some of them.  I did, however, see the Stephenville, Texas sightings in January on the news.  I believed it.  The only thing that made it hard to believe was when the object returned, they reported 2 noisy fighter jets chasing the noiseless, triangular craft at high speeds.  I don’t know if that part is true.  I have believed in UFOs ever since I was younger.  What made me believe in them was when I heard about a case on the news or something.  I believe that some of them are either ET, angels, or something like that.  I don’t know why they are here.  If this was a real craft, then this is amazing.  This is all that I have to say about this. ((NUFORC Note:  Witness elects to remain totally anonymous;  provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/062/S62130.html",
      "state": "OK",
      "duration": "1min, 10sec"
    },
    {
      "_id": "64d005f478aba2ec5a3b6dfa",
      "summary": "I was outside in my friends back yard on friday the 12th and noticed a bright light hovering about 3 miles away, i first disregarded it",
      "city": "tulsa",
      "shape": "unknown",
      "date": "2006-07-16T00:00:00",
      "story": "I was outside in my friends back yard on friday the 12th and noticed a bright light hovering about 3 miles away,  i first disregarded it as an airplane but then looked at it strongly and noticed it was actually hovering over one spot, so i went inside and told my friends lets go check it out see what it is, as we got closer the lights on it dimmed and i noticed it was over some kind of cornfield.  The lights then turned to red and blue on the side and it all of a sudden took off and was gone of sight in probly 15 seconds, the shape was unlike anything i had seen before.  Then last night technically this mornign may 15 at 12:30 am i was driving home from a friends house and spotted it in the exact same spot,  i called the friends i had been with last time told them it was back and to get a camera i picked up my first friend then got to the house with the camera, at the exact moment the object was flying over my friends house literaly 200 yards above us, we tried to pull out the camera but it was going to fast we halled through the neighboorhood and got some ok shots of it flying away.  Any way thats 2 times in 3 nights we have seen it and now have a little footage of it, it is the strangest thing i have ever seen, it is kind of a circular shape proble 3 or 4 times the size of a car not very big at all.  We are going to look for it again tonight and i will be back to post if anything else happens.",
      "link": "http://www.nuforc.org/webreports/050/S50578.html",
      "state": "OK",
      "duration": "10 min"
    },
    {
      "_id": "64d005f478aba2ec5a3b7011",
      "summary": "I was walking home from my local bar and I was looking at Mars because it can be seen so well right now. And I saw A light blinking red",
      "city": "tulsa",
      "shape": "unknown",
      "date": "2008-01-21T00:00:00",
      "story": "I was walking home from my local bar and I was looking at Mars because it can be seen so well right now. And I saw A light blinking red and white. Airplane right? I don't think so because it looked realy close and small. Also it made no sound. As I watched it moove across the sky anouther one became visable and they got close to together. I tried to keep my eyes on both of them as they mooved. I lost sight of the first one and then the second one and that was it. They were UFO's atleast from my prospective. What did I see? Anyone else report anything like this?",
      "link": "http://www.nuforc.org/webreports/060/S60741.html",
      "state": "OK",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b7e30",
      "summary": "Light far away in sky racing away from a location & back twice to again race away and not return",
      "city": "tulsa",
      "shape": "light",
      "date": "2009-12-12T00:00:00",
      "story": "Light far away in sky racing away from a location & back twice to again race away and not return This sighting corresponds quite closely to a sighting reported in Salina, Kansas, on 09/20/73. I have estimated a date/year in which this occured.  I am unsure if it was indeed 1976. It could have been 1975. First off, I am a realist.  I don't fall easily into the ghost/UFO sighting scene, but I know what I saw and it was very unexplainable. I was in my bedroom at approx. 2245 hrs. and just laying in my bed looking out the window when up in the sky in a west southwest direction I observed what at first I thought was a possible satellite.  I was in Boy Scouts at the time and we would always point out a certain satellite that would bounce up and down and change colors.  This object did not change colors but was moving up,down, and back & forth.  Then it raced away towards the North completely out of sight and at an unimaginable rate of speed, but within seconds came back to the approx. area in which it first was.  It then raced off again at an incredible speed and returned again, but this time it came back from a different angle.  Again, it raced off which looked to be a diagonal direction upwards but again to the North.  It never returned. I remained at the window for at least an hour just hoping it would return. My next door neighbors were out of town visiting family in Topeka, Kansas. When they returned, I informed my friend what I had seen and overhearing me was her mother. She informed me that while they were in Topeka that some neighbors of their relatives also saw the exact same thing in the sky. I am now 43 years old and a Deputy Sheriff.  At the time, I was approx. 9-10 years old.  This sighting has always bothered me since that time.  I read all these fantastic reports and they sound really silly.  But what I saw was totally genuine and I would really like to know of similar reports of this sighting.  I can't be the only one that saw this.  If in Kansas it was also seen, then I would think many people also saw it.  I am very determined to investigate this occurance just to possibly get some answers.",
      "link": "http://www.nuforc.org/webreports/073/S73614.html",
      "state": "OK",
      "duration": "45 SECS"
    },
    {
      "_id": "64d005f478aba2ec5a3b817b",
      "summary": "It was maybe 500ft above me, no lights, traveling VERY slow,  and completely silent.",
      "city": "tulsa",
      "shape": "other",
      "date": "2008-10-31T00:00:00",
      "story": "It was maybe 500ft above me, no lights, traveling VERY slow,  and completely silent. I was 18 at the time, and a senior in high school.  I was working at a mall in Tulsa, OK.  I had just left work around 10pm to go over to my girlfriend’s house for a few hours.  It was October 12, 1999, and Halloween was fast approaching.  She had decided to go as Dorothy from The Wizard of Oz. When I arrived at her house, she was outside gluing glitter to a pair of red heels for her costume.  I sat on her front steps with her while she did this.  When she was done, I suggested that we lie in the driveway and look at the stars.  It was relatively warm for that time of year, and the sky was as clear as can be. We got up and moved to the driveway.  As we lay there, looking at the stars and talking, I noticed something disturbing the night sky.  It was moving VERY slowly, maybe 100MPH or less.  The object was very low to the ground.  My guess is between 500ft and 750ft, but no more than that.  There were no lights, and no sound.  I could make out the silhouette of the object against the distant light pollution and the stars in the background.  It had a long fuselage with bulges to the side, kind of in the shape of lobes, where the cockpit might be, and at the back of the object.  The bulges to the side were smaller in the front than in the rear.  It had a slight glow behind it, though not like a jet.  I asked her if she was seeing what I was seeing.  She saw it as well.  We watched as the object slowly and silently moved through the night sky until it was out of sight. The fact that stood out to me was the complete lack of sound.  As a child I frequented air shows.  I was quite aware of the immense noise produced by a conventional engine, be it propeller or jet.  I had seen an F-14 perform a fly by at 100MPH once.  It was greatly pitched with a tremendous amount of thrust, and was loud enough to wake the dead.  What we saw that night was lower, slower, and not pitched at all. I don’t think it was alien spacecraft, but the technology was nothing known to exist to this day.  A few weeks later I saw a show on TV about the “Aurora”, the top secret space plane.  The supposed shape of the Aurora, according to the show, was nearly identical to what we had seen.  My guess is that we may have witnessed a test flight of this plane.  The only thing that keeps me from being sure of that is that there were no lights on it.  I know the US puts lights on all aircraft, even test planes.  We’ve seen this with the F-117.  This Unidentified Flying Object is wholly worthy of the title.  Not a flying saucer.  Not cigar shaped.  Not a light that moves at break-neck speed.  It was just an unidentified, slow flying, silent object.",
      "link": "http://www.nuforc.org/webreports/066/S66418.html",
      "state": "OK",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b8359",
      "summary": "trio of craft",
      "city": "tulsa",
      "shape": "circle",
      "date": "2009-08-05T00:00:00",
      "story": "trio of craft What I saw when I was out delivering pizzas was 3 craft fly overhead and come to a dead stop and hover there.  After a few seconds they did a right angle turn and sped off.  From my perspective they were out of sight in less than a second.  While they were hovering there, I felt sheer terror and have never told anyone about this because I did not want to be thought a crackpot. I have been in the military and have seen many types of military aircraft, even at night and have never seen anything like that.  I am a trained observer (ex-drill sergeant) and that was unlike anything I ever saw before.  Now that I am crippled from a work injury and live alone, I have nothing to fear by reporting this. ((NUFORC Note:  Source of report indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/070/S70631.html",
      "state": "OK",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3b8532",
      "summary": "UFO Sighting in Tulsa, OK",
      "city": "tulsa",
      "shape": "triangle",
      "date": "2009-08-05T00:00:00",
      "story": "UFO Sighting in Tulsa, OK On a calm night in April of this year, 2009, two of my friends and I saw something that we'll never forget. At least, I won't. We were down in an urban ravine, just hanging out and talking like friends do. I was the first one to look up and, in awe, see the unidentified flying object. I couldn't tell you how large or high up it was. All I know is that it was humongous, completely silent, and cruising slowly yet stealthily. Its luminous, phosphorescent lights made its shape out to be triangular or boomerang-like in nature, although the craft itself seemed to be cloaked. The whole spectacle lasted approximately ten to fifteen seconds until it just vanished. One of my friends later told me that he felt like he was being watched when it flew by. My other friend simply dismissed it as either a skein of geese, a weather balloon or swamp gas. But I know what I saw, and I'm sure that it wasn't either of those things, especially since another witness told me that three helicopters, \"two 'regular,' and one black,\" were scouting the area soon after the UFO had disappeared. ((NUFORC Note:  Source of report indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/070/S70779.html",
      "state": "OK",
      "duration": "10-15 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b86ed",
      "summary": "Star gets brighter then fades completely out.  ((NUFORC Note:  Flare from Iridium satellite?  PD))",
      "city": "tulsa",
      "shape": "",
      "date": "2009-08-05T00:00:00",
      "story": "Star gets brighter then fades completely out While standing out on deck last night watching thunderstorms to the south, I turned to go in when I noticed in northern sky a light or star that should not have been there. I'm limited to star mass due to city light pollution so you get to know what is where from observing over the years. This star was bright and in wrong place. It got brighter and brighter and brighter and I thought I was possible seeing a nova. It was exciting but then upseting at the same time. About five seconds in it started fading and faded fast like it was dying. It didn't seem to move, it just went out. Strange to say the least. It was not in the atmosphere, it was among the stars. I'm wondering if any one else observed this event. It was different. ((NUFORC Note:  Flare from Iridium satellite?  PD))",
      "link": "http://www.nuforc.org/webreports/070/S70486.html",
      "state": "OK",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b8a4c",
      "summary": "In't see nothing in the park",
      "city": "tulsa",
      "shape": "unknown",
      "date": "2009-12-12T00:00:00",
      "story": "In't see nothing in the park I went last 10 October 2009 with my 2 grandchildrens at Kite Festival here in Tulsa Oklahoma. While one eagle was fliyng on heads tops very high and took my attention. I shot several pictures and nothing happened, while when I downloaded my file to PC I found a small dot and called my wife. Wuao - I'm surprise man. I can't believed. My camera is Nikon D-40 with a big-large 200 mm X lens, I took picture with 1/500 speed - Oct 10/2009  I'm still surprised - S.B. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/073/S73027.html",
      "state": "OK",
      "duration": "6 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b8b84",
      "summary": "Two bright, motionless lights in Tulsa's northern sky.",
      "city": "tulsa",
      "shape": "light",
      "date": "2009-12-12T00:00:00",
      "story": "Two bright, motionless lights in Tulsa's northern sky. While looking due north, what seemed to be a faint star appeared. The single “star” remained faint for about ten seconds, then quickly grew in brightness. At maximum brightness, which was maintained for no more than 15 seconds and was as bright or brighter than Venus on a clear night, a second faint “star” appeared at about twenty degrees higher in the sky. The first “star” faded and disappeared completely within five seconds. Then, the second “star” grew in brightness, just as the first “star” did. This brightness was also maintained for no more than fifteen seconds. Just as the first did, the second “star” faded and disappeared completely within five seconds.  Both objects remained motionless in the sky. As far as I was able to determine, there were no clouds in the sky as I could see stars all around, fully formed constellations, and even the “north star”.",
      "link": "http://www.nuforc.org/webreports/072/S72880.html",
      "state": "OK",
      "duration": "45-50 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b8ddd",
      "summary": "3:30am Tulsa sky has 4 objects flashing blue lights",
      "city": "tulsa",
      "shape": "circle",
      "date": "2009-12-12T00:00:00",
      "story": "3:30am Tulsa sky has 4 objects flashing blue lights Friends came in and told me to come view the strange sighting og\"Blue Lights flashing 4 objects with bright flashing  blue lights circling and appeared to be headed downward. We shined bright lights and they seemed to respond moving closer in our direction.Lights appeared to flash back at us brighter than before. Just came back in and there are 2 objects still visible and still responding  to our laser lights. Time is now 4:06 am and they are still hovering the sky with their flashing blue lights.Standing in the dark of night with no lights. We trie to get a video of them but objects couldn't be visible on video. Strange but well worth the time of trying..",
      "link": "http://www.nuforc.org/webreports/072/S72989.html",
      "state": "OK",
      "duration": "1 hour"
    },
    {
      "_id": "64d005f478aba2ec5a3b8ea3",
      "summary": "Line formation of Lights in Tulsa,Ok.",
      "city": "tulsa",
      "shape": "formation",
      "date": "2008-10-31T00:00:00",
      "story": "Line formation of Lights in Tulsa,Ok. Initially I seen 3 white lights at staggered heights, but still close to one another.  Then they kind of faded out then appeared again within about 30 seconds and spread out in a single file line and multiplied to 6 or 7 lights all slightly blinking.  The lights then moved in line from west to east with no sound.  I am just south of Tulsa Airport and at first thought it was a jet that was taking off because I did hear a rumbling sound when I had first seen the lights.  But when the lights split into multiple lights I humorously thought a jet might have been sent to investigate the lights.  I do not know who to contact to see if there was a series of jets that took off that morning.  Surely they would not allow 6 or 7 jets to take flight at 1:30am with surrounding residential areas so close to the airport.",
      "link": "http://www.nuforc.org/webreports/065/S65719.html",
      "state": "OK",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b8faa",
      "summary": "Two syncrinized space crafts moving in and out of existance through Tulsa Sky's.",
      "city": "tulsa",
      "shape": "cone",
      "date": "2008-10-31T00:00:00",
      "story": "Two syncrinized space crafts moving in and out of existance through Tulsa Sky's. Seen over east Tulsa, two cone shaped objects in and out of sight for a brief moment. Paused for 10 seconds and continued ascending into the sky. They stuck together as if linked but no visable linkage between the two objects. This happend in daylight, never have I seen such a thing! ((NUFORC Note:  Witness elects to remain totally anonymous;  provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/065/S65749.html",
      "state": "OK",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b8f5c",
      "summary": "AWESOME SIGHT.... couldn't believe our eyes.",
      "city": "tulsa",
      "shape": "cone",
      "date": "2008-10-31T00:00:00",
      "story": "AWESOME SIGHT.... couldn't believe our eyes. as i was driving to work we saw the lights in the sky along hwy 169 and it seemed to hover and then take off super quick right out of view and then just as quick it shot back in sight and the lights went straight up till we could no longer see them i almost wrecked my car",
      "link": "http://www.nuforc.org/webreports/065/S65744.html",
      "state": "OK",
      "duration": "3 mins"
    },
    {
      "_id": "64d005f478aba2ec5a3b911e",
      "summary": "Witnessed with a friend, a large, rectangular object hovering at sundown in Tulsa Oklahoma.",
      "city": "tulsa",
      "shape": "rectangle",
      "date": "2010-05-12T00:00:00",
      "story": "Witnessed with a friend, a large, rectangular object hovering at sundown in Tulsa, Oklahoma. It was about sundown on a March evening in 1989.  I forgot the exact day.  I was riding in my friend’s Jeep and we were heading back to his apartment.  We were stopped at a red light at an intersection heading east.  Up in the Southeastern sky, it looked like a jet airliner was on fire heading down toward Earth.  The smoke and fire cleared after a few seconds and revealed a large, rectangle shaped, solid object.  It had dozens of white lights along the side.  I want to say they seemed to be windows, because the light seemed to be coming from inside the object, not mounted on the outside. The object seemed to be about a football field or so long.  It hovered at treetop level at a fifteen degree angle slowly drifting north about a mile away.  It made no sound. Everyone in their cars at the intersection was freaking out.  All of this took place over about a minute or so, maybe less. It had drifted pretty far North by the time the traffic light turned green.  That's when we saw and heard fighter jets (lights out) screaming toward the object from the far Southern sky.  As we hurried to try to get under it to get a better view, we lost sight of it for a few seconds because of the trees on the left side of the road.  When we got to the next intersection, the jets flew right over us, and we saw the object way down the street.  I could see the back end of it.  I would guess it was about a mile away, moving faster and much higher in the sky now.  We knew we would never catch up with it.  Almost as soon as we saw it, it quickly moved very high in the sky at an unbelievable speed, and it was gone. About an hour later, I went and told my Dad about it, and drew some sketches. We watched the ten o’clock news, as they were going to have a story WITH FILM FOOTAGE of an object seen in the sky that night.  The film they showed was taken by a lady that had been at a local nearby restaurant that evening, and it had that restaurant’s sign in the foreground.  But what they showed looked like a falling star, nothing more.  No word from the dozens of witnesses that saw what we saw.  No footage of the object hovering a hundred feet or so off the ground, or any of the rest of it.  They said it was a \"Russian satellite falling out of its orbit.\"   When those things happen, don't they know about when and where those things will fall?  I'm all the time hearing weathermen saying things like, \"Keep an eye in the Western sky tonight to catch a glimpse of blah blah blah.. Over the years, I've wondered how many other people saw that, and I've wanted to compare notes.  I haven't been able to find anything in any newspaper of TV. archives that even told the story. Since that night, I've questioned everything.  I truly believe the government knows much more than we even believe they do.  I hate to sound like one of those conspiracy freaks, but after seeing undisputable proof that we are not alone, it makes me uneasy to not have the whole story.  Anyway, that's my story, as best as I can remember it. ((NUFORC Note:  Witness indicates that date is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/075/S75254.html",
      "state": "OK",
      "duration": "3 to 5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b925b",
      "summary": "Round, blue and fast",
      "city": "tulsa",
      "shape": "circle",
      "date": "2009-12-12T00:00:00",
      "story": "Round, blue and fast It was flying straight towards me and when it was just above me it circled around and the U.F.O took off!",
      "link": "http://www.nuforc.org/webreports/073/S73196.html",
      "state": "OK",
      "duration": "4 SECONDS"
    },
    {
      "_id": "64d005f478aba2ec5a3b9480",
      "summary": "UFO sighting in the eastern night sky over very populated area.",
      "city": "tulsa",
      "shape": "fireball",
      "date": "2009-08-05T00:00:00",
      "story": "UFO sighting in the eastern night sky over very populated area. A few nights ago I was in my front lawn around between 2am and 4am smoking. I was gazing into the sky and saw what looked like a very bright star. I knew it could not be a star because it was so close and the color of the sun. I went online to see if there were suppose to be any visible planets that night, which it said there was so I figured it was a planet. Last night July 12 2009 at 4am I was outside again and saw the same star object in the same place so I assumed again it was a planet in the eastern sky. What caught my attention this time as I was gazing at the planet/star it was moving. I was startled and confused to what I was seeing. It was the same object as I saw before a few weeks ago round bright orange and kind and a lower point to it but not exactly sure, but this time i saw it kind of swaying back and forth. This time I knew what I was seeing was not a planet or star and was not a helicopter because it was way to big to be one. My step dad was here asleep and I decided to wake him thinking maybe he should take a look at this. I woke him and had him follow me outside to show him what I was seeing and it was gone! I told myself planets do not disappear in five minutes and they do not sway back and forth. The night was a clear night, no sign of clouds and this sighting was over a highly populated city. Now that I have seen this object twice I am going to set up a video camera and hopefully will get the chance to get this object on camera.",
      "link": "http://www.nuforc.org/webreports/071/S71047.html",
      "state": "OK",
      "duration": "30"
    },
    {
      "_id": "64d005f478aba2ec5a3b9966",
      "summary": "Two different colored lights, stationary & above the clouds.",
      "city": "tulsa",
      "shape": "light",
      "date": "2010-04-13T00:00:00",
      "story": "Two different colored lights, stationary & above the clouds. Standing outside of Cain's Ballroom, looked up and saw two larger stationary lights; one blueish grey and one orange.  The blueish light was horseshoe shaped, with sharpish points.  The orange light was more circular, but not perfect.  The lights faded and came back in intensity as the clouds passed under.  The two lights were directly overhead.  The moon was visible to the northwest and a star was visible slightly northwest.  Eventually, the clouds overpowered the lights, and they disappeared.  Also worth noting, this was near downtown Tulsa so the building lights overpowered a lot of weaker star light.  These lights were far enough above any manmade structure, as well as above the clouds, to be sure that there was nothing that any of us could think of what could be causing it.",
      "link": "http://www.nuforc.org/webreports/074/S74780.html",
      "state": "OK",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b9a2c",
      "summary": "Large very bright bluish white \"strip\" of light seen on bottom of a large craft",
      "city": "tulsa",
      "shape": "cigar",
      "date": "2009-06-09T00:00:00",
      "story": "Large very bright bluish white \"strip\" of light seen on bottom of a large craft While driving in to work (night shift in downtown Tulsa, Ok) at 10:02pm on Hwy. I-75 southbound (near 96th street exit) I saw a VERY BRIGHT \"strip\" of white or bluish white light in the sky to the east. This is very close to the approach used for runways at Tulsa International (Rwy. 18L and 18R). I am use to seeing planes approaching to land at the airport in Tulsa, but this WAS NOT an airplane about to land at the airport. It appeared (as best I can tell) to be about 1/4 mile to my east (no way to reference this distance, just a best guess). It had a dark outline I could not identify well, but then lit up with a VERY BRIGHT strip of white light on it's bottom. The light looked a bit like the expensive xenon headlights used by teenagers in the import cars, as it was almost blue tinted a bit. maybe like a mercury vapor light, but MUCH brighter. It stayed on for about 3/4 of a second and went out, then back on for about 1/4 second. Then, as it was going dark, it started moving away (appeared to be eastbound, but was hard to tell). As soon as the lights went out, I lost sight of it's dark outline and the sighting was over. If i were to guess, i would say this strip of light was at least 100 feet long, but I could see no real shape except that the strip of light was a straight line below a darker craft. When i saw it I immediately got a \"fight or flight\" feeling as adrenaline surged through me and I was awestruck and scared at the same time. I continued the drive to work (no missing time on my commute) and sent this report.",
      "link": "http://www.nuforc.org/webreports/070/S70042.html",
      "state": "OK",
      "duration": "10 seconds max"
    },
    {
      "_id": "64d005f478aba2ec5a3b9a41",
      "summary": "a light in the sky that flashes.",
      "city": "tulsa",
      "shape": "circle",
      "date": "2009-12-12T00:00:00",
      "story": "a light in the sky that flashes. We saw this at 6:00 pm and it stayed in one spot for a duration and moved when we left but you can see red and blue flashing lights and a white light that stays on we have watched it on and off for about an hour or two.",
      "link": "http://www.nuforc.org/webreports/073/S73422.html",
      "state": "OK",
      "duration": "40min and still there"
    },
    {
      "_id": "64d005f478aba2ec5a3b9c58",
      "summary": "Round white light/object moving through sky and suddenly disappearing",
      "city": "tulsa",
      "shape": "light",
      "date": "2008-10-31T00:00:00",
      "story": "Round white light/object moving through sky and suddenly disappearing Tulsa Oklahoma:  Approximately 7:30 PM CST on 10-8-08:  I saw an object in the Northern sky. At first I thought it was Venus by the shape, size and brightness. But then I quickly realized that's not where Venus is located and also noticed the object was moving, heading East South East. At first I thought, \"oh well, must be a plane\". But as I watched, I saw that it was not moving like a plane would move and it still looked like Venus, not a plane. So I grabbed my binoculars and looked at the object more closely. What I saw was a white, round object made of just one white round light. The object left no trail, had no other lights around it and moved at a fairly steady rate of speed. I watched the object for about 45-60 seconds and all of the sudden, it just flat disappeared. I don't mean it slowly went out of sight, more that, all of the sudden, it was just flat gone. There was no sound from the object, it did not change colors.",
      "link": "http://www.nuforc.org/webreports/066/S66120.html",
      "state": "OK",
      "duration": "60 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3ba00c",
      "summary": "I saw the object at approx. 60 degrees to the east-northeast. Thought it was a shooting star, and pointed it out to my husband. As we w",
      "city": "tulsa",
      "shape": "light",
      "date": "2010-04-13T00:00:00",
      "story": "I saw the object at approx. 60 degrees to the east-northeast.  Thought it was a shooting star, and pointed it out to my husband. As we watched it, it lasted much longer than a shooting star.  I lost sight of it, but my husband saw it take a hard left and head north.  I saw it after it had made the turn, but we both lost it after it went behind some trees and houses. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/074/S74917.html",
      "state": "OK",
      "duration": "8-10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3ba009",
      "summary": "This is the best I can do. If straight above my head in relation to the surface of the earth is 90 degrees, it was east-northeast at ap",
      "city": "tulsa",
      "shape": "light",
      "date": "2010-04-13T00:00:00",
      "story": "This is the best I can do. If straight above my head in relation to the surface of the earth is 90 degrees, it was east-northeast at approx. 37-38 degrees in relation to the surface of the earth. It was basically just a small ball of light with no trail and a slight haze surrounding it. It was on a slow arc downward, and at approx. 26-27 degrees, it made a little more than a 90 degree turn at the same rate of speed and was then heading due north. We then lost sight due to trees and houses, but we were able to follow its course for approx. 2-3 seconds. I do wish there was more to add to make this more exciting, but of all the things I've ever seen this was without a doubt the most peculiar.",
      "link": "http://www.nuforc.org/webreports/074/S74916.html",
      "state": "OK",
      "duration": "8 to 10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3ba235",
      "summary": "A white light circling in and out of the side of a thunderstom and planes moving to intercept it.",
      "city": "tulsa",
      "shape": "light",
      "date": "2008-07-05T00:00:00",
      "story": "A white light circling in and out of the side of a thunderstom and planes moving to intercept it. I went outside to smoke a cigarette and watch the approaching storm from the south when something from the west caught my eye, it was a circle shaped white light coming out of the side of the thunderstorm.   I watched it for a few moments before it circled back into the storm,  I knew it wasn’t a plane because they can’t move like that.    Right as that one went into the clouds another one shot out of the clouds and then circled right back in.   Could have been the same object, but I never saw them both at the same time out of the clouds.   So after about ten minutes of watching this I see a plane flying slowly from the east in the objects direction, as I’m watching that one another plane comes in really fast from the north I would imagine to intercept the object.   As I look back to see the object it was gone just as the fast moving plane goes into the side of the storm cloud.   The lightning was really bright but it was further to the south of me, I didn’t see any lightning bolt just the flashes through the clouds.   I think the edge of the storm is where I was and the object was going in and out through the side of the storm.   So that’s my account just thought id let you know.",
      "link": "http://www.nuforc.org/webreports/063/S63876.html",
      "state": "OK",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3ba2cc",
      "summary": "07/26/09    Tulsa  OK   Light      bright light flashing on and off moving rapidly across sky",
      "city": "tulsa",
      "shape": "light",
      "date": "2009-08-05T00:00:00",
      "story": "07/26/09    Tulsa  OK   Light      bright light flashing on and off moving rapidly across sky Last night, July 26, 2009, at about 9:15 PM, my husband and I saw a bright, white, light streaking across the sky.  It was travelling northwest to southeast.  At first we thought it was a “shooting star,” but instead of streaking and fading, it flashed on and off as it moved rapidly across the sky in a straight path.  Due to surrounding trees, we were only able to see it for about 5 seconds.  It was an amazing experience. ((name and employment deleted)) teacher; ((name deleted)), business owner",
      "link": "http://www.nuforc.org/webreports/071/S71361.html",
      "state": "OK",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3ba610",
      "summary": "While laying down studying stars with binoculars I saw a ovel-teardrop shaped craft up close with bare eye then with binoculars",
      "city": "tulsa",
      "shape": "teardrop",
      "date": "2008-08-12T00:00:00",
      "story": "While laying down studying stars with binoculars I saw a ovel-teardrop shaped craft up close with bare eye then with binoculars August 2 2008 East Tulsa Oklahoma  11:45 pm  While laying down studying stars and constellations with binoculars I noticed easily with my bare eyes to the east of me at about 600 to 800 feet high, a craft traveling at a pretty good clip, flying from south to north though the constellation Cassiopeia,through one arm of Andromeda and Pegasus before loosing sight as it went onto Pisces.My eyes were well adjusted to the dark since I was already studying the stars.I wrote this 30 minutes after sighting,lasting 10 seconds . It was brownish red/amber in color and shape was oval- tear drop,hard to explain but I will draw a picture of it.It had some sort of membrane/aura or field around it. Since I already had my binoculars in my hand, I zoomed in on it up close it was squared off in the front like a bay windows yet rounded as it tapered off towards the back,it was totally silent did not make any wild manoeuvres, Stayed at constant speed, no lights or flashing lights at all, it just traveled a straight low line until I could no longer see it.No way was it a balloon, it was a dead air night no wind whatsoever.Left no smoke/com trail.When observed through binoculars the membrane was transparent, and oval in shape.I could see through membrane but the \"teardrop\" shaped craft was solid with defenent shape.I did not panic, felt no fear or anxiety, just intent on details. Plus it was traveling too fast on a horizontal heading.It was not a plane for it had no wings and as close as it was I would have heard the engines, this craft was silent.I would guess the size -30x20x5' towards the back. I honestly can say now that I have seen something in the sky that I can not explain..It was not a satellite, plane,swamp gas,hang glider, balloon,jet,dirigible,shooting star,or helicopter .I know the constellations,I have see MANY satellites and shooting stars, we live in a City with a International Airport so I have seen all kinds of aircraft including stealth military aircraft.By its description It sounds like what a friend and his father saw about the first of June 08.The one they saw was flying at tree top level at a constant speed,with some manoeuvring and in the same area of the city.It also had that weird membrane, was teardop in shape the only difference was the craft they saw was emitting a reddish light and was much lower.I realize this is only anecdotal evidence, one mans story, but I will never forget it and from now I will have a camera along with my telescope and binoculars!",
      "link": "http://www.nuforc.org/webreports/064/S64991.html",
      "state": "OK",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3ba60f",
      "summary": "August, 2nd 11:45 pm. I saw a oval -teardrop shaped UFO up close with binoculars,.ASTOUNDING! I am still perplexed.....",
      "city": "tulsa",
      "shape": "oval",
      "date": "2008-08-12T00:00:00",
      "story": "August, 2nd 11:45 pm. I saw a oval -teardrop shaped UFO up close with binoculars,.ASTOUNDING! I am still perplexed..... Dear Mr.Davenport or staff, I am reporting this sighting again because I have a feeling you all don't believe me or think its a hoax.  Forgive me if it was a backlog issue.  I re edited my own report to shorten it up a bit.  I am in my middle ages and I pretty much know what belongs in the sky and what is not the norm.  I am also a ametuer astronomer.I ask you please to delete my report and all data pertaining to me if your not going to use this report.  I would testify under oath in a court of law that all I have said is true if I had too.I wished others had reported craft from Tulsa that night to back up my sighting. Thank you sincerely,  ((name deleted)). August 2 2008 East Tulsa Oklahoma  11:45 pm  While laying down studying stars and constellation's with binoculars,I noticed with my bare eyes to the east of me at about 80 degrees, 600 to 800 feet high, a craft traveling at high speed, flying from south to north before loosing site of it. My eyes were well adjusted to the dark since I was already studying the stars.The sighting lasted 10 seconds.Five with bare eyes and about five with binoculars. It was brownish red/amber in color and shape was oval- teardrop.It had some sort of membrane/aura around it.Amazingly I already had my binoculars in my hands,the timing was incredible!I zoomed in on it up close,it was squared off in the front like bay windows yet rounded as it tapered towards the back.The very back was rectangle in  shape, totally silent, stayed at constant speed, no lights at all.No way was it a balloon, it was a dead air night no wind whatsoever and the sky was clear.Left no smoke/con trail.When observed through binoculars the membrane was transparent,and oval in shape.I could see through the haze but the \"teardrop\" shaped craft was solid,defenantly mechanical in shape. It was traveling too fast on a horizontal heading to be a weird looking balloon.It was not a plane, as close as it was I would have heard the engines, This craft was silent.I would guess the size at 30x20x5'.I honestly can say now that I have seen something in the sky that I can not explain!It was not a satellite,plane,hang glider, balloon,jet,dirigible,shooting star,ISS or helicopter.I have seen many satellites and meteor's,we live in a City with a International Airport so I have seen all kinds of aircraft including military aircraft.It truly was a UFO by its very definition! ((NUFORC Note:  Witness elects to remain totally anonymous;  provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/065/S65108.html",
      "state": "OK",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3baae0",
      "summary": "Star drops out of sky straight down.",
      "city": "tulsa",
      "shape": "unknown",
      "date": "2010-11-21T00:00:00",
      "story": "Star drops out of sky straight down. Star? in East dropped straight down and winked out. Started dropping and went away in about four seconds. Interesting.  Didn't come west, went straight down ansd went out.  Dropped out of sky like lost gravity.  Interesting.",
      "link": "http://www.nuforc.org/webreports/077/S77828.html",
      "state": "OK",
      "duration": "4 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bb3f1",
      "summary": "Moved  very slowly looked like a cigar w/ rounde ends and a fin at back.",
      "city": "tulsa",
      "shape": "cigar",
      "date": "2011-02-18T00:00:00",
      "story": "Moved  very slowly looked like a cigar w/ rounde ends and a fin at back. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/080/S80015.html",
      "state": "OK",
      "duration": "5-10 sec."
    },
    {
      "_id": "64d005f478aba2ec5a3bbe89",
      "summary": "My 2 Sons and myself were driving home around 8:30 P.M.  We were about 3 blocks from our house.  We were heading North on Rockford ave",
      "city": "tulsa",
      "shape": "circle",
      "date": "2011-12-12T00:00:00",
      "story": "My 2 Sons and myself were driving home around 8:30 P.M.  We were about 3 blocks from our house.  We were heading North on Rockford ave and to my left coming out of the west was a orange light going west to east.  I noticed it because I did not see any blinking red or blue lights that a normal aircraft would have.  It was solid orange and I thought this was strange.   I preceded north to my street and turned left which I would be heading West.  I kept looking at the light and noticed several more were following the first one.   I stopped the car and me and my sons were watching these orange lights quietly moving West to to East at a slow pace with no sounds.  I would guest they were about a quarter mile away.   When we stopped the car to get out and watch we were actually about 100 yards from my house.  My son said hurry dad lets get the video camera, so we rushed home and he grabbed it and started to film which we caught the last 2 lights on video.   My daughter was home and she rushed out to see the last 2.  These lights seemed to have just disappeared.   My son swears one shot off fast but I did not see it shot off that fast.  We had to deal with some trees in our way.   I have been told these were Chinese laterns and I honestly do not see the way they moved it could of been.",
      "link": "http://www.nuforc.org/webreports/085/S85406.html",
      "state": "OK",
      "duration": "6 to 8 Minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bbffd",
      "summary": "Tulsa Oklahoma UFO sighting",
      "city": "tulsa",
      "shape": "oval",
      "date": "2011-10-10T00:00:00",
      "story": "Tulsa Oklahoma UFO sighting objects are moving up,down,left and right.object seems to have yellow green red white lights that seem to be wobbling in a circular motion around the craft getting very bright then very Dem.  the craft is in the same spot the last night-9-8-11. 9-9-11 the second night the object seemed to be just a few miles from the first night sighting looking at the craft with binoculars it has window between two discs clearly visible from the lights at times ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/083/S83815.html",
      "state": "OK",
      "duration": "two nights"
    },
    {
      "_id": "64d005f478aba2ec5a3bbfda",
      "summary": "Bright, stationary light in western sky at sunset.",
      "city": "tulsa",
      "shape": "light",
      "date": "2011-10-10T00:00:00",
      "story": "Bright, stationary light in western sky at sunset. My friend and I were on the street near some restaurants when he noticed a very bright light in the western sky, just above the horizon. Another friend and I looked up to see where he was pointing and saw what looked like a very bright ball of light about 10 degrees off the horizon.  At first, I thought it might be Venus or some bright star but the sky was way too bright, even at sunset.  We chatted a bit and we would occasionally glance up to look at the stationary object some more.  After about a min or two, the object simply vanished. As for a description of the object, it was extremely bright and slightly elongated horizontally. (cigar shaped?)  I thought it might be sunlight reflecting off of a jet, but due to the fact that it was stationary led me to believe otherwise.  In any case, none of us could identify it.  It vanished in an instant. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/083/S83807.html",
      "state": "OK",
      "duration": "2 min"
    },
    {
      "_id": "64d005f478aba2ec5a3bc7ab",
      "summary": "Unidentified object in photo of storm clouds.",
      "city": "tulsa",
      "shape": "",
      "date": "2011-08-21T00:00:00",
      "story": "Unidentified object in photo of storm clouds. Several months ago, I adopted a little hobby of taking photos of cloud formations.  My camera is nothing special ... just an old Samsung 35mm 8.1 pixel camera, but it takes pretty good photos.  Last night, Tulsa County was under a thunderstorm watch and warning for a few hours.  I went outside to take photos of the incoming storm clouds right before dusk.   At approximately 20:00 (I'm guessing) I took a photo facing North that turned out really nice.  I wasn't noticing any small details in the sky at the time.  I was just looking at the overall \"picture\" as I shot the photo.  A bit later I uploaded the pic onto my computer and noticed something unusual in the photo.  It does not look like an orb, a bug, or a plane, or something on my camera lens, to me.  I don't know what it is, so I will be emailing the photo to you and maybe you can decide?  I'm also sending an additional photo, though you will probably do this yourself ...    The second photo is a cropped, enlarged port! ion of the photo that focuses on the object.  I also tweaked the resolution to make the object appear sharper.",
      "link": "http://www.nuforc.org/webreports/083/S83026.html",
      "state": "OK",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3bceb5",
      "summary": "Fast moving low flying bright object makes path across south Tulsa neighborhood",
      "city": "tulsa",
      "shape": "light",
      "date": "2011-05-12T00:00:00",
      "story": "Fast moving low flying bright object makes path across south Tulsa neighborhood I was walking our dog before the sun began to rise.  I was heading east, but looking north at the light fog over the pond caused by the unusually cold May temperatures.  Suddenly, a round extremely bright white light darted above the pond just above the tree tops going at a speed equivalent to that of a car on the highway.  I witnessed it travel north approximatley 250-300 feet.  Relative to a star, it was about the same size.  But since it appeared so close to the ground, I would estimate it was about the size of a fist.  It appeared the object was flying level, neither gaining nor losing altitude.  By the time it reached just past the end of the pond, the light abruptly disappeared.",
      "link": "http://www.nuforc.org/webreports/081/S81101.html",
      "state": "OK",
      "duration": "2 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bcfb9",
      "summary": "Saw a glowing orange light traveling at constant speed and altitude no nav lights no sound.",
      "city": "tulsa",
      "shape": "circle",
      "date": "2012-09-24T00:00:00",
      "story": "saw a glowing orange light traveling at constant speed and altitude no nav lights no sound Heard you guys describe something I saw a couple month ago on coast to coast tonight.  I was standing with my mother talking outside by my car before I left their house and my mother said what do you think that is.  I looked up and saw a glowing orange circle traveling at a constant speed and making absolutely no sound whatsoever.  Now just so you know I am an aircraft mechanic and I work at Tulsa International Airport so I'm used to seeing planes in the air.  This object had no navigational lights and was flying at approximatly 2000 ft and was close enough to us that if it was an airplane we would have heard it,  my parents live pretty much right under where the planes line up to land at Tulsa International when there is a prevailing south wind I checked at work the next day and the planes had been coming in from the north the night before because of a prevailing nothern wind so no planes should have been in the area.  I have worked on planes for 10 yrs and! have never seen anything remotely like this.  The object continued to fly north at constant speed and altitude until it was out of sight. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/092/S92235.html",
      "state": "OK",
      "duration": "20 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bcfc6",
      "summary": "Light formation.",
      "city": "tulsa",
      "shape": "formation",
      "date": "2012-09-24T00:00:00",
      "story": "Light formation I was photographing clouds when I noticed in the shot I took 6 lights in sets of two.  They were all white in color, and were in the clouds a few seconds and disappeared.  There was no sound, and they were high in the sky.",
      "link": "http://www.nuforc.org/webreports/092/S92223.html",
      "state": "OK",
      "duration": "seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bd029",
      "summary": "Triangle shaped craft with lights on the corners and 1 big one in the middle.",
      "city": "tulsa",
      "shape": "triangle",
      "date": "2012-08-05T00:00:00",
      "story": "Triangle shaped craft with lights on the corners and 1 big one in the middle. I was doing a report on trespassers on a 6 deck parking garage and finished it was during the meteor shower.  I seen a bright light I thought it was a star or a planet cause it did not move.  It was in the north east around 1 o'clock area.  I viewed a light I thought was a meteor it went straight toward the the bright light then stopped.  The light I was watching suddenly took off and headed south. by the time I called my guard he was 4 miles away it was gone but when it went over my head I seen it was triangle shaped and had bright white lights on the corners and a big light in the middle  .It was from start to finish when it moved out of sight it might have been 1 minute.  It was the fastest thing I have ever seen. I have seen airplanes coming and going from the same place but they did not even get close to how fast the it moved.",
      "link": "http://www.nuforc.org/webreports/090/S90853.html",
      "state": "OK",
      "duration": "1hr. 30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bd0ed",
      "summary": "Red, white and green flashing lights",
      "city": "tulsa",
      "shape": "triangle",
      "date": "2012-09-24T00:00:00",
      "story": "hovering red, white and green flashing lights in a triangular formation in the western sky.  would disappear for a few then reappear.  moved to the north then did the same for app. an hour. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/091/S91983.html",
      "state": "OK",
      "duration": "45 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bd245",
      "summary": "Red Orb in Broken Arrow, OK Flew Over",
      "city": "tulsa",
      "shape": "fireball",
      "date": "2012-08-05T00:00:00",
      "story": "Red Orb in Broken Arrow, OK Flew Over A red orb glowing shape that had a radiant glow. It had a tail and a semi hollow center. it rose into about mid sky and flew or floated straight north.  It had a heat that you could almost feel. And you could tell it was radiant heat because it was on fire, but not burning.",
      "link": "http://www.nuforc.org/webreports/090/S90544.html",
      "state": "OK",
      "duration": "2-3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bd208",
      "summary": "UFO mimicking fireworks",
      "city": "tulsa",
      "shape": "sphere",
      "date": "2012-08-05T00:00:00",
      "story": "UFO mimicking fireworks I think I just saw a UFO?!  Yes, yes.... I know it's the 4th of July and everyone is shooting off fireworks – At 9:45pm, I was heading north on Harvard Ave. near Pine St. and I noticed this sparkly orb in the sky about a 1/2 mile up, I thought to myself \"That's a cool firework\" -- but it just hung there and kept changing colors. \"Well, maybe it's one of those with a Parachute attached too it?\"   I got to Harvard and Apache and it was still there, so I pulled over and got out of my car, looked at it for about 10 seconds and it was changing colors and all... then a large burst firework went off in the sky about a half block to my right -- then suddenly, in a blink..the orb shot north about a 1/3 of a mile, paused, in less then a second, it then took off further north about 5 miles -- then it was gone. I thought to myself, \"That was no firework, plane, or helicopter... I think I just saw a UFO -- and it was mimicking the fireworks?!\"  Weird!   Anyway, being the artist that I am, I duplicated what I saw, and it's dead on!  (I will send an email of this)",
      "link": "http://www.nuforc.org/webreports/090/S90420.html",
      "state": "OK",
      "duration": "4 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bd367",
      "summary": "Three stationary multi-colored lights in triangle formation over Tulsa, Ok",
      "city": "tulsa",
      "shape": "disk",
      "date": "2012-09-24T00:00:00",
      "story": "Three stationary multi-colored lights in triangle formation over Tulsa, Ok This sighting occured at my home in Tulsa, Oklahoma between the hours of 2:00 and 3:30 a.m. I was looking west up at the sky and saw three blinking lights in the sky. The sky was pretty clear, No clouds and no regular air traffic. I observed these three stationary white lights that were spread Out like an isoceles triangle. One was very faint to the naked eye, but i could clearly see it was blinking,  Slowly at times and rapid at times. The second white light was closer and I could make out a red and a blue light on either side of the central blinking white light. The third light was the closest to me, roughly 2 or 3 miles. This light was also blinking what looked like morse code along with the other two lights. This spacecraft, or whatever it was, was definitely a saucer like shape. I could make out the white light that came out of the craft was in a horizontal line that ran around the ship. It also seamed to have multi- colored lights that spun around the craft or center of the white light. All three of these ships sit stationary for a couple hours, this happened three nights in a row.  The first two nights they were in the same place in the sky, the third night they had moved.  But all three nights they seemed to be in a perfect triangle formation.",
      "link": "http://www.nuforc.org/webreports/092/S92328.html",
      "state": "OK",
      "duration": "1-2 hours"
    },
    {
      "_id": "64d005f478aba2ec5a3bd5c4",
      "summary": "Armada of Star-like Objects Moving Across Oklahoma Night Sky",
      "city": "tulsa",
      "shape": "formation",
      "date": "2012-10-30T00:00:00",
      "story": "Armada of Star-like Objects Moving Across Oklahoma Night Sky At approximately 8:08 central time, my son and I were sitting in our van at the intersection of 129th and 71st in the Broken Arrow, Tulsa area waiting for the light to change.  I was driving and we were facing west in the left hand through lane.  There was a moderate cloud cover. While waiting at the stop light my son, who is 17, said something to the effect of, \"Dad, what the heck is that/are those?\"   After a few seconds of confusion in trying to locate what he was looking at in the night sky, I observed what he saw.   With due west as the 12 o’clock position, I estimate that a group of objects were at about the 2 o’clock position about 55 to 65 degrees in elevation from the horizon moving from north to south.  Speed was difficult to assess because we didn’t know how far away the objects were - although while I was sitting at the light which couldn’t have been more than 20 seconds, they had traversed from the 2 o’clock position to about the 11 o’clock position in the sky as observed through my windshield. When I first observed the objects I thought they might be fireworks because they seemed to be flickering or pulsing - but then I noted they were moving in unison - although not in a regular formation in the sky.  Then I thought maybe they were lighted, radio-controlled aircraft that I had observed in the past in a field near our home.  But since I knew these planes  moved in a bobbing, irregular manner that did not explain these objects. When they were at the 11 o’clock position I started counting them before the light changed to green.  My recollection was I got up to about a dozen - but my perception was there were even more present - though they were faint.  I think they were at least 15 objects and maybe even up to 30 in the position we were observing them.  The sky was literally peppered with them in portions of that area of the sky.   I perceived the lights to be about the size and brightness of an easily visible star. The amount of sky they occupied would be approximately equivalent to both of one’s hands - or maybe closer to a hand and a half - covering such a section.  The length of the loose formation was greater than its width from what I could see.  I perceived the color of the lights to be a light green - although  my son thought they were more like neon purple.  I thought they were pulsing or blinking in unison at a what I think was a rate of 2-3 pulses per second.  Aaron thought this effect was from them passing in and out of the cloud cover. After the light turned green I caught glimpses of the lights again - although it was difficult to focus on them because I was driving.  Aaron saw them more clearly but we were moving so visual confirmation was difficult to maintain for him as well.  Light pollution didn’t help either.  About a quarter of mile down the road, we turned in behind a school to see if we could still observe the phenomenon but they had apparently disappeared behind the cloud cover or moved too far distant for us to observe them further. I would estimate the total time of the incident to be about one to two minutes from beginning to end of the observation. My son is a student at the local high school and an interested skeptic in such phenomenon.  I am a 49 year old  27 year teacher who has an admittedly avid interest in the topic of UFOs and although I’ve seen some unusual lights in the sky?  None I can’t explain as conventional artificial, meteorological, biological, or astronomical objects - until now.  The only conventional explanation I can think of for these object would be a formation of military helicopters.  They were definitely not airplanes or jets (moving too slowly), birds (unless pigeons have suddenly evolved luminescence in Oklahoma!), balloons, or meteors.",
      "link": "http://www.nuforc.org/webreports/093/S93343.html",
      "state": "OK",
      "duration": "<2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3be1f6",
      "summary": "Flashing lights in formation moving west to east over a 6 minute period in Tulsa OK",
      "city": "tulsa",
      "shape": "formation",
      "date": "2012-07-04T00:00:00",
      "story": "Flashing lights in formation moving west to east over a 6 minute period in Tulsa OK My wife saw 2 flashing lights in the sky in formation moving from West to East.  We were located at our home approximately 2 blocks south, and 2 blocks east of the intersection of 51 & Sheridan Road, in Tulsa, OK.  I was in bed, she called me out excitedly.  As I came outside, and walked to the end of our driveway and looked due south, she said look at that.. it looked like two strobe lights in the sky the lower left and upper right lights were intermittently flashing, red, blue, red, red, blue, white, and the flashing pattern was in sync for about 10 seconds my wife said.  She walked to the house called me, I came out and saw them stationary with NO sound.  The objects were at least a few miles in the air about 40degrees up from our vantage point at the end of the driveway.  I came outside saw them stationary... then they two objects started spreading apart... I immediately ran back inside to get my video camera and my $5K Canon 5DMark II digital slr camera! , and tried to take a video... as I got back outside (while my wife kept them in sight), they started moving to the east, south east at about 70-80 miles per hour, and I tried to setup my video camera to catch them... however couldn't focus on anything... I got my SLR camera out and changed lenses to my 70-200... and tried to get a 1080P hd movie going... but couldn't focus on anything... by the time I had the video going... they were at least 6-8 miles away... in less than 2-3 minutes. I had to walk south down our street to view them through the tree line.. and could still make out the blue, red, blue, red, white, blue, red, alternating flashing....  my wife was videoing and trying to see anything while I continued to try to take some time delayed stills to see if I could amplify the ambient light but couldn't.  I was outside watching the flashing until My eyes could barely make out a faint white flashing of 2-3 objects... in the far distance.  This all occurred within abo! ut 6 minutes!!   This is my wife and our 3rd sighting in the l! ast 3 mo nths now.  Last one in Arkansas, and 3 months ago directly above our home at 51 & Sheridan... what is going on?  No Noise?  and Bright star like objects moving in irregular ways...",
      "link": "http://www.nuforc.org/webreports/090/S90171.html",
      "state": "OK",
      "duration": "6 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3be3c4",
      "summary": "When I was at a Sonic's in Tulsa, Ok. out of no where I've seen a Blue, Blue Green, and Withe UFO over Pine and Peoria. Then like about",
      "city": "tulsa",
      "shape": "circle",
      "date": "2012-05-29T00:00:00",
      "story": "When I was at a Sonic's in Tulsa, Ok. out of no where I've seen a Blue, Blue Green, and Withe UFO over Pine and Peoria.   Then like about five secs later I've seen military craft out of know where.  I was pist because I did not had my iphone.",
      "link": "http://www.nuforc.org/webreports/089/S89005.html",
      "state": "OK",
      "duration": "South"
    },
    {
      "_id": "64d005f478aba2ec5a3be57f",
      "summary": "Four Round bright orange low and slow objects over Tulsa",
      "city": "tulsa",
      "shape": "circle",
      "date": "2012-05-29T00:00:00",
      "story": "Four Round bright orange low and slow objects over Tulsa Four objects headed from the east headed north west over Tulsa at dusk.  Bright orange, flying slow and low.  One in front, followed by a grouping of two, then one more.   Yard is heavily treed, so I could not follow them for long.  Bright Orange and circular. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/089/S89046.html",
      "state": "OK",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3beca9",
      "summary": "Green beam of light over Tulsa",
      "city": "tulsa",
      "shape": "light",
      "date": "2013-08-30T00:00:00",
      "story": "Green beam of light over Tulsa We had a major storm erupt last night in the Tulsa area by the Fairgrounds.  I witnessed what appeared to be a green \"laser\" about 3' in diameter scanning my yard.  I was no more than 15' away at its closest point.   It was definitely not lightning and came from a direct source in the sky.   I have no idea what it was but I have experienced this several times before since I was a child.",
      "link": "http://www.nuforc.org/webreports/100/S100430.html",
      "state": "OK",
      "duration": "15 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bee22",
      "summary": "Bright fast light making full circle in mid town in under 5 min",
      "city": "tulsa",
      "shape": "formation",
      "date": "2013-08-30T00:00:00",
      "story": "Bright fast light making full circle in mid town in under 5 min While getting on the highway the craft was spotted. Our vehicle was getting on 412 east bound to 244-E when it came from West Tulsa making a counter clockwise large circle over Utica St. and then off towards North Tulsa where it made a full circle and headed back east. It moved extremely fast, it was all white lights, two constant bright white \"cigar\" shaped lights that made a slight \"\\/\" shape but more open, almost flat but you could still see the slight \"v\" shape and blinking lights that seems to rotate around the middle just about the \"v\" shape, in an off on flashing pattern.  As it headed north, a helicopter came from the south and attempted to follow it, but the unknown craft was much more fast than the helicopter could travel, and it was gone. Mind you, this traveled from west Tulsa, first climbing upward emitting a yellow color, then it took off towards down town in a white color and made a full circle in less than 5 minutes, I've never seen a craft so fast, fly so low, with out making a sound...",
      "link": "http://www.nuforc.org/webreports/100/S100806.html",
      "state": "OK",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bf28e",
      "summary": "UFO over Tulsa, Oklahoma at 12:58am 12/21/12",
      "city": "tulsa",
      "shape": "other",
      "date": "2013-02-04T00:00:00",
      "story": "UFO over Tulsa, Oklahoma at 12:58am 12/21/12 I was on Facebook when I had a sudden urge to go outside.  It was already past midnight, so I thought to myself (okay I will go have a last cigarette before I head off to bed.). So I stepped out of my front door that face's west and started to look at the moon as it was setting. Oddly my attention was pulled to the N.W. I saw a red light going toward the airport. I naturally thought it was a plane. Then I noticed there were no flashing lights.  I said aloud, \"Okay... Now I'm watching you..\" Once I had said that it changed from heading East to S.E. then to South.  It was heading towards me.  I stepped further out into the front yard to get a better look as it went above my house.  I quickly ran in woke up my father and grabbed a camera.   By the time I got back outside it was gone nowhere to be seen even from the roof.  Later a plane went by higher up then it was I could see the flashing lights on it and hear the sound as it passed.  Description - Very bright red light 3 times bigger then any airplane or helicopter spotlight at the altitude it was traveling.  No noise emitted from the Craft.  Massive dark shape behind the red light.  Blocked out stars as it passed overhead. 5 times faster then any witnessed plane bomber jet (commercial/Fighter ). No tail/tracers from the light.  Single light 1/6 the size of craft.",
      "link": "http://www.nuforc.org/webreports/095/S95416.html",
      "state": "OK",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bf5b2",
      "summary": "Two, orangish-red ufo's over downtown Tulsa, on the night of the 4th of July.",
      "city": "tulsa",
      "shape": "unknown",
      "date": "2013-07-14T00:00:00",
      "story": "Two, orangish-red ufo's over downtown Tulsa, on the night of the 4th of July. I saw two of the orangish-red ufo's fly from the south to the north over downtown Tulsa between 8:30 PM, central standard time and 9:45 PM, central standard time while waiting to watch a fireworks display in downtown Tulsa, Oklahoma.   The two ufo's produced no sound and had no strobe lights like conventional aircraft.",
      "link": "http://www.nuforc.org/webreports/099/S99963.html",
      "state": "OK",
      "duration": "20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bf864",
      "summary": "Bright star moving across the sky at very slow speed.",
      "city": "tulsa",
      "shape": "unknown",
      "date": "2013-06-02T00:00:00",
      "story": "Bright star moving across the sky at very slow speed I was outside smoking a cigarette telling my roommate about a UFO I saw a few years ago in mid sentence he interrupted me and pointed up in the sky when I looked up I saw the same thing I have been seen for the past few years between 9:00PM - 10:30PM a bright star was slowly moving across the sky north to south after about a minute the star started to loose it's brightness and changed direction to the east eventually it was no longer bright but you can still see the object high up in the sky.  I have been seen these objects &quot;stars&quot; almost once or twice a week.",
      "link": "http://www.nuforc.org/webreports/098/S98049.html",
      "state": "OK",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3bfea0",
      "summary": "Tulsa OK 61st & Harvard residential area UFO 20 - 25 feet off the ground above the trees (front yard).",
      "city": "tulsa",
      "shape": "disk",
      "date": "2013-10-03T00:00:00",
      "story": "Tulsa OK 61st & Harvard residential area UFO 20 - 25 feet off the ground above the trees (front yard) After picking up my kids from school I came home and pulled up to my drive way and discovered that my garage door did not want to open I stepped out of my car and walked around the car to let my kids out when I heard a noise that sounded like electricity /static electricity/low pitch I felt as something was off and had a strange urge to look up in the trees in my front yard.   When I looked up there was a craft/ saucer shaped the size of a medium round kitchen table just hanging there about 20 – 25 feet off the ground just above the treetops.  The craft was very clear I could see every detail on it.  It had green, yellow and red lights rotating in one direction and the craft itself rotated in the opposite direction of the lights.    As I started panicking and telling my kids to get out of the car and go towards the house I kept my eye on the object and felt as I was been watched by whoever or whatever was inside the craft.  The craft than changed its position from facing straight down to angle view (front part of the saucer facing towards the ground and back facing to the sky) and then it just shot up in the sky and to the side as if I blinked and nothing was ever there.   My kids saw the craft from the car.  The metal of the craft was not ordinary it almost looked as it was see through some kind of liquid metal not of this earth.   Until this experience I was not a believer.  This was not something out of this world it almost looked as it moved with the speed of light..",
      "link": "http://www.nuforc.org/webreports/102/S102865.html",
      "state": "OK",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c06f7",
      "summary": "Large airplane flying low to ground stopping in mid-air hovering for a few seconds then continuing to fly.",
      "city": "tulsa",
      "shape": "other",
      "date": "2012-12-21T00:00:00",
      "story": "Large airplane flying low to ground stopping in mid-air hovering for a few seconds then continuing to fly. At 7:00 pm on December 20 2012 me my father and his girlfriend witnessed an airplane that was flying oddly low.   We watched the plane for a few seconds then the plane stopped completely in mid-air.  The large airplane hovered in the sky for a few seconds then rapidly sped up only to stop and hover again for a few more seconds.   My Dad has had aviation training and is familar with flight patterns and manuvers of human aircraft.  The reason I am reporting this on a UFO website is because airplanes can not stop and hover in mid-air. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/095/S95364.html",
      "state": "OK",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c06ea",
      "summary": "MORE PEOPLE HAD TO HAVE SEEN THIS AND NEED TO REPORT TO TULSA NEWS.",
      "city": "tulsa",
      "shape": "light",
      "date": "2012-12-20T00:00:00",
      "story": "MORE PEOPLE HAD TO HAVE SEEN THIS AND NEED TO REPORT TO TULSA NEWS SAW TWO FLASHES OF BLUE LIGHT TODAY ON MY DRIVE TO WORK.  THEY WERE TOO HIGH IN THE SKY TO BE UTILITY RELATED SUCH AS TRANSFORMERS BLOWING UP OR LINES OBSTRUCTED AND ARC FLASHING.  THESE LOOKED BLUE, WERE VERY LARGE AND WERE GONE IN A BLINK. WASN’T LIKE LIGHTHNING THAT WE TYPICALLY SEE; THE DEEP BLUE FLASH SURROUNDED A LARGE AREA OF SKY UNLIKE ANY LIGHTNING I’VE SEEN.",
      "link": "http://www.nuforc.org/webreports/095/S95351.html",
      "state": "OK",
      "duration": "1 second"
    },
    {
      "_id": "64d005f478aba2ec5a3c06ed",
      "summary": "A large metallic cigar/blimp like object that hovered in the air for 15 to 20 seconds and then shrunk into dispearnace in 1.5 seconds.",
      "city": "tulsa",
      "shape": "other",
      "date": "2012-12-21T00:00:00",
      "story": "A large metallic cigar/blimp like object that hovered in the air for 15 to 20 seconds and then shrunk into dispearnace in 1.5 seconds. At about 8:00 am (09:00) I was driving to school in Tulsa Oklahoma when I spotted a flying about hovering in the sky.  I observed the object for about 15 to 20 seconds.  I noticed the object was kind of cigar shaped but fatter in the middle almost blimp like but I have seen a blimp before and it was not a blimp.  The object was metallic and I could see the sun reflecting off ofthe surface of the object.  After oberving the object for 15 to 20 seconds the object shrunk until it disapeared.  The shrinking process occured in about a second and a half and it was gone. ((NUFORC Note:  Witness elects to remain totally anonymous; provides ittle contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/095/S95362.html",
      "state": "OK",
      "duration": "15-20 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c1051",
      "summary": "((HOAX??))  Multiple witnesses report hearing a very strange sound, emanating from the sky.",
      "city": "tulsa",
      "shape": "",
      "date": "2014-02-21T00:00:00",
      "story": "Multiple witnesses report hearing a very strange sound, emanating from the sky. This is a first for me, so not sure where or who to report it to and it may be nothing.  I live in a suburb on the outskirts of Tulsa, OK.  This last Wednesday at about 3:00pm, (I know as my son's bus came during the event) we started hearing the strangest noise we've ever heard over my home.   We ran outside as did many others, when it did not stop like a normal aircraft passing would.  The cloud cover was immense, but we could tell something was overhead.  Not just loud, but you could feel the pressure change.   A bunch of people went outside as this went on several minutes, and felt like it lasted forever.  I wish I could accurately describe the sound and the way it felt.  My dogs did not bark like they normally would, they went and hid.  Cars were stopping and everyone was trying to see what it was.   The only thing I saw, was after this noise had passed from overhead, I saw 2 fighter jets fly by at a very low altitude right over my house, through a small cloud break.  This noise kept going and going.  If it was some aircraft, it would have to be circling around and around for the entire length of time.   Even stranger, after, the news here reported at least 12 power transformers spontaneously erupted in fire causing over 1000 people to lose power.  Maybe a coincidence, but weird.   Nothing was mentioned anywhere about the air event, except on Facebook conversations.  My sister in law heard it at her house about 12 miles south, and this was right over my house going in a northeast direction, so it was that loud.  They went out to see what it was there, and couldn't see anything either.   My other sister in law lives close to my neighborhood, and said she was afraid it was the end of the world and was thinking only about her son at school.  At the grocery store yesterday, I overheard two people talking and one mentioned they thought it could be \"haarp\" related.  I had to look that up to see exactly what it was.  Whatever it was, it was bizarre and even stranger that the transformers blew up and that nothing was mentioned about it from our news sources.    I just wanted to report it somewhere.  Even if it was military maneuvers, it's worth reporting.  Obviously the military was involved somehow as the 2 jets that were following it could be seen. Sincerely, ((name deleted))",
      "link": "http://www.nuforc.org/webreports/107/S107307.html",
      "state": "OK",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3c1288",
      "summary": "During the snow fall on Friday night, I stepped out for a cigarette. I heard a strange sound that seemed to be a mix between very dista",
      "city": "tulsa",
      "shape": "circle",
      "date": "2013-12-12T00:00:00",
      "story": "During the snow fall on Friday night, I stepped out for a cigarette. I heard a strange sound that seemed to be a mix between very distant bells and a long drawn out low trumpet sound.  At some point I looked up into the sky at the snow fall and spotted a black circle.  It almost seemed as if it were turning slowly left then 30 seconds later to the right, as if a satellite dish would do when searching for transponders. Each time the sound would resonate into the night like a pulse.  There was what looked like a faint red light in the middle of the circle, that part was hard to tell, it could have been me trying to focus through the snow, but I for certain stared at this black circle that is no longer there, so it was not a shadowed fixture from a tower, something was there.  It was in the South Eastern sky just south of Tulsa University.",
      "link": "http://www.nuforc.org/webreports/105/S105190.html",
      "state": "OK",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c163a",
      "summary": "Video of giant triangular craft and helicopters that come shortly after and hover beneath it.",
      "city": "tulsa",
      "shape": "triangle",
      "date": "2013-11-11T00:00:00",
      "story": "video of giant triangular craft and helicopters that come shortly after and hover beneath it. It is a video taken very close up of a GIANT (baseball field sized) triangular craft that is also tall.  2 helicopters then fly under it and hover.  The details of the craft are very pronounced although it is dark outside.",
      "link": "http://www.nuforc.org/webreports/104/S104338.html",
      "state": "OK",
      "duration": "20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c17ed",
      "summary": "Green light raveling from East to West.",
      "city": "tulsa",
      "shape": "other",
      "date": "2014-07-11T00:00:00",
      "story": "Green light raveling from East to West. My wife and I looking due south in East Tulsa seen a elongated greenish light traveling from the East to directly West.  Lasted approximately 5 seconds.  We are normal folks just looking in the sky and bam!   There it was, silent and seemingly losing altitude throughout its trajectory.   At some point in western sky it vanished.",
      "link": "http://www.nuforc.org/webreports/111/S111356.html",
      "state": "OK",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c1a68",
      "summary": "12 orange orbs above downtown.",
      "city": "tulsa",
      "shape": "sphere",
      "date": "2014-06-20T00:00:00",
      "story": "12 orange orbs above downtown. Above some buildings in downtown.  12 orange spheres flying about what seemed randomly.   They were giving off light, I was able to see them faintly from my front porch more than an hour later.   They seemed to hover above one building but flew about randomly in a large radius.  They would die below the roof of the building.   The sky has no clouds, and they almost seemed like flying orange stars.    A co-worker and I both stared in awe at the phenomena ((NUFORC Note:  Source of report indicates that the date is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/110/S110313.html",
      "state": "OK",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c1b0b",
      "summary": "At least one craft with very bright lights very low in the sky seen by 2 people in Tulsa.",
      "city": "tulsa",
      "shape": "triangle",
      "date": "2014-07-20T00:00:00",
      "story": "At least one craft with very bright lights very low in the sky seen by 2 people in Tulsa. My friend and I were driving east and we saw an extremely bright light in the sky.  It did not appear to be moving and it did appear to be twinkling so I assumed it was a star.   I got out my stargazing app to see what star looked so large and close and there was no major star in that particular spot.   We drove for about 3 more miles and eventually it seemed to make a triangular shape.  For a few minutes it looked as if there were 2 but we aren't sure.   It started to get much clearer and it appeared to look like a craft flying extremely close to the ground but not landing or taking off.  It also at this point appeared to move a little bit and then stop again.  Then we turned north and to our surprise the light seemed to reappear to our left and it continued to move with us.   Then we turned east and it appeared behind us, then disappeared.",
      "link": "http://www.nuforc.org/webreports/111/S111581.html",
      "state": "OK",
      "duration": "15-20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c1dc9",
      "summary": "Slow moving fireball.",
      "city": "tulsa",
      "shape": "fireball",
      "date": "2014-07-11T00:00:00",
      "story": "Slow moving fireball. Slow moving fireball crossed the sky.   Was about 6-7 miles South of a storm cell.  Saw lightning in the area afterwards. Video is here. http://youtu.be/9ojcIoaHq78  http://youtu.be/Ssxv1F0a4qE",
      "link": "http://www.nuforc.org/webreports/111/S111410.html",
      "state": "OK",
      "duration": "60 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c20c3",
      "summary": "A bright white light in form of a cross appeared from southwest of Tulsa.   As it approached,  the craft moved to right for a second th",
      "city": "tulsa",
      "shape": "changing",
      "date": "2014-04-24T00:00:00",
      "story": "A bright white light in form of a cross appeared from southwest of Tulsa.    As it approached,  the craft moved to right for a second then headed due north.  It repeated this several times before slowing its speed down to a more fluent motion...   There was no sound as the craft flew directly over Tulsa.  Flashes of red appeared as it  slowed tremendously from its initial speed.  Silently it continued north..   The craft appeared to be cigar- like shape with yellow lights- one large in center with red small lights on either side and two smaller yellow lights on outer ends.   It appeared to float at this speed like a blimp.  It appeared to float further over Tulsa going north to north east...  Time recorded from 10:58 to 11:01 PM.",
      "link": "http://www.nuforc.org/webreports/108/S108744.html",
      "state": "OK",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c226e",
      "summary": "Pyramid shaped UFO sighted over Southern Hills Golf Course Wednesday, April 23rd over TULSA, OKLAHOMA.",
      "city": "tulsa",
      "shape": "triangle",
      "date": "2014-04-24T00:00:00",
      "story": "Pyramid shaped UFO sighted over Southern Hills Golf Course Wednesday, April 23rd over TULSA, OKLAHOMA. At 24:40, Wednesday, April 23rd 2014, I was driving in neighborhood from pharmacy.  I was traveling west on 75th Avenue when I noticed two very bright lights.  I thought it was just another car traveling because the two bright lights moved fluently and very smoothly much like a car with its brights on over the hills.  With so many hills in our neighborhood I thought nothing of it. I quickly realized I was wrong.  The two lights were not coming from a car but from a craft in the sky.  I realized it was a UFO.  The bright lights continued from west to east, fluently, over the trees and then made a right turn.  This turn  i would guess to be a 45 degree turn,  which allowed me to see two sides forming a v-shape.  It was moving at a steady rate of traffic so I would guess it was flying 45 to 50 mph. I turned the corner, heading north on Jamestown, as the UFO was directly past.  I turned the corner and decided to follow.   I was able to keep my eyes on it the entire time as I headed North on Harvard.  I immediately turned left. I could now make out the pyramid shape of the object from radiating off the golf course and also told me the craft  was now at 65th street between Harvard and Lewis.    At Lewis, the craft continued on till Riverside Drive then headed north following the interstate.   I got held up at the light and was unable to see it about a minute later when the five cars ahead of me had turned.   I am certain others had to have seen this UFO in Tulsa and I am guessing it was the same craft that was identified in Kansas. ((NUFORC Note:  Witness elects to provide no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/108/S108876.html",
      "state": "OK",
      "duration": "4-5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c25fd",
      "summary": "Four reddish lights in square formation in NW sky.",
      "city": "tulsa",
      "shape": "formation",
      "date": "2014-11-06T00:00:00",
      "story": "Four reddish lights in square formation in NW sky. Saw 4 red or orange lights grouped together in a square formation in the NW sky; they did not flash.  There was an airplane flying by the formation at what looked like a pretty good distance away from them.  I got a good look at the formation for a few seconds and then all of sudden the reddish lights went black and were gone. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/114/S114815.html",
      "state": "OK",
      "duration": "2 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c276f",
      "summary": "Disk shaped UFO shoots out of pink cloud in Tulsa, Oklahoma.",
      "city": "tulsa",
      "shape": "disk",
      "date": "2014-09-18T00:00:00",
      "story": "Disk shaped UFO shoots out of pink cloud in Tulsa, Oklahoma. I was on the front lawn, facing southwest, and noticed a strange looking cloud in the sky, just above the top of the houses across the street, so it wasn't directly overhead.   It was pink and golden colored, unlike the white clouds in the rest of the sky.   Suddenly a large disk shaped object came out of the cloud.  It was silver looking, then went VERY bright, like a golden neon light.  It hovered there for a few seconds, then shot off horizontally to the west, too fast for me to even follow with my eyes.   I've never seen a UFO before so this was really exciting to see!",
      "link": "http://www.nuforc.org/webreports/113/S113631.html",
      "state": "OK",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c29a9",
      "summary": "Glowing round light that flickered and moved slowly NW across the sky.",
      "city": "tulsa",
      "shape": "light",
      "date": "2014-10-03T00:00:00",
      "story": "glowing round light that flickered and moved slowly NW across the sky, got pictures and video",
      "link": "http://www.nuforc.org/webreports/114/S114008.html",
      "state": "OK",
      "duration": "20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c2a5b",
      "summary": "I just seen a strange craft flying strange in the sky. It was wight and blue light. It showed up righter I just d/l an ufo doctor app o",
      "city": "tulsa",
      "shape": "triangle",
      "date": "2014-08-29T00:00:00",
      "story": "I just seen a strange craft flying strange in the sky.  It was wight and blue light.  It showed up righter I just d/l an ufo doctor app on my phone.  So I went out side and look up and there it was.",
      "link": "http://www.nuforc.org/webreports/112/S112793.html",
      "state": "OK",
      "duration": "Downtown"
    },
    {
      "_id": "64d005f478aba2ec5a3c2b05",
      "summary": "Silver ball sphere next to sun.",
      "city": "tulsa",
      "shape": "sphere",
      "date": "2014-11-21T00:00:00",
      "story": "Silver ball sphere next to sun. A white ball of light sitting still.  Silverish sphere.",
      "link": "http://www.nuforc.org/webreports/115/S115475.html",
      "state": "OK",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c2c90",
      "summary": "Moved at very slow speed but sounded like a very slow jet propulsion.",
      "city": "tulsa",
      "shape": "triangle",
      "date": "2014-08-22T00:00:00",
      "story": "Moved at very slow speed but sounded like a very slow jet propulsion. Triangular shaped craft with three main lights and one red flashing light and center the craft hovered for 10 seconds.   Approximately 500 feet off the ground.",
      "link": "http://www.nuforc.org/webreports/112/S112696.html",
      "state": "OK",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c2eaa",
      "summary": "Bright light above cloud.",
      "city": "tulsa",
      "shape": "circle",
      "date": "2014-08-15T00:00:00",
      "story": "Bright light above cloud. I was driving over by Promenade Mall and I new tonight was the super moon, so I looked up in the sky around 8, tonight and saw a white dot, very bright right above a cloud, it stayed for about five seconds and disappeared then in the same position, I saw the same light it was about the size of a truck or car.   It shone twice very brightly and disappeared.  Weird!   No color just white.",
      "link": "http://www.nuforc.org/webreports/112/S112366.html",
      "state": "OK",
      "duration": "5-10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c30ee",
      "summary": "At the Guthrie Green tonight, when several people including my family saw an unidentified flying object over downtown Tulsa.",
      "city": "tulsa",
      "shape": "triangle",
      "date": "2014-08-15T00:00:00",
      "story": "We were at the Guthrie Green tonight when several people including my family saw an unidentified flying object over downtown Tulsa.  The craft was triangular in shape and flashed three colors-red, blue and white.   It defied physics by making several right turns coming vertical.  It would go up slowly then come down slowly.  It moved very fast and then hovered for about 2 minutes over us, and then it went into the clouds and disappeared",
      "link": "http://www.nuforc.org/webreports/112/S112468.html",
      "state": "OK",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c3484",
      "summary": "While driving down 41st, headed west, we saw a strange light in the sky moving straight up, with streams of lights under it.",
      "city": "tulsa",
      "shape": "unknown",
      "date": "2015-02-20T00:00:00",
      "story": "While driving down 41st, headed west, we saw a strange light in the sky moving straight up, with streams of lights under it. We saw a bright light down pretty low under the clouds. It was going slowly straight up.  As we got closer to the object we could see a circular object on the top with fire like streams of lights shooting below it.  As we took pictures and video it started moving faster (straight up) until it was just gone.  Can anyone explain that?  Did anyone else see what we saw?",
      "link": "http://www.nuforc.org/webreports/117/S117318.html",
      "state": "OK",
      "duration": "5-8 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c34f9",
      "summary": "Multiple witnesses to a strange sound near Tulsa, OK.",
      "city": "tulsa",
      "shape": "",
      "date": "2015-02-20T00:00:00",
      "story": "Multiple witnesses to a strange sound near Tulsa. This is a first for me, so not sure where or who to report it to and it may be nothing.   I live in a suburb on the outskirts of Tulsa, OK.  This last Wednesday at about 3:00pm, (I know as my son's bus came during the event) we started hearing the strangest noise we've ever heard over my home.  We ran outside as did many others, when it did not stop like a normal aircraft passing would.  The cloud cover was immense, but we could tell something was overhead.  Not just loud, but you could feel the pressure change.   A bunch of people went outside as this went on several minutes, and felt like it lasted forever.  I wish I could accurately describe the sound and the way it felt.  My dogs did not bark like they normally would, they went and hid.  Cars were stopping and everyone was trying to see what it was.    The only thing I saw, was after this noise had passed from overhead, I saw 2 fighter jets fly by at a very low altitude right over my house, through a small cloud break.  This noise kept going and going.  If it was some aircraft, it would have to be circling around and around for the entire length of time.   Even stranger, after, the news here reported at least 12 power transformers spontaneously erupted in fire causing over 1000 people to lose power.  Maybe a coincidence, but weird.   Nothing was mentioned anywhere about the air event, except on Facebook conversations.  My sister in law heard it at her house about 12 miles south, and this was right over my house going in a northeast direction, so it was that loud.  They went out to see what it was there, and couldn't see anything either.   My other sister in law lives close to my neighborhood, and said she was afraid it was the end of the world and was thinking only about her son at school.  At the grocery store yesterday, I overheard two people talking and one mentioned they thought it could be \"haarp\" related.  I had to look that up to see exactly what it was.   Whatever it was, it was bizarre and even stranger that the transformers blew up and that nothing was mentioned about it from our news sources.    I just wanted to report it somewhere.  Even if it was military maneuvers, it's worth reporting.  Obviously the military was involved somehow as the 2 jets that were following it could be seen.  Sincerely,  ((name deleted))  Sent from my iPhone ((NUFORC Note:  Witness provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/117/S117309.html",
      "state": "OK",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3c35a3",
      "summary": "3 Round Bright Green Lights not flashing side by side & 1 Red Flashing Light, Loud Craft.",
      "city": "tulsa",
      "shape": "unknown",
      "date": "2015-02-12T00:00:00",
      "story": "3 Round Bright Green Lights not flashing side by side & 1 Red Flashing Light, Loud Craft. Looked out patio door at 2 a.m. In the North Airport area I noticed some really bright green lights side by side in sky.  Thought it was odd and not normal.  So I sat there and waited for it to get closer.  It was low flying, barely above tree top level.  It came about as fast as an airplane taking off would.  When it got close I could see 3 really large Round Bright Green Lights that were not blinking.  It was going South.   When it got to my fence line it stopped and hovered. It was real loud like a lawnmower in the sky. It was so steady hovering there.  I sat there wondering what the heck this thing is? I could not open my door to get a better look, or my Alarm would have went off.  I sat there watching it.  I heard a noise like a transmission would make and those 3 Green Lights rotated counter clockwise and was now Facing East instead of South like they were facing. That was an incredible sight.  The lights literally twirled around fast.  When it turned I now saw a R! ed Flashing Light on the back of this thing and could see about one inch of the Green light lens on one of the lights on the side near me, I knew the lights were still there but now they were facing East.  The craft took slowly off going East now.  This thing had to be black or a dark color cause It was so dark that morning, I could not make out shape of it.  I could not tell what it was. It was not our Police Helicopter or an airplane.  It was not a toy either.  It was too large.  The lights were huge. I live on the flight path of the airport and am used to seeing all kinds of airplanes and helicopters.  Never saw lights like that or a sound like that.  I have spent hours now researching every plane, drone and helicopter I can find and can’t find anything that has 3 Green lights on it that are that large and round and don’t blink.  So wish I knew what it was.   One thing for sure, I saw first hand how these flying crafts change direction so fast.  Apparently they must push a button or a gear and can go from going South to going East real quick.  It must be a new craft too, not many reports of 3 Green lights that are solid and not flashing.  I will never forget what I saw.  It all happened so fast and me being slow at walking, I could not get my camera to take a picture or I would have missed it!",
      "link": "http://www.nuforc.org/webreports/117/S117276.html",
      "state": "OK",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c365f",
      "summary": "I was traveling north on highway 75. It was almost dark outside but still visible to see in the sky. All of sudden when driving north i",
      "city": "tulsa",
      "shape": "cylinder",
      "date": "2015-03-06T00:00:00",
      "story": "I was traveling north on Highway 75.  It was almost dark outside, but still visible to see in the sky.   All of sudden when driving north I spotted something in the sky.  The sighting was right over the crossing of pole cat creek. up in the sky was a craft with three wings and three sets of wings. The wings were almost like a capital L with another hook on it.   The aircraft was just hovering about 200 feet up.  It was a cylinder type of craft with a sharp front.  The wings of the set of three were aprox 1/3 of the length of the craft.  The wings were almost like frozen.  There was no activity other then the hovering.   At the end was almost like a jet engine but a lot bigger and move developed.  There was also nothing else coming out of this engine no streaks. almost like when you see fumes coming out of an exhaust.  More layers then a regular engine.  The color was almost like a black silk kind of color.  It was somewhat shiny, but still dull.   By the time i got off the exit it was already gone.   There is a lot of plane activity which that is what i thought at first but it was running east to west, instead of running north to south, which the Jenks Airport does.  It was also moving to slow and to low to the ground to be a aircraft.   I'm really not doing this for attention.  I just want to know if anyone else saw what I did, last night.",
      "link": "http://www.nuforc.org/webreports/117/S117586.html",
      "state": "OK",
      "duration": "30-45 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c3b81",
      "summary": "Sun was shining on hovering, still, silver object in western Tulsa sky, about 15 seconds before it vanished.",
      "city": "tulsa",
      "shape": "unknown",
      "date": "2015-08-06T00:00:00",
      "story": "Sun was shining on hovering, still, silver object in western Tulsa sky, about 15 seconds before it vanished. I was driving West around 17:45 and notice a shiny object in West sky over Tulsa.  The sun was making it shiny.   I watched it hovering about 15 seconds.  It didn't move.  And then it vanished...disappeared. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/120/S120855.html",
      "state": "OK",
      "duration": "15 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c406b",
      "summary": "Bright object traveling at a west to east direction accelerated and made what can be described as a u turn.",
      "city": "tulsa",
      "shape": "unknown",
      "date": "2015-05-22T00:00:00",
      "story": "Bright object traveling at a west to east direction accelerated and made what can be described as a u turn. Object appeared as a moving bright light.  Initially thought to be either a shooting star or satellite.  Traveled as slowly as a satellite, in a west to east direction, but suddenly took an almost perfect 90 degree turn to the north, and then again back to the west.  The object accelerated at a rate at least 5 times as fast as it was traveling initially when it made the two 90 degree turns.",
      "link": "http://www.nuforc.org/webreports/119/S119033.html",
      "state": "OK",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c429e",
      "summary": "Saw multiple balls of light moving across the sky at low altitude.  At one point they slowed down, stopped and fly away rapidly.",
      "city": "tulsa",
      "shape": "circle",
      "date": "2015-04-23T00:00:00",
      "story": "Saw multiple balls of light moving across the sky at low altitude.   At one point they slowed down, stopped and fly away rapidly. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/118/S118557.html",
      "state": "OK",
      "duration": "20 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c4509",
      "summary": "Tulsa UFO with amazing flight path at speed.",
      "city": "tulsa",
      "shape": "triangle",
      "date": "2015-11-06T00:00:00",
      "story": "Tulsa UfO with amazing flight path at speed. I am a factually based MD radiologist practicing in a major medical center.  I have never had an experience of this nature. I was sitting in a hot tub shortly before dawn, when a more delta-like boomerang shaped object with a round apex and sharper back corners came into view far away on the eastern horizon.  It had no running lights, and was only faintly identifiable in the night sky as a vague pearlescent entity.  There were no clouds in the sky.   At first, I thought it was an ultralight, but it was so high that the shape never changed as it migrated from my 12 o'clock to my 4 o'clock position in a straight line.  There was no sound. At the 4 o'clock  position, it made a severe 90 degree turn south with no indication of banking or change in shape.  The turn was executed as a smooth alteration in course occurring in a space of approximately 2-3 times the width of the object with no change in speed.  It headed south for 2-3 more seconds and then disappeared from sight abruptly without any preceding alteration in speed or direction.",
      "link": "http://www.nuforc.org/webreports/123/S123222.html",
      "state": "OK",
      "duration": "15-20 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c5030",
      "summary": "Orange light.",
      "city": "tulsa",
      "shape": "unknown",
      "date": "2016-02-19T00:00:00",
      "story": "I'm a security officer from Tulsa.  On the above date and time, I was outside the guard house, having a cigar.  The weather was clear and calm (a front came in around 0630).   I saw an orange light heading due west.  The light slowly pulsate at about 2 second intervals, it was also very large about 3 or 4 times bigger than the largest star.   I couldn't tell how high it was or what the light was attached to.   It didn't make any noise. ((NUFORC Note:  We have corrected to date to February 08th, 2016.  PD)) ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/125/S125808.html",
      "state": "OK",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c513c",
      "summary": "It was a light going in half a circle every 6 seconds; it made a whistling sound, then it stopped and a car alarm went off.",
      "city": "tulsa",
      "shape": "light",
      "date": "2016-02-19T00:00:00",
      "story": "it was a light going in half a circle every 6 seconds and it made a whistling sound than it stopped and a car alarm went off. i was outside playing basketball when i noticed a circle light went by in a half circle motion so o stopped and seen it again than i counted how long until it did it again and i did that three times just to verify my answer and it was 6 seconds it was about 1:00 a.m when it happened than it stopped going around i didn't see it anymore than me and my witness heard a car alarm go off and it was in the area of the light so i said lets go inside to be safe cause that was a UFO.",
      "link": "http://www.nuforc.org/webreports/125/S125895.html",
      "state": "OK",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c512f",
      "summary": "While F-16s took off from TUL, a white disc/cloud object accelerated and disappeared on horizon.",
      "city": "tulsa",
      "shape": "disk",
      "date": "2016-02-11T00:00:00",
      "story": "While F-16s took off from TUL, a white disc/cloud object accelerated and disappeared on horizon. I am a aircraft ground handler at Tulsa International Airport (KTUL).  Between 14:27 and 14:33, I was servicing a plane parked on the B terminal, when I heard the local Air National Guard F-16s taking off.  I watched the lead aircraft rotate on Runway 36R heading North and then a small white disc- shaped cloud above the airport caught my eye.   The \"cloud\" began to accelerate to the east from a stationary position at a high rate of speed until it disappeared from my vision.   4 F-16s in total took off and circled the airport for aproximately 30 mins, then landed and taxied back to the Air Guard base.   2 had local Oklahoma 138th FW  tail markings and 2 had Ohio 180th FW markings.",
      "link": "http://www.nuforc.org/webreports/125/S125728.html",
      "state": "OK",
      "duration": "4 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c5665",
      "summary": "Assumed a bright light was a star until it wobbled, moved back and forth and straight up.  ((NUFORC Note:  Star?  PD))",
      "city": "tulsa",
      "shape": "light",
      "date": "2016-07-15T00:00:00",
      "story": "Assumed a bright light was a star until it wobbled, moved back and forth and straight up I was sitting outside of my house in midtown Tulsa.  In the eastern sky, I observed what I thought was a bright star until I noticed that it was kind of wobbling back and forth.  As I watched it shot up very  quickly and then returned to its station.  It kept doing this and then what really took my breath away was when it shot straight up moving kind of jerky.   I watched it and went and got my husband out of bed.  He has to get up at 6 for work, so I wouldn't do that on a whim.  He observed the light moving back and forth as well and then went back to bed.  I  watched and I tried to video it but was unable to.  I wanted to call someone, but I didn't know who to call.  The mosquitoes are bad this time of year, so I would go in the house and come out again and look.  This continued until I went to bed about an hour and a half later.  I wish I had stayed up now! ((NUFORC Note:  Star?  PD))",
      "link": "http://www.nuforc.org/webreports/128/S128463.html",
      "state": "OK",
      "duration": "1 hour"
    },
    {
      "_id": "64d005f478aba2ec5a3c564c",
      "summary": "I was sitting out @ about 11:00 pm.  I noticed a bright-what looked to be a star-in the distance. ((NUFORC Note:  Star?  PD))",
      "city": "tulsa",
      "shape": "light",
      "date": "2016-07-15T00:00:00",
      "story": "I was sitting out in my lawn chair about 11:00 pm.  I noticed a bright-what looked to be a star-in the distance.  It seemed pretty high in the air, to where i was not able to see any details.  The light moved erratically sideways and back, straight up and back, seemingly not a very far distance from point of origin. light always returned to original position.   I watched for hours before i went to bed.  I thought it might be my eyes playing tricks or clouds moving but  i was  holding my head perfectly still, and was certain that it was moving jerkily up and sideways.  If anyone else experienced this i would be very interested in information",
      "link": "http://www.nuforc.org/webreports/128/S128460.html",
      "state": "OK",
      "duration": "3 hours"
    },
    {
      "_id": "64d005f478aba2ec5a3c5988",
      "summary": "Three separate crafts taking off in a 90 degree angle.",
      "city": "tulsa",
      "shape": "triangle",
      "date": "2016-05-20T00:00:00",
      "story": "Three separate crafts taking off in a 90 degree angle. Around 2:15 am, I was letting my dogs outside before we went to bed, and as I looked up at the sky off to the southwestern direction I saw three crafts with flashing lights in a triangle shape.  I then saw two crafts, appear in the center of the triangle shoot off in a ball of light and very fast.  The smaller crafts took off in a northern direction and seconds after that the triangle split up and took off in a strait upward direction in a 90 degree angle.   Very shocking I got the dogs in and closed the blinds and did not see any further craft or UFO’s in the sky.  I will say it was amazing, and exiting all at the same time.",
      "link": "http://www.nuforc.org/webreports/127/S127350.html",
      "state": "OK",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c5b72",
      "summary": "High speed light.",
      "city": "tulsa",
      "shape": "light",
      "date": "2016-04-15T00:00:00",
      "story": "High speed light. Myself and a coworker were driving westbound on Hwy 51, we both saw a light travel over our heads at an extremely high rate of speed while curving upward until it disappeared into the distance.   We both agreed it was going faster than any known aircraft.",
      "link": "http://www.nuforc.org/webreports/126/S126726.html",
      "state": "OK",
      "duration": "2 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c5c23",
      "summary": "T-shaped object, moving slow, with one red one green and four white lights.",
      "city": "tulsa",
      "shape": "cross",
      "date": "2016-04-01T00:00:00",
      "story": "T-shapes object, moving slow, with one red one green and four white lights. My husband and I were out on our patio off in the distance which looked like a plane at first.  When it got closer it was moving slow probably 10 mph close to the ground.   When it got over us we saw circular lights one red, one green and four white lights under the craft and the craft looked T-shaped.  When it passed over our house it seemed to look like it just stopped moving from a distance.  We got in our car to follow it, but we couldn't find it.",
      "link": "http://www.nuforc.org/webreports/126/S126575.html",
      "state": "OK",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c5cf1",
      "summary": "I have great pictures. Been going on for over a week. They are reddish some flash bright white and moves L to R.((anonymous report))",
      "city": "tulsa",
      "shape": "other",
      "date": "2016-12-05T00:00:00",
      "story": "I have great pictures. Been going on for over a week. They are reddish some flash bright white and moves from left to right .  See crafts move zigzag .making some type of formation. I wish I had a good lens or telescope.  It's amazing.  Even see some at dusk.  I wish someone would come and watch these with me.  It would blow your mind.",
      "link": "http://www.nuforc.org/webreports/131/S131262.html",
      "state": "OK",
      "duration": "Hours"
    },
    {
      "_id": "64d005f478aba2ec5a3c5ee4",
      "summary": "3 flying objects seen, no sound, no lights, crafts flying in a line formation, appeared to be gray-to tan in color, almost invisible ag",
      "city": "tulsa",
      "shape": "triangle",
      "date": "2016-10-21T00:00:00",
      "story": "3 flying objects seen, no sound, no lights, crafts flying in a line formation, appeared to be gray-to tan in color, almost invisible against the partly cloudy night sky.  Passenger aircraft flew directly over the craft and moved much slower, easily identifiable as passenger jet.  The three crafts appeared to be flying at a high speed, and made no sound.   Following the sighting, immediately, aircraft traffic increased to a rate of half a dozen within 15 minutes of sighting.  All were using what I would describe as search lights to communicate morse code.  Very abnormal behavior.  30 minutes later, a single unknown craft identical to the first 3 was observed for 25 seconds, flying from northeast to south.",
      "link": "http://www.nuforc.org/webreports/130/S130687.html",
      "state": "OK",
      "duration": "8 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c608d",
      "summary": "At approximately 05:30 on 10/18/2016 I witnessed a series of 3 triangular shaped craft.  All 3 had lights on the the 3 points of a perf",
      "city": "tulsa",
      "shape": "triangle",
      "date": "2016-10-21T00:00:00",
      "story": "At approximately 05:30 on 10/18/2016 I witnessed a series of 3 triangular shaped craft.  All 3 had lights on the the 3 points of a perfect equilateral triangle.  First  at 05:35 then 5-7 minutes later the 2nd and 5-7 after that one came the third.",
      "link": "http://www.nuforc.org/webreports/130/S130673.html",
      "state": "OK",
      "duration": "20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c66a4",
      "summary": "Metallic, egg-shaped, silent, low-flying, object.",
      "city": "tulsa",
      "shape": "egg",
      "date": "2017-03-10T00:00:00",
      "story": "Metallic, egg-shaped, silent, low-flying, object. The object I witnessed flew over my house in the early afternoon.  I live under a common commercial and military flight path so I'm used to seeing interesting jets and planes flying overhead.   This object caught my eye because it was not only flying in the wrong direction from the usual flight path, but it was also perfectly silent, leaving no trail.  The object seemed to be roughly the size of a short school bus and flying about 40 stories high at probably 50 mph.  It was heading perfectly North.  The speed stayed consistent as I watched it fly beyond the horizon.  The object was more of a chrome I'd say than silver.  It reflected the ground an sky like a mirror.  The object also flew with the slightly smaller end pointed North in the direction it was heading. I hope this helps anyone who may have seen a similar object.  I've always wondered what it may be and if anyone else has seen the same. ((NUFORC Note:  Source of report indicates that the date is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/133/S133052.html",
      "state": "OK",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c69d3",
      "summary": "It was approximately noon in southern Tulsa, and my sister, mother and I were headed back from lunch. We saw a strange coppery, round o",
      "city": "tulsa",
      "shape": "sphere",
      "date": "2017-02-22T00:00:00",
      "story": "It was approximately noon in southern Tulsa, and my sister, mother and I were headed back from lunch.  We saw a strange coppery, round object far away and close to the horizon.  It had a round object that either reflected or glowed red attached on each side by a short pole.  After a few minutes of going further away, the two side objects were released and slowly floated up into the sky until we could no longer see them.  The main object soon sped up and passed beyond the horizon, out of sight. ((NUFORC Note:  Source of report indicates that the date is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/132/S132704.html",
      "state": "OK",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c6b80",
      "summary": "Large almost stationary distant object with white and blinking red lights",
      "city": "tulsa",
      "shape": "unknown",
      "date": "2017-01-26T00:00:00",
      "story": "Large almost stationary distant object with white and blinking red lights Noticed an extraordinarily bright star NE of my location; after several seconds of watching it, the star appeared to be blinking.  Figured it was a distant airplane. Some minutes later, I looked again, the object appeared stationary.  After several more minutes, same thing.  The blinking was intriguing, so I grabbed my binoculars. I braced the binoculars against a door to get a steady focus.  The object appeared to be a string of horizontal lights, with red lights blinking somewhere along the middle and another on the left end.  Figured it was a very distant jet, and the sighting was occluded by atmospheric conditions. Over the space of about 45 minutes, the apparent direction of travel was to the east and it may have been moving with the earth's rotation.  Thinking it was a planet (unlikely, as it was well to the north), I double checked with \"in-the-sky.org.\"  All of the planets were eliminated as an explanation. After a total of about 90 minutes, I went back to look again and the object had moved well north and slightly west of its previous position.  Another look through the binoculars provided pretty much the same description, with the possible exception of a gap in the lights. As I type this, it is moving below the tree line out sight in the general direction of Wichita, Kansas.",
      "link": "http://www.nuforc.org/webreports/132/S132255.html",
      "state": "OK",
      "duration": "1.5 hours"
    },
    {
      "_id": "64d005f478aba2ec5a3c710c",
      "summary": "Two fast moving green and silver orbs pass over Tulsa, Oklahoma.",
      "city": "tulsa",
      "shape": "sphere",
      "date": "2017-07-27T00:00:00",
      "story": "Two fast moving green and silver orbs pass over Tulsa, Oklahoma. I am a 52-year-old researcher/data collection specialist.  I was sitting with my 78-year-old mother and 13 year old son on our back porch. I was looking to the southeast and two green glowing orbs appeared from behind a neighbor’s roofline.  From my prospective, they appeared to be glowing green orbs with a barely noticeable silver edge around one edge of the green glowing circle; as if a sliver of the side of the object was observable.  The silver part seemed solid like it was metal. It is clear that they were several miles away.  They were also very high up.  It was a hot hazy day with hazy clouds high in the sky.  The objects were clearly observed being obscured by the clouds at times.  The two orbs stayed the same distance from each other throughout the observation.  They moved much quicker than an airplane but the movement was steady; not jerking around like perhaps a laser pointer might look. The orbs were heading towards us and the closer they got, the more obvious the details became.  It also was more obvious that the objects were very high up.  Once overhead, my perception was that they were not very big, maybe the size of a car.  At no time did we hear any sound coming from them. A middle aged couple was out for a walk and noticed my family looking at the sky.  They turned around and I asked them to look for the lights.  They saw them too.  We all stood and watched the lights move quickly but steadily towards us and over the house until we could not see them anymore.  My son said that right before they disappeared from our view, they circled each other.  This is the only observation that they broke the formation that we observed throughout.  My son is the only one who saw them circle each other.",
      "link": "http://www.nuforc.org/webreports/135/S135335.html",
      "state": "OK",
      "duration": "7 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c720f",
      "summary": "Large lighted stationary for over 1 hour three witnesses and possable photo on phone  object was lighted from top to bottom.",
      "city": "tulsa",
      "shape": "chevron",
      "date": "2017-07-14T00:00:00",
      "story": "large lighted stationary for over one hour three wittnesses and possable photo on phone object was lighted from top to bottom and resev On or about 1;10 am while walking my dog I looked up to see what constellations where visible since the sky was cleat with exception of a few small clouds.  As I looked to the north west I noted a large lighted object that was staying in the same location from my location in my driveway I could see it in obstructed at approx. 1 o'oclock  high at approx. 15000 to 18000 feet  At first it appeared to be a chevron, small at top wider at bottom lit at bottom and top with lights running vertical up the body of  the object  my 34 yr.  Old son in law 13 yr.old grandson and myself a retired police officer  drawings and time listings from first sight at 1:10 am to last sighting as it sped away at 2:18 am  I also tried to take photo with my phone but it wouldn't work till right before it left ((NUFORC Note:  We spoke via telephone with the witness, and he seemed to us to be quite sincere, and sober-minded.  We suspect that he is a very good witness.  PD))",
      "link": "http://www.nuforc.org/webreports/135/S135099.html",
      "state": "OK",
      "duration": "78 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c74bb",
      "summary": "Looked like 2 kites",
      "city": "tulsa",
      "shape": "other",
      "date": "2017-05-06T00:00:00",
      "story": "looked like 2 kites On April 27th, 2017, around 11am, I was heading to work, I was on a city bus 306 when 2 objects cought my eye at the east they looked like kite`s with a tail attached to it, at first so i did not think anything of it but one of the objects was at a standstill and did not move the other object would orbit around it.  They seem pretty far away and up in the sky i say around 10,000 feet.  I tryed to take a picture but it did not show in the picture by the time i got off the bus 5 minutes later the objects where not in site.",
      "link": "http://www.nuforc.org/webreports/133/S133879.html",
      "state": "OK",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c7866",
      "summary": "My 13 year-old grandson and I were driving home from a Tulsa hospital when he noticed 2 bright lights and in the sky and asked if it wa",
      "city": "tulsa",
      "shape": "circle",
      "date": "2017-12-10T00:00:00",
      "story": "My 13 year-old grandson and I were driving home from a Tulsa hospital, when he noticed 2 bright lights and in the sky and asked if it was an airplane, since we were within about 8 miles of an airport.  It was bright like an airplane light but there was 2 of them.  At times they seemed as though they were hovering barely moving and then moved quickly around .  We kept driving so we only observed them for about 5 minutes. About 1 1/2 hours earlier, just West of Inola on our way to the hospital, we noticed a bright circle of light northeast of Tulsa, and about the time my Grandson asked me what star it was it started moving South. I told him sometimes planes have to circle before they land, but it seemed to be moving slower than it should be.",
      "link": "http://www.nuforc.org/webreports/137/S137634.html",
      "state": "OK",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c7a10",
      "summary": "Golden circles with a tail seen circling around the sky.   ((NUFORC Note:  Possibly advertising lights??  PD))",
      "city": "tulsa",
      "shape": "circle",
      "date": "2017-12-08T00:00:00",
      "story": "Golden circles with a tail seen circling around the sky. At approximately 8:00pm on December 7th, 2017, my husband and I witnessed 2 large objects and 2 smaller objects in the sky.  At first they started to blink, and the two larger objects continuously circled each other for around 30 minutes.  The two smaller objects disappeared after about 10 minutes, leaving the 2 larger objects chasing each other in the sky.  They would blink for a while, then be a solid golden color, then go back to blinking and so on.   At one point, they were stationary in the sky for 20 seconds or so, and a silver/blue object fell from one of the crafts, then started flying again.  After about 30 minutes had passed, the two large objects stopped circling in the sky and took off in one direction.   I tried taking a few photos with my phone and managed to capture an image.  It looked like a circle with a tail.",
      "link": "http://www.nuforc.org/webreports/137/S137608.html",
      "state": "OK",
      "duration": "30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c7cfa",
      "summary": "Bright white light transforming from a star appearance to a full blown object of some kind. ((NUFORC Note:  Venus??  PD))",
      "city": "tulsa",
      "shape": "unknown",
      "date": "2017-09-21T00:00:00",
      "story": "bright white light transforming from a star appearance to a full blown object of somekind. I went outside and saw a bright star like light.  Thought it might be Jupiter, then the light took the shape of a crescent moon.  Thought it was the moon behind some clouds.  However, it was much larger than what the moon looks like in the sky.   Then it transformed into a huge white light in the shape of a bowl.  I could see a darker outline above the light creating a full round circle shape.  I said what is that?   As I was looking at it the light began to diminish until nothing was left visibly.  Although the light was totally gone I could still see a dark round outline in the sky.   I watched a few more minutes but could not see anything else.  It was so huge!  When I realized it wasn't the moon I knew I must be witnessing a UFO sighting.",
      "link": "http://www.nuforc.org/webreports/136/S136179.html",
      "state": "OK",
      "duration": "3-5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c7f79",
      "summary": "At approx. 0240 am, I awakened from a deep sleep from noise coming from the sky.  It was very loud.",
      "city": "tulsa",
      "shape": "unknown",
      "date": "2018-04-26T00:00:00",
      "story": "Tonight at approximately 240 A.M. I awakened from a deep sleep from noise coming from the Sky. It was very loud, and sounded a bit like a low flying jet except it hovered.  It was so loud my house vibrated.  I looked outside and didn't see anything unusual but it's been raining and was cloudy.  The sound was so strange that I am frightened and cannot get back to sleep.",
      "link": "http://www.nuforc.org/webreports/139/S139585.html",
      "state": "OK",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c8137",
      "summary": "Was outside to smoke my final cigarette of the evening and noticed a low flying craft with no sound travelling northeast in the night",
      "city": "tulsa",
      "shape": "fireball",
      "date": "2018-03-08T00:00:00",
      "story": "I was outside to smoke my final cigarette of the evening, and noticed a low flying craft with no sound, travelling northeast in the night sky.  I watched it for about a minute and a half, and it never changed shape or blinked.  I lost sight of it as it seemed to fly lower and lower and disappeared into the treetops.",
      "link": "http://www.nuforc.org/webreports/139/S139103.html",
      "state": "OK",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c835e",
      "summary": "Midtown Tulsa Oklahoma:witnessed one bright ball of light high in the night sky. Looked up to notice the beauty of the moon lit clouds",
      "city": "tulsa",
      "shape": "circle",
      "date": "2018-09-27T00:00:00",
      "story": "Midtown Tulsa Oklahoma:  witnessed one bright ball of light high in the night sky.  Looked up to notice the beauty of the moon lit clouds streaking over head.  Realized this ball of light buzzing higher than the aircraft and moving way to fast and awkward to be an aircraft we have today.  Headed north towards airport TUL I.  Now a lot of air traffic.... Helicopters? air base off 169hw 56th....  We don't own anything thAt can do that.",
      "link": "http://www.nuforc.org/webreports/143/S143129.html",
      "state": "OK",
      "duration": "3-4 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c8651",
      "summary": "Spherical red light moving through the night sky. It came from the north and moved south. Lost sight of it after 3 minutes. The light w",
      "city": "tulsa",
      "shape": "sphere",
      "date": "2018-08-17T00:00:00",
      "story": "Spherical red light moving through the night sky.  It came from the north and moved south.  Lost sight of it after 3 minutes.  The light was steady, but appeared to have a shadow moving along the edge of it.",
      "link": "http://www.nuforc.org/webreports/142/S142669.html",
      "state": "OK",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c86bf",
      "summary": "Unusual colored object changing to white, rapidly diminishing in size tapering brightness.",
      "city": "tulsa",
      "shape": "changing",
      "date": "2018-08-17T00:00:00",
      "story": "Unusual colored object changing to white, rapidly diminishing in size tapering brightness. ime:  4:50 AM cdt  Sky conditions:  thin overcast per infrared satellite recordings on weather.unisys.com Unusual lighted object spotted moving southwesterly direction over city while driving south on Lewis Avenue near 3rd street, returning home from airport passenger drop-off.  First noticed when object was easterly direction from Lewis, crossed in front of observer at indeterminate altitude.  Speed also indeterminate due to unknown distance to object. Initial size of object approximately that of a lemon held at arm's length, shape indeterminate, colors varying and ended up white.  Rapidly grew smaller.  By the time observer got camera on target (maybe 10 seconds max), object had diminished in size to almost a point.  Short video shows very bright white light moving along straight line across the observer's route, in a southwesterly direction becoming rapidly smaller then vanishing. Unusual lights and change of object's size unrecorded, but the character of the point of white light and the rapid disappearance (tapered of rapidly, not a sudden “off” like a light switch phenomenon) are recorded on video.  Possibly tapered off due to entering cloud layer but no haziness evident on video.",
      "link": "http://www.nuforc.org/webreports/142/S142661.html",
      "state": "OK",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c869c",
      "summary": "Appeared as a very large whistling meteor turned almost 90° and then appeared and sounded as very fast moving aircraft over Oklahoma.",
      "city": "tulsa",
      "shape": "other",
      "date": "2018-08-17T00:00:00",
      "story": "Appeared as a very large whistling meteor turned almost 90° and then appeared and sounded as very fast moving aircraft over Oklahoma Looked like a falling star then got larger, brighter appeared to be orange sparks behind it sort of like a bottle rocket but by now about the size of what I would imagine a small aircraft in a Terminal predicament would look like.  A blue hue appeared behind it around the orange and a whistle sound could now be heard.  The blue diminished and the orange sparks started to lessen.  Front point had turned into what appeared to be a growing glowing white round light which at first was a small circle of light but dark in the center and progressed into being all white light as the Sparks continue to diminish.  By now the whistle turned into a hum that sounded similar to a small aircraft not in distress.  When the orange sparks disappeared the hum continued and all that was left was a blueish or green light and a small gold/white/gold/white light and only for a moment a red light.   From there it proceeded out of sight, trees were blocking my view, looking and sounding like a small aircraft but moving much faster than any plane that I've ever known of and the hum diminished respectively with the sight of it.  It first appeared moving South and barely East from my location as it appeared to drop down and made almost a 90 degrees curve to head East but a little North.  About 1/8 of the way towards North from due East.I don't know latitudes and longitudes.  It did only travel in two straight very distinctive lines.  The turn was maneuvered at the point where the orange sparks were brightest and largest immeditely after the turn is when the blue hue appeared and sparks right after that started to diminish and as the sparks start to diminish is when the whistle turn into a hum.   After the Sparks diminished that's when it turned into the bluish light the flashing light which went dark and the red light which only blinked once left only a bluish-green light.  White circle appeared just barely before the blue hue was completely gone, the white circle was! gone when the lights started appearing in the other colors at! the fro nt point.  The colored lights were in the form of a small triangle with unequal sides when the red light blinked but the white and gold appeared in different relations to the bluish green light. I heard the whistle for about one-and-a-half seconds and about 75% of that time was before the curve and about 25% after.  The curve was made instantly. Same amount of time it would take a second hand on a clock to go to the next second after it started to move but before it hit the next second, that's how long it took the curve to be accomplished. If a possible altitude is necessary I can only guess and that would be it appeared from nowhere to begin to fall from the sky and after the curve would be below the average cloud level. It occurred during a clear night, no clouds and could see stars.  Please reply to this message?  I know I can't leave personal info in a message, but I would like to know what that was or at least that someone has looked into it.  And especially for any questions ! or comments that you might have.  Thank you.",
      "link": "http://www.nuforc.org/webreports/142/S142653.html",
      "state": "OK",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c8856",
      "summary": "Floating bright object.",
      "city": "tulsa",
      "shape": "light",
      "date": "2018-07-05T00:00:00",
      "story": "Floating bright object Floating/stationary object in sky.  Noticed it while waiting for fireworks. Was extremely bright at first, but it since has slightly adjusted its position and brightness.  Planes/helicopters have flown almost close to it and continue to circle it seems like.  Too bright to be a star and too low.  It has only moved ever so slightly so it's not a plane or helicopter.  Started at 9:15 PM or so",
      "link": "http://www.nuforc.org/webreports/142/S142059.html",
      "state": "OK",
      "duration": "40 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c8b92",
      "summary": "Early hour that morning I saw a mother ship.Size of a football field. Above houses. No sound. Tubing on both sides. Nothing man made.",
      "city": "tulsa",
      "shape": "triangle",
      "date": "2019-02-27T00:00:00",
      "story": "Early hr that morning, I saw a mother ship.  Size of a football field.  Above houses.  No sound.  Tubing on both sides.  Nothing man made on earth.  I turned off In the neighborhood and followed it.  Cars in the street slowed me way down.  Grabbed my pbone to take pic.  But not turn out.  I lost it.  Gone that fast.  My security on my car been missed up since.  It was huge ppl.  I pass a lie detector test any day.  Pass it.  Lights are up in the sky at nite around Tulsa.  At times it in the path of the airport.  Just farther up.  But I saw this one up close.  Huge.",
      "link": "http://www.nuforc.org/webreports/145/S145025.html",
      "state": "OK",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c8cbf",
      "summary": "I was laying in bed trying to go to sleep and felt something slightly shaking my room and a very loud noise buzzing. I looked out my wi",
      "city": "tulsa",
      "shape": "unknown",
      "date": "2019-02-01T00:00:00",
      "story": "I was laying in bed trying to go to sleep and felt something slightly shaking my room and a very loud noise buzzing.  I looked out my window and couldn't see anything but it definitely sounded nothing like an airplane, car, helicopter.  It felt magnetic.",
      "link": "http://www.nuforc.org/webreports/144/S144656.html",
      "state": "OK",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c8e2d",
      "summary": "Driving along hwy 412 you in the sky it had 4 lights one on each side. It just hovered with each light blinking one after another. It w",
      "city": "tulsa",
      "shape": "unknown",
      "date": "2019-01-04T00:00:00",
      "story": "Driving along hwy 412 you in the sky it had 4 lights one on each side.  It just hovered with each light blinking one after another.  It was just there and it gave me a creepy feeling.",
      "link": "http://www.nuforc.org/webreports/144/S144168.html",
      "state": "OK",
      "duration": "Hovering over the side ro"
    },
    {
      "_id": "64d005f478aba2ec5a3c9223",
      "summary": "Slow moving boomerang object",
      "city": "tulsa",
      "shape": "chevron",
      "date": "2019-12-01T00:00:00",
      "story": "Slow moving boomerang object Was outside when I looked up and saw a slow moving object with no lights.  Looked like a boomerang with a curved nose.  It made no sound and looked like it was just gliding across the sky.  Was hard to see.",
      "link": "http://www.nuforc.org/webreports/149/S149791.html",
      "state": "OK",
      "duration": "20 sec"
    },
    {
      "_id": "64d005f478aba2ec5a3c934c",
      "summary": "((NUFORC Note:  \"Starlink\" satellites?  PD))",
      "city": "tulsa",
      "shape": "circle",
      "date": "2019-12-01T00:00:00",
      "story": "On October 27th 2019 approximately around 22:00 I was sitting in my outside Hot tub that sits on my backyard porch,while looking up at the stars I noticed what I initially was a possible flock of geese..there were several flocks moving different directions...this of course made me question myself thinking they were flocks of geese simply because they were too far up in the sky and they were moving at different directions and moving very fast..at closer inspection I could see more of the appearance of the phenomenon. They all looked see through and like large circles of clouds or white smoke as if they were possibly trying to cloak within the clouds. They literally appeared to be large cloud like circles moving different directions and quickly...we saw about 8 total over 30 minutes. I absolutely believe this to be a UFO and a very strange one at that. They almost looked more organic in nature than like a metal made machine. No lights were seen on or around th! em...they were more just translucent. Three people in my family also saw these and agree they were not only incredibly strange but not of this earth.  This occurred within the city of Tulsa Oklahoma.  I did see a older video post on the UK Mirror that looked very much like the craft saw. These in this post were seen during the day and looked like smoke circles as well. Considering they were more than one makes me think this could be a fleet traveling.No sounds were heard with these at all.",
      "link": "http://www.nuforc.org/webreports/150/S150870.html",
      "state": "OK",
      "duration": "30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c940c",
      "summary": "Multi-color rotating star object",
      "city": "tulsa",
      "shape": "light",
      "date": "2019-12-01T00:00:00",
      "story": "Multi-color rotating star object Tulsa, Oklahoma.  I regularly observe strange, color-twinkling star-like objects, in the four quadrants of the sky.  They appear to be regularly positioned and are clearly no ordinary “star” or “planet”.  They appear, to the naked eye, as almost a dice-shaped device, “spinning” on one of its corners, and flashing regularly, white, green, and red.  I am 63 years old and have been sky watching all of my life and cannot explain what these new objects in the sky are.  I first noticed them in 2012.  I called the St. Louis Planetarium in hopes that someone there could clue me in to what these objects are; but the only response I got was someone trying to convince me about the “twinkling” that occurs as bodies in space rise or set through our atmosphere, especially near the horizons.  I felt that my questions were quickly dismissed.  My gut tells me that these are some kind of UFO and/or military crafts.  I find the objects disconcerting, especially since very few ! people notice them or even care about hearing about them.",
      "link": "http://www.nuforc.org/webreports/150/S150494.html",
      "state": "OK",
      "duration": "all night long"
    }
  ]
}