{
  "city": "virginiabeach",
  "fetch_timestamp": "2025-07-12T14:32:19.262200",
  "record_count": 130,
  "pages_fetched": 6,
  "api_calls": 7,
  "source": "ufo_aficionado_api",
  "records": [
    {
      "_id": "64d005f478aba2ec5a3b421d",
      "summary": "Orange orb.  ((anonymous report))",
      "city": "virginiabeach",
      "shape": "circle",
      "date": "2019-03-21T00:00:00",
      "story": "I was driving home from the grocery store and as I approached my home, I saw an orange orb glowing in the sky.  I could not take my eyes off it as I was driving.  I was mesmerized. It appeared to be driving with me and when I got on my street, I stopped right in front of my house to just watch it and it did not appear to move.  I then called my fiancee and told him to run out side.  I then jumped back in the car and then the orb appeared to go back out into the night sky put stayed parallel to the landscape.  It was a clear night tonight.  My fiancee saw the orb as well when it was flying away. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/145/S145215.html",
      "state": "VA",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b421e",
      "summary": "Orange orb. ((anonymous report))",
      "city": "virginiabeach",
      "shape": "circle",
      "date": "2019-03-21T00:00:00",
      "story": "I was driving home from the grocery store and as I approached my home, I saw an orange orb glowing in the sky.  I could not take my eyes off it as I was driving.  I was mesmerized. It appeared to be driving with me and when I got on my street, I stopped right in front of my house to just watch it and it did not appear to move.   I then called my fiancee and told him to run out side.  I then jumped back in the car and then the orb appeared to go back out into the night sky put stayed parallel to the landscape.  It was a clear night tonight.  My fiancee saw the orb as well when it was flying away. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/145/S145214.html",
      "state": "VA",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b4878",
      "summary": "I was letting my dogs out. I saw a small bright orange light I  the northern sky just below my fence line, so much so I had to stand on",
      "city": "virginiabeach",
      "shape": "fireball",
      "date": "2019-06-07T00:00:00",
      "story": "I was letting my dogs out.  I saw a small bright orange light I  the northern sky just below my fence line, so much so I had to stand on my toes to see it.  It slowly rose and I no longer had to stand on my toes.  It contrasted against a street light and didn't look like the pale, white stars in the disrance.",
      "link": "http://www.nuforc.org/webreports/146/S146131.html",
      "state": "VA",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b4da4",
      "summary": "I photographed 2 UFOs last night, 4/18/19, at around 9:25 pm, in Virginia Beach from my yard.  ((NUFORC Note:  Lens flare.  PD))",
      "city": "virginiabeach",
      "shape": "disk",
      "date": "2019-04-25T00:00:00",
      "story": "I don’t know if my report went through because the website doesn’t tell me so I am going to try it again.  I have also emailed this information with photograph . I’m pretty sure I photographed 2 UFOs last night, 4/18/19, at around 9:25 pm, in Virginia Beach, Courthouse Estates, Lancaster Village, from my yard.  I am including photos.   Not the light beams, but 2 objects moving together at a perfect angle.  It’s possible that the brown blue light was coming off of the structure of the craft.  I don’t know.  One had a structure and the other was a round blue light.  They were totally silent and moving slowly then I lost sight of them.  Then almost immediately several loud,  low-flying jets flew over us, going in the same direction as these objects.   You are welcome to contact me if you’d like. ((NUFORC Note:  One of the objects, a small greenish circle, we believe is a lens flare.  We are unable to identify the other object.  PD))",
      "link": "http://www.nuforc.org/webreports/145/S145736.html",
      "state": "VA",
      "duration": "1-2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b4da3",
      "summary": "Two objects, one with the structure and one just a light moving over our neighborhood then apparently chased away by jets.",
      "city": "virginiabeach",
      "shape": "disk",
      "date": "2019-04-25T00:00:00",
      "story": "Two objects, one with the structure and one just a light moving over our neighborhood then apparently chased away by jets. Fixed typo errors:   I’m pretty sure I photographed 2 UFOs last night, 4/18/19 around 9:25 pm, in Virginia Beach, Courthouse Estates, Lancaster Village, from my yard.  I am including photos.   Not the light beams, but 2 objects moving together at a perfect angle.  It’s possible that the brown blue light was coming off of the structure of the craft.  I don’t know  One had a structure and the other was a round blue light.  They were totally silent and moving slowly then I lost sight of them.  Then almost immediately several loud,  low-flying jets flew over us, going in the same direction as these objects.  You are welcome to contact me if you’d like. Geez, I keep trying to submit this and making errors.  That was supposed to say I have included photographs.  And it should also say round blue light, not brown blue light. ((NUFORC Note:  One of the objects, a small greenish circle, we believe is a lens flare.  We are unable to identify the other object.  PD))",
      "link": "http://www.nuforc.org/webreports/145/S145735.html",
      "state": "VA",
      "duration": "1-2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b4eeb",
      "summary": "Glowing pale blue sphere moving very fast across the sky heading in an easterly direction.  Seen from Dahlia drive.",
      "city": "virginiabeach",
      "shape": "circle",
      "date": "2019-04-08T00:00:00",
      "story": "Glowing pale blue sphere moving very fast across the sky heading in an easterly direction. Seen from Dahlia Drive, near the intersection of Front Royal Road.",
      "link": "http://www.nuforc.org/webreports/145/S145503.html",
      "state": "VA",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b521e",
      "summary": "Cloaked lights in the trees",
      "city": "virginiabeach",
      "shape": "light",
      "date": "2008-06-12T00:00:00",
      "story": "Cloaked lights in the trees It was in November 1983, my husband, who is now retired from the Navy, was stationed at Naval Air Station Oceana in Virginia Beach, VA.  I was stationed there as well, but, this was before we were married.  My husband would often drive home from Virginia to his home in Louisville, Kentucky during long weekends, on a long stretch of highway (I'm not sure what the name of the highway was).   He had said that one time when he was driving home, he had looked out of his rear view mirror and he said that he saw four lights hovering above the trees that were along side of the road about thirty yards from his car.  He said that the lights were two red and two green.  He stopped the car and got out.  There were no other cars on the road at the time and it was around 5:00 p.m.  My husband said that he looked at the trees and saw no lights.  He looked in the rear view mirror again and saw the lights.  He looked in the mirror on the driver's side of the car and he saw the lights.  He looked at the tree and saw no lights.  He said that it was as if the lights were cloaked.  He said that he stood there for the longest time, about 15 minutes and then he went on.  My husband said that it was the strangest thing he'd seen. ((NUFORC Note:  Witness indicates that date of incident is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/063/S63509.html",
      "state": "VA",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b5648",
      "summary": "3 lighted disk",
      "city": "virginiabeach",
      "shape": "disk",
      "date": "2006-10-30T00:00:00",
      "story": "3 lighted disk in the middle of the woods in back bay lagomar.see them atleast once a month,in the same spot",
      "link": "http://www.nuforc.org/webreports/051/S51692.html",
      "state": "VA",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3b5780",
      "summary": "I went out to back bay . I was taking pictures of the area. I captured this on my digital camera. that about sums it up. I was alone.",
      "city": "virginiabeach",
      "shape": "disk",
      "date": "2007-11-28T00:00:00",
      "story": "I went out to back bay.  I was taking pictures of the area. I captured this on my digital camera.  that about sums it up.  I was alone. ((NUFORC Note:  No photos sent by witness.  PD))",
      "link": "http://www.nuforc.org/webreports/059/S59609.html",
      "state": "VA",
      "duration": "UFO"
    },
    {
      "_id": "64d005f478aba2ec5a3b5f97",
      "summary": "Brilliant orange light seemed to be emitting from something above as if it were propulsion.",
      "city": "virginiabeach",
      "shape": "fireball",
      "date": "2008-03-04T00:00:00",
      "story": "Brilliant orange light seemed to be emitting from something above as if it were propulsion. I was walking out to the car and saw what looked like an orange fireball. After looking a little closer, it was square in shape at the top and faded towards the ground. To me it looked like a sort of propulsion. The sky was dark and I couldn't see anything but the light. It was traveling away from me so I got in the car to go to my destination. As I drove I kept watching it. After it had taraveled some distance away I saw a second smaller light descend from the larger one. It disappeared below the tree line. The larger object then pulsated several times and disappeared. My step son also witnessed the object but I wouldn't want to speak for him in this report.",
      "link": "http://www.nuforc.org/webreports/060/S60312.html",
      "state": "VA",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b6382",
      "summary": "3rd night of Orb sighting in Larkspur area of  Virginia Beach",
      "city": "virginiabeach",
      "shape": "sphere",
      "date": "2007-06-12T00:00:00",
      "story": "3rd night of Orb sighting in Larkspur area of  Virginia Beach This was the third night in a row that I had witnessed an “orb,” passing over my house, following roughly Edwin Drive at an altitude of about 1,000 ft. The first night we witnessed the same object approximately at 7:00pm while trick or treating with my wife, my neighbor’s wife and our children. All three of us witnessed the object traveling in the same direction height etc. I witnessed the object again on 11/1/05 around same time and on the third evening I was outside and it appeared again. I ran to my truck and got my Nikon D70 digital camera and quickly tried to focus it on the object, while resting the camera on the hood of my truck to steady the camera. The camera had trouble auto-focusing and I switched the auto mode to sports, and was able to get three pictures, 2 of the object and the third of nothing many seconds later. I have the RAW – NEFF pictures for anyone who wants to analyze them, however you will need Nikon Capture 4 software to view the images. My neighbor wants nothing to do with this, nor does my wife. An unknown man near to us during the Halloween sighting on 10/31/05, exclaimed, “It is a UFO!,” but we don’t know who he was, he was not from our neighborhood. After I did a radio interview on Coast to Coast, a Suffolk man contacted me and described seeing the objects again three nights in a row. This is not the first time I have seen orbs traveling in this direction (roughly South to North) a friend and I practically chased one in the daytime in the fall of 2000. I have since learned how to set the parameters on my camera and will be ready the next time to hopefully get better pictures. I have been told that digital pictures are not as reliable as film photos, but still a pretty good amount of detail and authenticity should be able to be gleaned from these two photos by those who know what they are doing, since I have no background or experience in this type of research. Photos can be seen and downloaded at www.thenorfolkincident.com/orbs.htm",
      "link": "http://www.nuforc.org/webreports/056/S56545.html",
      "state": "VA",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b63c4",
      "summary": "Bright green light \"draws\" serveral strange marks over the Atlantic Ocean",
      "city": "virginiabeach",
      "shape": "light",
      "date": "2008-03-31T00:00:00",
      "story": "Bright green light \"draws\" serveral strange marks over the Atlantic Ocean I was at the Virginia Beach oceanfront with five friends on a summer night in 2003. Three of them left to go play pool. My friend and I went and sat on the beach around 80th street, a few miles down from the strip. When I first saw the green light, it looked like a dotted line being slowly drawn downward slowly in the sky. It seemed to be very wide and very high, miles out over the Atlantic Ocean. I pointed it out to my friend and we both just thought it looked cool. It stopped abruptly, but about 5 minutes later it returned, a little faster now, and it was a solid line. The light made one streak and then stopped. This line remained visible for quite awhile. My friend and I became very interested after that. I called my mother and a few friends to tell them to look for it. One of those friends was on as boat just off the Outer Banks of North Carolina, and she and her friends could see it from there. We eventually settled back down, but an hour or so later the light returned. It started the same way, making a segmented line. When it came back as a solid line it made a broad, looping stroke in the sky. It was really bright green, and reminded me off a neon sign. My friend and I started to feel uneasy after the second appearance. There were other people scattered on the stretch off sand, and they all began pointing up and acting afraid. There was a group of around ten teenagers there from the Ukraine on work visas for the summer. They approached us and asked if we knew what was happening. Some of them seemed really scared. They sat and talked with us for another hour or so (it was between midnight and 1am) and then the light returned a third time. After its dotted stroke, the light made another sold line. This time the light swooped around a few times before culminating with an incredibly bright flash. At this point I became frightened as well, and I remember thinking we were seeing some kind of unfathomable missile or bomb approaching and that we were all going to be killed. Both the lines and the shape of the flash remained visible for what seemed like an hour. My other three friends came back sometime between 1 and 2 am. We told them what happened and one of them stayed on the beach with us and the Ukrainians. As I recounted the light appearances, it struck me that the three different shapes left by the solid line resembled the numbers 1, 2, and 3, in that order. This wasn’t completely true, however because the \"3\" had an extra swirl at the tail before the flash. We were all completely amazed when it came back again, making the same dotted and solid line as it had the first time. I was scared, but I was also mesmerized and couldn’t tear myself away. We all just sat there watching the sky, wondering if it would keep coming back. When it did (again, about an hour later), it repeated the pattern of the second dotted and solid line. I was sure it would come back and repeat the third line and its flash, and just before dawn it did. I was still completely awed and so even as my companions went to bed, I stayed on the beach. The cycle began to repeat itself a third time as the sky grew lighter. It was still visible after sunrise. I watched as the light again formed its first and second formations, but before the third pattern could be re-drawn, I succumbed to my exhaustion and went to sleep. I remember wanting to see what the newspaper or local news would have to say about the lights, but I never heard anything about it. I assumed the stations would be flooded with calls from people in Virginia Beach and as far away as North Carolina, so I never even considered calling myself. I did do an internet search to see if there were any weird tests being done at nearby military bases, but came up empty-handed. I still tell people about it, and when I run into the friend who had been out there with me we ask each other whether we’ve figured out it was.  We haven’t, of course. ((NUFORC Note:  Witness indicates that the date of the incident is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/062/S62249.html",
      "state": "VA",
      "duration": "5 hours"
    },
    {
      "_id": "64d005f478aba2ec5a3b66d4",
      "summary": "I did not realize there was anything out there until I printed the photo.",
      "city": "virginiabeach",
      "shape": "",
      "date": "2007-02-01T00:00:00",
      "story": "I did not realize there was anything out there until I printed the photo. When I saw a new moon (merely a sliver) behind the bare branches of the tree, I decided to try and photograph it. I took three photos each slightly to the right of the first. When I printed the photos (digital camera) I was amazed to find what looked like a full moon. On closer inspection, I discovered two other less bright  circular objects. I still don't know what I captured on film. When I took the photo, I was so concentrating on the composition, and trying to capture the new moon behind the branches that I did not see anything else. It was not until I printed the photo that I discovered that there was something else.",
      "link": "http://www.nuforc.org/webreports/054/S54172.html",
      "state": "VA",
      "duration": "?"
    },
    {
      "_id": "64d005f478aba2ec5a3b689e",
      "summary": "orange lights in southern VA",
      "city": "virginiabeach",
      "shape": "oval",
      "date": "2008-03-04T00:00:00",
      "story": "orange lights in southern VA Upon getting home from work, the couple next door was staring into the sky. I thought they had to much too drink. when I got out of my truck the guy said hey we have been watching these strange lights move slowly across the sky. I looked up into the southern sky and saw what appeared to be 3 to 4 orange lights at a very high attitude, much higher then a helicoper can fly and they where moving very slowly back and forth. I grabbed my girlfriend and 2 pair of binocs and we both views this object for about 15 minutes until it ascended and disappeared from eye sight.  If anyone else saw this I would love to hear from you. I have drawn a few pictures of what we saw.  Thanx. ((nickname deleted)) ((NUFORC Note:  Witness indicates that the date of the event is approximate.  May be an evening sighting, but the witness does not indicate that.  We have requested a possible correction of the time indicated above.  PD))",
      "link": "http://www.nuforc.org/webreports/061/S61802.html",
      "state": "VA",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b6a4d",
      "summary": "Bright light gains size over, and vanishes over Lesnor Bridge, in Virginia Beach!",
      "city": "virginiabeach",
      "shape": "light",
      "date": "2006-07-16T00:00:00",
      "story": "Bright light gains size over, and vanishes over Lesnor Bridge, in Virginia Beach! I was at a secluded beach, by the Lesnor bridge in Virginia beach.  It was after midnight and a couple of people were on the beach with me.  My attention was drawn to the sky along with a few other peoples attention.  Soon after i noticed a light gaining size rapidly and it grew to be the biggest light in the sky atleat 3 times the size of a star and then it was the brightest shinning light in the sky for about 2 whole minutes.  Then short after everyone drew their attention to it.  It caught off as if someone had flipped a light switch and turnned all power off.  It wasnt the first time i have seen something supsicious like that in the sky.  And it was not something anyone would be able to explain. ((NUFORC Note:  Witness indicates that the date of the event is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/051/S51151.html",
      "state": "VA",
      "duration": "3 mins"
    },
    {
      "_id": "64d005f478aba2ec5a3b72d9",
      "summary": "Small black sphere dancing in Virgina Beach sky",
      "city": "virginiabeach",
      "shape": "disk",
      "date": "2007-04-27T00:00:00",
      "story": "Small black sphere dancing in Virgina Beach sky I was sitting in my backyard reading a book being that if was a very beautiful day.  I noticed a swarm of buzzards or some type of bird of prey so I watched the circle overhead.  I then noticed a small black sphere moving across the sky at about the same speed an aircraft would fly.  At first I thought it was some sort of military craft, which is not unusual around Virginia Beach.  But then the craft stopped abruptly, backtracked dropped slightly in altitude and then continued in the direction it was originally heading.  It continued behind a cloud and then reappeared even slightly lower than it was before.  It then paused, hovered for a moment and then shot off amazingly quick up and to the left, back into the cloud.   I stared at the sky for a few more min, hoping to see  it again, but I didn’t.",
      "link": "http://www.nuforc.org/webreports/056/S56151.html",
      "state": "VA",
      "duration": "about a 1 min"
    },
    {
      "_id": "64d005f478aba2ec5a3b735f",
      "summary": "3 starish kind of things, orangish, in a formation of a triangle.  ((NUFORC Note:  Student report.  PD))",
      "city": "virginiabeach",
      "shape": "circle",
      "date": "2008-03-04T00:00:00",
      "story": "3 starrish kind of things, orangish, in a formation of a triangle. It was Thursday the 28th around 10 o’clock pm and I was getting ready to go upstairs.  Before I did I went to the back door to make sure its locked and I saw 3 bright reddish orangish things in the sky flickering like a candle. They were in the formation of a triangle and at first I thought it was the big dipper.  Then I ran upstairs really quick and showed my uncle out his bathroom window and there were only two left but really spaced apart, yet they still kept flickering.  We watched for about 5 minutes and one of them slowly disappeared then the last one.  I left when they all vanished but my uncle said there were planes chasing them.  And that was the end of the night.  Until the next morning I forgot totally about it and one of my classmates brought it up. We talked about the sighting and we had the same exact description. She said she was with her boyfriend and a car full of people, so she knew she wasn’t crazy. Once we talked about them, we knew they were UFO’s. ((NUFORC Note:  Student report.  PD))",
      "link": "http://www.nuforc.org/webreports/062/S62049.html",
      "state": "VA",
      "duration": "5-10 mins"
    },
    {
      "_id": "64d005f478aba2ec5a3b7b0f",
      "summary": "Metallic sphere floating 20 feet in air in Virgina Beach",
      "city": "virginiabeach",
      "shape": "sphere",
      "date": "2007-02-24T00:00:00",
      "story": "Metallic sphere floating 20 feet in air in Virgina Beach I was skateboarding over to my friends house through my neighborhood near the beach.  I was going down a straight street with houses on either side.   I looked to my left and saw a metallic sphere a little larger than a basketball floating about 20 feet in the air.  It was going in a straight path at about 5 or 10mph.  It went between 2 houses, over me and then between 2 other houses on the side of the road.   Upon looking at Google Earth later in I saw that the path it was taking was due east.  It was really eerie, and gave me crazy chills down my spine when it flew directly over me.  It made no sound and it looked like a giant floating pinball,  but it didn’t seem be reflecting anything, it was just intensely shiny.  It looked like something you would see in a movie, except only it was real and it caught me completely off guard. ((NUFORC Note:  Report submitted by student.  PD))",
      "link": "http://www.nuforc.org/webreports/055/S55248.html",
      "state": "VA",
      "duration": "15-20 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b7cca",
      "summary": "((POSSIBLE HOAX)) A triangular craft with solid red and flashing white lights hovering strangely over Virginia Beach, VA late at night.",
      "city": "virginiabeach",
      "shape": "triangle",
      "date": "2006-07-16T00:00:00",
      "story": "((NUFORC Note:  Student report.  Possible hoax.  PD)) A triangular craft with solid red and flashing white lights hovering strangely over Virginia Beach, VA late at night. I was watching TV late at night around 2:30 am. I looked around the window and show flashing white lights. I went up to the window and noticed some aircraft flying. My first thought was a helicopter because it was moving very weirdly. It went left and up and right and up and zig zagged a few times and it moved pretty fast. I pressed my ear tot he window but i didn't hear any sounds of a helicopter instead it was just silent. I focused hard and noticed with was triangular shaped and it had a red light on each angle. there were white lights flashing but in an irregular patern. I moved away from the window and a couple of minutes later notices white lights flashing right above my house. they stopped and a couple of minutes later they flashed again. This was not the first time I've seen this. A couple of days before for a cuple of seconds i saw some red and white lights moving in a zig zag patern out the window, again at night. But they quickly disappeared behind other houses and trees. Again, completely silent.",
      "link": "http://www.nuforc.org/webreports/051/S51212.html",
      "state": "VA",
      "duration": "2-5 min."
    },
    {
      "_id": "64d005f478aba2ec5a3b811d",
      "summary": "There were \"two white lights, huge in size” like \"two flares in [the] sky hovering,\" with \"dogs howling\" at the same time of sighting.",
      "city": "virginiabeach",
      "shape": "other",
      "date": "2009-03-19T00:00:00",
      "story": "There were \"two white lights, huge in size, like \"two flares in [the] sky hovering,\" with \"dogs howling\" at the same time of sighting. The following report information is a transcribed extract from the UFO sighting report files of the Virginia Beach, Virginia, Police Department, taken from a chronology of Virginia Beach, Virginia UFO sighting reports on file with the Virginia Beach Police Department dating back to May 1976.  All quotes are taken directly from the original report forms and some extrapolation is made for the description of the UFO(s) sighted, as not all of the report details were recorded in complete and full sentences by the dispatcher who received the report. Report 29: 10/31/80 at 5:25 Description: These UFOs were \"two white lights, that were \"huge in size.\"  They were like \"two flares in [the] sky hovering.\" There were some \"dogs howling\" at the same time. How Many: 2 Sighted -Distance: \"1/2 mile\" -Duration: UFO was \"still in view\" at time of call. UFO Central advised at 5:30. Address: Seahorse Way -Witnesses: 2",
      "link": "http://www.nuforc.org/webreports/068/S68587.html",
      "state": "VA",
      "duration": "Still In View When Called"
    },
    {
      "_id": "64d005f478aba2ec5a3b8119",
      "summary": "A \"cylinder [shaped] object” that had a “white light with a red dot”  and was “over roof top” and then “went behind the houses.\"",
      "city": "virginiabeach",
      "shape": "cylinder",
      "date": "2009-03-19T00:00:00",
      "story": "A \"cylinder [shaped] object” that had a “white light with a red dot”  and was “over roof top” and then “went behind the houses.\" The following report information is a transcribed extract from the UFO sighting report files of the Virginia Beach, Virginia, Police Department, taken from a chronology of Virginia Beach, Virginia UFO sighting reports on file with the Virginia Beach Police Department dating back to May 1976. All quotes are taken directly from the original report forms and some extrapolation is made for the description of the UFO(s) sighted, as not all of the report details were recorded in complete and full sentences by the dispatcher who received the report. Report 21: 1/23/80 at 22:30 -Description: This UFO was a \"cylinder [shaped] object.  It had a “white light with a red dot.” The UFO was “over [the witness’s] roof top” and then “went behind the houses.” -How Many: 1 Sighted -Distance: \"2 feet over [witness’s] roof top.” -Duration: 20 minutes Address: Fetsch Place -Witnesses: 1",
      "link": "http://www.nuforc.org/webreports/068/S68590.html",
      "state": "VA",
      "duration": "20 Minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b8160",
      "summary": "Object over 100 feet in length, 6 square red lights in front, middle area dark, back section [had] 3 red flashing lights, low, silent.",
      "city": "virginiabeach",
      "shape": "unknown",
      "date": "2009-03-19T00:00:00",
      "story": "Object over 100 feet in length, 6 square red lights in front, middle area dark, back section [had] 3 red flashing lights, low, silent. The following report information is a transcribed extract from the UFO sighting report files of the Virginia Beach, Virginia, Police Department, taken from a chronology of Virginia Beach, Virginia UFO sighting reports on file with the Virginia Beach Police Department dating back to May 1976.  All quotes are taken directly from the original report forms and some extrapolation is made for the description of the UFO(s) sighted, as not all of the report details were recorded in complete and full sentences by the dispatcher who received the report. Report 45: 1/1/85 at 22:00  Description: The UFO was an \"object over 100 feet in length.” It had \"6 square red lights in front, 1/2 [word illegible] row.” The \"middle area\" of the UFO was \"dark\" and the \"back section [had] 3 red flashing lights.” The UFO \"flew very slowly and low and silent out over the ocean.” The object was \"followed shortly by 4 aircraft.” The \"NAS Oceana tower [was] checked and [had] negative results.” This confirms the UFO was not a conventional aircraft tracked by radar. The witness was \"attached to NAS Oceana, VA, 35,\" unless this was in reference to the person phoned at the Oceana tower. How Many: 1 Sighted Distance: “200-300 yards above trees”  Duration: “In view 200 feet” Address: Glen Falls Court Witnesses: 2",
      "link": "http://www.nuforc.org/webreports/068/S68586.html",
      "state": "VA",
      "duration": "In View For 200 Feet Whil"
    },
    {
      "_id": "64d005f478aba2ec5a3b8168",
      "summary": "A “group of four lights appeared in the sky, stopped  dead still, then went back the way they came and shot straight up in the sky.\"",
      "city": "virginiabeach",
      "shape": "unknown",
      "date": "2009-03-19T00:00:00",
      "story": "A “group of four lights appeared in the sky, stopped  dead still, then went back the way they came and shot straight up in the sky.\" The following report information is a transcribed extract from the UFO sighting report files of the Virginia Beach, Virginia, Police Department, taken from a chronology of Virginia Beach, Virginia UFO sighting reports on file with the Virginia Beach Police Department dating back to May 1976. All quotes are taken directly from the original report forms and some extrapolation is made for the description of the UFO(s) sighted, as not all of the report details were recorded in complete and full sentences by the dispatcher who received the report. Report 53: 5/5/88 at 22:15 - Description: This UFO was a “group of four lights [that] appeared in the sky, stopped dead still, then went back the way they came and [then] shot straight up in the sky.” - How Many: 1 Sighted - Distance: “About as far away as an airplane.” - Duration: “2 minutes” - Address: Settlers Park Drive - Witnesses: 2",
      "link": "http://www.nuforc.org/webreports/068/S68588.html",
      "state": "VA",
      "duration": "2 Minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b8203",
      "summary": "A circular object with lights on the bottom, flying very low to the house, possibly about six stories high, there was a humming noise.",
      "city": "virginiabeach",
      "shape": "circle",
      "date": "2009-03-19T00:00:00",
      "story": "A circular object with lights on the bottom, flying very low to the house, possibly about six stories high, there was a humming noise. The following report information is a transcribed extract from the UFO sighting report files of the Virginia Beach, Virginia, Police Department, taken from a chronology of Virginia Beach, Virginia UFO sighting reports on file with the Virginia Beach Police Department dating back to May 1976. All quotes are taken directly from the original report forms and some extrapolation is made for the description of the UFO(s) sighted, as not all of the report details were recorded in complete and full sentences by the dispatcher who received the report. Report 68: 11/19/95 at 23:06 - Description: The UFO was “a circular object with lights on the bottom. The object was moving in a northeast path, flying very low to the house, possibly about six stories high. Object then disappeared behind the trees. Also… there was a humming noise.” - How many: 1 Sighted - Distance: “About six stories high from the ground.” - Duration: “20-30 seconds.” - Address: Montgomery Place - Witnesses: 1",
      "link": "http://www.nuforc.org/webreports/068/S68589.html",
      "state": "VA",
      "duration": "20-30 Seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b8405",
      "summary": "A bright light that came closer to photographer with each camera flash; green, orange and violet haze around the orb.",
      "city": "virginiabeach",
      "shape": "sphere",
      "date": "2009-03-19T00:00:00",
      "story": "A bright light that came closer to photographer with each camera flash; green, orange and violet haze around the orb. Several dogs at a nearby kennel started barking in a defensive manner.  We went to the backyard to see why they were barking and a bright, hovering light was seen in the sky.  It radiated green, orange and violet auras.   As we began to take pictures, it appeared to be moving closer to our location with each camera flash and then would fall back when the flashes stopped.   I would have reported this sooner if I would have know about this website. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/068/S68660.html",
      "state": "VA",
      "duration": "60 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b85d1",
      "summary": "Triangular craft, solid white lights with red center over Oceana Air Force Base Virginia Beach, VA",
      "city": "virginiabeach",
      "shape": "triangle",
      "date": "2009-01-10T00:00:00",
      "story": "Triangular craft, solid white lights with red center over Oceana Air Force Base Virginia Beach, VA As my wife and I sat on the couch with our window blinds open, I suddenly heard my wife say 'Whats that!?' Sitting next to her, I said 'See what?' And within seconds a very large triangular shaped craft appeared within my visual through the window pane in the sky. Now we are used to jets flying at night from Oceana Air Force Base in Virginia Beach, VA, but this was no jet! The craft was very close to us, maybe 1/4 to 1/2 mile and very large in comparision to jets at that range. It was probably 1000 feet in the air, flying behind the tree lines. I watched in disbelief and quickly ran out the front door to get a better view of the lights, but the craft was lower than our next door neighbors house. I could hear engines or some sort of mechanical power grrr through the sky. I ran out back but couldn't see anything else, only the sound fading away. We quickly jumped in the car to take a ride to see if we could get another glimpse of it, but we had no luck. To describe the craft: It looked exactly like a triangle starting with 5 vertical lights, then 4, then 3, then 2, then 1. They were VERY bright lights, not typical commercial flight lights. A strange thing about the lights was, the 3 vertical lights had a red light in the middle. This was the only different light, and it also was very bright red. The lights did not blink, they remained solid. I would love to know what we saw, and have looked for it from time to time ever since. (NUFORC Note:  Witness indicates that date of incident is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/067/S67054.html",
      "state": "VA",
      "duration": "15 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b8af3",
      "summary": "Glowing fireball type orb with a tail of some sort, with strange movements, and then unimaginable speed to disapear.",
      "city": "virginiabeach",
      "shape": "fireball",
      "date": "2010-04-13T00:00:00",
      "story": "Glowing fireball type orb with a tail of some sort, with strange movements, and then unimaginable speed to disapear. My dad was driving in our truck and I was in the passanger seat.  We were stopped at a left turn signal on Indian River Rd.  While we were waiting for the light to change out of the corner of my eye I saw a bright circular object, at first i thought it was the full moon, but it was not the moon.  I looked at the object and I was glowing bright white to orange to redish colors, almost as if it was on fire.  There was also a tail somewhat like a comet's tail coming of of the back of it.  The way this object moved though could not have been a comet, or a rocket.  My dad was watching it as well once I pointed it out to him.  He is a high level navy Senior Cheif and now works in a control tower for a nearby base.  The object sometimes just floated, there seemed to be no sound whatsoever, and then it would make complex movements left to right, diagnoly, straight down, up, any way it wanted.  This lasted about 2 minutes. I looked at the car in front of us and noticed the couple in the car were also pointing to the object in the sky.  Soon after the object made some more maneuvers.  Then as if having the ability to accelerate to what I believe to be the speed of light, the orb, craft, object whatever it may have been.  Shot off at an amazing speed and in a matter of 1-2 seconds completely disapeared. This image has stuck in my head ever since and I dont think I will ever get an explanation for what we saw that night.  My father contacted Langley to see if any launches were scheduled for that day and there was nothing. My father works with many top officials now that he is retired and now a civilian working on base in the control tower.  He knows what we saw that night was nothing at least in military arsenal that has been released. This area has seen many sighting since then...  Including the lights and explosion seen and felt over va / nc in the last couple months or so.",
      "link": "http://www.nuforc.org/webreports/074/S74863.html",
      "state": "VA",
      "duration": "3-5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b913a",
      "summary": "Lights seen in Virginia Beach sky",
      "city": "virginiabeach",
      "shape": "light",
      "date": "2009-08-05T00:00:00",
      "story": "Lights seen in Virginia Beach sky On July 6 2009 I had gone out back to my patio to talk on the phone to a good friend of mine. After about 3 min of talk I noticed what looked like a dim, pulsating, blue star moving extremely fast to the south west and ascending.  It was moving entirely to fast to be a plane and also moving to slow to be a shooting star. It proceeded to change its course to direct west and straightened its course, then went out immediatly. After about 30 sec I noticed a much brighter and continuous white light bigger than the first (about 3 times larger.) and also much lower and closer, moving at about the same speed as the first, heading in a north west direction. It proceeded to ascend also and then abruptly faded out like a shooting star about roughly a mile from my position. This was not a shooting star. After this event about 3 min to 5 min later I noticed a 3rd light that immediately shot out of the northern sky and descended to the southern sky. It then proceeded to fade out. The 3rd light I believe was a normal shooting star (Meteorite).",
      "link": "http://www.nuforc.org/webreports/070/S70947.html",
      "state": "VA",
      "duration": "7 min"
    },
    {
      "_id": "64d005f478aba2ec5a3b9265",
      "summary": "((SERIOUS REPORT??))  We saw a strange light in the sky; saw two strange looking men in a grocery store, one of which, I spoke with.",
      "city": "virginiabeach",
      "shape": "fireball",
      "date": "2010-05-12T00:00:00",
      "story": "We saw a strange light in the sky and on the same night, saw two strange looking men in a grocery store, one of which, I spoke with. Not sure of the exact date but sometime in september of 2008 many residents of Virginia Beach saw an unidentified object in the sky.  It looked like a fire in the sky that moved very slowly and suddenly disappeared.  Many people were outside viewing it and some were videotaping it, other residents from close by areas saw it too.  It was comming from the North/East over the oceanfront maybe?  It must have hung around for at least twenty minutes or so. But thats not where the story ends.  Later that night me and my Girlfriend, ((female's name deleted)) were shopping for groceries in the local Farm Fresh located on General Booth blvd.  I noticed a strange looking man walking past.  He was tall, caucasion, dressed in casual cloths and he was by himself but there was something strange about his eyes.  They looked a little out there. Heres a photo of what the eyes kind of looked like. http://daysofourlife.files.wordpress.com/2008/04/charles-manson.jpg  I walked passed and didn't really think too much of it except \"that guy looked weird\". Then I saw another man caucasion, short, casual cloths-also alone, and he had the same eyes!  I became interested and followed him for a bit.  He walked over to the magazine section and was reading some magazine(didn't look to see which one), and I told ((woman's name deleted)) about what I had seen and she told me to go up to him and ask him for directions, so I did.  His movement was very erratic and he had his head lowered at an angle(which I also found strange). I told him that I was lost and needed to know the best way to get to the oceanfront.  He spoke in a strange accent(even though his english was perfect), the way it came out sounded very monotone and far away.  He didn't turn away from his magazine and wouldn't look me in the eyes, which I also found strange.  I will tell you this, as a person who is experianced in meditation and telepathy, the man gave off a very strange, unearthly energy that I cannot describe.  I felt hypnotized by his words.  I couldn't read anything from him except th! at I felt as if I was pulled in by his strange energy.  He told me that he wasn't from here and couldn't help me.  I felt tongue tied and couldn't bring myself to say anything else.  I walked away feeling hazy, as if the experiance had happened in a dream or something.  My hand were cold and I was shaking.  I told ((woman's name deleted)) about it and she insisted that she speak with him herself as her psychic powers are natural and mine are more developed.  By the time we had returned, he had disappeared.  I just wanted to leave, so we did.  Nothing else came out of the incident. ((NUFORC Note:  Witness indicates that date of sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/075/S75351.html",
      "state": "VA",
      "duration": "20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b97fd",
      "summary": "Craft that was bright and looked like it was on fire was 300 yards away and came closer and I put a light on it, and it came closer.",
      "city": "virginiabeach",
      "shape": "fireball",
      "date": "2009-01-10T00:00:00",
      "story": "A craft that was bright and looked like it was on fire was 300 yards away and came closer and I put a light on it, and it came closer. It happend a little after five AM. I was setting up for a duck hunt in Back Bay on December 8th 2008.  I was early and began putting out decoys and it was very very dark out.   I was faceing the opan water and out of nowhere a huge bright light the size of a small air plane came around a point off a cove it was the color of fire and extreamly bright and extrmaly fast.  It was no more than 300 yards away from me and it was moveing closer to me.  I had no lights on during this time.  As it came closer I became very scared and picked up my 2,000,000 power spotlight and pointed it at it.  As soon as i turned it on the light that was like fire went out.   Five minuites later, a dark shadowy figure which was silent, came within 50 yards of me i was so scared.  It was like it it knew it was spoted and then came to see what had made that light. and seconds latter it was gone, so i thought. I emmedittly called home to tell them what I had seen i was on the phone for about 15 minutes and while I was talking I saw the it agin and it was about .5 mile away and it was on or right above the water and in seconds it was in the sky and as high as the stars,  The whole incounter from beging to end was about 35-40 min.  Oddly before this while I paddled my duck boat out to the duck blind there was a small metor shower or some like that and then a few right after the event.  The fire like light was huge, bright, very fast, quite, and amazing.   I have never seen anything like this. terrifying but amazing. ((NUFORC Note:  Witness elects to remain totally anonymous;  provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/067/S67393.html",
      "state": "VA",
      "duration": "20min"
    },
    {
      "_id": "64d005f478aba2ec5a3b9aff",
      "summary": "Ball of light, smaller lights flying, flying saucer",
      "city": "virginiabeach",
      "shape": "light",
      "date": "2010-05-12T00:00:00",
      "story": "Ball of light, smaller lights flying, flying saucer On the night os April 28th, A friend and I were outside smoking a cigarette, we noticed a giant light in the sky flying in a slow motion, the light never blinked and was abnormally slow.  The light in the sky was floated by and we were shocked so we ran to my backyard to check it out, by that time I grabbed my camera and took some shots, I only got 1 picture of the big light, I zoomed in and it is a perfect rectangle.   After that we were watching the sky and we noticed some small lights that resembled stars and I began snapping photos.   We followed the light not losing focus and as the small light passed what seem to be a star the star began moving in opposite direction!  The supposed star flew over us, and after that we noticed another one flying,  It seemed far away and it flew over my house.  I have photo proof of what I seen! I zoomed in and there is a UFO FLYING SAUCER with a Red window and there is something white in the window!!!  I am from Arizona and I have seen them before but I have never seen them in Virginia Beach since I live near the AFB.",
      "link": "http://www.nuforc.org/webreports/075/S75237.html",
      "state": "VA",
      "duration": "1 hour"
    },
    {
      "_id": "64d005f478aba2ec5a3ba472",
      "summary": "huge moon like blue white spheres  flashed in night sky accompanied by loud booms",
      "city": "virginiabeach",
      "shape": "sphere",
      "date": "2009-04-14T00:00:00",
      "story": "huge moon like blue white spheres  flashed in night sky accompanied by loud booms I saw a bright flash of light ,I went to my window and saw a huge moon like sphere of blue white light flash very bright and smaller sphere shoot out backwrds from the larger sphere as it flashed bright again. Then there was a huge percussion werid sounding booms that followed. Minutes later I saw what I thought was an aircraft flashing from blue to red to green it moved quickly left and then backwards it stopped and stayed in place about 30 to 40 minutes then I saw jets flying in the area and it disappeared. The brillant flash was seen in three states. Some saw a green fire ball I did not see that, what I saw was the flashing spheres, it may have been our location. The media first thought it was a meteorite now they are saying it may have been space junk. I doubt that as Norad keeps track of that. I believe what I saw was 2 very different ufo's. I had never see anything like this before. And I have never heard of space junk or meteorites being seen across three states either, I am convinced it was a major ufo event.",
      "link": "http://www.nuforc.org/webreports/069/S69459.html",
      "state": "VA",
      "duration": "1 to 2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3ba474",
      "summary": "Purple fire trail from debris headed east at rapid pace, leaving thunder boom in its wake.",
      "city": "virginiabeach",
      "shape": "fireball",
      "date": "2009-04-14T00:00:00",
      "story": "Purple fire trail from debris headed east at rapid pace, leaving thunder boom in its wake. There was a chunk of debris with a purple trail (like fire) flying east in the air at a rapid pace. There was a short thunder boom afterward which scared my animals. I called my wife who was about 10 miles east and she was outside with everyone in the neighborhood trying to figure out what happened, they heard the same thing.",
      "link": "http://www.nuforc.org/webreports/069/S69435.html",
      "state": "VA",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3ba5f2",
      "summary": "Bright light seen in Virginia Beach",
      "city": "virginiabeach",
      "shape": "chevron",
      "date": "2008-10-31T00:00:00",
      "story": "Bright light seen in Virginia Beach   I was taking my dog outside when I saw a bright, cross shaped UFO hovering over my apartment complex. I watched it for a minute or so, then went inside to get a camera but I left my dog outside. When I came back out,the UFO was still there, so I turned on the camera, but by the time I snapped the picture it was gone. My dog was nowhere to be found. Minnie (the dog) always stays close by, so I am convinced that the craft abducted my dog. The craft appeared to have a relatively low altitude, probably 1000ft. There were no discernible features other than the \"V\" shape and bright lights. I did not hear any abnormal sounds during the entire encounter. I have contacted VA Beach PD and they think I am just a nuisance and will not process my report. I am left with no other options. Please help me. I would prefer to be contacted by email due to the nature of my work. I can't predict who will be around me, and some of my coworkers have been very unsupportive of my situation.",
      "link": "http://www.nuforc.org/webreports/066/S66411.html",
      "state": "VA",
      "duration": "3-5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3ba6d5",
      "summary": "Brief, bright light--high in the sky.",
      "city": "virginiabeach",
      "shape": "light",
      "date": "2009-06-09T00:00:00",
      "story": "Brief, bright light--high in the sky. Around 11:30 p.m., I was walking north in Virginia Beach and, looking up into the Big Dipper, I saw a light very high in the sky that was bright enough to make me say, “Wow!”  I was trying to figure out what sort of star it could possibly be when it started moving and the light dimmed.  It seemed to be moving irregularly. It was similar to the way a plane looks when the headlights are aimed at you, but this was so high in the sky, for that to be true, the plane would have had to be descending--and it wasn’t.",
      "link": "http://www.nuforc.org/webreports/070/S70401.html",
      "state": "VA",
      "duration": "A few seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3ba6bc",
      "summary": "this object was very high up and emmited no sound.!",
      "city": "virginiabeach",
      "shape": "fireball",
      "date": "2008-08-12T00:00:00",
      "story": "this object was very high up and emmited no sound.! it was on a very clear Sunday night around 9pm when i spotted a high altitude (Bright)orange orb with no tail moving in a straight line from west to east over top of me for about 1 minute. As it moved closer it slowly dimmed to an ember/amber color for 20 seconds and before it reached overhead and disappeared with no sound. that night i even saw many blinking jet liners and even a large meteor burning towards the earth like hot magnesium..no it didn't hit the ground ha ha. it lit up trees in front of me before i turned around and spotted the flaming rock, so that provided great references to the mysterious object i saw. it was not a plane and definitely not a meteor. ive seen this object four times in the past few months so its a common phenomena.",
      "link": "http://www.nuforc.org/webreports/065/S65064.html",
      "state": "VA",
      "duration": "4 months"
    },
    {
      "_id": "64d005f478aba2ec5a3bab2a",
      "summary": "Ufo In Virginia Beach",
      "city": "virginiabeach",
      "shape": "sphere",
      "date": "2010-11-21T00:00:00",
      "story": "Ufo In Virginia Beach At approximately 9:35, spherical object was spotted hovering over Independence Blvd.  Kept sight of for 2 minutes.  Had jet stream of alternating colors including Red, Blue, and Green.",
      "link": "http://www.nuforc.org/webreports/077/S77929.html",
      "state": "VA",
      "duration": "2 Min."
    },
    {
      "_id": "64d005f478aba2ec5a3bafdf",
      "summary": "fast and low flying triangular object with red lights over Va Beach, Va  area",
      "city": "virginiabeach",
      "shape": "diamond",
      "date": "2011-05-02T00:00:00",
      "story": "fast and low flying triangular object with red lights over Va Beach, Va  area Last night while riding home from work my boyfriend spotted a triangular object in the sky with flashing red lights asking \"what is that!?\",    I look up to see what could have been mistaken for a helicopter but with one second look I noticed that the object was definitely not a helicopter,  its was traveling at a speed that was way too fast and at a level way too low to be considered any type of domestic aircraft.   It was in shape of a faint  triangle with red lights at its top and bottom traveling horizontally and very low. It was unbelievable!   The air craft then came to a complete stop and its red lights changed to green while it remained still hovering the same spot for about 2 minutes.  I never took my eyes off of it, so my heart sank when it vanished in thin air.",
      "link": "http://www.nuforc.org/webreports/080/S80935.html",
      "state": "VA",
      "duration": "7 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bb29f",
      "summary": "orb shaped, hovering UFO during the day in virginia beach on march 29, 2011.",
      "city": "virginiabeach",
      "shape": "oval",
      "date": "2011-04-03T00:00:00",
      "story": "orb shaped, hovering UFO during the day in virginia beach on march 29, 2011. In the sky, while still daylight outside, me and one other person witnessed what seemed like a helicoptor without propellers or a tail hovering at a relatively low velocity, consistantly and maintaining the same altitude.  It was silent and it reflected the suns light at certain points and flashed a soft red and white light once or twice.  about 5 minutes after it disappeared in the distance, there was a plan traveling very slowly in the same direction as if it was tailing the ufo. i tried to video tape it but it was relatively small and somewhat far from us and nothing showed up in the video itself.",
      "link": "http://www.nuforc.org/webreports/080/S80672.html",
      "state": "VA",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bb3cb",
      "summary": "multiple dark shades in an otherwise clear blue sky above high rise",
      "city": "virginiabeach",
      "shape": "formation",
      "date": "2011-02-23T00:00:00",
      "story": "multiple dark shades in an otherwise clear blue sky above high rise I have never seen a UFO but this picture is rather strange.  I have heard that some pictures used with high quality film pick up traces of phenomena that would not otherwise be seen.  This picture is from a Real Estate listing Agency attempting to sell high priced high rise units in the newly built Town Center VB area.   I am a contractor and was interested in seeing the build out of the place-not to look at any anything else!  Might be nothing, but thought you might give it a look.  Please keep in mind the Edgar Cayce Center is just miles down the road from this location. The link is at this location: Great Room Panarama, Rose & Womble RE Suffolk, VA. http://rtvpix.com/RC-1295-GICP9Y-01 ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/080/S80135.html",
      "state": "VA",
      "duration": "picture"
    },
    {
      "_id": "64d005f478aba2ec5a3bb5e9",
      "summary": "Sphere seen traveling at a high rate of speed over  Virginia Beach",
      "city": "virginiabeach",
      "shape": "sphere",
      "date": "2010-11-21T00:00:00",
      "story": "Sphere seen traveling at a high rate of speed over  Virginia Beach While driving to work this morning, I noticed a bright light moving from west to east at an extremely fast pace.   My initial thought was that I was observing a meteor, but it wasn’t displaying any characteristics of what I know from seeing meteors in the past.   This sphere traveled in a straight line over the horizon, and then all at once, it shot upwards then shot straight down over the tree line.  From my vantage point, it seemed to pass just south of Oceana Naval Air Station but this was too fast for any jet I’ve ever seen.",
      "link": "http://www.nuforc.org/webreports/078/S78940.html",
      "state": "VA",
      "duration": "20 Seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bb692",
      "summary": "@ the intersection of Priness Anne Road & Upton Drive, near Red Mill Commons...",
      "city": "virginiabeach",
      "shape": "triangle",
      "date": "2010-08-24T00:00:00",
      "story": "@ the intersection of Priness Anne Road & Upton Drive, near Red Mill Commons... A buddy and I were heading home from grabbing a bite to eat when we stopped at a traffic light and saw three lights moving in one direction. My friend asked if I noticed that the far left light was behaving oddly; it wasn’t flashing, but it would seemingly disappear from view at random intervals. I thought it looked like a plane, at first, but the light positions and behavior didn’t correspond with those of typical navigation lights.  Right before the light turned green, the object seemed to stop.  I was close enough to the ground to use terrestrial objects as a reference for its position.  We then began travelling towards the object on a two lane highway, leading out to the rural part of town (I gather from the way it approached that this was where it was originally, before moving towards us).  The closer we got to it, the more we realized that it had stopped moving and was hovering over a field. It was frozen in place.  The radio was at a very minimal volume and we both had our windows down.  We were more than close enough to hear a jet turbine, prop chatter, etc. At our closest point I would imagine it was roughly 125 yards out in the field. The craft was triangular in shape, but somewhat thin from a side view.  It had three lights, one on each corner of the triangle shape, and a spotlight on the front (or in the direction was moving, rather), which was casting a fading cone shape, straight ahead.  For a brief period, I also noticed a faint blue light emanating from underneath the vessel. We pulled over in a turning lane just beyond our point of perp endicularity.  As we stopped, the car behind us pulled over in the same turning lane, just ahead of us. My friend got out of the car to catch a better look, but my view was perfect from inside the car.  Shortly after stopping, the craft began floating across the road we were travelling, not quite a quarter mile behind us.  It was directly above the street; I would wager it was about 150-200 feet above the ground.  It was travelling very slow and was heading behind the shopping center we had just left. We pulled up next to the other car and asked the driver if he saw what j! ust happened. He said he just got off the phone with his girlfriend, telling her about the hovering object.  He claimed he was a seasoned pilot and began commenting on the object's triangular shape and strange hovering.  He explained how the particular craft looked and behaved unlike anything he had ever seen. Side note:  This is a tough position to be in.  I used to mock those that reported UFOs, but now, I am one of them.  My friend and I, plus the other man in the car behind us, saw something that was simply unfathomable.  This was no faded smudge from a distance or a lightning fast stream of light; this was up close and personal.",
      "link": "http://www.nuforc.org/webreports/077/S77195.html",
      "state": "VA",
      "duration": "5-7 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bbb8d",
      "summary": "Group of  friends an I  follow a UFO on bicycles, I have a sighting alone about a week later.",
      "city": "virginiabeach",
      "shape": "disk",
      "date": "2011-10-10T00:00:00",
      "story": "Group of  friends an I  follow a UFO on bicycles, I have a sighting alone about a week later. I was about 8 years old and a group of kids in my neighborhood were riding bikes on Longfellow Ave. I looked up at the sky and noticed a UFO approx 500 feet above us, silently, we all decided to follow it and we rode our bikes all the way to the end of the street and then turned around when it sped up to the point where we could not keep up. Approximately a week later, at approximately 5pm, I arrived back  home from a Brownie Troop meeting (my mom picked me up and drove me to the house afterwards) and my mom brought my brother in the house to start dinner. For some reason, I decided to not go in the house right away, I was on the side of the house and looked up and could not believe my eyes, I saw the same UFO I saw a week earlier, I looked up and felt paralyzed and did not move for what seemed to be approx 10-30 minutes (it was hard to tell how long it was there).  The disk had square windows that beamed white light, it was silent and quite mesmerizing. When! it left it, darted up at the sky and seemed to silently disappear at an unbelivable speed.  My mom asked me why it took so long for me to come back in the house because she was almost finished making dinner.  I didn't say anything about the UFO to her because I thought she might not believe it, anyway. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/084/S84013.html",
      "state": "VA",
      "duration": "10-30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bbc8e",
      "summary": "I saw it too!",
      "city": "virginiabeach",
      "shape": "sphere",
      "date": "2011-12-12T00:00:00",
      "story": "I saw it too! I just submitted a report of an incident that happened to me in Charlotte, NC.  I made a reference to another incident that I had when I lived in Virginia Beach.  I was looking through your posts to see if I saw anything that was similar to what I saw and found report:  Occurred : 6/15/2003 19:00 (Entered as : 06/15/03 19:00)  Reported: 4/1/2010 9:00:03 PM 21:00  Posted: 4/13/2010  Location: Virginia Beach, VA  Shape: Fireball  Duration:3-5 minutes   This report describes exactly what I saw other than the changing colors. I lived right off of Kempsville Road which intersects Indian River.  If this person was near this intersection, then I think we were possibly viewing the same event.  I know that the front of my home faced the direction of the intersection of Indian River/Kempsville Road.  If they were observing this from facing the driection of Centerville Tpk, then I know this has to be the same incident. I know that the weather was warm outside and it was late evening right about when the sun was about an hour from full set. Whatever I saw made the same irregular movements...up/down...left/right...and also had that faint trail of light that followed it.  (There was a small tornado in Kempsriver Shopping Center that is right at the intersection of Indian River Road and Kempsville Road.  I was on my front porch when this tornado had formed and could see it clearing forming in the sky from my porch so I know that it is ! very well possible that this person, if they were facing toward my home at that time could see what I was seeing....Facing my house, the incident took place to the left of my house.  If the person who reported this was traveling on Indian River traveling towards Kempsville, then they were facing toward my home.",
      "link": "http://www.nuforc.org/webreports/085/S85629.html",
      "state": "VA",
      "duration": "60 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bbd53",
      "summary": "Possible UFO sighting. Unknown. Orange/dimming ball. Went across the beach towards the ocean.",
      "city": "virginiabeach",
      "shape": "circle",
      "date": "2011-10-10T00:00:00",
      "story": "Possible UFO sighting. Unknown. Orange/dimming ball. Went across the beach towards the ocean. It was possible that it was a UFO, but I am not too sure.  I was walking on Sand fiddler Road in Virginia on vacation when i saw this glowing orange ball in the sky going across the beach.  I believe the duration of the sighting was about 2 to 3 minutes.  It was glowing for a while then it made a quick right towards the water and dimmed away.  Then it was nowhere to be seen.  I'm not too sure if it was a Chinese lantern or not.  According to a friend we told, she said it could of been one of those.  But who knows, so this is my report which is unprofessional.",
      "link": "http://www.nuforc.org/webreports/084/S84234.html",
      "state": "VA",
      "duration": "About 3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bc4c8",
      "summary": "Two creatures or aliens in Bay Colony, no UFO.",
      "city": "virginiabeach",
      "shape": "unknown",
      "date": "2011-08-21T00:00:00",
      "story": "Two creatures or aliens in Bay Colony, no UFO. This is not a report of a UFO, but of two strange creatures I witnessed.  I was 12 to 13 years old, it was dusk and overcast.  I remember it being windy and about to rain or it was sprinkling.  Out of my downstairs bedroom window, I can clearly see the neighbors house roof.  I was looking out the window and saw a figure on top of the roof ridge about 5 feet from the gable end.  It appeared to be sitting there looking at me!   I watched it for a minute or so and ended up walking away for a minute to find someone else to see.  When I came back to the window, there was a second creature sitting behind the first one and appeared to have its arms around the first one from behind.  Like hugging someone from behind.  They just sat and looked at me for enough time that I figured they wern't going anywhere soon.   So, I left to find a witness, but on my return, they were gone!  I thought it was a racoon or O'possom when I saw the first creature, but soon realised it was nothing I've ever seen.  I was raised in the mountains and have never seen an animal like this!  The best description is a kuala bear.  They were no more than 1.5 - 2 feet tall, more of a brown/black longer fur, and smaller ears.  The roof top was about ~75' from my window.  I've never heard of koala's in Virginia, except at the zoo. This happened in the Bay Colony neighborhood of Va. Beach.  It is a neighborhood surrounded by water and only a few land/road access points through populated areas.",
      "link": "http://www.nuforc.org/webreports/083/S83236.html",
      "state": "VA",
      "duration": "5 min"
    },
    {
      "_id": "64d005f478aba2ec5a3bc5cb",
      "summary": "There was a bright red light that shot straight up out of the water on the ocean side of the Cheasapeake Bay Bridge Tunnel.",
      "city": "virginiabeach",
      "shape": "light",
      "date": "2011-08-21T00:00:00",
      "story": "There was a bright red light that shot straight up out of the water on the ocean side of the Cheasapeake Bay Bridge Tunnel. I was walking on the beach at Little Creek Naval Amphibious Base at about 11pm looking towards the Cheasapeake Bay Bridge Tunnel when suddenly a bright red light shot straight up from the water on the other side (ocean side) of the bridge.  I am guessing it was between 5 and 10 miles from my location.  At first I thought it was some sort of flare, but then it exploded and shot out red sparks without making a sound.  At this point the sparks faded, but a single solid red light remained which slowly began to move vertically like an airplane southeast towards the Virginia Beach Coast.  I watched it for about 5 minutes when without notice it dissapeared.  There was no fading, dimming or blinking at any time of any sort.  The red light just immediatley went out.  From what I could tell in the darkness there was no contrail on the object before or after it split apart, and it made no sound. I cannot imagine how anyone on the Bay Bridge Tunnel could not have seen t! his, but I have not been able to find another report. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/083/S83174.html",
      "state": "VA",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bc8ac",
      "summary": "Fire ball off I-264",
      "city": "virginiabeach",
      "shape": "fireball",
      "date": "2011-08-21T00:00:00",
      "story": "Fire ball off I-264 As I was driving to work on I-264 in Va Bch headed toward the 264-64 interchange, out of my left window right above the street lights I saw this orange fire ball just sitting in one place with its lights fizzing or flickering very fast.   To me it looked like an orange static ball just floating there in one spot.   It was approx. 200 feet off the ground and about a 1/4 of a mile from the highway.   There was other air traffic in the same area as the object but as they continued on their path the fireball stayed in the same spot.  Where the spotting took place there is alot of air traffic from Norfolk Intl and NAS Oceana.   I am in the Navy and I have worked on both F-18's and SH-60's and this was definitely not like anything I have ever seen in my life.   Please tell me I am not the only one who saw this!!!",
      "link": "http://www.nuforc.org/webreports/083/S83071.html",
      "state": "VA",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bca97",
      "summary": "Blue oval object over ocean in front of a lightning storm move at a high rate of speed.",
      "city": "virginiabeach",
      "shape": "oval",
      "date": "2011-08-21T00:00:00",
      "story": "Blue oval object over ocean in front of a lightning storm move at a high rate of speed. It was approximately 12:08am EST on August 19, 2011, I was standing in my back yard watching the lightning storms over the ocean.  This is when I looked to the left (North East) and seen a blue oval shaped object moving at great speed about 10 degrees above the horizon, just above the roof tops of the houses in the distance.  It moved north east to south west. The object was about the size of a 20 millimeter bb, it was oval and moved in a straight line across the sky from north east to south west.  It was moving very fast, it took less than 10 seconds to move across the sky and my view.  At this time there was and commercial aircraft moving towards it. The commercial aircraft was much higher in the sky.  It was at about 60 degrees above the horizon and you could see the FAA required lights along with the shape.  Commercial aircraft have to fly at higher altitudes due to the military base I’m close to.  Also, the speed of the commercial aircraft was much slower than the object. The object was in front of the storm because you could see the lightning storm and clouds behind it. There also was no sound.  I also could not hear the commercial aircraft either, but I could see the moon, stars, the commercial aircraft, and clouds very clearly.  The storm in the distance was over the ocean.",
      "link": "http://www.nuforc.org/webreports/083/S83273.html",
      "state": "VA",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bd0b2",
      "summary": "Saw a small,boxlike object with spikes or antenna travelling slowly over the city.",
      "city": "virginiabeach",
      "shape": "other",
      "date": "2012-09-24T00:00:00",
      "story": "Saw a small,boxlike object with spikes or antenna travelling slowly over the city. On Sunday afternoon I was leaving the Walmart on Phoenix Ave near the Lynnhaven Mall in Virginia Beach, VA. This is about 1/3 of a mile west of the Oceana Naval Air Station.  It was a rainy, drizzly day but had stopped at the time.I turned northbound on Lynnhaven Parkway when I saw an unknown object in the sky.  It was indistinct in shape, as it had what appeared to be antenna or spikes extending laterally fore and aft and to some degree on the bottom. It was about the size of a nickel held at arms length.  My impression was that it was about the size of a desk several hundred feet off the ground. It was dark in color and made no noise any louder than the traffic. I drove slowly and watched it travel west by southwest in a straight line at about 10-15 mph. There were no markings or lights. It started to get behind my position and traffic compelled me to drive on. It was perfectly steady and did not appear to be a balloon of any kind. I thought it may have ! been an airborne surveillance device, but it certainly wasn't anything like the stuff you see on TV. There was no obvious means of propulsion.  Just a brief, weird thing.",
      "link": "http://www.nuforc.org/webreports/092/S92003.html",
      "state": "VA",
      "duration": "25 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bdd5e",
      "summary": "Observed a fast moving spherical object moving horizontally across the eastern horizon.",
      "city": "virginiabeach",
      "shape": "",
      "date": "2012-10-30T00:00:00",
      "story": "Observed a fast moving spherical object moving horizontally across the eastern horizon. Very bright red/orange spherical object 30 degrees above the horizon traveling in a north to south direction at constant very high speed.  Speed faster than any planets or stars, but much slower than the Orionoid asteroids visible that night. Come into view at about 150 degrees on the eastern horizon and lost its lighting at about 170 degrees. We observed 2 recurrences within 2 min of dissipation, each was lower on the horizon. The object seemed to be reflective, not self illuminated.  This assumption is based on the fact that the object dimmed out as it moved out of sight in the southern range of its arc.",
      "link": "http://www.nuforc.org/webreports/093/S93742.html",
      "state": "VA",
      "duration": "90 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bdf4e",
      "summary": "Colored round balls of green and orange over the skies of virginia beach VA",
      "city": "virginiabeach",
      "shape": "sphere",
      "date": "2012-05-13T00:00:00",
      "story": "colored round balls of green and orange over the skies of virginia beach VA It was a round ball like object ,cigarette ash orange in color.  The sighting lasted about 15 to 20 seconds moving across the southeastern sky / 3 nights prior in the northeastern sky a bright green ball like object was seen for about same duration .  I estimate object to be 15-20 feet in diameter.  There is a navy air base around 1 mile from sighting but it was no plane.",
      "link": "http://www.nuforc.org/webreports/088/S88509.html",
      "state": "VA",
      "duration": "15 to 20 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bdf74",
      "summary": "Multi-colored spot of bright light near oceanfront/Dam Neck Naval Station",
      "city": "virginiabeach",
      "shape": "circle",
      "date": "2012-10-30T00:00:00",
      "story": "Multi-colored spot of bright light near oceanfront/Dam Neck Naval Station Woke up to what sounded like a police or military helicopter flying over my hosue around 2am. Disappeared after that.  Looking towards the ocean (East) from Lynnhaven and Holland i could see a bright low spot of light.  Thought it was a planet but it appeared to have multi-colored lights and it appears to sort of &quot;jump&quot; around the sky.  Didnt move much but just enough to know it was not a star/planet.  Tried taking photos with my 400mm lens but came out blurry of course. But my photos showed just about every color in the spectrum.  Freaked me out.  Turned radio scanner to military base channels and didnt hear any talk about aircraft. Ill be looking tonight to see if its there again...",
      "link": "http://www.nuforc.org/webreports/093/S93796.html",
      "state": "VA",
      "duration": "30 minutes or more"
    },
    {
      "_id": "64d005f478aba2ec5a3be4be",
      "summary": "Small fiery orange sphere floats over Va Beach neighborhood and travels slowly, silently and steadily away.",
      "city": "virginiabeach",
      "shape": "fireball",
      "date": "2012-05-13T00:00:00",
      "story": "Small fiery orange sphere floats over Va Beach neighborhood and travels slowly, silently and steadily away. I usually walk my dog in the evenings after sunset/dark. I have been fascinated by being able to see the International Space Station during my walks (and subscribe to a NASA feed from http://spaceflight.nasa.gov/realdata/sightings/ that lets me know when I can see it) and I enjoy watching the stars and their different position in the sky at different times of the year. Tonight the moon and Venus are farther apart than the last two nights. As I was walking my dog tonight (in a neighborhood behind First Colonial High School in Virginia Beach), I saw an orange sphere floating approximately 50-100 feet above the street/sidewalk. It looked like a home-made see-through contraption that someone put a candle or some other heat source in to make it rise like a hot air balloon. It was only about a foot in diameter.  It seemed as if one of the neighbors had launched it from their back yard.  It floated in the air and slowly, steadily and silently rose and traveled northwestward toward Venus.  As it got farther and farther away, its course gradually became more westward.  It had no tail or exhaust or contrail, just a glowing orange sphere. It became smaller and smaller like the size of a star to the human eye and then was no longer visible. The total duration of this encounter was approximately 2-3 minutes.",
      "link": "http://www.nuforc.org/webreports/088/S88700.html",
      "state": "VA",
      "duration": "2-3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bed1a",
      "summary": "I say almost disk shaped because the edges did not come to a point but were straight, could have been cigar shaped at an angle.",
      "city": "virginiabeach",
      "shape": "disk",
      "date": "2013-05-15T00:00:00",
      "story": "I say almost disk shaped because the edges did not come to a point but were straight, could have been cigar shaped at an angle. U.F.O. Sighting. Time frame 1993-1994 (cannot recall the exact date) Location Virginia  Beach, Virginia approximate Latitude, Longitude: 36 49.1' N, 76 08.9' W Shape : disc, maybe cigar depending on the angle. I was a teenager at the time and was with a group of friends, when someone quickly exclaimed that there was a U.F.O. hovering over the neighboring golf course. Where upon we all turned our attention to the skies to examine the object.  All of the other teens quickly agreed it was a U.F.O.. I was the only skeptic at this point trying to find an explanation. What I witnessed was a black almost disk shaped craft with a series of red lights hovering in the sky.  I tried explaining it by saying it was a blimp moving slowly at a strange angle away from us so it appeared not to be moving. We debated this for about one to two minutes when the craft nearly vanished before our eyes accelerating at a great rate of speed I cannot compare to anything I've ever seen. I immediately conceded and agreed what we witness was a U.F.O.. I have never seen anything like it since, nor have I seen anything like it in any photos I've seen of U.F.O.'s online or on television. ((NUFORC Note:  Witness indicates that the date is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/097/S97069.html",
      "state": "VA",
      "duration": "3-4 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bf0df",
      "summary": "Cigar shaped green purple lights huge object if anyone knows plz research! -VA",
      "city": "virginiabeach",
      "shape": "cigar",
      "date": "2013-09-30T00:00:00",
      "story": "cigar shaped green purple lights huge object if anyone knows plz research! -VA I am an 18 year old male from virginia as me and my two friends were walking and see a cigar shaped object in the sky glowing green and purple then white it looked like as if it was pulling off as if this object has landed in the chesapeak virgina area this is a big military community but i have never seen that.",
      "link": "http://www.nuforc.org/webreports/102/S102289.html",
      "state": "VA",
      "duration": "35 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bf2ee",
      "summary": "Orange Lights in Triangular Formation over Virginia Beach.",
      "city": "virginiabeach",
      "shape": "triangle",
      "date": "2013-07-03T00:00:00",
      "story": "Orange Lights in Triangular Formation over Virginia Beach I just saw an incredibly large triangle over land in Virginia Beach and couldn't believe the size.  There were clouds out tonight so it could not have possibly been stars or a planet.  I can identify a helicopter or airplane from the numerous vehicles I see almost daily in this area.  It was silent and was below the cloud deck, but the size was extremely large.  Giant in fact.  I've never seen something so large and distinct in our sky ever.  I am truly touched, enough to write this note tonight.   Each light was equidistant from each other and faded out quickly.  One light went out and then the other 2 went out at the same time and not a Chinese lantern.  I've seen them before as well.  Hopefully others saw the same thing as me and the people around me weren't the only ones seeing this object.  It was a once in a lifetime event as far as I'm concerned. ((ADDENDUM FROM WITNESS) Dear Peter, I called WAVY news, the local NBC affiliate and reported my sighting.  It was an amazing site. I only wonder if it was a government vehicle of sorts,  Amazing indeed! Thanks for your time this evening. I can't sleep now… ((name deleted)) ((END ADDENDUM))",
      "link": "http://www.nuforc.org/webreports/098/S98505.html",
      "state": "VA",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3bf379",
      "summary": "3 fireballs going vertical.",
      "city": "virginiabeach",
      "shape": "fireball",
      "date": "2013-07-03T00:00:00",
      "story": "3 fireballs going vertical 3 fireball lights fading to 2, then disappearing completely, returning with 2 lights and a horizontal streak of yellow below it, then disappeared completely again.   Returned with 3 lights and went vertical for awhile then disappeared.",
      "link": "http://www.nuforc.org/webreports/098/S98491.html",
      "state": "VA",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bf80f",
      "summary": "Metalic object bigger than empire state building appeared to rise up in blue aura of light.",
      "city": "virginiabeach",
      "shape": "other",
      "date": "2013-09-30T00:00:00",
      "story": "metalic object bigger than empire state building appeared to rise up in blue aura of light On Monday September 23, 2013 in Virginia Beach, Virginia in zipcode 23464 three young men at about 8:00 pm saw a blue aura light up the sky, and light going in pulses from earth to sky, in three pulses, and going up into the sky was a pointed metalic object.  Immediately afterward, not at the same time, the electric power went out in the community for about five minutes.  The object did not return.  The sky returned to normal.  The viewers were shocked and in  awe at what they saw. ((NUFORC Note:  Witness provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/102/S102565.html",
      "state": "VA",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bf8e0",
      "summary": "Dark circle with orange light above no sound, no flashing, slowly crossing sky.",
      "city": "virginiabeach",
      "shape": "circle",
      "date": "2013-07-14T00:00:00",
      "story": "Dark circle with orange light above no sound, no flashing, slowly crossing sky. Dark circle with orange light above, circle only visible due to orange light above.   Slowly crossing the sky from southwest to northeast, no flashing lights like normal air traffic, no sound, steady pace until faded from view. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/099/S99752.html",
      "state": "VA",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bf8f4",
      "summary": "Unknown line of white lights moving slowly to the North North East",
      "city": "virginiabeach",
      "shape": "formation",
      "date": "2013-09-30T00:00:00",
      "story": "Unknown line of white lights moving slowly to the North North East On September 24, 2013 at 0543 hours, I was walking to my car to go to work and looked up and saw 7 white lights in a straight line moving slowly to the north north east.  The sky was clear above me with a few clouds on the horizon. The lights moved in a steady slow pace with no sound. The lights had an occasional Flash, much like a strobe light.  I looked for red and green navigational lights that are on airplanes and could not see any. The spacing of the lights remained constant during the movement and I could not tell if it was one large object or several objects since it was still dark. I lost sight of the object at 0548 hours and proceeded to work.  This occurred over the Windsor Oaks area of Virginia Beach, Virginia.",
      "link": "http://www.nuforc.org/webreports/102/S102606.html",
      "state": "VA",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bf90d",
      "summary": "Bright white light spotted hovering in the sky, then disappears.",
      "city": "virginiabeach",
      "shape": "egg",
      "date": "2013-08-30T00:00:00",
      "story": "Bright white light spotted hovering in the sky, then disappears. While standing outside my garage in the driveway smoking, enjoying the silence, I witnessed something odd approximately 500-1000 feet above my house.  (Approx. 11 pm)The sky was brighter than normal due to the full moon. I was facing my open garage thinking about a project I was working on.  I momentarily turned around facing the street when out of my peripheral vision something above caught my attention.  I looked up for a second and saw a rather large bright white light, hovering.  Thinking it was a helicopter at first,  I was about to look away when it occurred to me that there was no noise. At that very instant the light went souring across the sky as if it were a shooting star.  There was no gradual acceleration, it was instantaneous. I was a little freaked out. It was almost like it was watching me and when it noticed that I saw it, took off.  I've heard of people seeing weird things like this, but this is the first time it's ever happened to me.  It appeared to be egg shaped as it traveled, but could’ve just been due to the speed at which it took off that made it appear to be oblong.  I don’t know. But there was second, small red light attached to the large white light when it was moving. Anyway, that’s what I saw. It all lasted maybe 3-4 seconds at the most. No noise. Complete silence. Couldn't make out any shape of the object to which the light was attached. Just the light.",
      "link": "http://www.nuforc.org/webreports/101/S101319.html",
      "state": "VA",
      "duration": "3 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bfa49",
      "summary": "24 orange lights traveling at a constant speed in some kind of formation, none of the lights strayed away.",
      "city": "virginiabeach",
      "shape": "fireball",
      "date": "2013-06-02T00:00:00",
      "story": "24 orange lights traveling at a constant speed in some kind of formation, none of the lights strayed away. On Saturday, May 18th 2013 at approximately 9:24 pm in Virginia Beach my boyfriend had came inside to get me so i could see something that him, his brother, and his brothers girlfriend had been looking at.  As i walked to my driveway all i could see was roughly 24 orange lights in the pitch black sky.  There had been no sounds prior, during, or after seeing these lights.  They were all moving at the same speed in some kind of formation. Some of the lights would dim just a little bitbit but never went out.  They passed over us for about 6 minutes and then disappeared because of some trees.  To surprise i had one friend tell me she saw something similar but there was only about 5. Its possible that i even saw a couple more then 24 but not less.  They were traveling up (north) the coast.",
      "link": "http://www.nuforc.org/webreports/097/S97855.html",
      "state": "VA",
      "duration": "6 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bfc08",
      "summary": "Orange like Firery ball steadily flying from one end of sky to another- no sound- no flashing.",
      "city": "virginiabeach",
      "shape": "circle",
      "date": "2013-06-02T00:00:00",
      "story": "Orange like Firery ball steadily flying from one end of sky to another- no sound- no flashing.",
      "link": "http://www.nuforc.org/webreports/097/S97821.html",
      "state": "VA",
      "duration": "3-5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bfca4",
      "summary": "Bright orange orbs off VA Beach, VA coast.",
      "city": "virginiabeach",
      "shape": "sphere",
      "date": "2012-12-20T00:00:00",
      "story": "Bright orange orbs off VA Beach, VA coast My wife and I live on the beach just south of Dam Neck Naval Base.   We saw 2 bright orange orbs move from the north to the south along the coast.   The 2 orbs went away and a third appeared in the same area of the first two.   Several neighbors were outside and we heard their gasps of surprise and then heard them speculating on what we were all actually seeing.   My wife is very upset by this.",
      "link": "http://www.nuforc.org/webreports/094/S94720.html",
      "state": "VA",
      "duration": "8 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bfe26",
      "summary": "I was outside talking on the phone when I looked up at saw two strange orange lights in the sky. I saw a black circle fall from the sky",
      "city": "virginiabeach",
      "shape": "circle",
      "date": "2013-06-02T00:00:00",
      "story": "I was outside talking on the phone when I looked up at saw two strange orange lights in the sky.  I saw a black circle fall from the sky.  I yelled for my husband and he came out but one of the orange lights had completely vanished.  The other one hovered and then took off and disappeared.",
      "link": "http://www.nuforc.org/webreports/098/S98109.html",
      "state": "VA",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c05a6",
      "summary": "An orange-reddish light was seen over Virginia Beach.",
      "city": "virginiabeach",
      "shape": "fireball",
      "date": "2013-03-03T00:00:00",
      "story": "An orange-reddish light was seen over Virginia Beach. Me and my mother were in our car, driving back home when I spotted a strange light in the sky, hovering over a field to the left of the road.  I alerted my mom, who pulled into the left turn lane and opened the window.   The light had a reddish halo when initially spotted, however it faded away into a single bright orange light.  It made no sound throughout the entire encounter.  It remained like this for about 15 seconds, then started to move ESE over a suburb.  It seemed to float, effortlessly for about 10 seconds.   We took the left turn and followed as close as we could on this road, and then it paused again.  We saw the reddish halo for about 3 seconds, then it concentrated into the orange light.   After about 10 seconds, the light then seemed to change directions and move South.  This time it moved much quicker, and the movement seemed more forced.   It got smaller, and it was difficult to tell how far away it was at this point.  It then faded away and seemed to disappear into the clouds. ((NUFORC Note:  We suspect an evening sighting, and have amended the time above, to reflect that fact.  We attempted to contact the witness, but were unable to do so.  PD))",
      "link": "http://www.nuforc.org/webreports/096/S96475.html",
      "state": "VA",
      "duration": "55 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c060b",
      "summary": "Very distinct flash in the eyes beam of light directing me towards the &quot;star&quot; object darting through sky",
      "city": "virginiabeach",
      "shape": "chevron",
      "date": "2013-02-18T00:00:00",
      "story": "Very distinct flash in the eyes beam of light directing me towards the &quot;star&quot; object darting through sky This is my first official report though I've had many sightings in my life. This one stood out so I felt the need to report it.   I was casually going outside for a smoke when directly in my field of vision as if it were imprinted on my eyes was a flash that looked like basically ^ that an upside down v basically and it was bright yellow in the middle fading to orange with a black stripe strongly in the middle of the shape I guess you could say it was closer to a triangle or just a really thick upside down v.   At that point I saw a beam stretch skyward directing my attention to what looked like a star that darted up towards the moon but then quickly darted left.   I gazed at the sky for a while to see if anything else stood out but that was it.   Thank you for reviewing my report.   As a note anyone wishing to contact me please do so by email not by phone thank you.",
      "link": "http://www.nuforc.org/webreports/096/S96313.html",
      "state": "VA",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c077f",
      "summary": "Small orb like object, made quick sharp turns, very very fast and from my vantage point appeared to be red.",
      "city": "virginiabeach",
      "shape": "sphere",
      "date": "2014-01-10T00:00:00",
      "story": "Small orb like object, made quick sharp turns, very very fast and from my vantage point appeared to be red. The event occured the night of the launch from Wallops Island on November 18, 2013.  The time was between 1930 and 1945.  I'm sure of the time because while headed to class I heard about the launch on the radio.  Class normally ends at 1930 but I left early (around 1915) to make sure I was out of the building before the launch took place.  I didn't see the launch, but as I was was preparing to turn into my neighborhood I saw a red orb like craft flying (I'm not good with directions) so I'll have to use my home as a point of reference.  I'm on the street heading toward my home and my home was on the right side of the street.   The craft approached from the far right of my home and was headed left and would have passed in front of me but it veered sharp right and ended directly in front but above me.  It wasn't flying very high...it was low and close enough for me to see that it was round and was red or from the rear was red.  There was no sound and it was moving very very fast.  It did not appear to have many lights, the object itself appeard to be red.",
      "link": "http://www.nuforc.org/webreports/105/S105609.html",
      "state": "VA",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c0796",
      "summary": "12/22/13 08:45 Virginia Beach VA  white egg shape object hovered  for 1 hour and dissappeared after cloud cover came in.",
      "city": "virginiabeach",
      "shape": "egg",
      "date": "2014-01-10T00:00:00",
      "story": "12/22/13 08:45 Virginia Beach VA  white egg shape object hovered  for 1 hour and dissappeared after cloud cover came in. At approximately 0845 on December 22, 2013 I noticed a white/transparent egg shaped object in the eastern sky between 20 to 30 degrees in altitude from the horizon.  The sun was rising to the south.  The sun was very bright at that time of the day and it was hard to see the object unless you blocked the sun out from your vision.  There was intermittent cloud cover starting at 0845, but became increasingly heavier up until 0945 when the cloud cover became almost full.  At approximately 0945 when the cloud cover became almost total the object disappeared.  The object never moved and it disappeared during one of the cloud cover periods.  It was hard to see because of the distance of the object and also because of the position of it in comparison to the sun's position. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/105/S105615.html",
      "state": "VA",
      "duration": "1 hour"
    },
    {
      "_id": "64d005f478aba2ec5a3c0cd4",
      "summary": "One bright traveling light splits into two in Virginia Beach sky.",
      "city": "virginiabeach",
      "shape": "circle",
      "date": "2014-02-27T00:00:00",
      "story": "One bright traveling light splits into two in Virginia Beach sky We were driving on the highway where the sky is completely visible with no trees.  All the way towards the right, a bright light the size of an meteor and as bright as a planet suddenly appeared.  The color was white, like an LED lightbulb.  When I saw it at first I yelled, \"Look, a shooting star!\"  Quickly, I realized it was not a star.  Most of the stars were hardly visible from light pollution from the street lights.  It didn't flicker or flash like stars, planes or towers.  It seems much closer, bigger, and brighter than any of the stars.  After about 1 second, it split into two and one light went up and one went down creating a sideways Y.  This was a perfect triangle formation.  In about 1/3 of a second it completely disappeared.  When the light divided into two they were equally as bright and big as the original one was.  They disappeared in perfect sync, down to the millisecond.  I'd estimate it was about 1/2-1 mile away.  During the event, I didn't feel anything other than amazement and awe. The two witnesses were myself and my father.  Neither of us have ever been to interested in UFOs, so it was not like we would be looking for that sort of thing. ((NUFORC Note:  We have amended the time of the alleged sighting in order to reflect an evening sighting.  We have attempted to contact the source of the report, but have not heard back from him.  PD))",
      "link": "http://www.nuforc.org/webreports/107/S107397.html",
      "state": "VA",
      "duration": "2 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c0e65",
      "summary": "3 white lights flying over the East Coast just above the cloud ceiling moving like birds in formation",
      "city": "virginiabeach",
      "shape": "light",
      "date": "2013-11-11T00:00:00",
      "story": "3 white lights flying over the East Coast just above the cloud ceiling moving like birds in formation I was sitting on my balcony with a friend close to the ocean looking up.  There was mild cloud cover.  Cold and clear for the most part.  I noticed what I thought at first was a shooting star.  It was a small round white light slightly larger and a little more dull than the other stars visible.  After a few seconds, the other two lights came in to view.  From North to South, over the coastline.  They flew low just above the cloud ceiling, at a pace faster than a jet in the distance, and much slower than shooting stars.  They flew in an interesting almost chaotic pattern.  They were in a kind of formation that resembled birds, randomly moving about each other occasionally.  This lasted approximately 15 seconds before they flew south and out of sight.  They did not make any noise.  I pointed them out to my friend when as soon as I saw the first light, thinking it was a shooting star.  I followed them with my finger until they were out of view, but unfortunately she did not see them.  I was pretty speechless.",
      "link": "http://www.nuforc.org/webreports/104/S104257.html",
      "state": "VA",
      "duration": "15 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c0f3e",
      "summary": "V-shaped moving slow over houses.",
      "city": "virginiabeach",
      "shape": "chevron",
      "date": "2013-12-02T00:00:00",
      "story": "v shaped moving slow over houses Moved slow above 50 ft over roof top of houses.  Darkened spot in the sky very few lights.  Clear sky most stars were visible.  Made no noise",
      "link": "http://www.nuforc.org/webreports/104/S104720.html",
      "state": "VA",
      "duration": "20 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c11b5",
      "summary": "Lights in triangle shape then a line.",
      "city": "virginiabeach",
      "shape": "changing",
      "date": "2013-11-20T00:00:00",
      "story": "Lights in triangle shape then a line About 5 star like lights moving fastly across the sky in a triangle for about five seconds, then the top light moved to form a line with the others and lost the sight of them after five seconds.",
      "link": "http://www.nuforc.org/webreports/104/S104416.html",
      "state": "VA",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c167f",
      "summary": "2 fast helicopters chasing themselves or something.",
      "city": "virginiabeach",
      "shape": "unknown",
      "date": "2013-10-23T00:00:00",
      "story": "2 fast helicopters chasing themselves or something Don’t know if this is UFO related or not; I saw half of the incident. 2 low level helicopters appeared Early Saturday morning, flying west to East over Bonney Road in Virginia Beach, one behind the other and both inclining towards a decent.   It looked like they were chasing each other except they were going very fast.   Never saw 2 ‘copters in a row in chase format.  Could have been chasing after an unidentified craft?   I have not seen this incident reported in any police or military action, so thought it may be an unreported \"sighting\" - hence reporting it here.",
      "link": "http://www.nuforc.org/webreports/103/S103440.html",
      "state": "VA",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c1b03",
      "summary": "On July 5 at 11:45 p.m., I was with my dogs in the backyard during their potty break because one is scared of fireworks.",
      "city": "virginiabeach",
      "shape": "rectangle",
      "date": "2014-07-11T00:00:00",
      "story": "On July 5 at 11:45 p.m., I was with my dogs in the backyard during their potty break because one is scared of fireworks.  I enjoy stargazing & frequently look up while outside at night (my back door faces east) and since the moon is only 1/2 full and low on the horizon, it was dark in the yard & I just used a flashlight.  Moving southwest to northeast in a straight line I was surprised to see what appeared to be a bright red rectangular shaped object with a bright white light in the middle.  The shape was something like a sport skydiver might use, except this rectangular object was moving lengthwise.  I know it wasn't a helicopter (saw & heard the police chopper flying earlier before & after the fireworks show), it didn't look like a plane and I never heard any sounds.   I moved to the front yard to get a longer view of it and saw my neighbor (retired military, worked on helicopters) so I called him over to look at it.  He was as surprised and puzzled as I was.  He didn't hear anything and saw the same rectangular shape and colors as it was moving away from us.  The object eventually grew dim and disappeared from out sight, the entire episode lasting 1 to 1-1/2 minutes. I checked the ISS schedule, but knew I wouldn't find it listed as flying by.  I've seen the ISS before & this object was larger/lower in the sky and I could make out a shape vs. the ISS's large all white light image.",
      "link": "http://www.nuforc.org/webreports/111/S111137.html",
      "state": "VA",
      "duration": "60-90 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c1cfa",
      "summary": "Observed in sky over Pungo.  Moving in the same direction.  First was set of two and one 'dropped' something illuminated.",
      "city": "virginiabeach",
      "shape": "fireball",
      "date": "2014-07-20T00:00:00",
      "story": "Observed in sky over Pungo.  Moving in the same direction.  First was set of two and one 'dropped' something illuminated.   Following, they kept appearing in increments.  Appearing bright orange, with no navigation lights and emitting no sound.   As I write this, we just saw two move overhead.",
      "link": "http://www.nuforc.org/webreports/111/S111698.html",
      "state": "VA",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c1f26",
      "summary": "Fireball in the sky that changed direction.",
      "city": "virginiabeach",
      "shape": "fireball",
      "date": "2014-06-20T00:00:00",
      "story": "Fireball in the sky that changed direction While sitting around a fire at Sandbridge Beach we noticed a ball of fire moving in a northward direction. It moved on a flat horizontal plane.  At first I thought it was a plane with it’s tail on fire, but we heard no sound.  The object continued moving in a northward direction and then seemed to stop for a moment then turn eastward over the ocean.  By this time it was no longer a ball of fire but more of a glowing ember.  I had enough time to run in and grab my video camera but by the time I got back on the beach it had started disappearing.",
      "link": "http://www.nuforc.org/webreports/110/S110371.html",
      "state": "VA",
      "duration": "3-5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c230f",
      "summary": "Approximately three to four white rockets appeared with trails-gray UFO flying low in trees then, disappeared.",
      "city": "virginiabeach",
      "shape": "other",
      "date": "2014-04-04T00:00:00",
      "story": "Approximately three to four white rockets appeared with trails-gray UFO flying low in trees then, disappeared.",
      "link": "http://www.nuforc.org/webreports/108/S108186.html",
      "state": "VA",
      "duration": "1 hour"
    },
    {
      "_id": "64d005f478aba2ec5a3c2394",
      "summary": "Craft crosses in front of commercial airplane.",
      "city": "virginiabeach",
      "shape": "disk",
      "date": "2014-04-04T00:00:00",
      "story": "Craft crosses in front of commercial airplane. I was letting my dog out the back slider door, which faces directly West.  She went out and I stood there with the door open looking up at the sky, there were a couple commercial airplanes and the only reason I was really watching them was because they were leaving trails behind them, one closer to me than the others. I was focused on the airplane that was closer, it was headed East toward the ocean, (which I live about 10 miles from) when out of  nowhere a grayish flat disk shape craft came from the south and was headed right for the airplane. I thought at first I was going to witness a mid air collision, but the craft crossed right in front of the commercial airplane and after about 2 or 3 seconds of me trying to see what it was, it simply disappeared. There was no trail left by the craft, the commercial airplane kept heading East making a trial behind it. I looked at the clock and saw that it was 7:12pm, so the event took place about 7:11pm. I am hoping the pilots of this commercial airline makes a report to confirm mine. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  We have corrected the date above.  PD))",
      "link": "http://www.nuforc.org/webreports/108/S108241.html",
      "state": "VA",
      "duration": "~30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c24e3",
      "summary": "Alien triples.",
      "city": "virginiabeach",
      "shape": "fireball",
      "date": "2014-11-06T00:00:00",
      "story": "alien triples I was filming around 9pm and recorded 3 paths of dots that i believe are ufos skipping across the film. Here are the links to the photo and video. Photo:  http://consciousmystery.com/ufos101214.png  Video:  http://consciousmystery.com/1012142027-01.3gp  i think they were telling me they move in triples of 9's, twice..vigintriplicity what i mean is you play 9 notes, 9 more notes, than finally 9 more notes, twice, and it sounds like a root to the sound in space they make. tell me what ya think. thanks and godbless!",
      "link": "http://www.nuforc.org/webreports/114/S114553.html",
      "state": "VA",
      "duration": "42 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c27bc",
      "summary": "Silver disk seen hovering near Ferrell Parkway.",
      "city": "virginiabeach",
      "shape": "disk",
      "date": "2014-11-21T00:00:00",
      "story": "((NUFORC Note:  Witness indicates that the date of the event is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/115/S115507.html",
      "state": "VA",
      "duration": "45-60 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c2892",
      "summary": "Son, wife and I saw 3 of what looked to be fireballs traveling directly vertical at a fast pace.",
      "city": "virginiabeach",
      "shape": "fireball",
      "date": "2014-11-21T00:00:00",
      "story": "Son, wife and I driving down the road shortly after dark.   She noticed them first so I pulled over to look too.  3 of what looked to be fireballs traveling directly vertical at a fast pace.  The orientation was if they had launched 3 rockets one right after another.    At first I just thought maybe it was a launch from nasal at Wallops Island.  However, the launch pad at Wallops launch pad was destroyed a few weeks ago when the rocket exploded.   We watched and tried to video it but you can't really tell anything on the video.   After they reached a very high altitude the \"fire\" went out but we could still kind of see them.  Almost as if they had turned white or traveled through the atmosphere.",
      "link": "http://www.nuforc.org/webreports/115/S115379.html",
      "state": "VA",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c2965",
      "summary": "Red dot circling around me on my porch at home.",
      "city": "virginiabeach",
      "shape": "other",
      "date": "2014-08-29T00:00:00",
      "story": "Red dot circling around me on my porch at home. Caught on video a red dot spiraling around.  Thought it could be a glare at first, but it kept getting closer.  It wasnt a laser, just a dot that circled around, and i have a video of how clear it looks.",
      "link": "http://www.nuforc.org/webreports/112/S112827.html",
      "state": "VA",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c29d7",
      "summary": "Bright round shiny object.",
      "city": "virginiabeach",
      "shape": "light",
      "date": "2014-12-05T00:00:00",
      "story": "Bright round shiny object. Bright light, shiny object, looked round, took picture.  Wanted to take another, and it was gone. ((ADDENDUM FROM WITNESS, DECEMBER 10, 2014)) Hello Mr. Davenport, After having a good look at my picture I think it's just could have been a jet. I guess they eye play's tricks sometimes..  I'm sorry. ((END ADDENDUM))",
      "link": "http://www.nuforc.org/webreports/115/S115763.html",
      "state": "VA",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c2c12",
      "summary": "Four large fireballs moving slowly with no sound.",
      "city": "virginiabeach",
      "shape": "fireball",
      "date": "2014-09-10T00:00:00",
      "story": "Four large fireballs moving slowly with no sound. Four large fireballs moving slowly over our house, Very close to Oceana Navel Air Station. Fireballs presented no sound and moveed in a strange fashion.  One returned after passing in a very high angle.",
      "link": "http://www.nuforc.org/webreports/113/S113355.html",
      "state": "VA",
      "duration": "15 Minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c3033",
      "summary": "Light expanding and shrinking, hovering and then zipping away.",
      "city": "virginiabeach",
      "shape": "light",
      "date": "2014-08-31T00:00:00",
      "story": "light expanding and shrinking, hovering and then zipping away. I was outside speaking with a friend and saw a light that appeared to be expanding in size and shrinking, as if zigzagging to-and-fro.  It came to a complete stop and then expanded in size again, and zipped off without a trace.  I immediately ran inside to call non-emergency.  I came back outside after a few minutes and the light was back in the same spot, only this time it was hovering.  And its light appeared to get bigger as it did before and zipped off again.   I was the only one to have witnessed this.",
      "link": "http://www.nuforc.org/webreports/113/S113063.html",
      "state": "VA",
      "duration": "45 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c310b",
      "summary": "Huge 1000-ft long saucer accelerated skyward and disappeared during the day, Virginia Beach.",
      "city": "virginiabeach",
      "shape": "disk",
      "date": "2014-08-01T00:00:00",
      "story": "huge 1000ft long saucer accelerated skyward and disappeared during the day, Virginia Beach I was in a clearing on the KOA campsite in Virginia Beach.  I turned around and looked up and an object pewter in color, with a compressed dome on top with 3 portal in it .. took off silently at an a speed I can only describe as astonishing.  I am a retired military aircraft mechanic and have 20 years working around aircraft, including hi performance aircraft.  This object had no seams, it made no noise.  It appeared not quite over damn neck base.  And for some reason I thought nothing of it. It had to be the length of an aircraft.. It had a feel of a hologram but there was just something that gave it depth of field.  I have knowledge of photography and it was so fast you couldn't have gotten it on camera.  It went at an angle of about 70-80 degrees vertical and then veered left toward the atmosphere like the space shuttle  I can be contacted at (757) ((number deleted))",
      "link": "http://www.nuforc.org/webreports/111/S111991.html",
      "state": "VA",
      "duration": "1/2 second"
    },
    {
      "_id": "64d005f478aba2ec5a3c31c7",
      "summary": "2 fireballs illuminated the night sky.",
      "city": "virginiabeach",
      "shape": "fireball",
      "date": "2014-08-01T00:00:00",
      "story": "2 fireballs illuminated the night sky 2 fireball unidentified flying objects within 50 yards apart flying at very low speeds for about 5-10 minutes, disappearing at a distance.   They appeared to be at 1/10 of the size of the moon estimated.",
      "link": "http://www.nuforc.org/webreports/112/S112089.html",
      "state": "VA",
      "duration": "5-10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c31e2",
      "summary": "Light in the Eastern sky rotating and changing colors.  When we uploaded the pictures, it became clear of what we witnessed!",
      "city": "virginiabeach",
      "shape": "other",
      "date": "2015-02-12T00:00:00",
      "story": "Light in the Eastern sky rotating and changing colors.  When we uploaded the pictures, it became clear of what we witnessed! My husband was outside with our dog and he came in to get me and said he seen an unusual light in the Eastern sky.  I grabbed the camera and went out to confirm what he and I were now witnessing~  We both witnessed an object that was rotating and changing colors.  It would move close and then further away.  There was no sound and we could not see the shape, only a light. By this time I was taking pictures, as well as a short video.  We watched the object for about 20 minutes and then went in because it was very cold and my camera was cold.  The object was still there when we went inside. I uploaded the pictures to the computer and we could not believe what we saw!  The main craft was hard to see, more of a hazy mass, but within this mass, we could see very clearly 4 spheres/balls within the object.  There may have been more.  Only by enlarging the pictures could we see any kind of shape.  We of course, have the memory card as proof. My husband and I have been watching the skies for many years and we make it a point to go out on clear nights to look at celestial events as well as for UFOs.  For the last few years I have been president of the UFO Club Of Virginia. We are sending the best of the pictures to you.",
      "link": "http://www.nuforc.org/webreports/117/S117231.html",
      "state": "VA",
      "duration": "20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c35d5",
      "summary": "At around 8:45 tonight 25 Dec 2014 I was standing on my back deck looking at the moon in the western sky.  When i saw what i thought we",
      "city": "virginiabeach",
      "shape": "fireball",
      "date": "2015-01-07T00:00:00",
      "story": "At around 8:45 tonight, 25 Dec., 2014, I was standing on my back deck looking at the moon in the western sky, when i saw what i thought were three helicopters moving across the sky towards the south.   As they got closer I could not hear any sound I called my wife out an she saw them also.  It was three reddish orange looking balls, then all of the sudden they were gone.   I was just wondering if any one else may have seen this also and of course what they might have been.",
      "link": "http://www.nuforc.org/webreports/116/S116323.html",
      "state": "VA",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c3884",
      "summary": "Orange glowing domed shaped disks with red lights around the bottom of each.",
      "city": "virginiabeach",
      "shape": "disk",
      "date": "2015-01-07T00:00:00",
      "story": "Orange glowing domed shaped disks with red lights around the bottom of each. Saw a whole fleet of domed shaped saucers all aglow in orange, with red lights around the bottom.   They were flying due east towards the ocean.  They kept coming.  I stopped counting at 20.   They were first headed right over our house, and then also to the far right.  There was so many, me, my daughter and son couldn't count them all.   I tried to take pictures with my Vivitar camera.  They didn't come out as clearly as we could see them with our eyes.  We were in awe!",
      "link": "http://www.nuforc.org/webreports/116/S116393.html",
      "state": "VA",
      "duration": "20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c3b54",
      "summary": "Large, bright blue & red lights over Virginia Beach.",
      "city": "virginiabeach",
      "shape": "unknown",
      "date": "2015-08-06T00:00:00",
      "story": "Large, bright blue & red lights over Virginia Beach. It was so unusual I called my husband outside.  He came out and said....\"WHOA\".  I said... exactly what the hell is it!?!   It was very strange and almost just sitting there barely moving,  very bright, pretty,  large lights of red and light blue color.  It just hardly moved and we stood and watched it for quite a while, then it started moving again very slowly in another dicection.   We stood and watched it till it completely just disappeared.  Strangest thing I've ever seen in  a night sky.   My husband is retired Navy and is currently with Homeland Security, and is always the logical one.  He had no explanation for this.",
      "link": "http://www.nuforc.org/webreports/120/S120843.html",
      "state": "VA",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c3c58",
      "summary": "I was at work at the oceanfront taking the trash out and saw This flying around! It flew towards me then just hovered for a minute and",
      "city": "virginiabeach",
      "shape": "fireball",
      "date": "2015-07-17T00:00:00",
      "story": "I was at work at the oceanfront, taking the trash out and saw this flying around!  It flew towards me, then just hovered for a minute, and flew away the opposite way...   It was a few thousand feet up.  But it looked as if it was a fireball when I first saw it, or a plane on fire! It was just freaky !",
      "link": "http://www.nuforc.org/webreports/120/S120357.html",
      "state": "VA",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c3c93",
      "summary": "Lights in sky with 3 globe looking lights.",
      "city": "virginiabeach",
      "shape": "light",
      "date": "2015-07-31T00:00:00",
      "story": "Lights in sky with 3 globe looking lights Noticed the sky was lit up for a long period of time, without reason.  Went outside and saw 3 floating objects changed color 2 times to red then white, and then flew to the right and lost them after 1 mile.",
      "link": "http://www.nuforc.org/webreports/120/S120762.html",
      "state": "VA",
      "duration": "30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c4354",
      "summary": "Bright Orange Fireball over Virginia Coast",
      "city": "virginiabeach",
      "shape": "fireball",
      "date": "2015-11-19T00:00:00",
      "story": "Bright Orange Fireball over Virginia Coast On 11/6/15 around 9pm, I was standing outside talking on the phone and saw a bright orange light appear in the southeast sky.  It appeared to originate over the Outer Banks of NC and proceeded to travel north until it reached approximately northern Virginia Beach, then turned directly east and disappeared into the clouds.   It was not very high in the sky (roughly half as high as any airplane lights that were also visible).   It also appeared to have flame-like characteristics and once every 5-10 seconds you could see a trail as if something was burning and releasing from the object.   The entire event lasted approximately 2 minutes. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/123/S123546.html",
      "state": "VA",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c4d69",
      "summary": "A bright white angular object in the sky during an approaching thunderstorm.",
      "city": "virginiabeach",
      "shape": "rectangle",
      "date": "2015-09-11T00:00:00",
      "story": "A bright white angular object in the sky during an approaching thunderstorm. I took this photograph at a skatepark where my son was skating.  I was photographing a significant approaching storm. It was 30 minutes later, at another location, when I noticed the strange object in the photo. I took the photo with an iPhone 6 which remained in my possession from the time I took the photo until it was viewed.",
      "link": "http://www.nuforc.org/webreports/121/S121874.html",
      "state": "VA",
      "duration": "unknown"
    },
    {
      "_id": "64d005f478aba2ec5a3c4ec0",
      "summary": "Triangular object with dim orange lights.",
      "city": "virginiabeach",
      "shape": "triangle",
      "date": "2016-03-18T00:00:00",
      "story": "Triangular object with dim orange lights Back yard in quiet neighborhood, stargazing with my 11 year old.  Silent triangular object at least 75 feet above me.  5 small circular dim orange lights or reflective surfaces of some kind.  Our street lights burn orange so perhaps it was just reflecting that.  Going in a straight path N to S.  Possible RC tri-copter but no known commercial models to match what I obseved.",
      "link": "http://www.nuforc.org/webreports/126/S126388.html",
      "state": "VA",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c5201",
      "summary": "Walked outside & the object caught my attention.  I live behind Oceana Air Base (US Government owned).  ((NUFORC Note:  Sirius?  PD))",
      "city": "virginiabeach",
      "shape": "unknown",
      "date": "2016-01-29T00:00:00",
      "story": "Walked outside & the object caught my attention.  I live behind Oceana Air Base (US Government owned), so my 1st thought was it was probably an airplane.  I could see that it was a very bright white light that had flashing red lights & what appeared to be blue flashing lights also.  It was relatively stationary.  I am about 5 miles away & only had my phone, so no photos unfortunately. ((NUFORC Note:  We suspect a \"twinkling\" star, and perhaps Sirius.  PD))",
      "link": "http://www.nuforc.org/webreports/125/S125427.html",
      "state": "VA",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c5653",
      "summary": "Yellow blinking light moving at high speed.",
      "city": "virginiabeach",
      "shape": "circle",
      "date": "2016-07-22T00:00:00",
      "story": "Yellow blinking light moving at high speed. One yellow object.  Moving at high speed passing moon.  Pulsing at once a second.  Possible ISS but too bright.   Have photo and video. ((NUFORC Note:  We have amended the time above, to reflect a nighttime sighting.  PD))",
      "link": "http://www.nuforc.org/webreports/128/S128541.html",
      "state": "VA",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c5a7b",
      "summary": "Up up and away",
      "city": "virginiabeach",
      "shape": "unknown",
      "date": "2016-04-29T00:00:00",
      "story": "Up up and away Hello I live in military housing in oceana, I woke up to use the bathroom and I notice how bright the moon was, I laid down began praying and staring at the stars.  I thought to myself how beautiful they are.   As I laid back in my bed trying to fall asleep I noticed a small object with red lights go straight up it began blinking white I thought I was tripping almost falling out the bed to stare.  I then woke up all the way up and began staring at the sky and saw three more they were acting as stars and just went straight up I could see what looked like smoke as they went straight up and disappeared   I know how this story sounds but it's true and scary because now I know there's something that comes in our universe and leaves. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/127/S127008.html",
      "state": "VA",
      "duration": "1 hour"
    },
    {
      "_id": "64d005f478aba2ec5a3c5ffe",
      "summary": "Long UFO over school.   ((anonymous report))",
      "city": "virginiabeach",
      "shape": "disk",
      "date": "2016-11-11T00:00:00",
      "story": "Long UFO over school. Saw a UFO at about 8:40 pm, hovering over a school had lights on the bottom of craft and looked oval in the center but really long.  It quickly moved into a slight vertical position and hovered over the street were driving at behind our vehicle and then disappeared.  It all happened within 30 sec. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/131/S131147.html",
      "state": "VA",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c6082",
      "summary": "Saw 3 different orange pulsating lights one after another go from nothing to really bright to dim and a pulsating effect to just a orng",
      "city": "virginiabeach",
      "shape": "fireball",
      "date": "2016-10-21T00:00:00",
      "story": "Saw 3 different orange pulsating lights one after another go from nothing to really bright to dim and a pulsating effect to just a orange light and moved across the sky from from North to South before turning bright and disappear along with star like objects very high moving across the sky at slow speeds.",
      "link": "http://www.nuforc.org/webreports/130/S130665.html",
      "state": "VA",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c60ab",
      "summary": "VA Beach shore drive.  Cigar-shape 8' off ground yellow lights.  ((anonymous report))",
      "city": "virginiabeach",
      "shape": "cigar",
      "date": "2016-09-30T00:00:00",
      "story": "Virginia Beach shore drive.  Cigar shape 8' off ground yellow lights. Caught on motion camera 8:30 just at dark.  5 seconds.  Craft cigar shaped with two whitish orange lights on either end approx 3 feet wide.   Seemed to have a red infrared type beam on ground even after the craft left frame.  Flashed from somewhat dim to bright one time for about half second.   Have blurry zoom of it.  Some kind of appendage on top but can't tell.  Moved fast between house trees.  Too fast and small an area to be a drone in my opinion.   Came into view by shed, flashed and quickly but efficiently moved away avoiding trees and fences.  Motion was almost scary as it departed.   Clear night 8 ' off of ground 20 feet from camera.  No sound recorded camera inside.  No red or green navigation lights that I could see.   Across from JEB naval base.   Good video of it hovering and departing. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/130/S130328.html",
      "state": "VA",
      "duration": "Seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c639f",
      "summary": "2 Red lights flew over.",
      "city": "virginiabeach",
      "shape": "circle",
      "date": "2016-09-02T00:00:00",
      "story": "2 Red lights flew over. 2 circular lights flew over my house.  They cause the surrounding area to turn red as they flew over.  There was about 5 or ten minutes between them.  A strange noise was made as it flew over.",
      "link": "http://www.nuforc.org/webreports/129/S129570.html",
      "state": "VA",
      "duration": "Brief"
    },
    {
      "_id": "64d005f478aba2ec5a3c6635",
      "summary": "The craft shaped like a tear drop flew over my car and stopped and took off.  ((anonymous report))",
      "city": "virginiabeach",
      "shape": "teardrop",
      "date": "2016-08-02T00:00:00",
      "story": "The craft shaped like a tear drop flew over my car and stopped and took off. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/128/S128887.html",
      "state": "VA",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c692e",
      "summary": "Two red objects moving over the sky in Virginia.",
      "city": "virginiabeach",
      "shape": "fireball",
      "date": "2017-03-17T00:00:00",
      "story": "Two red objects moving over the sky in Virginia. The object was flying over heading NW around 9:41pm in Virginia Beach.  It was very clear out and the moon was bright.  The object was red/orange in color and silent.  It was moving at the speed of a plane.  We often have planes fly over our house because we are close to a naval base.  This was definitely not a plane.   I watched it pass over my house, moving higher and higher into the sky until it disappeared.  I turned the direction it came from and there was another object that looked the same.  It flew in the same path and disappeared in the same spot the other did.   I took a picture of it and I did record it for 6 seconds but stopped because on my iPhone screen it looked like a reddish blob.  After zooming in on the video and picture, I realized it looked nothing like a blob.",
      "link": "http://www.nuforc.org/webreports/133/S133082.html",
      "state": "VA",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c6912",
      "summary": "Extra star in the sky...",
      "city": "virginiabeach",
      "shape": "light",
      "date": "2017-04-07T00:00:00",
      "story": "Extra star in the sky... I was sitting out back smoking my tobacco pipe and saw an extra star in the sky.  I thought to myself what star is that.  When I focused my eyes on it, it moved slightly to the right.  I than looked at the other star that is usually in the sky at this time during the night and than back at the other light and than it went out.   It brought a smile to my face.",
      "link": "http://www.nuforc.org/webreports/133/S133438.html",
      "state": "VA",
      "duration": "15 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c6d51",
      "summary": "Large, silent, stadium light high, floating completely still appearance of commercial aircraft; so CLOSE to me it can't be dismissed",
      "city": "virginiabeach",
      "shape": "cigar",
      "date": "2016-12-15T00:00:00",
      "story": "Large, silent, stadium li evght high, floating completely still appearance of commercial aircraft; so CLOSE to me it can't be dismissed First thought was a commercial plane (in appearance and color, shape yada yada), then took notice it wasn't moving, it was only 6 stories high {just above the stadium lights} and also it was silent.  It had white lights running across the bottom, with a couple of red lights on both ends.  Once, my brain concluded it was not behavior of any known plane that large to hover silently that low, was not a helo, was not a drone (unless it's a million dollar drone that was as big as a commercial plane and capable of holding completely still).  As I was quickly trying to call boss and yell down to another employee to see if either of them was seeing what I was seeing, running down the ramp from 2nd floor as I kept an eye on it.  I looked away for approx. 4 seconds as I looked for the other employee or anyone to tell them to look up, it was gone.  I ran back up the ramp and asked a group of men watching the football game if they had seen a blimp or anything fly over the field.  They said they were looking downward to the game. In my 54 years I have never seen anything like it and so close that I know what it wasn't.  This same location on different nights in Oct and Nov others and I have witnessed green glowing falling stars 3 feet off the ground, and tree line yellow and white ones on other occasions.  More activity in this one location then I have seen in my entire 54 years. The large aircraft continued to bother me as I had no explanation for what I AM SURE I SAW. I don't drink nor do drugs. Thus, still wanting answers, I entered some keywords into search engine and to my surprise others across the state of VA have described the same craft at about same tree line area, silent with the lights across the bottom. I wonder how many people see unexplainable things and don't report for fear of being labeled as mentally disturbed.",
      "link": "http://www.nuforc.org/webreports/131/S131675.html",
      "state": "VA",
      "duration": "37 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c6d89",
      "summary": "Virginia Beach UFO.",
      "city": "virginiabeach",
      "shape": "cigar",
      "date": "2016-12-15T00:00:00",
      "story": "Virginia Beach UFO. At approximately, 8:41PM on December 10, 2016, I exited my car to enter my house in Virginia Beach, VA.  I was facing east and I saw something moving across the sky in a south by southwest direction, so it was moving from my left to my right at an angle from in front of me to behind me.  It stopped me in my tracks because I had never seen anything like it in the sky before. The object appeared to be the size and shape of a Tylenol extra strength tablet. It had lights on the front and back.  The lights appeared to be fluttering like in a haze.  The object appeared to be gliding across the sky at a pretty high speed, and there was no noise that I could hear. It took me a few seconds to compute what I was looking at, and I was able to rule out many explanations in my mind.  It was not an airlines jet, it was to big in the sky and no airport in that direction.  I thought maybe it was a helicopter behind the clouds, but a quick look around and I could see many stars and constellations, so I quickly ruled out cloud cover.  The absence of noise also helped me rule out a helicopter, as well as a military jet, which do fly in our area but are very noisy.  The lights were not flashing like the normal air traffic in the sky.  The lights were dull and hazy like they were fluttering. I then got my cellphone out to video.  While trying to keep my eyes on the quick moving target I also tried to zoom.  By the time I got the camera on the object, it was far off to my right and I only was able to film the back side of the object. The entire event was less than 1 minute about 10 seconds for me to process and decide to video and the 31 seconds of footage. I had just returned from dinner with my mother.  I had not been drinking and was not under the influence of any narcotics. After the event, I went into my house and called my mother, then my sister, then my son to tell them what I had seen.",
      "link": "http://www.nuforc.org/webreports/131/S131734.html",
      "state": "VA",
      "duration": "<1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c6e74",
      "summary": "Green orb like objects flying in the sky.",
      "city": "virginiabeach",
      "shape": "light",
      "date": "2017-07-07T00:00:00",
      "story": "Green orb like objects flying in the sky. It was between 10-12 glowing objects traveling in the sky.  They were not in a specific formation.  The objects were within our atmosphere.",
      "link": "http://www.nuforc.org/webreports/134/S134722.html",
      "state": "VA",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c7370",
      "summary": "Square shaped object hovering over Independence Blvd.",
      "city": "virginiabeach",
      "shape": "rectangle",
      "date": "2017-06-15T00:00:00",
      "story": "Square shaped object hovering over Independence Blvd. Square shaped object, equivalent to the size of 3 or 4 hot air balloons hovering over Independence Blvd near Town Center.  The square shape appeared to have 2 legs about half of the length of the square's diameter.  It was grey in color.  I took a video for about 20 seconds with my phone as it hovered moving away from Independence Blvd. heading west.  However, when I replayed my video, for some reason I only captured 3 seconds.  Nevertheless, I did capture the image, but it is blurry.  I took the video from my car while I was in traffic.",
      "link": "http://www.nuforc.org/webreports/134/S134527.html",
      "state": "VA",
      "duration": "1 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c73e0",
      "summary": "Dull Diamond Triangle",
      "city": "virginiabeach",
      "shape": "triangle",
      "date": "2017-06-09T00:00:00",
      "story": "Dull Diamond Triangle I was sitting out front smoking my pipe and 3 huge lights appeared, in a triangle shape, in the gray rain cloud night sky.  The lights looked like 3 moons, 2 up top and 1 in the south.   After 30 seconds, 2 of the lights faded that you could still see, the north ones.  And the 3rd light, south corner, got very bright like a dull diamond instead of the bright diamond light they usually look like.  They were a white light like the white light in the movie, 'Arrival'.   After that, they all faded out leaving the gray rain cloud sky.   I had my tablet in my pocket the whole time and didn't even think to record it.  *Sigh*",
      "link": "http://www.nuforc.org/webreports/134/S134444.html",
      "state": "VA",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c7820",
      "summary": "Moon-white object w/swept wings appeared to spurt debris several times then break into 3. ((NUFORC Note:  Satellite re-entry.  PD))",
      "city": "virginiabeach",
      "shape": "other",
      "date": "2017-12-04T00:00:00",
      "story": "moon-white object with swept wings appeared to spurt debris several times then break into three pieces. We were at Mount Trashmore in Virginia Beach, Virginia, walking counter-clockwise around the lake, at the southern edge facing east.   To the southeast, well below the moon, without any prior trace, a white object the color of the moon and as bright, appeared in the sky, looking large, as though quite close, moving level, left to right, appearing to have swept wings, like a military jet, and a fuselage, appeared to eject three distinct bursts of debris, including what looked like small round balls, then broke into three pieces, and disappeared without a trace.  No afterglow, no fireball, no sound whatsoever.",
      "link": "http://www.nuforc.org/webreports/137/S137412.html",
      "state": "VA",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c80c7",
      "summary": "Blue orb, white triangle with looks to be imbedded faces in video screen shot.  ((NUFORC Note:  Possible lens flare??  PD))",
      "city": "virginiabeach",
      "shape": "triangle",
      "date": "2018-03-08T00:00:00",
      "story": "Blue orb, white triangle with looks to be imbedded faces in video screen shot. This was a video capture from walking a dog in Virginia Beach, VA.  Nothing obvious to the naked eye, but when watching the video saw this image.  Even looks to be other “stuff” imbedded in photo that seems very strange. ((NUFORC Note:  We are awaiting a copy of the video that the witness took.  PD))",
      "link": "http://www.nuforc.org/webreports/139/S139108.html",
      "state": "VA",
      "duration": "?"
    },
    {
      "_id": "64d005f478aba2ec5a3c814a",
      "summary": "Objects darted around as if they were playing tag. I shined my light at several of the objects.  ((anonymous report))",
      "city": "virginiabeach",
      "shape": "triangle",
      "date": "2018-03-02T00:00:00",
      "story": "Objects darted around as if they were playing tag.  I shined my light at several of the objects and they followed my light again as if they were playing follow the leader i.e. follows my light.  The objects, which were triangle in shape, were surrounded by a field that changed shape.  The objects moved side-to-side, up and down, also hovered, and at times were completely still, NO SOUND WAS HEARD from any of the objects.   1 year ago, I saw a triangle shaped craft up and close as it appeared motionless above a neighbor’s home almost appearing as if it was observing what was going on in the home at that time.  I will write that repot in detail and post it soon.  Let me just say the object I saw up and close WAS some type of triangular craft, it could for a lack of a better word camouflage itself, blending into the sky as if it was a small cluster of stars.  It was very quick and stealth. It made no sound or had no exhaust or heat signature!!   These crafts fly above t! he VA beach sky’s day and night.  There are bright triangular crafts that the military use and hide in plain sight, they appear to be stars but are some type of craft that have extremely bright lights, I have seen them up close, and personal too, I believe they are some type of very Advanced MILITARY DRONE.  Not much bigger than a vw bug but quick fast stealthy, they can move around.  Just look in to the night sky for a triangular shape that appears to move just a bit.  They are there every night and day. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/138/S138928.html",
      "state": "VA",
      "duration": "2 hours"
    },
    {
      "_id": "64d005f478aba2ec5a3c81d1",
      "summary": "Triangle Dark Airship being Escorted 10 min duration.",
      "city": "virginiabeach",
      "shape": "triangle",
      "date": "2018-02-22T00:00:00",
      "story": "Triangle dark airship being escorted, 10 minute duration. Witnessed 3 red lights in triangle formation seemed to be one giant craft moving NE seemed massive from my vantage point, also slowly moving in front of object a more conventional plane maybe fighter jet, no noise?   Two minutes later, several small objects planes or drones following behind triangle, all different flight paths, staggered in speeds almost felt it was an escort for the mysterious triangle ship, after 10 minutes out of view and no other planes for 30 mins, felt eerie, I have no other experience to compare this to.",
      "link": "http://www.nuforc.org/webreports/138/S138903.html",
      "state": "VA",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c85cc",
      "summary": "Sky is cloudy, heard jet like noise, but was hovering over my apartment for 3 minutes, moved slightly.  ((anonymous report))",
      "city": "virginiabeach",
      "shape": "unknown",
      "date": "2018-09-13T00:00:00",
      "story": "Sky is cloudy, heard jet like noise, but was hovering over my apartment for 3 minutes, moved slightly then heard 3 loud horn like sounds, went from low to medium to high.  Like 1, 2, 3.  And felt electricity on my skin, raised the hairs on my arms. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/143/S143090.html",
      "state": "VA",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c861d",
      "summary": "Blinking lights in triangle.",
      "city": "virginiabeach",
      "shape": "light",
      "date": "2018-08-31T00:00:00",
      "story": "Blinking lights in triangle Went out with dog about 9:30 PM.  I looked up at the stars because it was a nice clear night.  I saw 3 lights flashing way up in the sky in a triangle they were up where cross country jets would fly.  I thought it was strange but not a big deal.  In a blink of an eye they were in a strait line.  In another blink one light was gone and the other two went in opposite directions until I could no longer see them.  That was about 30 seconds or so.",
      "link": "http://www.nuforc.org/webreports/142/S142841.html",
      "state": "VA",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c878a",
      "summary": "I was sitting on my patio here in Virginia Beach, VA.  Usually we see the military jets doing maneuvers with their loud engines.",
      "city": "virginiabeach",
      "shape": "rectangle",
      "date": "2018-07-19T00:00:00",
      "story": "I was sitting on my patio here in Virginia Beach, VA.  Usually we see the military jets doing maneuvers with their loud engines.  Today, at approximately 4:00 PM, I saw a large brownish rectangular object flying nonchalantly by.  It was probably the length of three or four of those military jets we watch most days and the height was about a third of that.   It flew pretty much the same areas the jets fly but went straight off into the SE direction.  Very strange and I wondered how that could actually fly being a rectangle.  Since it was there in broad daylight, I assumed it must be military…I saw it for about 2 to 3 minutes as it went slowly by.",
      "link": "http://www.nuforc.org/webreports/142/S142247.html",
      "state": "VA",
      "duration": "2-3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c8b27",
      "summary": "White orb in the sky (anonymous).",
      "city": "virginiabeach",
      "shape": "sphere",
      "date": "2019-03-14T00:00:00",
      "story": "White orb in the sky (anonymous) My son and I were sitting in the car in our driveway.  We had just arrived back home from doing some errands.  While sitting in the car I pointed out the clouds overhead and told him that it looked like an alien.  We both laughed and I decided to take a picture of the clouds to show his younger brother.  It was amusing.  We went inside and then carried in the rest of our groceries.   As we sat down and looked back at the photographs (one taken right after the other), we noticed that there was an white orb in the sky and that it had moved from its location in the first picture to another location in the second frame.  They were both snapped at the same time, one right after the other with my cell phone.  Neither of us saw the orb in the sky at the time, it was not the moon -- the moon doesn't move, plus we went back outside to look up at the sky to see if we could see the object.  It was gone.  It looks like there are lights inside of the orb.  Very strange.",
      "link": "http://www.nuforc.org/webreports/145/S145148.html",
      "state": "VA",
      "duration": "Unknown"
    },
    {
      "_id": "64d005f478aba2ec5a3c8b5c",
      "summary": "Standing in the suburbs of Virginia Beach, I saw two different light anomalies moving across the night sky. It was a new moon and the s",
      "city": "virginiabeach",
      "shape": "light",
      "date": "2019-03-14T00:00:00",
      "story": "Standing in the suburbs of Virginia Beach, I saw two different light anomalies moving across the night sky.  It was a new moon and the stars were very bright.  The light anomaly was a soft grey/silver color and looked like a trail left by an airplane, except the movement was in a sideways direction.  The light didn't measure across the whole sky either, so as I turned around, I could still see it in my peripheral vision.  It slowly crept across the sky for about 5 minutes and disappeared.  A second one happened about 5 minutes later, in a different position, moving a different direction.",
      "link": "http://www.nuforc.org/webreports/145/S145086.html",
      "state": "VA",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c8bb3",
      "summary": "Long-pause \"strobe\"?",
      "city": "virginiabeach",
      "shape": "unknown",
      "date": "2019-02-27T00:00:00",
      "story": "Long-pause &quot;strobe&quot;? Enjoying the first clear night in a week, I noticed a bright white flash in the sky. It was brighter than the stars but only a pinpoint.  It did not light up the area or the sky.  Not sure what I had seen, I payed close attention to that area and roughly 3 minutes later the same area of the sky, size and and duration white flash.  Not sure what to make of this irregular, long pause \"strobe.\"  I know what aircraft look like both coming and going but this was not typical to what I've seen living less than a half mile from NAS.  Any ideas, NUFORC?",
      "link": "http://www.nuforc.org/webreports/144/S144998.html",
      "state": "VA",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c8cce",
      "summary": "I was outside facing east, speaking with a co-worker. The sun was coming up, civil twilight was well underway. As another co-worker app",
      "city": "virginiabeach",
      "shape": "fireball",
      "date": "2019-01-24T00:00:00",
      "story": "I was outside facing east, speaking with a co-worker.  The sun was coming up, civil twilight was well underway.  As another co-worker approached I pointed to the eastern sky and said, “Wow, look at that!”  An object ( obviously a meteor) was traveling north to south at what seemed to be a slow speed, and descending.  If I had held my hand in front of me at arms length I could have blocked it out, so it wasn’t huge, but closer than I have ever seen a “falling star”. The tail was quite long, as well, and I could actually see fire trailing the object.  Again, it appeared to be very close to earth, flames were visible, and in the 5-7 seconds that the object was visible, I thought to myself, “This one is going to hit”. The fire trail turned into more of a black smoke trail as it descended behind some trees and a building and out of sight.  I waited a second or two for a sound or vibration indicative of a crash landing, but thankfully, none came.",
      "link": "http://www.nuforc.org/webreports/144/S144555.html",
      "state": "VA",
      "duration": "5-7 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c95cc",
      "summary": "Group of “stars” in perfect triangular shape",
      "city": "virginiabeach",
      "shape": "triangle",
      "date": "2019-12-19T00:00:00",
      "story": "Group of “stars” in perfect triangular shape At 23:15 me and my husband were looking at the stars. We noticed a bunch of “stars” in a perfect triangular shape pass over our heads heading south. We initially thought it was a flock of birds, but the birds would have been dark and not white looking like a group of stars. In that perfect triangle were a few “stars” missing.There was no sound. It also flew seemingly faster than any plane. It was definitely something we’ve never seen before. (My husband is military and live near a base so we are used to planes flying)",
      "link": "http://www.nuforc.org/webreports/151/S151446.html",
      "state": "VA",
      "duration": "Minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c96a3",
      "summary": "I was walking along virgina beach when I seen a small orange circular orb flying threw the sky the object got brighter and brighter ora",
      "city": "virginiabeach",
      "shape": "circle",
      "date": "2019-10-04T00:00:00",
      "story": "I was walking along Virgina Beach when I seen a small orange circular orb flying threw the sky the object got brighter and brighter orangeish red then it made like a huge flash like a giant camera flash I then see it dimmer and fly up looking like a star but still the orange color.",
      "link": "http://www.nuforc.org/webreports/148/S148983.html",
      "state": "VA",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c96a2",
      "summary": "I was walking along virgina beach when I seen a small orange circular orb flying threw the sky the object got brighter and brighter ora",
      "city": "virginiabeach",
      "shape": "circle",
      "date": "2019-10-04T00:00:00",
      "story": "I was walking along virgina beach when I seen a small orange circular orb flying threw the sky the object got brighter and brighter orangeish red then it made like a huge flash like a giant camera flash I then see it dimmer and fly up looking like a star, but still the orange color.",
      "link": "http://www.nuforc.org/webreports/148/S148984.html",
      "state": "VA",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c9726",
      "summary": "String of lights in morning sky.  ((NUFORC Note:  \"Starlink\" satellites?  PD))",
      "city": "virginiabeach",
      "shape": "light",
      "date": "2019-12-01T00:00:00",
      "story": "String of lights in morning sky At apprx 5:30 AM, 11/23/2019- I was looking up N,NW in the morning sky - zip code 23451- and i saw a long string of lights appear to come (possibly) down from out of view between orion the hunter and the little dipper and travel north, north west out of sight.  The lights made no noise, traveled in a straight line - I looked up in the middle of the line so it had already started but I watched at least 40-60 lights pass by.",
      "link": "http://www.nuforc.org/webreports/150/S150999.html",
      "state": "VA",
      "duration": "~15"
    },
    {
      "_id": "64d005f478aba2ec5a3c97df",
      "summary": "While viewing the NAS Oceana airshow, what looked like a bright, twinkling star was hovering high in the sky over the runway.",
      "city": "virginiabeach",
      "shape": "light",
      "date": "2019-10-04T00:00:00",
      "story": "While viewing the NAS Oceana airshow, what looked like a bright, twinkling star was hovering high in the sky over the runway.  There was no noise and I couldn't tell if the object was creating or reflecting light, but it was a cloudless and a very bright day",
      "link": "http://www.nuforc.org/webreports/149/S149101.html",
      "state": "VA",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c9893",
      "summary": "White &quot;clouds&quot; merge into translucent shape",
      "city": "virginiabeach",
      "shape": "oval",
      "date": "2019-12-19T00:00:00",
      "story": "White &quot;clouds&quot; merge into translucent shape Mostly clear morning, looked up and saw what looked like two small white clouds very high in the atmosphere.  The two clouds were \"floating\" very quickly, faster than a typical plane that high up.  The white lines moved closer together until parallel, then \"merged\" into a translucent oval with white edges which faded.  I looked away for a moment and looked back and could no longer see the apparition-like structure.",
      "link": "http://www.nuforc.org/webreports/151/S151712.html",
      "state": "VA",
      "duration": "1 minute"
    }
  ]
}