{
  "city": "washington",
  "fetch_timestamp": "2025-07-12T14:19:32.797689",
  "record_count": 131,
  "pages_fetched": 6,
  "api_calls": 7,
  "source": "ufo_aficionado_api",
  "records": [
    {
      "_id": "64d005f478aba2ec5a3b4289",
      "summary": "coloured moving lights over washington",
      "city": "washington",
      "shape": "light",
      "date": "2006-05-15T00:00:00",
      "story": "coloured moving lights over washington in 2002 we had a holiday in cuba, 10th - 24 july,  on the way home i saw something that will stay with me until the day i die,  the flight path home took us along the eastern side of the usa, i had a window seat and whil over land i like to look out at the scene below, as we were passing over washington i looked out of the  airplane window and saw 'lights' that i assumed was maybe lightening but the movements of these lights made me realise it was something more, i tried to show my husband but as i pointed out where the lights were they would suddenly 'jump' moving at great speed and he would miss them, fascinated i watched for as long as i could which was only a few minutes as the plane was moving away from them.  the lights were coloured, blue, orange, red, violet, it seemed as though i was watching something spinning and the colour changed as the object turned,  it would be in one place, revolving for a few seconds and then it would be gone only to reappear in a different part of the sky, there was more than one object and there seemed to be a pattern to the movement, it was unlike anything i had ever seen befor,  i knew i would see something about these lights in the paper and sure enough a couple of days later there was a report in the daily mail about the u.f.o over washington",
      "link": "http://www.nuforc.org/webreports/049/S49922.html",
      "state": "DC",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b430e",
      "summary": "ufo I seen in washington pa.",
      "city": "washington",
      "shape": "disk",
      "date": "2006-05-15T00:00:00",
      "story": "ufo I seen in washington pa. I was sitting on my patio at 8 pm getting some cold air when i looked back by my garage. I seen something in the sky. i got up and walked back there, it was dark but i could see it real good. it was about 20 feet off the ground . it was round , it had different colored lights down close to the bottom of it. they were flashing all around it, red, blue, yellow ,white, red, blue yellow white.in that order. there was no sound.i walked beside my garage , i was about  50 feet away from it.it was moving slow, i could have walked faster than it was moving.i was amazed at what i was seeing. i went to to get my girlfriend in the house. its about 10 feet from my garage. she didn't wanta see it i was in there for 2 minutes then i went back out. i looked where it was and now it was just a dot on the other side of town. about 6 or 7 miles away from where it was. i thought it moved away kinda fast. i know what i seen i seen one before when i was younger. it was moving north when i seen it.the night was very clear .",
      "link": "http://www.nuforc.org/webreports/050/S50017.html",
      "state": "PA",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b4454",
      "summary": "Large object covers the moon",
      "city": "washington",
      "shape": "oval",
      "date": "2006-05-15T00:00:00",
      "story": "Large object covers the moon As I was preparing for bed, I looked out the window up at the moon and saw a large object with flashing lights (green and red) slowly cover the moon. The moon was covered up completely for about 1 and a half minute. It looked as if an eclipse occured.",
      "link": "http://www.nuforc.org/webreports/049/S49972.html",
      "state": "DC",
      "duration": "1.5  min"
    },
    {
      "_id": "64d005f478aba2ec5a3b50d8",
      "summary": "July 1964, 15:00, Washington, MO, rectangular, 20 min, from north to south, posted 9-28-06.",
      "city": "washington",
      "shape": "other",
      "date": "",
      "story": "July 1964, 15:00, Washington, MO, rectangular, 20 min, from north to south, posted 9-28-06. When I was about 13 years, a student of astronomy, interested in aircraft, and the NASA “space program”, I saw a UFO.  I was at that age a model rocket, math, and science enthusiast.  As an adult I graduated with an engineering degree.  On this special day, it was clear and sunny.  It was in the month of July.  The sky was blue with few clouds and maybe 90 F.  The winds were clam.  I first noticed it coming from the North floating towards the South or South Southeast.  Its speed seemed slow but did travel in a straight line of flight.  The object shape was clearly a rectangle.  Note, it was only a two dimensional object - no thickness.  You could not see through it.  Its color appeared as if it were a solid black - no color changes.  It floated along as if it were a plastic sheet one would hold by hand along the short side in front of a strong fan watching the greater length of plastic flutter very very slowly yet perpendicular to the fan face.  It remained level and with no sound, always keeping the same altitude, same speed, and same direction.  I followed it for nearly 20 minutes and was finally unable to continue.  It just continued southward, in the same direction, same altitude, same speed, unabated.  To ascertain a speed relative to ground, I estimate a segment distance of travel of 500 feet.  During that distance it traveled that distance in about 1 minute.  To estimate the size of the UFO, I would compare it to holding in my out stretched something 1.5\"x3.0\" in size in my hand.  As far as I know I was the only one to see it.  Comment: Over the years I often wondered if it were nothing more than a plastic sheet floating along.  But anyone experienced in kite flying would know that any flat plastic sheet would not stay aloft parallel to the earth indefinitely as this object.  I felt when watching it as if it were a hole in the sky.  Almost as if I and the homes were being observed.  I was never frightened. ((NUFORC Note:  Witness indicates that the date of the event is approximate.  We have assigned an arbitrary date above.  PD))",
      "link": "http://www.nuforc.org/webreports/052/S52669.html",
      "state": "MO",
      "duration": "20 min"
    },
    {
      "_id": "64d005f478aba2ec5a3b6731",
      "summary": "Small orbs circle the pentagon on Sept 11th",
      "city": "washington",
      "shape": "circle",
      "date": "2006-07-16T00:00:00",
      "story": "Small orbs circle the pentagon on Sept 11th IFilm - plane strikes pentagon 2nd angle quicktime footage-  After the tomahawk missle hits the building  a small Mantis like mini helicopter flys by (raising the parking lot gate thing) and a  guy points at it then,  afew seconds later you can see a pair of small orbs  passing each other in perfect syncronization. The motion is perfect - they circle the area two times - about 3 or 4 feet off the ground -  this little movie shows how our technology compares to......who ever they are.....I'm not an Alien fanatic, but twice now i've seen with my own eyes what I know in my heart were displays of technology that are not of this world. 1st time at night in the skys off the coast of Boston ( a light in the sky moved - darted off at a speed we can't travel at ) and in broad daylight from my back yard in LA. ( dull metal colored disk - standing still - then vanished and I made sure I didn't blink - I could see it's shape clearly - very clear sky - no clouds at all) I asked my lady to explain what we both were looking at... she saw it. . . she won't talk about it - that's rare for her....I've only seen the little orb things on tv, but I think thats whats on the video @ ifilms ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/050/S50894.html",
      "state": "DC",
      "duration": "1 min"
    },
    {
      "_id": "64d005f478aba2ec5a3b678e",
      "summary": "Two UFO's Lingering In The Sky On October 31, Followed By Lights And Surrounded By Green Fog.  ((NUFORC Note:  Satellites??  PD))",
      "city": "washington",
      "shape": "sphere",
      "date": "2007-11-28T00:00:00",
      "story": "Two UFO's Lingering In The Sky On October 31, Followed By Lights And Surrounded By Green Fog, Every Dog Was Barking The Entire Time I just saw 2 ufo's outside on my balcony, it's halloween night in Washingron, DC on Glenbrook Road, I was looking at stars when I saw a ufo in the sky, I knew it wasn't a star because it was different looking. I knew it wasn't a plane or satallite because it wasn't moving fast or blinking. One was coming in a diagonal direction from the west the other from the east. I got my bionoculares and telescope to look at it up close. When I looked at the objects in both the telescope and bionoculars in focus and up close at the 2 ufo's, but when I directly looked at it through the telescope and bionoculars I could only see a unidentified fly object absolutely surrounded by a green-ish fog or laser type of thing and a bright light following them.  The entire 1 hour time peroid every single dog in the entire neighborhood were barking like mad and growling angerily constantly I could her it from inside my house.  All night there were planes coming in and out, but I live near a major airport. ((NUFORC Note:  Satellites??  PD))",
      "link": "http://www.nuforc.org/webreports/059/S59547.html",
      "state": "DC",
      "duration": "about 1 hour"
    },
    {
      "_id": "64d005f478aba2ec5a3b68b6",
      "summary": "It was a round white light with tentacles sticking out blue and white, look like a spider.",
      "city": "washington",
      "shape": "other",
      "date": "2008-06-12T00:00:00",
      "story": "It was a round white light with tentacles sticking out blue and white, look like a spider. On Thurday morning may 29th 2008 at 6:47 am edt, I went outside on my porch And sat down to get some air and just casually looked up in the sky. I saw something in the sky that looked like a spider with a light on its belly.  At first I thought it was a balloon but in the light breeze yesterday it was not moving. Also It was as high as a helicopter so the visual was not that ba to see and the sky was dead clear and even though it was day the sun was not quite all the way shining but against the sky it was clear. It had long stringy arms or tentacles which were blue and white not really straight but slightly curly. I went in the house after watching it for 15 min hoping to see a plane or something else and when to call 2 tv statins channel 8 and 9 which I called channel 9 today to see if they when to se Washington dc to see if they saw what I saw and the said they went there and saw nothing. I returned outside aroung 7:17 am and the arms were shorter and more curly and tha sky was getting sunny. I went back to bed. I awakened at 1 pm and nothing was there.",
      "link": "http://www.nuforc.org/webreports/063/S63609.html",
      "state": "DC",
      "duration": "30 min"
    },
    {
      "_id": "64d005f478aba2ec5a3b6caa",
      "summary": "This is my second report of these Triangular shapped flying objects with red flashing lights.  This second sighting compelled me to rep",
      "city": "washington",
      "shape": "triangle",
      "date": "2006-07-16T00:00:00",
      "story": "This is my second report of these Triangular shapped flying objects with red flashing lights.  This second sighting compelled me to report it.  My last sighting was two years ago in 2004 in New Jersey.   This sighting occured in Washington, D.C. in April of 2006.  I was at a friend's house and the three of us decided to go outside on the apartment balcony and smoke a cigarette.   While we were out there I saw small flying aircrafts that were flashing red lights.  It reminded me of my sighting two years ago and brought back memories.  I realized it was the same objects.  I recognized the speed of the red flashing objects.   Again, my friends being very skeptical just assumed they were airplanes but not me.  No way, this is the second time that these objects came around.  This time in Washington, D.C.  They moved the same way in all types of directions.   The flying objects disappared after a short time, maybe 10 minutes.  Then after that I saw other aircrafts which looked like helicopters with spot lights just like my first sighting flying around the area.   We didn't stick around to see the helicopters fly around but they were gone after 30 minutes.  Again I  assume it is a UFO or something government related.  Especially since it happened in Washington, D.C.   You never really know with the government.   I don't know if they were any other outside witnesses but I have done some research online and have seen some forums with other witnesses of the same event.  I just decided to report this stuff since it was my second sighting of the same thing but in different states. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/050/S50700.html",
      "state": "DC",
      "duration": "20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b6f52",
      "summary": "black triangular object with three red lights underneath it flying over DC",
      "city": "washington",
      "shape": "triangle",
      "date": "2006-07-16T00:00:00",
      "story": "black triangular object with three red lights underneath it flying over DC I was driving south on the 295 interstate coming out of downtown DC where I work. It was the early am of 17 May 06, Wednesday at about 12:20 am. I was headed south and as I approached the area of Bolling AFB (to the right) and the Naval Research Lab on the 295 I saw the side view shape of a Stealth aircraft......nothing else has that shape....flying over the interstate headed in the direction of the AFB..to the right. I then looked to the left side of the 295 and saw a black triangular shaped craft with 3 red circular lights in each corner of the triangle flying over the area across from the Naval Research Lab. The stealth appeared to be escorting the craft. the triangle was descending and appeared to go down in an area with a very high treeline. The treeline is thick and dense with a fence that stretches the entire distance of the trees.",
      "link": "http://www.nuforc.org/webreports/050/S50661.html",
      "state": "DC",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b6f88",
      "summary": "While going toward Washington, MO., saw a streak of light with a green tail traveling southwest, very fast, angling down",
      "city": "washington",
      "shape": "light",
      "date": "2007-02-01T00:00:00",
      "story": "While going toward Washington, MO., saw a streak of light with a green tail traveling southwest, very fast, angling down",
      "link": "http://www.nuforc.org/webreports/054/S54408.html",
      "state": "MO",
      "duration": "seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b7686",
      "summary": "Sighting recorded Friday November 10th, 8:20AM. I witnessed an object off the lower left side of the plane (South/West). It would be be",
      "city": "washington",
      "shape": "cylinder",
      "date": "2006-12-07T00:00:00",
      "story": "Sighting recorded Friday November 10th, 8:20AM.  I witnessed an object off the lower left side of the plane (South/West).   It would be best described as silver, cylindrical, shaped like a cigar tube.  No Windows, Wings, Identifyable Marks or Propulsion source.   It was half way between our plane and the ground.  Taking into account the speed our plane was travelling, the object was either hovering or moving very slow in a South West direction along a parallel flight path with the ground.  No erratic movement noted.  I was on a Continental Airline flight. The plane departed at 7AM from West Palm Beach, FL, en route to Newark, NJ.  We landed in Newark at about 9:30 AM.  I have never witnessed an unusual object such as this before. The sighting lasted approximately 30 seconds.  There was not time enough to get the attention of anyone else on the plane.  The object appeared to be slightly less than half distance between our plane and the ground.  I understand commercial aircraft generally travel at 35,000 feet, if this is the case, it would be my estimate that the object was located at about 17,000 feet.   Visability was perfectly clear. There were no clouds anywhere.  I cannot provide a comparison of the object to the sun, since my line of view was from above the object looking downward. I struggle to comprehend the actual size of the witnessed object.  It was large enough that it was clear and distinct but otherwise small from my point of view.  In comparison to objects on the ground, it was bigger than the size of a large house on the ground. ((NUFORC Note:  We spoke via telephone with this witness, and we found him to be quite lucid, and emphatic, as to the very real nature of his sighting.  PD))",
      "link": "http://www.nuforc.org/webreports/053/S53400.html",
      "state": "DC",
      "duration": "30 Seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b7711",
      "summary": "cell phone picture of Capitol - apparent objects",
      "city": "washington",
      "shape": "light",
      "date": "2007-02-24T00:00:00",
      "story": "cell phone picture of Capitol - apparent objects I took a cell phone picture of the U.S. Capitol after I watched the arrival of former President Ford's body there the night of Dec. 30, 2006. The time is approximate. I was standing in the middle of East Capitol Street facing the Capitol and facing generally west. I did not see anything strange with my bare eyes, but when I took the cell phone picture of the Capitol there are these three lights shaped like oval objects that show up. I took other pictures of the Capitol earlier that night and did not see any lights in the background. I tried to send the image via the email address ufocntr@nwlink.com but am not sure that is the right address. I am sending it to the address on the webpage. I apologize if this is not worth noting. I thought that it looked strange upon seeing the picture. ((NUFORC Note:  Photo shows multiple lights above the Capitol Building, which look somewhat reminiscent of landing lights on approaching airliners.  However, the camera is pointed generally to the east, and no airliners are in that part of the sky near the Capitol.  They would be far to the west of the Mall, as they approach Reagen International Airport.  We suspect that the \"objects\" may be lens flares, generated by the bright lights, which light the front of the Capitol Building.  PD))",
      "link": "http://www.nuforc.org/webreports/055/S55114.html",
      "state": "DC",
      "duration": "NA"
    },
    {
      "_id": "64d005f478aba2ec5a3b77f0",
      "summary": "Fireball Over Capitol Hill- Very Long Deep Blue Tail- During Anti- War Rally",
      "city": "washington",
      "shape": "fireball",
      "date": "2007-02-24T00:00:00",
      "story": "Fireball Over Capitol Hill- Very Long Deep Blue Tail- During Anti- War Rally I witnessed a huge aerial event over Washington, D.C., while attending the Jan. 27 Anti- War Rally and March. A fireball streaking high overhead from south to north, it was a DAYTIME SIGHTING, the persistent long tail was bright color of electric- arc blue mixed with violet- the color and brightness appearing like lightning from this witness' perspective, the head of the object grew larger as it moved from my right to left high in the sky, directly over the U.S. Capitol and behind the speaker's stage- I was located in the Mall between the Capitol and the Washington Monument, facing east, standing almost directly in front of the speakers stage about 100 feet back when I saw this object streak overhead  about half- way through the scheduled speakers presentations. I was awed and blown away for quite a while, and I wondered whether anybody else in the crowd witnessed this !  I was initially frightened by the streak or dart of light I saw in the sky over Capitol Hill- I thought at first a big firework, then I saw how high up it was- thousands of feet, or several miles- and then I thought missile, and the fireball got somewhat larger as it traveled, -and I actually expected an explosion with sound- but only silence happened, and the tail faded without leaving any smoke or cloud whatsoever. The tail of a normal meteor would have left a thin remnant smoke or cloud trail like a contrail- but I repeatedly sought for a wisp of smoke to try to understand what I was seeing- and saw only CLEAR BLUE SKY AND SUN- BOTH BEFORE AND AFTER ! AND my early impression is this was LIKE AN ARROW ! Why ? Because the tail was very long and persisted way too long to be a normal meteor. You see, a normal meteor is colored incandescent white or bright sun- yellow, with a short tail because the tail tracks closely to the head of the meteor ( look at videos of the unfortunate shuttle reentry loss ). But THIS object- the tail continued for at least 20 degrees of sky, the entire display faded all at once, and the color of the tail was electric- arc blue- like an arc welder, but deeper blue- fringed with violet- FULL LENGTH- and I think the head of the object, as it progressed and grew bigger, was more violet than blue. Moving south to north, from the direction of the sun towards north.  I turned and looked at the faces of the crowd together with the media risers close behind me- NO REACTION AT ALL ! That really bothered me, too !",
      "link": "http://www.nuforc.org/webreports/055/S55160.html",
      "state": "DC",
      "duration": "4 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b7b90",
      "summary": "Hovering saucer-shaped object, yellow lights, approached by bronze-colored object, triangular or flying wing shape, which hovered near.",
      "city": "washington",
      "shape": "other",
      "date": "2007-03-08T00:00:00",
      "story": "Hovering saucer-shaped object, yellow lights, approached by bronze-colored object, triangular or flying wing shape, which hovered near. (Preliminary report) 2 objects observed.  (1) saucer shape, yellow flashing lights, hovering near tree-top level, no sound  (2) approached by second object, triangular or \"flying wing\" shape, also silent, not well lit, appeared sort of bronze colored, approached first craft and hovered nearby.  2nd object seemed to fade slowly from view, possibly obscured by cloud.  Watched for 10 minutes, then had to leave.  First object still in view at that time. ((NUFORC Note:  We spoke via telephone with the party who submitted this report for a friend.  The friend did not want to be identified, but the caller sounded to us to be quite serious-minded and credible.  PD))",
      "link": "http://www.nuforc.org/webreports/055/S55562.html",
      "state": "DC",
      "duration": "10 min"
    },
    {
      "_id": "64d005f478aba2ec5a3b7ca8",
      "summary": "((HOAX??)) It was a very shiny diamond-shaped crystal UFO craft, and it sounded like a high pitched whistle.",
      "city": "washington",
      "shape": "diamond",
      "date": "2006-12-14T00:00:00",
      "story": "It was a very shiny diamond-shaped crystal UFO craft, and it sounded like a high pitched whistle. i was jogging very early in the morning when i heard a very annoying noise. I looked around to find where the noise came from and i looked in the sky and their was about 22 or 23 of these diamond shaped flying objects.   I was in the air force for about 6 years, and i have never seen any aircraft shaped or osund like this one, i wanted to see if their was anyone else who had seen these ufo-like things, nad i found a man, sitting on a nearby bench, their was a homeless man who was speaking franticly about the crafts, and he ran off, i tried to stop him, and all these other people were being drawn to the attention that the homeless man had drawned to himself, i met a woman, she was a newspaper editor, and she told me that those were ufo's and i agreed with her that i have never seen anything like it, then 11 minutes passed, and later on, when the light started to come up around 1:10 a.m., and the ufo's faded away and nobody else admitted to seeing them. ((NUFORC Note:  This may be a hoax, we believe.  PD))",
      "link": "http://www.nuforc.org/webreports/053/S53915.html",
      "state": "DC",
      "duration": "12 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b7cb7",
      "summary": "It was early morning 6:20 when I saw a cicular object flying over our house.  ((NUFORC Note:  Possible student report??  PD))",
      "city": "washington",
      "shape": "circle",
      "date": "2006-12-07T00:00:00",
      "story": "((NUFORC Note:  Source of the report elects to remain totally anonymous.  Possible student report.  Possible hoax??  PD)) It was early morning 6:20 when I saw a cicular object flying over our house. It was early morning and I heard a strange wooshing noise.  I also noticed there was light coming from the window.  I got out of bed and looked through the window there was a strange circular object in the sky; it had a few lights on it.   This was no airplane I repeat THIS WAS NO AIRPLANE!  The wooshing noise stopped and the aircraft slowed down a little.  It had some haze around it.  The UFO flew directly over our house it was flying right over many trees.  I could not tell what color exactly the object was because it was fairly dark and blended into the backround. ((NUFORC Note:  Source of the report elects to remain totally anonymous.  Possible student report.  Possible hoax??  PD))",
      "link": "http://www.nuforc.org/webreports/053/S53704.html",
      "state": "VA",
      "duration": "20 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b7f44",
      "summary": "a vectoring orange streak, which at the end of forwards vectoring, makes a sudden 90 degree turn?",
      "city": "washington",
      "shape": "fireball",
      "date": "2009-12-12T00:00:00",
      "story": "At 20:57 PM I photographed a high speed sequence of images of abstract clouds that were above my home?  The technology allowed me to image, exactly what I was focused on (clouds). However in the sequence of images are  what starts as a stationary orange anomaly in the clouds? In each proceeding image, is a vectoring orange streak, which at the end of forwards vectoring, makes a sudden 90 degree turn? In each representation of this anomaly, a streak of light which peaks brightness only in various shots?  The anomaly, matches the anomaly which landed in front of me in Baltimore 08/03/08 http://www.nuforc.org/webreports/065/S65053.html, however this time I have it vectoring in the sky?  Unlike anything I have ever seen? http://www.facebook.com/UFOdc?ref=profile#/album.php?aid=98539&id=783309194 http://www.facebook.com/UFOdc?ref=profile#/video/video.php?v=122114149194",
      "link": "http://www.nuforc.org/webreports/071/S71952.html",
      "state": "DC",
      "duration": "2 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b801d",
      "summary": "Two fighter airplanes, assigned to inspect a white-dot cluster, suddenly disappear off radar, and then the cluster also disappears.",
      "city": "washington",
      "shape": "formation",
      "date": "",
      "story": "Two fighter airplanes, assigned to inspect a white-dot cluster, suddenly disappear off radar, and then the cluster also disappears. Unusual UFO recording at Project Blue Book  In 1955, as part of a publishing team from Bantam Books who had published a book on UFO's, I was invited to the \"inner sanctuary\" of Project Blue Book. We were shown many interesting photos, but the most stunning experience came from a radar recording.  A radar record showed a number of white dots moving in formation high in the sky over Washington, D.C. Then two fighter airplanes were ordered up to investigate. We watched as they approached closer and closer to the cluster of about 5 or 6 white lights.  Suddenly, the radar dots of the planes disappeared. Then, in just a few seconds, the white-lights cluster suddenly moved upward at great speed, and quickly disappeared off of radar altogether.  We sat there in stunned silence--and then the questions and unhappy answers.  No, the planes and the pilots were never found. No wreckage. Only conclusion possible: they had been captured by the UFO's, pilots and planes, in toto.  No, the relatives were not told the truth. They had been told that the fighers had disappeared way out in the Atlantic Ocean.  And No--you cannot tell the truth, either.  You have been sworn to silence, and you must stick to that. Otherwise, you might stir up a hellish wave of panic.  That's it. Have never mentioned the event for the 53 years between then and 2008, when I thought it was finally time to reveal the event to Peter Davenport at the National UFO Reporting Center, in Seattle, Washington. ((NUFORC Note:  Witness indicates that date of incident is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/065/S65946.html",
      "state": "DC",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3b822b",
      "summary": "elongated ad flattened 6 inch dome, with 1 bright light, hovers and darts like dragonfly, D.C. Mall, 7-4-97",
      "city": "washington",
      "shape": "other",
      "date": "2009-03-19T00:00:00",
      "story": "elongated ad flattened 6 inch dome, with 1 bright light, hovers and darts like dragonfly, D.C. Mall, 7-4-97 I've decided that I should finally share something that I and my then-girlfriend saw over 10 years ago.  This seems to be the best place to do it.  I do not expect it to be taken tremendously seriously, as there are some details I've frankly just forgotten, and it is far from what you hear most UFO reports sounding like, but perhaps it's something to add to your database which could be correlated to other incidents.  I've only recently become deeply interested in this event again, sparked by a discussion with a friend, but I know that it has, in a way, always been in the back of my mind, for over 10 years now. Brought to the fore every time there was some report or show on TV, or a tabloid headline having to do with UFO's.  I do not expect a response to this, though it would be interesting to know if anyone else has ever seen anything like what I describe. First of all, about me:  My name is, let's say \"Mike\".  (I have no trouble giving my true details privately.)  I'm 37 years old, educated, and most would say intelligent. I practiced law for 4 years, now write flight simulation software, and will next year begin teaching high-school mathematics.  My hobbies have included things such as aviation, reading classic literature and about physics, plus even a bit of dabbling in astronomy.  (Just enough to appreciate the TREMENDOUS distances to even the nearest stars... which in my mind would make interstellar travel nearly impossible, at least under physics as we know it.  This is one of the reasons I'm so skeptical and have had real internal conflict over what I saw.)  By the way, I do not have a pilot's license, but do know quite a bit about aviation, theory of flight and such.  With a background such as this, and a mind-set skewed towards logic and science and technology, it's probably no surprise that I'm generally a very skeptical, evidence-oriented person. I frankly view a large part of the UFO \"movement\" or whatever it's called as comprised of people who just WANT to believe something -- followers, in a sense, of their own religion, in that many seem as eager to bypass reason and rationality as do the fundamentalists of the traditional religions. I add this only to point out that there really isn't a large part of me that is *eager* to believe this... to believe what I probably must believe if I accept the reality of what she (my girlfriend \"Lori\") and I saw. I think I now am starting to... hence this e-mail, 12 years later. My \"sighting\":  First, I'm actually not certain that this happened in 1997.  Lori and I are no longer together but still talk about this, and we're only 80 percent sure it was '97.  It may have been '96.  Regardless, it was the night of July 4th, and we had been to the National Mall in Washington D.C. to view the fireworks.  We each lived in the northwest suburbs of D.C., so had taken the metro (rail) from Gaithersburg directly down to the mall. (Red line to Orange line.)  We were there all day, watched the fireworks, and in general had a great time. We did not consume any alcohol, as we rarely drank, nor did we take any drugs.  The fireworks had ended.  We were tired and ready to go home. It was around 11 o'clock, I believe.  The crowd there was huge, obviously, so she and I had waited a bit for it to thin out instead of trying to sardine ourselves onto one of the metro train cars. So we started walking (I remember it as we were walking west, on the north side of the mall), and were heading towards the Nat'l Mall entrance to the Smithsonian Metro station.  We were not far at all from this entrance, certainly within 100 feet.  Then, from nowhere, this... \"thing\".. appeared. Carmel and I have always referred to it as the \"dragonfly UFO.\" It was on our left, slightly above eye-level -- no more than 10 feet high -- and I'm certain it was within 15 feet of us the whole time, at several moments probably less than half that. This thing was the size of a large dragonfly, I would say around 6 inches, and it flew and hovered the way a dragonfly might... just with MUCH more quick and abrupt movements. Like gravity and inertia didn't mater to it. It would be hovering, and then a handful of seconds later, in what seemed like an instant, it would zip over and be hovering several feet away in a new spot. We were walking while this was all happening, mouths agape I'm sure and staring, but afraid to stop I guess because of the main light's striking brightness. It did seem like it was paying attention to us (I can't believe I'm saying this, but like it was \"scanning\" us), so, during the probably 30 second period this all lasted, we saw this zipping around movement I described several times. It was so astounding. How that made us feel is complicated. In fact, I can only speak for myself. I just know that as this was happening, a few times I glanced quickly around to see if others were seeing this too. There were people around, so I suppose I felt a little bit of the whole \"safety in numbers\" thing. On the other hand, it did seem to stay near us, and we saw its light from the brightest aspect angles, I assume, so it did seem like we were being evaluated somehow. Combine that with the fact that this thing does NOT, truly, seem to be anything that would come from this Earth, and yes, there's a level of fear that mixes in. So all in all, I personally was a little scared, VERY amazed by what it could do, and frankly felt somewhat entertained by it (to the point that I was laughing... as if I knew then I'd never see such a spectacular show again.)  Sound.... This thing made no sound whatsoever. (Even considering the background noise, which is actually not as much as you'd might imagine that time of night on the Nat'l Mall, I feel confident that, given this thing's proximity to us at times, we should have heard something.) \"Lori\" agreed with this: if there were anything to hear, we would've. This \"dragonfly\" SEEMED to be slightly illuminated, but perhaps was just so shiny that it was reflecting the background light. I'm honestly not sure. It was hard to see past its \"main\" light. This was a very bright yellowish light, facing forward, from the \"head\"... though it struck me that calling that direction \"forward\" was somewhat arbitrary... and I really only could call it the head because that's where the light was. But this main light didn't show up as a beam, despite its intensity.  Again, maybe because there was a fair amount of background light in the area. What I did make out past of the object past that bright light could be best described as a very elongated computer mouse -- a flatter bottom, more rounded top, and length that was probably 3 - 4 times its width. Height was maybe half its width. All edges were rounded... nothing sharp. By FAR the most interesting feature of this miracle dragonfly was that there seemed to be two small spherical \"wings\" to it. But it wasn't like the blurry whirlwind you'd see when a humming bird or dragonfly are moving their wings very rapidly. It was more like a slightly yellow luminescent haze. Kind of like when you can see the heat rising from the asphalt on a hot summer day, but this was more intense than that. Somehow more turbulent or \"wigglier.\" These circles, where dragonfly wings would've been, were not large. Maybe a couple of inches, probably slightly less (because they were less than 1/3 its length). But certainly they were not large enough, had it actually been the blur of wings, to support even the lightest weight imaginable for a \"body\" of that size... i.e., even though we refer to it as the dragonfly UFO, its \"yellow haze ball\" wings were not nearly as large, proportionately, as a dragonfly's. One thing striking to both \"Lori\" and I is that only one other person seemed to see what we were seeing, though there were probably a dozen people within a 30 - 40 foot diameter. It was a girl between 5 to 10 feet behind us, and who herself was several feet away from who I assume was her boyfriend. She and I just quickly glanced at each other, puzzled, amazed, after this thing flew away. Those parts I remember clearly. I think I may have said something like \"what the HELL was that,\" but I can't be sure that I wasn't just thinking it. I know she said nothing to me, but looked shocked and far too white for July in D.C.. As I said, this thing seemed to come out of nowhere. When it left, about 30 seconds later, it receded to our left (which I believe was south at that point, towards the Potomac), very rapidly, in a flat trajectory. No more than +5 degrees flight path. It was as if this thing had instantly decided to go monitor someone else a mile away. The speed at which it left I'd say was 80 to 100 miles per hour. But I could not keep it in sight for long, and don't know if it sped up after that, or where it went. And it reached that 80 - 100 mph speed very, very quickly... as I look at the second hand of my computer clock and replay this in my mind, I'd say just a bit over a second. 1.25 +/- . But you have to understand that this thing was not so easy to see unless the main light was visible to you, and near the end it was not visible to us. You could track it if you HAD seen the main light, and then it turned and maneuvered, but with the way it blended with everything else, pulling in and reflecting, almost duplicating the visual surroundings, I doubt that someone who wasn't in the path of the main light would have noticed it at all. I remember this very clearly: this object did not have to yaw or turn so that it was facing the direction it wanted to fly, nor did it have to pitch its nose up as a typical helicopter would if it wanted to fly backwards. This stuck with me. Standard fixed or rotor wing flight principles are out of the question here. Jet and rocket engines make noise, of which this had none. Even the ion engine things I've seen are not equipped to power something in the way that we saw. Nuclear... sure, whatever. But these are power sources, not propulsion sources, and there is no physics text book in the land that could describe how something could move this way. You almost have to have seen it to believe it... those yellow luminescent \"wing\" spheres... the INSTANTANEOUS stopping and starting. No way. Skeptics may dismiss things like these as obvious hoaxes, but I'm telling you, neither I, nor my ex-girlfriend are idiots. I've tried for 12 years to find ways to convince myself it was some super secret CIA craft, but I just can't believe that. The principles behind this \"dragonfly\" just simply strike me as things which are thousands of years ahead of our technology. I have never heard of UFO sightings such as this, with a small craft doing dragonfly-like darting maneuvers. But I can tell you that \"Lori\" and I discussed this incident many times, and there was always an element of disbelief in those conversations. I'm not sure either of us ever said this explicitly (maybe because of fear of ridicule by the other... because we're intelligent, rational people, right?), but I'm pretty sure there was an unspoken understanding between us that this \"thing\" was not built by man. Yet it was definitely intelligently controlled. The conclusion is one I've avoided, but which is obvious.... I've attached a very rudimentary bitmap. I'm not much with any of those paint programs, but it gives you a pretty close idea. However, as I look at what I \"drew,\" it seems to me that the length should be still longer. Still 6 inches, but the other sides adjusted proportionally down, so that the whole thing would appear longer and thinner, a super fat cigar, almost. By the way, I should tell you, I admire the work your organization is doing, and believe, given what I've seen, and given what it seems others have seen, that your hard work will be validated and highly appreciated within the next 50 years. ((NUFORC Note:  Source of report indicates that the date of the incident is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/068/S68051.html",
      "state": "DC",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b8353",
      "summary": "Triangle/Diamond with white lights, hovering and rotating around axis",
      "city": "washington",
      "shape": "diamond",
      "date": "2009-08-05T00:00:00",
      "story": "Triangle/Diamond with white lights, hovering and rotating around axis I am 33 years old today, so this occurred when I was 20 years old.   But even though this was 13 years ago, I remember it vividly.  It has never left me, just for some reason started to think more and more about it lately. There was a small group of us over at a friend’s house, planning to spend the night.  As the evening was winding down, a few of us stepped outside for some fresh air.  After a bit of time the other individuals with me decided to go inside, but for some reason I thought I’d just stay out there a little longer. I remember looking straight up at the sky, and marveling at the fact that it was so clear.  There were tons of stars out.  As I was looking up at the stars, something caught my eye.  At first it had blended in with the rest of the stars, but I soon realized that there were a set of white lights moving with each other, slightly rotating.  (Since the object was high up in the sky and it was dark out, the lights were the only thing I really saw).  At this point, the lights appeared as if they were in a triangle formation, equi-distant from each other.   The object remained in the same point of the sky, but started to ‘revolve’ around it’s vertical axis.   This is when I started to realize that it was a 3D object.    As the triangle shaped set of lights began to rotate at a moderate speed, the triangular plane created by those lights became slanted until I was looking at the very edge of the triangle (for a split second I just saw a line of lights).  As it continued to rotate, the! triangular plane appeared again as if viewing it from the other side.   All this was happening on/near it’s vertical axis, but the entire object start to revolve around the horizontal axis as well.   As it continued to revolve it began moving slowly across the sky.   After moving at that speed for  a bit, it sped up considerably until it was out of sight in a matter of seconds.  It traveled a long distance in a very short amount of time. As I was watching this, I remember feeling that this object was way up in the sky, and very large.  My setting was almost void of any sound, and this craft did not add to it at all, there was no sound (but it took me a bit to realize this, since it was so odd).  I also thought the lights must have been very bright considering the fact they were competing with stars from my original vantage point.   I couldn’t believe what I had seen, and was/am sure it was from another world. ((NUFORC Note:  Source of report indicates that the date is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/071/S71482.html",
      "state": "MO",
      "duration": "3-4 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b855f",
      "summary": "Cylindrical object over Washington D.C. viewd from near Smithsonian Metro Station",
      "city": "washington",
      "shape": "cylinder",
      "date": "2008-10-31T00:00:00",
      "story": "Cylindrical object over Washington D.C. viewd from near Smithsonian Metro Station My friends and I went on a trip to Washington D.C. on August 13 2008, at about 8:00 pm or a little after we were walking west on the mall towards the Smithsonian Metro Station when I noticed an object in the sky.  It appeared to be cylindrical in shape and dark, gray maybe or a dull metallic color; it was relatively well offset by the colors of the evening sky so it was plainly visible to the naked eye.  It seemed to be fairly large and distant; it stayed completely stationary for some time.  After I first noticed it I didn’t point it out until I realized that it had not moved at all for close to 30 sec.  I pointed it out to my 4 friends who all saw I but we could not decided what it was, the general consensus seemed to be that it might be a kite of some sort but to me it seemed too high in the sky and large, also the area of the sky it was in did not see like a place where anyone would fly a kite of any sort.  I pulled out my cell phone to take a picture the clouds behind the object could be seen on the screen the but object did not appear despite that fact that as I mentioned before it was plainly visible to the naked eye, a fact that I pointed out to my friends, and all of my group saw it.  If I recall I also heard someone in another group we passed mention noticing it.  The object remained stationary for several minutes thereafter until it moved slightly down and to the right and from view. \tThe object was perhaps 30 to 40 degrees in the sky to the WNW, generally in the area of the sky between the Washington monument and the White House but probably more distant.  It particularly struck me as odd because this is not a residential area, and as far as I know restricted air space, also this is the area of the sky were aircraft approach Regan National airport.",
      "link": "http://www.nuforc.org/webreports/065/S65713.html",
      "state": "DC",
      "duration": "3 to 5 min"
    },
    {
      "_id": "64d005f478aba2ec5a3b867f",
      "summary": "(egg shaped) anomaly shooting a beam of light towards the ground?",
      "city": "washington",
      "shape": "egg",
      "date": "2008-10-31T00:00:00",
      "story": "While on a roof top on 13 th and N streets NW, I imaged a sphere (egg shaped) anomaly shooting a beam of light towards the ground? Imaged with 1080 i HD camera technology. Sample shows a bright white egg shaped anomaly with blue and red lights , beam is focuced from apex of egg at a 45 degree angle. No noise was heard, image sample is extraordinary!",
      "link": "http://www.nuforc.org/webreports/065/S65274.html",
      "state": "DC",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3b86a7",
      "summary": "I saw a very shinny, flat, round object resembling a mirror in the sky that just disappeared.",
      "city": "washington",
      "shape": "circle",
      "date": "2008-10-31T00:00:00",
      "story": "I saw a very shinny, flat, round object resembling a mirror in the sky that just disappeared. I was driving South on Rt. 31 out of Washington, Warren County, NJ when an extremely shinny object in the sky caught my eye. It was far away and traveling West to East rather quickly. It looked to be just slightly smaller than a dime at the distance it was. At first I thought it must be a plane but as I focused on it a few things struck me as odd. 1) it was moving quite fast 2) it was INTENSELY SHINNY 3) it looked flat and round.  After only a few seconds it just disappeared. It was not as if it shot upward or down or anything like that it just was gone. I kept watching the sky to see if maybe it had turned or something but there was nothing and then about 3-5 seconds after it disappeared a huge black helicopter came into view from the West slightly closer and continued to the East.  The whole thing took place in a matter of 10 seconds or so about 11:55 AM Monday, August 18, 2008  In my line of work I am always on the road at various times of day and night. I have always been one to watch the sky. I have seen many shooting stars, a satellite and glowing greenish meteor during a fall meteor shower. What I saw today was quite strange. It reminded me of a round mirror in the sky.",
      "link": "http://www.nuforc.org/webreports/065/S65285.html",
      "state": "NJ",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b89e4",
      "summary": "Hello, im a 17 year old girl and Im from New York.  I was watching a video, before Barack Obama inaguration, these news people were spe",
      "city": "washington",
      "shape": "",
      "date": "2009-03-19T00:00:00",
      "story": "Hello, im a 17 year old girl and Im from New York.   I was watching a video, before Barack Obama inaguration, these news people were speaking on CNN and they cameraman change the view and a UFO zoomed right across washington, really fast in less than a second    Here is the link to the video: http://www.youtube.com/watch?v=KikkGlCAKHw   You all probably all ready know about this but I figured I should tell someone",
      "link": "http://www.nuforc.org/webreports/068/S68185.html",
      "state": "DC",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3b8a39",
      "summary": "I was watching this video on cnn.com look in the far right and watch object fly past sky infront of statue",
      "city": "washington",
      "shape": "cigar",
      "date": "2009-03-19T00:00:00",
      "story": "I was watching this video on cnn.com look in the far right and watch object fly past sky infront of statue <script src=\"http://i.cdn.turner.com/cnn/.element/js/2.0/video/evp/module.js?loc=dom&vid=/video/politics/2009/01/20/inaug.blitz.gergen.obrien.cnn\" type=\"text/javascript\"></script><noscript>Embedded video from <a href=\"http://www.cnn.com/video\">CNN Video</a></noscript> ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/068/S68156.html",
      "state": "DC",
      "duration": "1 sec"
    },
    {
      "_id": "64d005f478aba2ec5a3b8c79",
      "summary": "I captured a red sphere like anomaly in 15 frames of 1080 i HD imagery? 5 minutes later and 100 yards from POV we stopped the car and I",
      "city": "washington",
      "shape": "other",
      "date": "2010-04-13T00:00:00",
      "story": "While at Haines Point in SW Washington DC, while photographing model/artist; DM  My camera would not focus on her during the duration of images taken in high sequense @ 20000 ISO (D700 Nikon) using F 1.8 lens, and had excellent ambient light to fire high speed sequence under hand held conditions.   However; I captured a red sphere like anomaly in 15 frames of 1080 i HD imagery?  5 minutes later and 100 yards from POV we stopped the car and I fired 3 frames of L'Enfant Plaza and what I thought was the Moon, except the moon was in another position in the sky?  My 3 frames showed this anomaly with consistency in slow, forwards motion.  It was moving towards us, but we left to soon to find out if that was indeed the case?  High definition physical samples of both  Red sphere and Moon like (acorn) shaped anomaly.",
      "link": "http://www.nuforc.org/webreports/071/S71713.html",
      "state": "DC",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b8d5e",
      "summary": "i saw a bright green light above the clouds the streaked across the sky for about 2 seconds.",
      "city": "washington",
      "shape": "oval",
      "date": "2010-02-14T00:00:00",
      "story": "i saw a bright green light above the clouds the streaked across the sky for about 2 seconds. Driving home after going to dinner, a few friends and i were driving down an back road, coming downward from a hill i looked up to see a green oval shaped object flash across the sky. It was VERY VERY bright but it was above the cloud line. it was only there for a moment but I know what I saw. I instantly slowed down and kept looking up, i turned down the music and asked it anyone else saw what i just saw (after screaming a few profanities) and my girlfriend who was in the passenger seat said \"Oh my God, I saw it too. You mean that green thing right?\" I replied yes, and we kept peering but the light was long gone. Also to include detail it was obviously dark out, and it was a chilly night. No one was using any drugs nor alcohol.",
      "link": "http://www.nuforc.org/webreports/073/S73885.html",
      "state": "NJ",
      "duration": "very quick?"
    },
    {
      "_id": "64d005f478aba2ec5a3b8d70",
      "summary": "UFO flies into frames taken @ US Capitol Building @ 17:06 PM 1080 HD",
      "city": "washington",
      "shape": "other",
      "date": "2009-01-10T00:00:00",
      "story": "UFO flies into frames taken @ US Capitol Building @ 17:06 PM 1080 HD A film crew and I set up establishing images of US Capitol Building at 17:06:06, I fired 7 images within a 52 second window.  In 4 of 5 images is an anomaly which flies into the frame, and changes position in each frame in sequence?  Taken using HD 1080 imaging technology at 20,700 ISO (D1) using Nikon D700 camera.  Anomaly matched objects imaged at the same location however on July 16, 2002.  Images placed in sequence and animated shows this anomaly moved with intelligent design.  Its images samples are exceptional! Video taken to be analyzed. (Discovery Sci-Fi Crew) ((NUFORC Note:  We are grateful to the source of the report, who has submitted many reports and photos to our Center.  Although the individual is a very experienced photographer, we cannot certify that any of the photos he has submitted to us are of genuine UFO's.  They contain apparent anomalies, but that does not necessarily translate to alien craft, captured on film.  We hope that the individual, at some time, will be able to capture an unambiguous photo of a genuine UFO.  PD))",
      "link": "http://www.nuforc.org/webreports/066/S66992.html",
      "state": "DC",
      "duration": "19:06:54"
    },
    {
      "_id": "64d005f478aba2ec5a3b8e2f",
      "summary": "Object spotted in photos of D.C.",
      "city": "washington",
      "shape": "oval",
      "date": "2010-04-13T00:00:00",
      "story": "Object spotted in photos of D.C. I did not notice the object until I got home and began cropping the photos.  The image is in a particular direction.  I'll let you see the photos and make your own guess.  I do not buy into UFO's AT ALL and am just curious as to what it is. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/074/S74386.html",
      "state": "DC",
      "duration": "Unknown"
    },
    {
      "_id": "64d005f478aba2ec5a3b9276",
      "summary": "3 lights moving very smoothley at the capital",
      "city": "washington",
      "shape": "light",
      "date": "2008-10-31T00:00:00",
      "story": "3 lights moving very smoothley at the capital My family and I were driving down constitution street and we saw 3 lights moving very smoothly at a medium speed behind the statue on top of the capital when we got to union station we had a view of  the capital and they were still there only going in a different direction on are way back home we got the best view yet we could see the lights were circular but since it was night we couldn’t actually see the ship itself we went back later that night with binoculars but we didn’t see anything. However when we were there with the binoculars a helicopter was searching around the capital with a search light. ((NUFORC Note:  Witness elects to remain totally anonymous;  provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/066/S66051.html",
      "state": "DC",
      "duration": "56 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b9439",
      "summary": "Small spinning circular shaped object passes between houses but doesn't come down.",
      "city": "washington",
      "shape": "circle",
      "date": "",
      "story": "Small spinning circular shaped object passes between houses but doesn't come down. My friend and I, ages approximately 9 and 10 years old, were playing catch with a baseball in his back yard on a bright sunny warm morning in June, approximately 1966, when what I perceived to be a boomarang came between his house and the neighbors house.  It was about 2 feet in diameter and between 15 and 20 feet off the ground traveling south when I saw it coming from behind my friend. I immediately yelled,\"look a boomarang, lets catch it.\"  He looked up and saw it and we both waited for it to come down but it continued traveling on a straight steady course and did not come down as we expected it to. We ran and grabbed our sling shots and ran after it.  We ran into a large open field behind his house and watched it as it traveled over a tree, which was in the yard of a house about 1 block away.  We knew that a large woods was immediaately behind that house and so we ran across the open field to the woods and then ran about 1 mile through the woods to find out if we could still see the object.  We peered out over what was then a city trash dump but could no longer see the object.  It was traveling at about 10 miles per hour when it came between the houses and made no noise what so ever.  The object guided itself to pass immediately over the tree of the house which was one block away.  The object looked to me like a boomarang spinning so fast as to appear as a solid disc, but it may have actually been solid, I don't know.  I chose to classify it as circular instead of disc because I don't believe it was very thick at all.  My friend still remembers this event today, which is at least 42 years later.   This may have occured in either 1965, 1966 or 1967. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD)) ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/070/S70060.html",
      "state": "IN",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b9977",
      "summary": "large bright  burning slow moving white light at dawn",
      "city": "washington",
      "shape": "light",
      "date": "2009-06-09T00:00:00",
      "story": "large bright  burning slow moving white light at dawn I was looking east in the horizon at about 545 on the 13th of May, a large white light appeared, the moon was still up and to the right and the light was about one forth the size of the full moon, it was traveling towards me at what appeared to be 400-500 feet, at lasted about 45 seconds to one minute and then went out instantaneously, at first I thought it was possibly a search light but after the light disappeared there was nothing there, the sun was about to rise and this light still shone brightly in the sly like something entering the atmospere.",
      "link": "http://www.nuforc.org/webreports/070/S70078.html",
      "state": "NC",
      "duration": "about one minute"
    },
    {
      "_id": "64d005f478aba2ec5a3b9c4a",
      "summary": "luminous craft with halo's in slow flight over the rooftops of the buildings",
      "city": "washington",
      "shape": "sphere",
      "date": "2010-05-12T00:00:00",
      "story": "A friend and I went behind \"Ben's Chili Bowl\" In NW DC,   He was interested in my D700 Nikon.  I took 5 random pictures, one with daylight color balance, the next 4 with tungsten light balanced filters, variation in exposures, however; in each were luminous craft with halo's in slow flight over the rooftops of the buildings I photographed for the cameras demonstration* I took each image from the same POV and with a fixed focal lens (50 mm).   The objects in sequence are in motion.  Taken at 20000 ISO (1/80th of a second -1/30th of a second exposures.  In each the objects are luminous and in different positions.  I have them in other samples**taken this night*  http://www.facebook.com/home.php#!/photo.php?pid=3941017&id=783309194",
      "link": "http://www.nuforc.org/webreports/075/S75307.html",
      "state": "DC",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3b9d7b",
      "summary": "A bright, flashing, possibly immobile object that seemed large and whose flashing obscured the emitting object.",
      "city": "washington",
      "shape": "flash",
      "date": "2009-12-12T00:00:00",
      "story": "A bright, flashing, possibly immobile object that seemed large and whose flashing obscured the emitting object. At around 7:35, witness 1 saw a bright flashing light that was brighter than every other light we could see.  It seemed to be very large, and the light obscured the object that emitted it.  The object was high up, and might have been moving, but it was hard to see.Then we lost sight of it.",
      "link": "http://www.nuforc.org/webreports/073/S73506.html",
      "state": "AR",
      "duration": "5-10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3ba073",
      "summary": "The object looked like top of a heart shape and was very large and appeared to make no noise and also had no patter",
      "city": "washington",
      "shape": "other",
      "date": "2009-04-14T00:00:00",
      "story": "The object looked like top of a heart shape and was very large and appeared to make no noise and also had no patter I was looking up at the sky and i saw a shadow going through the sky. I thought at first that it was a giant bird of some kind but then i realized it was too large. It looked like a lower case m or the top of a heart shape. The had a sort of a white glow around its forward perimeter and was going quite fast yet made no noise. It appeared as if it were just gliding very smoothly through the air. I went inside to get my dad and told him i saw something odd in the sky and then he came out and i saw it again but he did not. It came around a 3rd time and he saw it and we though it may be a searchlight but it had no pattern and it was oddly shaped and then we though maybe a stealth bomber but it was the wrong shape and bird was out of the question so we were left with a ufo. We waited outside for about 10 more minutes but it never showed up again. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/069/S69305.html",
      "state": "DC",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3ba110",
      "summary": "Daytime sighting of bright light changing to stationary white/blue gray annulus and then moved very fast.",
      "city": "washington",
      "shape": "disk",
      "date": "2008-07-05T00:00:00",
      "story": "Daytime sighting of bright light changing to stationary white/blue gray annulus and then moved very fast. Weather: Temperature (est) upper 80s/low 90s), humidity (dew point 60s), wind light, clear sky with patch of high level cirrus to north east.  Air craft contrails moderate to short with definite gaps in trail. Narrative: I was sitting on a lounge chair located in the patio shade attempting to read a novel as I played with my granddaughter and a neighbor’s child.  They were interested in how the chair could change positions as I relaxed so they were tilting me to and fro.  My grandson was off exploring around the corner of the house. I observed a contrail passing from North to South as an aircraft flew along the usual flight path to the west of Washington.  This contrail was short to moderate in length as it evaporated into the dry upper-level air.  The next aircraft observed along that path did not pass until after 1700 hours.  Length of contrails depends upon humidity level of the surrounding air and there were definite long gaps in these contrails. As I looked at the contrail and the aircraft started to disappear behind a nearby tree, my attention was drawn to a bright light very slightly above the contrail.  I assumed this light to be caused by the sun reflecting from another aircraft.  As I looked at the light source, its position in the sky relative to the contrail did not change.  Thus it could not have been caused by reflection from another aircraft. Nor could it have been caused by reflection from a satellite.  Both sources would have moved relative to the contrail. Shortly the apparent position relative to the still existing contrail changed from above to below the contrail.  Time for this change from the initial was estimated in the neighborhood of 30 to 60 seconds.  I noted that the light was now an object that appeared to be similar to a high flying balloon such as those used for upper air studies.  So my next guess at the cause of the bright light that I first noticed was a reflection from the instrument package.  Thus I arose from my lounge chair to call my grandchildren so that I could show them the balloon. The object now appeared against the blue sky background as a white/blue-gray annulus with a darker blue-gray center. It was much larger than the original light source.  Relative size can be compared to that of a pea (3-5 mm) held at arms’ length.  From my viewing angle I assumed that it was a round object with a flat bottom since it appeared elliptical.  Color and shading was consistent with light shining through, not reflecting from, a high flying polyethylene balloon.  Brightness was similar to that of the moon which was in the eastern sky on that day.  The moon in the southern sky was hidden from my view by the roof of the home. I continued to view the object as it moved quite quickly for a short (relative) distance and stopped.  Upon this movement, I started to think that perhaps the object was much closer to me and that it could be some type of air borne seed (such as cottonwood) or debris moved about by low level winds swirling around the house.  Second thoughts occurred as I changed my position relative to nearby houses and trees.  This object had moved too fast for wind born insects, seeds or debris. As I continued to observe the object, it very suddenly accelerated and sped off eastward passing across my field of view from west to east behind the nearby rooftop in well under one second.  Total subtended angle of movement before moving out of my sight was in the 20 degree range.  No contrail or other evidence of its passing remained except the image in my minds eye. Altitude of this object cannot be estimated from this single observation since the size of this object is unknown.  Estimated angle above the horizon at first sighting is around 40 degrees.  The apparent standing still with respect to the contrail can be explained by the initial movement of the object directly toward me.  The object would have moved closer to me and toward the north as it descended below my reference contrail and become a recognizable shape.  From my viewing angle, the object was probably circular giving it somewhat of an elliptical \"cigar\" shape popularized by other UFO reports.  It moved too fast across my field of view to describe it better.  Total viewing time was 1.5 to 3 minutes.   This is estimated from my first sighting to my subsequent moving about to locate my grandchildren.  I certainly did not look at my watch during this event. Observer Background: Meteorology (retired) ((NUFORC Note:  Witness appears to us to be an exceedingly qualified observer.  PD))",
      "link": "http://www.nuforc.org/webreports/063/S63874.html",
      "state": "DC",
      "duration": "1.5 -3 min"
    },
    {
      "_id": "64d005f478aba2ec5a3ba0e2",
      "summary": "two star light object seen minutes apart moving slowly across the sky originating and ending at the same locaiton",
      "city": "washington",
      "shape": "light",
      "date": "2010-05-12T00:00:00",
      "story": "two star light object seen minutes apart moving slowly across the sky originating and ending at the same locaiton From a balcony looking ENE I was looking at a star in the sky when a second \"star\" appeared above it of about the same light intensity.  The intensity remained the same as it moved in a straight line at a slow rate of speed for about 5 seconds before disappearing.  It was not blinking and did not appear to be an airplane or a meteor.  My guess was that it was a satellite, except within a matter of minutes a second light appeared in precisely the same spot as where the first appeared, was of slightly greater intensity, and moved across the same path as the first before disappearing.  The possibility of two satellites on the same trajectory only minutes apart seemed odd.",
      "link": "http://www.nuforc.org/webreports/075/S75349.html",
      "state": "DC",
      "duration": "5 min"
    },
    {
      "_id": "64d005f478aba2ec5a3ba21c",
      "summary": "Sighting of a large flying sphere near our nation's capital.",
      "city": "washington",
      "shape": "sphere",
      "date": "2009-12-12T00:00:00",
      "story": "Sighting of a large flying sphere near our nation's capital. At around 11pm, my friend and I were walking back to campus through a field, we saw a bright light moving in the distance getting bigger by the second as it came closer.  When it came within about 50 yards, it became apparent that the light was a spinning sphere of many lights with a metallic surface.  It stopped abruptly and hovered for about 10 seconds and sped off again.  As it hovered, it emitted an almost inaudible hum that you could feel in the air.   After calming down from our sighting, we called the authorities to report what we had seen but they were not receptive.   After our experience, we found your organization on the Internet and decided to contact you in hopes of confirming our sighting.  Thank you for your time. ((NUFORC Note:  Source of report placed placed \"Washington\" in Pennsylvania.  We have corrected it above.  We spoke via telephone with the source of this report, and initially suspected that the call might be yet another prank telephone call from an American youth.  We may have erred in that initial suspicion, in which case, this may be a serious-minded report.  The written report appears to us to be composed in a responsible manner.  PD))",
      "link": "http://www.nuforc.org/webreports/073/S73630.html",
      "state": "DC",
      "duration": "one minute"
    },
    {
      "_id": "64d005f478aba2ec5a3ba304",
      "summary": "Glowing orb with sharp turns in Washington ,DC",
      "city": "washington",
      "shape": "fireball",
      "date": "2009-06-09T00:00:00",
      "story": "Glowing orb with sharp turns in Washington ,DC It was a humid night, a little hazy, you could see the moon and maybe one star. I was in Meridian Hill Park in NW Washington, DC.; looking at the sky around 9:30 pm I saw a strange light moving slowly across the sky heading South.  It abruptly made a 90 degree left to the East then after a while appeared to be lowering and faded out.  It looked like a large bright planet, a warm colored glowing orb. I couldn't tell how high up it was, but I think it was about 200ft when it faded out.   My friend who was with me had seen a diamond shaped UFO up close as a 10 year old and also seen others just like this one. It didn't seem to be moving that fast but did cover a large area in a short time.  It faded out what appeared to be near Howard Univeristy Hospital (or on 14th near Belmont st) to the north west of the Capitol. If anyone has any idea what that might have been, please let me know.",
      "link": "http://www.nuforc.org/webreports/070/S70233.html",
      "state": "DC",
      "duration": "4 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3ba555",
      "summary": "Very unusual sphere with multiple flashing colored lights, high in the southwestern sky.",
      "city": "washington",
      "shape": "sphere",
      "date": "2009-04-14T00:00:00",
      "story": "Very unusual sphere with multiple flashing colored lights, high in the southwestern sky. In the southwestern sky, high on the horizon, we watched for over two hours an object the size of 3 large bright stars that stayed in one position and flashed various colors of light such as white, red, green, turquoise, and purple. With the naked eye, it was visible.  With a spotting scope,it was incredible. Small parts would pulsate with the same colors and break off the original just to reattach again. I contacted the county police, who referred me to the state police, who referred me to the FAA, and the local TV station.  All were very unconcerned.  The gentleman from the FAA did say he heard on the news there was supposed to be \"some sort of event\" in the southeastern sky in the Boston area, but he didn't know anything more.  It's very frustrating to try to convince anyone especially the police, to just step ouside their vehicle and look up!",
      "link": "http://www.nuforc.org/webreports/069/S69495.html",
      "state": "ME",
      "duration": "2 + hrs"
    },
    {
      "_id": "64d005f478aba2ec5a3ba548",
      "summary": "Ball of flame moving toward earth, seemed to bounce off and turn south",
      "city": "washington",
      "shape": "oval",
      "date": "2008-07-05T00:00:00",
      "story": "Ball of flame moving toward earth, seemed to bounce off and turn south Round ball of flame in southern sky moving toward earth at a high rate of speed. Then seemed to bounce off and make a relatively sharp turn upward and to the south.  Several aircraft, totally unrelated to the event, flew by in the next 15 minutes and the altitude of those craft seemed high than the ufo.   I have never seen anything like this before.  Object was observed by myself and my wife. We are both college grads. I am retired and my wife is self employed.",
      "link": "http://www.nuforc.org/webreports/063/S63995.html",
      "state": "PA",
      "duration": "4 seconds +_"
    },
    {
      "_id": "64d005f478aba2ec5a3ba61e",
      "summary": "A green colored sphere appeared out of nowhere and fell straight to the ground",
      "city": "washington",
      "shape": "sphere",
      "date": "2009-01-10T00:00:00",
      "story": "A green colored sphere appeared out of nowhere and fell straight to the ground As I was driving eastward on the Capital Beltway (I-495) in the vicinity of Silver Spring, MD I saw in the sky to the Northest of Washington DC a green colored sphere.  I saw it for only a second, it seemed to appear out of nowhere and then immediately drop straight to the ground.  It looked extrememly large, and I fully expected to hear or see an explosion when it reached the ground.  I didn't see any such explosion.  I kept looking to the sky as I was driving and when I looked back at the road, I saw I was beginning to swerve out of my lane.  Several other cars ahead of me where also swerving out of their lanes as if they were also watching the sphere.  I heard no sounds during the sighting.",
      "link": "http://www.nuforc.org/webreports/067/S67826.html",
      "state": "DC",
      "duration": "split second"
    },
    {
      "_id": "64d005f478aba2ec5a3baf45",
      "summary": "The news caster seen it also, then shut up. I saw it plain as day.",
      "city": "washington",
      "shape": "disk",
      "date": "2011-03-10T00:00:00",
      "story": "The news castor seen it also, then shut up.  I saw it plain as day. Watching WCTV Channel 6, Tallahassee FL., news cast of President Obama's Ingrauation, you could see it fly behind the Washington Monument from a shot from behind the President. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD)) ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/080/S80356.html",
      "state": "DC",
      "duration": "1 min"
    },
    {
      "_id": "64d005f478aba2ec5a3baf8e",
      "summary": "I saw Two ufo object's over the Washington Monument during the 4th. of July events.",
      "city": "washington",
      "shape": "circle",
      "date": "2010-08-24T00:00:00",
      "story": "I saw Two ufo object's over the Washington Monument during the 4th. of July events. I was watching fireworks from my apt. window  with friends and taking photo's of the fireworks, and noticed to the left above the Washington Monument, to the left were two luminus objects while taking photo's.",
      "link": "http://www.nuforc.org/webreports/077/S77103.html",
      "state": "DC",
      "duration": "2mn."
    },
    {
      "_id": "64d005f478aba2ec5a3bb070",
      "summary": "Moving star with beam of light",
      "city": "washington",
      "shape": "sphere",
      "date": "2010-08-24T00:00:00",
      "story": "Moving star with beam of light My wife and I went out to walk the dog.  While out we all saw a slow moving bright star!  I thought it was strange, the dog would not look away, and became agitated afterwards?  But what we think we saw, left us floored!  The damn thing emitted a tube of light.. I think Z saw red lights around it or moving away from it.   My wife does not want to talk or have me make this report, so please do not post my name!   I did not believe in UFO's until I saw this light!  Kirk to Enterprise: Beam me up? ((NUFORC Note:  Witness elects to remain semi-anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/076/S76930.html",
      "state": "DC",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bb06f",
      "summary": "\tI live in Wash., D.C. For weeks I had observed a bright luminous celestial body in the sky I couldn’t identify. The object would rise",
      "city": "washington",
      "shape": "light",
      "date": "2010-08-24T00:00:00",
      "story": "I live in Wash., D.C.   For weeks, I had observed a bright luminous celestial body in the sky I couldn’t identify.  The object would rise in the east and proceed in a westerly direction.  I was pretty certain that it was not Sirius and it shown so brightly that it had me captivated and perplexed.  I mentioned it to an acquaintance who happens to be a professional photographer and \"UFO Hunter.\" On the morning of July 20, 2010, I called him at 3:00 am and asked him to go outside and take photos of the \"star\" so that we could figure out what it was.  It was larger and brighter than any star I’ve ever seen; even Venus. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/076/S76932.html",
      "state": "DC",
      "duration": "nightly"
    },
    {
      "_id": "64d005f478aba2ec5a3bb0c9",
      "summary": "I saw a silver metallic ball fly over my house in Wash., D.C. in broad daylight!",
      "city": "washington",
      "shape": "",
      "date": "2010-08-24T00:00:00",
      "story": "I saw a silver metallic ball fly over my house in Wash., D.C. in broad daylight! On the morning of July 28, 2010 at 10:00am I was sitting in my back yard contemplating a conversation my son and I had then night before. It was a crystal clear, beautiful morning with very few clouds.  I looked up and saw approaching from the west in an easterly direction, a silver metallic ball slowly approaching.  It was as low in the sky as any commercial airplane is allowed in and over Washington D.C. Amazed, my first thought was to call my family, however, they were still asleep and I feared it would be gone by the time I got back.  I considered grabbing my camera but decided against it for the same reason.  As I sat gazing at this clearly visible metallic ball, I realized I had my cell phone on me. Unfortunately, my cell phone camera only works when I don’t want it to and as I attempted to photograph the object,  I couldn’t get it to work, to my frustration. It was probably due to nervousness.  The object was visible for at least 30 seconds and then when it was directly above my head,  it disappeared.  It didn’t zoom off or fly away, it disappeared!  The only reason I know it was 10:00 exactly is because after it disappeared my phone clock said 10:01am.  This is real!  It was the most beautiful thing I’ve ever seen, perfectly round, reflecting the sun on the side that was nearest the sunlight.  I know what I saw. It was real.  If I’m lying I pray my children drop dead now.  Something is going on in the nation’s capitol!",
      "link": "http://www.nuforc.org/webreports/076/S76934.html",
      "state": "DC",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bb570",
      "summary": "I was watching web-cams in Washington DC as The Agency had notified forums members on the 10th of Feb that they would fly their craft o",
      "city": "washington",
      "shape": "light",
      "date": "2011-02-18T00:00:00",
      "story": "I was watching web-cams in Washington DC as The Agency had notified forums members on the 10th of Feb that they would fly their craft over Washington DC on the 12th & 13th to prove that they exist. The craft hovered around the Capitol building to the Titanic memorial for nearly an hour. I captured the object on the W Washington Hotel web-cam. I will email the JPG to you. ((NUFORC Note:  We have looked at the photo, and the object is just a tiny dot of light.  The photo does not provide nearly enough information for us to conclude that the light is a genuine UFO.  PD))",
      "link": "http://www.nuforc.org/webreports/080/S80106.html",
      "state": "DC",
      "duration": "50 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bb5f8",
      "summary": "Hovering lights in western sky, Washington, Iowa",
      "city": "washington",
      "shape": "diamond",
      "date": "2010-08-24T00:00:00",
      "story": "Hovering lights in western sky, Washington, Iowa I was driving to work heading northbound and it was pitch black from the thunderstorm and to the east, there was lighting and I noticed a blinking light to the west, high up there and thought it was plane at first but this light stayed in one spot the whole time. Like it was hovering. I watched it the whole way to work which was about a 10 min drive, but my friend who also works at the same place saw the same exact thing on his way to work behind me about 15 minutes after me. It had red lights in a diamond/pyramid shape, but was blinking like an airliner plane.  I don't know if it was military or whatever...i'm sure there were things going on beyond what they let the general people know.",
      "link": "http://www.nuforc.org/webreports/077/S77096.html",
      "state": "IA",
      "duration": "30-45 mins didnt get to w"
    },
    {
      "_id": "64d005f478aba2ec5a3bb715",
      "summary": "Large white craft seen on 1-70W during morning traffic",
      "city": "washington",
      "shape": "unknown",
      "date": "2010-08-30T00:00:00",
      "story": "Large white craft seen on 1-70W during morning traffic On Saturday, August 21, 2010, I was driving to Wheeling, WV to attend a wedding.  At around 10:45AM, while approaching Washington, PA on I-70W, a large object in the northern sky caught my attention.  Since there was a bit of traffic and I was driving relatively slowly, I was able to observe the object for approximately 45 seconds. The first instant I saw it, I thought it must have been a very large, low flying jet of some sort, but further observation ruled that out.  The object was long, thin, tapered at each end, with a somewhat thicker section in the middle of the craft. It was a solid white in color and was flying at about 8 inches (visually) above the treeline.  It was at least five inches long at arm's length from end to end, and maybe about an inch maximum from top to bottom at the thickest part. Again, it appeared to be very large.  I could see that it was definitely gliding toward my general direction at a steady speed.  I could not distinguish the exact! shape of the craft as I was looking at an approaching object dead-on. In my opinion, it was probably a large disk or chevron-shaped craft.  There was no sound and I saw no contrail. It was very startling due to the size and nature of the object.  It was unlike anything I am familiar with seeing in the sky.  I was unable to see where it went after I drove past it. I know for a fact that several other people had the chance to see this object, as there were many vehicles on the road at the time, the object was quite noticeable, and traffic was moving relatively slowly.  I'm extremely curious to see if another witness might read this report and come forward with their own account.  Perhaps someone at a different vantage point was able to get a better view of the shape of the object.",
      "link": "http://www.nuforc.org/webreports/077/S77425.html",
      "state": "PA",
      "duration": "45 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bb85d",
      "summary": "Bright light rockets into space after gliding above myself and fellow companions.",
      "city": "washington",
      "shape": "light",
      "date": "2010-07-19T00:00:00",
      "story": "Bright light rockets into space after gliding above myself and fellow companions. A ball of light similar to the headlight of an airplane came cruising across the clear night sky.  As I joked to my companions that it was a UFO due to no flashing lights the craft began to raipdly climb higher into the atmoshphere.   Within seconds the bright light had disapeared.   What I thought I saw at first was an airplane until it made the unuasual climb and disapeared into the cloudless night sky.",
      "link": "http://www.nuforc.org/webreports/076/S76566.html",
      "state": "NJ",
      "duration": "1.30"
    },
    {
      "_id": "64d005f478aba2ec5a3bb84a",
      "summary": "Red flaming object flying low over Washington DC with no sound",
      "city": "washington",
      "shape": "fireball",
      "date": "2010-08-30T00:00:00",
      "story": "Red flaming object flying low over Washington DC with no sound At the indicated time, my wife and I observed what appeared to be a red flaming object heading over Northwest Washington DC.  We reside in a high rise building and lost sight of the object after about 2 minutes as it travelled over our building.   I was able to go onto the patio of our residence and could not hear any sound coming from the object.  It was moving at a pace consistent with air traffic , but was outside of the normal areas where we have previously seen air traffic and had no flashing lights that one would expect to see on a traditional aircraft.   The object was at an altitude that I would estimate at between 2,000 to 3,000 feet and appeared to be travelling parallel to the ground, not increasing or decreasing in altitude.  The object appeared similar to a rocket, although all that I was able to make out was the flame.  The flame was distinctly red and lacked the white or yellow colorations that I have seen when observing several shuttle launches! .   The object was heading towards the Potomac Maryland area.  The object was flying in a straight path. I am a financial services executive and have never previously reporting anything of this nature.  Given the security parameters in place in the Washington DC area, I would hope that someone would have information on this object.   I am reporting it in hopes that someone can provide me with an explanation of what this very unusual object was.  It was flying low enough that it should have emitted some type of sound and I was amazed that I could hear no noise at all.   Also the red coloration was very unusual.   Would appreciate any information.",
      "link": "http://www.nuforc.org/webreports/077/S77477.html",
      "state": "DC",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bb880",
      "summary": "Was photgraphing clouds and didn't see object until I was looking at the photos on my computer.",
      "city": "washington",
      "shape": "unknown",
      "date": "2010-08-24T00:00:00",
      "story": "Was photgraphing clouds and didn't see object until I was looking at the photos on my computer. I noticed a beautiful cloud formation to the south (towards the Grand Canyon) at dusk while standing at my kitchen sink.  Decided to run and grab my wifes Canon Rebel XST camera so I could get a few shots of the clouds using a zoom lens.  I was bare footed and climbed on some small landscaping rocks near the pool to get higher so the block fence wouldn't be in the way.  I took a total of eight photos within less than two minutes.  When I downloaded the photos I noticed the first four had an object moving through the photos at a downward angle to the left.  I seemed to be fairly distant as I never saw it with my eyes.  It probably only took me 30 or 40 seconds to take the first 5 or 6 photos because the rocks were hurting my feet and I wanted to get down to the pool deck where I took about two more.  I showed my wife and she thought I might have had something on the lens. If I did it came off quick because the last four photos do not show the object.  I zoomed in on ! the photos to see if I could detect a shape. Two looked oval and the other two appeared to have a saucer shape.  I have no idea what it is but it is strange and I don't think anything was on the lens.  I have the unalterd photos if you want them.",
      "link": "http://www.nuforc.org/webreports/077/S77364.html",
      "state": "UT",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bb917",
      "summary": "In June 19 while on vacation in Washington CD with my wife I took a photo of this sighting by chance. We didn't know of the UFOs until",
      "city": "washington",
      "shape": "disk",
      "date": "2010-07-29T00:00:00",
      "story": "In June 19, while on vacation in Washignton CD, with my wife I took a photo of this sighting by chance.  We didn't know of the UFOs until my sister called me in July 25 to tell me about this photograph which it was part of the vacation photos I downloaded to her computer.  I have photo and be glad to share it upon request.",
      "link": "http://www.nuforc.org/webreports/076/S76846.html",
      "state": "DC",
      "duration": "unknown"
    },
    {
      "_id": "64d005f478aba2ec5a3bb8f4",
      "summary": "At 03:18 AM I was called to take a look at a bright object, by a friend. I went outside with my camera and camera platform (tripod) and",
      "city": "washington",
      "shape": "sphere",
      "date": "2010-07-28T00:00:00",
      "story": "At 03:18 AM I was called to take a look at a bright object, by a friend.   I went outside with my camera and camera platform (tripod) and fired 10 continuous frames of what I thought to be bright \"stars\"/planets?    After taking the images I went back into my home and transferred the HD data.  The 10 frames in sequence showed 1 constantly stationary star, and another object moving (vectoring) in the air in 1/4 inch increments (the object was moving fast!!) slightly deviating from its forwards trajectory*.   In the 10th frame..the object emitted what looks like a plasma beam!  The samples are most extraordinary*   Series analysis performed by Dr. Bruce Maccabee & W Allen ((NUFORC Note:  Photos were forwarded by the source of the report, who is well known to NUFORC.  The object in the photo is not inconsistent with the appearance of Jupiter, but we do not know what the object is.  PD))",
      "link": "http://www.nuforc.org/webreports/076/S76739.html",
      "state": "DC",
      "duration": "3 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bbb1c",
      "summary": "2 luminous objects  over Washington Monument July 4, 2010",
      "city": "washington",
      "shape": "sphere",
      "date": "2010-07-06T00:00:00",
      "story": "2 luminous objects  over Washington Monument July 4, 2010 4th of July fireworks @ the Washington Monument, I was filming the fireworks display against the backdrop of the Washington Monument.   I set my camera to fire in continuous mode and fired 1140 frames from a stationary platform (tripod).   In 1 frame in the sequence of 1140 images, are 2 luminous objects?  These anomalies only appeared in 1 frame, so I looked at several frames before and after this one frame, and there is nothing?    I put all the HD frames in Combustion and generated a continuous motion sample of this event.  Upon analysis of the anomalies, there is some blur associated to motion however it seemed to be hyper dimensional, just in its attributes in this one sample.   This is not the first time I imaged this anomaly?   Imaged in HD using Remote Controlled D700 Nikon on a stationary platform (tripod).    All images taken in continuous sequence mode",
      "link": "http://www.nuforc.org/webreports/076/S76130.html",
      "state": "DC",
      "duration": "1 second"
    },
    {
      "_id": "64d005f478aba2ec5a3bbf5b",
      "summary": "Luminous object thought to be a star?",
      "city": "washington",
      "shape": "cylinder",
      "date": "2012-01-12T00:00:00",
      "story": "Luminous object thought to be a star? Taking random sky scans using 200 mm F 2.8 lens @ 20000 ISO, I decided to take stationary platform shots of the stars on a relatively clear night.  I fired 23 continuous frames in high speed mode using a RC D700 Nikon.  I focused on the stars and started taking a series of rapid fire images.  I had to focus on a star, and set the lens to manual, then start the burst of frames with the remote control.   When I loaded the data into the computer, one of the objects thought to be a star was in motion.  The samples show the object, though in a straight flight trajectory, the frames show this object was sweeping, each exposure sample showed a different flight angular positioning of this object relative to the stars around it.  I have 19 continuous frames showing this object taken from a RC camera*  It was luminous like the stars*, and way up in the sky, it would not have been visible by the human eye*",
      "link": "http://www.nuforc.org/webreports/085/S85909.html",
      "state": "DC",
      "duration": "4 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bc650",
      "summary": "22:55 U.S. eastern  From a third floor balcony facing Northwest, observed a bright red-orange light that I thought at first was a Chine",
      "city": "washington",
      "shape": "",
      "date": "2011-12-12T00:00:00",
      "story": "22:55 hrs. (U.S. eastern) From a third floor balcony facing Northwest, observed a bright red-orange light that I thought at first was a Chinese lantern, but on further observation I could not tell what it was.   It appeared to move in directions inconsistent with the prevailing wind, and instead of burning out, looked like it took off for high altitude and was still visible at apparently pretty high altitude and far distance.   Observed from near geographic middle of Washington, DC, looking Northwest.   Object was first visible apparently above city, then moved quickly to the North.   Estimated time of observation, about a minute.",
      "link": "http://www.nuforc.org/webreports/085/S85705.html",
      "state": "DC",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3bc808",
      "summary": "Me and my friend was watching the moon then we saw Three saucers or disks with three lights on it one was white and there were a red an",
      "city": "washington",
      "shape": "disk",
      "date": "2011-08-21T00:00:00",
      "story": "Me and my friend was watching the moon then we saw three saucers or disks with three lights on it one was white and there were a red and blue one that would blink on and off continuesly.   Two of the crafts were stationary and one was moving what looked like torwards the moon then it disappeared.  the one west of the Moon disappeared around 11:20p.m then the one East of the moon started shooting faded blue lights off of it around 11:22p.m then the one moving flew fast next to the one and slowed down and stopped next to the one East of the moon then disappeared a few minutes later.  Then at twelve it did nothing further so we went back into the our house.",
      "link": "http://www.nuforc.org/webreports/083/S83046.html",
      "state": "PA",
      "duration": "27 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bc974",
      "summary": "Saw three lights in triangle shape on Van Dyke Expressway that shot straight down in a fast time.",
      "city": "washington",
      "shape": "triangle",
      "date": "2011-10-19T00:00:00",
      "story": "Saw three lights in triangle shape on Van Dyke Expressway that shot straight down in a fast time. Driving north on the Van Dyke Expressway.  Saw three round lights in the shape of a triangle in the sky that shot straight down in about 2 seconds.  Possible small blue light at the back of the object.  Object was very fast.",
      "link": "http://www.nuforc.org/webreports/084/S84588.html",
      "state": "MI",
      "duration": "2 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bc9a6",
      "summary": "((HOAX??))  Saw hover triangle with eight lights in D.C.",
      "city": "washington",
      "shape": "triangle",
      "date": "2011-07-17T00:00:00",
      "story": "Saw hover triangle with eight lights in D.C. My friend and I, while on vacation, were out smoking on the balcony of our hotel room and we saw a large triangle with eight lights hover far up in the sky. ((NUFORC Note:  Our suspicion is that this may not be a serious-minded report.  Just a guess.  PD))",
      "link": "http://www.nuforc.org/webreports/081/S81353.html",
      "state": "DC",
      "duration": "on going"
    },
    {
      "_id": "64d005f478aba2ec5a3bc9c4",
      "summary": "I saw 7 metallic disk type hovering above the Washington monument. There were 7 total at one point.  Two were on the left side hovering",
      "city": "washington",
      "shape": "disk",
      "date": "2011-07-17T00:00:00",
      "story": "I saw 7 metallic disk type hovering above the Washington monument.  There were 7 total at one point.  Two were on the left side hovering and moving super fast to the left and returning towards the cupola of the monument at a lower speed.  The ones on the right had a semi-circle formation and were moving very slow maintaining the formation.   It was strange because I saw them when the sun was creating like an eclipse because it was behind the very top of the monument.   As I was watching, there was a kid who asked his father what were those objects.   When he asked his dad if he saw the objects, I immediately responded like he was talking to me.   I have a photo of a light that in another frame appears as having symmetrical shape that looks like a saucer.  I did not know it was there until I was showing the photos to my wife's aunt and uncle.",
      "link": "http://www.nuforc.org/webreports/082/S82458.html",
      "state": "NY",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bca23",
      "summary": "My family and I saw something fly over head silently and without lights.",
      "city": "washington",
      "shape": "cylinder",
      "date": "2011-07-17T00:00:00",
      "story": "Parked on 14th street bridge during fireworks display, my family and I saw something fly over head silently and without lights.  It was black or carbon, and we all watched this object fly over.   Can anybody tell me whats up or if anyone else saw something?  I am in the US Military and have never seen anything like that.   I do not wish to be contacted or named ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  One of six reports from same source.  PD))",
      "link": "http://www.nuforc.org/webreports/082/S82403.html",
      "state": "DC",
      "duration": "2 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bca80",
      "summary": "Black cylinder zips through Fireworks.at the Washington Monument",
      "city": "washington",
      "shape": "cylinder",
      "date": "2011-07-17T00:00:00",
      "story": "Black cylinder zips through Fireworks.at the Washington Monument I filmed the fireworks from the base of the Washington Monument, using a camera with remote control, on a tripod.  I took 1500 frames. In 6 frames 6-7 minutes into the show, a black cylinder darts through the frame and is imaged in 5 frames (1.5 seconds) of action.  As the object punched  holes in the smoke of the fireworks exploding?  5 frames of incredible.",
      "link": "http://www.nuforc.org/webreports/082/S82325.html",
      "state": "DC",
      "duration": "1.5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bca82",
      "summary": "At approx. 1:00am something caught my eye it was a clear night you could see all the",
      "city": "washington",
      "shape": "changing",
      "date": "2011-07-17T00:00:00",
      "story": "at aproxamitly 1:00 am i was leaving my bedroom to go downstairs when something caught my eye  it was a clear night you could see all the stars and and there was something different in the sky i dont know what it was it was fairly large and hovering about a mile from my house it had 5 lights then it would change to 3 in the shape of a triangle and they would change color they were different from any lights i have ever seen on a aircraft it changed shape several times lights were red green purple white and yellow i have seen this object twice in july moving towards pittsburgh pa i dont have a camera but my fiance has seen it as well it makes eradic movements and brighter than any stars in the sky that is what cameracaught my eye it made no sound could not have been a helicopter but one did fly by my house and i saw commercial airplanes and they looked nothing like the object an i have seen it twice since the beginning of july",
      "link": "http://www.nuforc.org/webreports/082/S82282.html",
      "state": "PA",
      "duration": "2 hours"
    },
    {
      "_id": "64d005f478aba2ec5a3bca6f",
      "summary": "while watching the debt debate on cnn news channel we witnessed an ornage sphere flying over the capital during an commercial break on",
      "city": "washington",
      "shape": "sphere",
      "date": "2011-08-07T00:00:00",
      "story": "while watching the debt debate on cnn news channel we witnessed an ornage sphere flying over the capital during an commercial break on live tv this happend at 7:30 pm ((NUFORC Note:  We have amended the time above to reflect 7:30 p.m..  PD))",
      "link": "http://www.nuforc.org/webreports/082/S82877.html",
      "state": "DC",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bcc3f",
      "summary": ";@ Approx 9:45 pm tonight my wife and I were sitting on our deck.",
      "city": "washington",
      "shape": "triangle",
      "date": "2011-07-04T00:00:00",
      "story": ";@ Approx 9:45 pm tonight my wife and I were sitting on our deck. Heard fire works going off in our Subdivison.  I look to the South and saw through the trees and saw what i thought was an orange \" hanging firework\" it kept rising through the trees and i told my wife (that sure is hanging a long time)  then it came out of the sight of the tree and we could make-out an 'orange 'triangular light\". We started yelling @ our daughter & friend to come to wittness this they made it out and as it traveled North it made no sound and suddenly disappeared. ????? ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/082/S82061.html",
      "state": "MO",
      "duration": "2:00"
    },
    {
      "_id": "64d005f478aba2ec5a3bcc32",
      "summary": "Shape-shifting craft viewed over Washington, Michigan",
      "city": "washington",
      "shape": "changing",
      "date": "2011-07-06T00:00:00",
      "story": "shape-shifting craft viewed over Washington, Michigan The objects seen constantly shifted shape and looked like it was made of plasma.  It looked as if it were wheels of plasma within wheels.   The two silent craft flew slowly forward then took off in the north direction and disapeared behind the tree line.   The 2 craft seemed to have a mind of there own.  One craft was red and one was orange.  One of the observers was a lawyer, one had no job and two were only children.",
      "link": "http://www.nuforc.org/webreports/082/S82233.html",
      "state": "MI",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bcfe2",
      "summary": "Elongated and flattened \" dome,\" with 1 bright light, hovers and darts like dragonfly, D.C. Mall, July 4th 1997",
      "city": "washington",
      "shape": "other",
      "date": "2012-08-05T00:00:00",
      "story": "elongated and flattened 6\"dome,\" with 1 bright light, hovers and darts like dragonfly, D.C. Mall, July 4th 1997 I've decided that I should finally share something that I and my friend and at least one other person saw over 10 years ago. It's something to add to your database so that it could perhaps be correlated to other incidents.  Please note that I'm actually not certain that this happened on Independence Day 1997; it may have been Independence Day of 1996.  But my friend and I have talked about this event many times since then, and we're 80 percent sure it was 1997. I'm a D.C. metro area educated professional, in my mid 30's. I've long been interested in both aviation and astronomy, and know quite a bit about each.   I'm generally a very skeptical, practical and evidence-oriented person, and until the moment of this sighting, I would not have given the UFO topic the time of day.  But there were multiple witnesses to this event, so I can't simply dismiss it, and yet I also can't explain it in any conventional way. My friend and I had been to the National Mall in Washington D.C. to view the 4th of July fireworks. We had taken the Metro rail into the city, were there at The Mall all day, watched the fireworks, and they had recently ended.  We had not consumed any alcohol. The crowd there had been huge, obviously, so we waited a bit for the masses of people to thin out instead of trying to sardine ourselves onto a Metro car.  This incident therefore must've occurred around 11p.m. We were walking on the Mall on the eastern side of Washington Monument, headed west, toward the northern-most entrance to the Smithsonian Metro station.  We were not far at all from the entrance, certainly within 100 feet, when we first saw this small object.  We have always referred to it as the \"dragonfly UFO\"  (Googling that phrase now, I see it has its own meaning in UFO circles.  But what we saw looked nothing like that infamous hoax.)   This object was to our left, slightly above eye-level, and I'm certain it was within 15 feet of us for this 30-second duration, and at several moments probably less than half that distance.  It was about 6 inches at its longest, and it darted and hovered the way a dragonfly or hummingbird might, with extremely quick and abrupt stops and starts. Like gravity and inertia were barely an inconvenience.  It would be hovering for a handful of seconds, and then in almost an instant it would zip over and be hovering several feet away.  We saw this particular movement probably 5 or 6 times.  The object was definitely intelligently controlled, as it seemed interested in the people in the area. It made no sound whatsoever, and given this thing's proximity to us we should have heard something. (Even considering the background noise.) It was just astounding to see. The object consisted of two main parts: a very bright main light up above, and underneath that a handful of inches was a slightly illuminated, metallic-looking dome.  Like a slightly flattened and elongated top half of a softball.  But I'm less certain of that aspect, since it was hard to see past the object's upper main light.  That light was a very bright, with a yellowish and brilliant glow, facing forward from what I perceived to be the object's front. The most interesting feature of this object, to me -- what I could see since it was slightly lower than the 'body' (itself below the main light) -- was that there seemed to be two small, slightly yellow and luminescent areas of \"haze\" underneath the central area, the area where wings should've been. This haze reminded me of the heat that rises a few inches from black asphalt on a hot summer day, but it was more intense and turbulent -- finer, in a sense.  These hazy areas were basically spherical and not very large -- maybe 2 or 3 inches -- sitting just below the body. When the object left, about 30 seconds after we first saw it, it flew towards our front left (south to southwest) very rapidly, and in a basically flat trajectory.  This would be towards what is now the Whitten Building.  It left at a speed of probably 80-100 mph, but it reached this speed very quickly, in only a second or maybe slightly more.  And one thing I specifically remember extremely clearly is that this object, when hovering and darting, did not have to yaw or turn in any way to accommodate the direction in which it was about to fly.  Knowing aviation as I do, this struck me as particularly odd. So, standard fixed- or rotor-wing flight principles were not at work here.  They just weren't.   This object clearly was not flying aerodynamically, or based on standard lift, and yet I'm confident it was intelligently controlled.  Its near instantaneous stopping and starting, the lack of sound, the unique brilliance of the top light... it was amazing.  As strange as it sounds and as! hard as it has been for me to come to terms with, I simply cannot imagine that this object was manufactured by humans. I know that many people had to have seen this object that night. I'm amazed that I've not been able to find any similar reports. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/090/S90895.html",
      "state": "DC",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bd18b",
      "summary": "Luminous spheres in flight, then suddenly vanishing into nothingness",
      "city": "washington",
      "shape": "sphere",
      "date": "2012-08-05T00:00:00",
      "story": "I generally film the fireworks at the Washington Monument, and setup a static HD motion picture camera in a fixed position.  Periodically, I would start and stop the video to check the video quality.  In one sequence of film, are luminous spheres, modulating in color (red/green), and in a formation.  The video captured the objects until they suddenly vanish one, by one, into the sir.  The objects are consistent with objects imaged over the US Capitol Building July 16, 1952. This is most spectacular video!  It shows these objects leaving (ascending) from a river, based on the camera POV in regard to the monument.  The film analysis shows luminous spheres in flight, then suddenly vanishing into nothingness.  Camera recorded HD video which is very unusual and showing objects with uniform consistency cloaking (vanishing) from screen.",
      "link": "http://www.nuforc.org/webreports/090/S90706.html",
      "state": "DC",
      "duration": "5.5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bd373",
      "summary": "Two lights/objects over DC with quick, erratic movements",
      "city": "washington",
      "shape": "light",
      "date": "2012-08-05T00:00:00",
      "story": "Two lights/objects over DC with quick, erratic movements Approximately an hour after the fireworks in DC had ended, we observed a high altitude object with erratic movements.  Far too erratic to be an airplane, and moving too quickly to be a weather ballon.  The object stayed in the same general area and moved back-and forth several times for a few minutes.  A second object similar object appeared close-by after a few minutes with the same erratic movements.  Did anyone else see these strange lights over DC?",
      "link": "http://www.nuforc.org/webreports/090/S90947.html",
      "state": "DC",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bd440",
      "summary": "6 fireballs in slow succession, moving north to south",
      "city": "washington",
      "shape": "fireball",
      "date": "2012-05-13T00:00:00",
      "story": "6 fireballs in slow succession, moving north to south I stumbled upon this site by accident and realized my family and I witnessed the same objects that were reported in Greenwood, IN on the same night. If I had thought to check this site then, I would have reported sooner. UFO's aren't my thing but this was darned odd. I am a technology professional. I don't have time for UFO's and little green men.  About 45 minutes before fireworks were due to begin, my wife, my two kids and I were out in the front yard playing and waiting for darkness to fall so we could watch the fireworks our town puts on every year. Our yard has a spacious view of the skies to the north and west. As my infant son played in the bed of my pickup truck, I was intrigued when I noticed a single, bright ball of light moving very slowly southward from the distance in the northern sky. It took several minutes for the light to reach our position but slightly west of us. As it came closer, it almost seemed as if it was made of fire, like a campfire moving through sky?! Since there were no clouds, I was unable to determine any kind of altitude. As I watched it continue to move southward, it seemed to slowly fade out and disappear completely. I could see the lights and vapor trails of airplanes higher up but not this object.  As fascinating as that object was, I was completely astounded when I witnessed five more objects, traveling nearly the same trajectory, one by one in succession, cross the evening sky in the same general direction, that is, north to south. The last object traveled out of the north, moving directly south and ended up to the east of our position. They all took approximately 5 to 7 minutes to traverse the sky.  My first thought was that these were some kind of rocket tests as we are near Crane Naval Weapons Station. But I never found any news articles stating that there would be tests. I eliminated the possibility of chinese lanterns simply because of their trajectory. I didn't have a video capture device at the time so I was unable to get footage.  One idea I had was to look back and see what the wind patterns were on that night, but I am unable to find any data on this.  I hope this information is helpful to someone.",
      "link": "http://www.nuforc.org/webreports/088/S88882.html",
      "state": "IN",
      "duration": "30"
    },
    {
      "_id": "64d005f478aba2ec5a3bd831",
      "summary": "3 objects in 15 minutes, 2 balls of light moving north to south and 1 shape changing white &quot;ball&quot; moving in same direction",
      "city": "washington",
      "shape": "changing",
      "date": "2012-08-19T00:00:00",
      "story": "3 objects in 15 minutes, 2 balls of light moving north to south and 1 shape changing white &quot;ball&quot; moving in same direction On Wednesday 7/25/12 I was walking home from a friend’s house at about 9:30pm.  I was passing a school located at Rhode Island Ave. & Q St. NW.  Coming from behind the school, I saw a bright light high up in the sky moving south to north.  At first it looked like an airplane because it was moving in a slow, slight line.  But the more I looked at it the less it looked like an airplane.  The light had an orange color to it and was getting brighter and then dimmer over and over again.  As it passed overhead, it started to dim and then finally disappeared altogether. Right before the light disappeared, another light came from behind the same school.  This second light was completely identical to the first in its flight path, speed and quality of the color.  It also dimmed and then disappeared at the same place in the sky as the first one did.  It’s difficult to estimate how far each one traveled as I watched them.  But they were far up in the sky so they easily could have covered 1,000 feet of distance. Neither of these objects made any noise.  For a second I thought they might have been helicopters because I heard a helicopter motor just as the second one was disappearing.  But then I realized that they weren’t because the helicopter noise was coming from behind the school (the south – where the object had just come from).  In fact I briefly saw the lights of the helicopter come from behind the school to confirm what I was thinking.  It didn’t follow the flight path of the lights as far as I could tell. I continued to walk and got to my street within about 10 minutes.  As I was walking down my street, I looked back in the general area in the sky where I had seen the two lights.  To my surprise I saw a third object that was completely different than the first two.  While the first two objects were high up like an airplane, this object was lower, about the height of a low flying helicopter.  It was moving in a straight line from south to north.  It’s difficult to describe its appearance because it had no discernible features.  If you can imagine a large plastic grocery bag (about the size of an SUV) flying through the air and changing shape in the wind, that’s how it looked.  Unlike the first two objects, it didn’t have any kind of light to it.  It was a white object that was visible due to the ambient light of the city.  It made no noise even though it was not too far over the rooftops.  I watched it travel for about 500 feet until the trees of my neighborhood obscured my vi! ew.",
      "link": "http://www.nuforc.org/webreports/091/S91507.html",
      "state": "DC",
      "duration": "10-15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bdc75",
      "summary": "Perfectly vertical streak of light",
      "city": "washington",
      "shape": "other",
      "date": "2012-07-04T00:00:00",
      "story": "During an electrical storm 6-22-2012 at 20:01 PM, I filmed an object which registered as a perfectly vertical streak of light through the image area of 1 frame in video filmed @ 24 frames per second at a shutter speed of 1/8000th of a second.  Whatever it was, it was luminous against the clouds, and left a perfectly straight horizontal luminous impression in this one frame of action within the video stream. Imaged using HD 1920 x 1080 video.  I have never seen anything like this!",
      "link": "http://www.nuforc.org/webreports/090/S90045.html",
      "state": "DC",
      "duration": "1 ML sec"
    },
    {
      "_id": "64d005f478aba2ec5a3bdcbb",
      "summary": "At about 3:00 am I was watching out my window, which faced East. I noticed a very bright ball of light passing from North to South. It",
      "city": "washington",
      "shape": "light",
      "date": "2012-05-13T00:00:00",
      "story": "at about 3:00 am I was watching out my window, which faced East.  I noticed a very bright ball of light passing from North to South.  It was traveling about 30 to 40 mph.  Passing behind trees that were in front of it.  As I watched it did not speed up or down.  It did pass behind the school top floor.  And repeared on the other side.  For a few seconds.  And was lost due to our building wall.",
      "link": "http://www.nuforc.org/webreports/088/S88540.html",
      "state": "DC",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bdd09",
      "summary": "6 glowing objects fly near roof. (reoccuring)",
      "city": "washington",
      "shape": "light",
      "date": "2012-08-19T00:00:00",
      "story": "6 glowing objects fly near roof. (reoccuring) On two separate occasions I witnessed glowing objects in flight that ranged in size from firefly size to navel orange size. The first sighting happened Tuesday August 7, 2012 at approximately 11:30 pm. I was sitting on the deck with my friend and about 60 yards away in the distance we saw glowing objects flying right above a 2 story house in front of the chimney.  From what I could tell, they were round, or spherical objects that could change their size.  At the very least they would appear to be the size of a firefly but much brighter, and at times the objects would appear to grow to the size of a navel orange, but then shrink and disappear.  I watched these objects fly around for about 15 minutes. I walked away for 10 minutes then returned and the objects were still there.  On Friday August 10, 2012 at approximately 3 AM I witnessed the objects again, they were flying around in the same place as before.  This time I had binoculars and with getting a closer look!  I was able to detect that they were not fireflies.  They seemed to maneuver like moths, in a rather erratic fashion.  But they did not have wings.  One of the objects which was about the size of a ping pong ball flew in a corkscrew maneuver within what seemed like an area of 2 feet or so.   All of the objects flew within an area of about 3 feet, I did not witness the objects flying away from the area in front of the chimney.  I wouldn't be surprised if the objects were to appear again.",
      "link": "http://www.nuforc.org/webreports/091/S91668.html",
      "state": "DC",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bdf0a",
      "summary": "Ball of light brighly flashing green and orange.",
      "city": "washington",
      "shape": "light",
      "date": "2012-08-05T00:00:00",
      "story": "Ball of light brighly flashing green and orange. At around 22:30, I was asleep in my bedroom.  My housemate knocked on my door and woke me up, claiming there were strange flashes of light in the sky.  We both went outside.  As soon as we were outside I observed repeatedly flashing bright white light in the night sky.  It looked almost like lightning, however there was no thunder and the light was continuously flashing and lighting up the whole sky.  After about 15 minutes of the repeatedly flashing light, a very large cloud quickly covered the entire sky in a matter of a few minutes.  Shortly after the cloud moved in a very large ball of light appeared behind the cloud.  At first it looked like the moon shining through a cloud.  I then noticed the moon was actually very far away from this strange light source.  The light source then began to move around.  It flashed a brilliant green light and then moved around again.  Then it flashed a bright orange light and began to move around again.  Suddenly there was a huge gust of wind and the object disappeared.",
      "link": "http://www.nuforc.org/webreports/091/S91225.html",
      "state": "DC",
      "duration": "30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3be063",
      "summary": "MISSOURI INVESTIGATORS REPORT:  In clear blue sky my friend saw what at first thought was a com. plane until realized saw no wings.",
      "city": "washington",
      "shape": "cylinder",
      "date": "2012-03-13T00:00:00",
      "story": "Report taken by the Missouri Investigators Group   http://ufomig.yolasite.com   In clear blue sky my friend saw what at first thought was a commercial plane until realized saw no wings then he said it went away.  Another appeared possibly 5 minutes after which I saw.  Saw a white segment moving southwest not very high altitude (10,000 maybe) then it just vanished in fron of my eyes.   Shortly after another appeared at much higher altitude, traveled for a short distance and again just vanished.  This moring saw video of Branson UFO from 2009.  Looks as if could be the same thing.",
      "link": "http://www.nuforc.org/webreports/087/S87353.html",
      "state": "MO",
      "duration": "15 to 20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3be1b2",
      "summary": "2 luminous spheres converged into the image frame from 2 different directions, and flew by",
      "city": "washington",
      "shape": "sphere",
      "date": "2012-05-29T00:00:00",
      "story": "I felt as if I should video a cloud mass above my head, and I did. wile filming, 2 luminous spheres converged into the image frame from 2 different directions, and flew by.  Filmed in HD 1920 x 1080 video using 50 mm F-1.4 nocturnal lens technology.",
      "link": "http://www.nuforc.org/webreports/089/S89083.html",
      "state": "DC",
      "duration": "3 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3be4e9",
      "summary": "Red balls of light",
      "city": "washington",
      "shape": "light",
      "date": "2012-08-05T00:00:00",
      "story": "Red balls of light I was driving and was at a stop sign, and at 9:20pm at dusk looked to the north at a 45 degree angle and saw four red lights a little bigger then stars in a square pattern over a hill.  They were about two hundred feet away from each other and were at the elevation of small planes.  I watched for about 30 seconds as the lights stayed in the same place until each one slowly started disappearing.   I started driving up the hill and right before the last one disappeared I saw in the distance another one shot up from ground to the same height as the other ones and started heading north.  While at the top of the hill watching it a small propeller plane was flying west heading towards it.   Within about hundred feet of the red light the plane made a sharp 180 degree turn and started heading in the opposite direction to the east.  I then was watched the red ball of light go out of sight into the distance. Since I star gaze almost every night and never seeing anything like! this, they could have not of been flares due to the four staying in the same place and the other one moving.",
      "link": "http://www.nuforc.org/webreports/091/S91466.html",
      "state": "PA",
      "duration": "five minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3be527",
      "summary": "Orange ball traverses Southeast Michigan sky on May 18, 2012.",
      "city": "washington",
      "shape": "sphere",
      "date": "2012-05-29T00:00:00",
      "story": "Orange ball traverses Southeast Michigan sky on May 18, 2012. Last Friday night, 5/18/12, from about 10:00PM on we were out in the hot tub watching the northern sky as we do regularly.  Around 10:15 - 10:30 we saw a rather spectacular sight.  An object traveled across the entire sky from southeast to northwest at an elevation of about 30 degrees above the horizon as it passed in front of us.  We saw no maneuvering, but it might have turned slightly more north toward the end of our viewing.  It was orange in color and looked like a burning orange, but no flames.  It was not a spec but rather a sphere or disc, perhaps subtending an angle ¼ that of a full moon.  No changes in appearance, color or speed.  Its altitude appeared to be that of small private aircraft.  It could not have been as high as commercial jets because had it been, its speed would have been so great that we would have experienced a sonic boom.  It was moving moderately quickly, I estimate at 200 mph.  What was most interesting is that there was no sound! from it!  We both are adults, an engineer and a teacher.  We’ve seen many things in the night sky:  aircraft, spacecraft (ISS, Iridium Flares, etc).  Never anything like this.",
      "link": "http://www.nuforc.org/webreports/089/S89135.html",
      "state": "MI",
      "duration": "1 min"
    },
    {
      "_id": "64d005f478aba2ec5a3beb1d",
      "summary": "A group of darting/revolving round white lights moving together at a very high speed across the sky.",
      "city": "washington",
      "shape": "other",
      "date": "2012-02-03T00:00:00",
      "story": "A group of darting/revolving round white lights moving together at a very high speed across the sky. I also made a report last night, about 30 minutes after seeing this, to a site called UFOSNM. Today is Monday Jan 30th 2012. Description: I live in Washington DC. Moving almost exactly from east to west (I have checked the direction on google earth) at about 7:20 pm today (01/29/12) I saw a large group of round white lights, maybe 10 or 12 of them, seemingly apart from each other, in a group, moving far too quickly to be plane/jet/etc.  Although the lights moved around each other at a very fast rate, the group traveled in a straight line  It looked like each white light was moving around each other in a pattern.  Somewhat like bees do around a hive.  I have no idea what this was but what I do know is it was not like anything that I have ever seen before.  I should add that this could NOT be any aircraft known. This close group of revolving/moving lights moved across the entire sky in approximately 10 seconds.  Fantastic, whatever it was.  I might also add that I have never made any such report before.*other than note above. The sky was clear at this time.  No way to determine altitude.  I watched this ‘group of lights’ until they reached the horizon and faded out. The reason for me making this report is that,  1/ Being the nation’s capitol, I think that this should be looked into. 2/ I would like to find out if there was any other report of what I saw, seeing that we have so many aircraft in this area. I am 60 years old.  Have good eye sight with glasses.  UK citizen.  Registered Alien (not a joke).",
      "link": "http://www.nuforc.org/webreports/086/S86921.html",
      "state": "DC",
      "duration": "8 to 10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3beca3",
      "summary": "Lights around object which changed color.",
      "city": "washington",
      "shape": "cone",
      "date": "2013-08-30T00:00:00",
      "story": "Lights around object which changed color Three objects emitting white and red lights above the horizon.  As time went by, they dropped downwards and then disappeared.",
      "link": "http://www.nuforc.org/webreports/100/S100446.html",
      "state": "CT",
      "duration": "30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bec56",
      "summary": "Glowing Orb/ Fireball",
      "city": "washington",
      "shape": "fireball",
      "date": "2013-08-30T00:00:00",
      "story": "Glowing Orb/ Fireball This past 4th of July, 2013, my family and I had gone to go watch the community fireworks show at the local middle school.  We arrived at the field around 8:30pm.  It was still light out and there were already hundreds of people gathered in the field.  We were there for maybe about 15-20 minutes watching the kids run around catching fireflies and I was setting up my camera getting ready for the show.  I have a Cannon Rebel T3i with a 55mm-250mm telephoto lens and was playing with the settings to get the best fireworks shots I could. My youngest son who is 5 years old saw something in the sky and told us all to turn and look at it.  He thought it was a balloon.  When I turned to look at it I knew right away that it was no balloon.  It appeared to be some sort of glowing orb.  It was so bright at the center that it appeared bright white and had an orange glow around that.  As an avid photographer I had taken many photographs of balloons and knew right away this was different.  It was traveling horizontally across the sky about the speed of a commercial passenger plane. It moved very smoothly and silently.  It was probably flying around 15000 to 20000 feet based off where most planes fly.  It maintained its speed and altitude as it crossed the sky.   Soon after my son pointed it out to us I began to hear others around the field taking notice and asking what it was as well.  Everyone was looking and pointing at the object as it hovered across the sky.  It traveled about three quarter of the way across the sky before it! disappeared. In that time I managed to take two photos of the object.  I was so interested in watching it that I didn’t take any more.  Shortly after the object disappeared from the sky a plane fly overhead seeming to follow the exact path the object took minutes before.  It moved at a very similar speed only there was apparent noise generated by the planes engines.   The plane also seemed to fly further across the sky than the object did getting smaller until it was no longer visible.  One of the photos I took had apparent distortion to the object from shaking the camera. The other was very clear.  Once I got home I was able to crop the photo and get a better look at the object. It appeared to have some sort of structure inside the “glow”.  As far as what it was I couldn’t make that out.  No one in the field that night seemed to talk about it after it disappeared.  I kept a close eye on the news papers and news websites following the event to see if anyone else reported it or if there was any mention of what it was.  There were hundreds of witnesses that night but I have yet to hear anything from anybody as far as what they thought it was.",
      "link": "http://www.nuforc.org/webreports/100/S100412.html",
      "state": "NJ",
      "duration": "5-10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bef6a",
      "summary": "Taking a picture and two objects moved quickly past in both pictures.  It was so quick no one saw them but they are in the two pictures",
      "city": "washington",
      "shape": "circle",
      "date": "2013-05-15T00:00:00",
      "story": "Taking a picture and two objects moved quickly past in both pictures.  It was so quick no one saw them but they are in the two pictures",
      "link": "http://www.nuforc.org/webreports/096/S96665.html",
      "state": "DC",
      "duration": "seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bef73",
      "summary": "Triangular shaped object flew across sky during Wash, DC 7/4/13 fireworks display.",
      "city": "washington",
      "shape": "triangle",
      "date": "2013-09-30T00:00:00",
      "story": "Triangular shaped object flew across sky during Wash, DC 7/4/13 fireworks display While watching the last few minutes of the 4th of July celebration in Washington, DC, a triangular-shaped object flew slowing across the screen.  I taped this on my DVR.",
      "link": "http://www.nuforc.org/webreports/102/S102325.html",
      "state": "DC",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bf5b3",
      "summary": "Orange glowing orb floats across sky",
      "city": "washington",
      "shape": "cylinder",
      "date": "2013-07-14T00:00:00",
      "story": "orange glowing orb floats across sky My family and I were waiting in the field behind the middle school waiting for the 4th of July fireworks when my 5 yr old son noticed something in the sky.  He thought it was a hot air balloon.   When we turned to look at it there was no balloon or basket.  What we saw was a glowing orb. It was bright white at the center, yellow around the center and orange on the outside.  It was traveling from southwest to northeast.  It wasn't falling thru the sky, it appeared to be gaining in altitude.  It made no noise.   There were at least a couple hundred people there waiting for the fireworks to begin.  You could hear other people saying \"look at that\"  So I know we weren't the only ones who seen it.   As an avid photographer I had my camera ready to photograph the fireworks and was able to get 2 pictures of the object. I have a Canon T3i rebel camera with a 55mm-250mm zoom lens and was able to get a fairly clear photo of the object.   My girlfriend had been frightened by what we saw when we were observing it.  It traveled in a fairly straight path across the sky appearing to slighty gain altitude as it crossed overhead.  It traveled about three quarters across the sky above before it just disappeared.  About 15-20 minutes later a comercial plane passed over the field seemingly in the exact same path and at the same speed as the glowing object.  The plane had the traditional noise associated with a plane and flew until it was so small you couldn't see it anymore, farther than the object that passed before it but it was visably much less bright.   Once I was home and examined the photos I took, one had obvious shaking distortion to the object.   The other was clear and you could make out a longer cylindrical solid object in the center of the glow. Clearly nothing like any othe flying craft I had witnessed or anyone I've shown the photo to.   I'm positive that others there that night witnessed the same object.",
      "link": "http://www.nuforc.org/webreports/099/S99838.html",
      "state": "NJ",
      "duration": "2-3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bf9c6",
      "summary": "Saw a triangular craft flying north to south, few minutes saw a chemtrail moving east to west.",
      "city": "washington",
      "shape": "triangle",
      "date": "2013-02-04T00:00:00",
      "story": "saw a triangular craft flying north to south, few minutes saw a chemtrail moving east to west. I was standing outside my apartment building, and I happened to look up, and I saw a black triangular object flying north to south.  It was clearly illuminated by the moon.  It was totally silent.  Of course I kept my eyes on the sky.  A few minutes later I see a chemtrail plain as day, or rather by night illuminated by the moon.  Thats the last I saw as the trail moved east to west.",
      "link": "http://www.nuforc.org/webreports/095/S95620.html",
      "state": "DC",
      "duration": "10-15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bfcbe",
      "summary": "Nobody's saying we saw ET, just want an explanation.",
      "city": "washington",
      "shape": "unknown",
      "date": "2013-08-30T00:00:00",
      "story": "Nobody's saying we saw ET, just want an explanation. The first object was witnessed by my employer and I while in our parking lot.  Noticing an orange glowing light in the night sky, we guessed at possibilities such as a helicopter with a searchlight, or a flare.  She briefly thought she heard a muffled helicopter type sound, but we were standing near an outside AC unit which also produces a hum.  We then took notice that outside of the orange light, we could make out no other lights on the object, which moved with what seemed like a controlled \"floating\" similar to that of a helicopter.  The brightness of the color varied but was always orange as it moved basically parallel and a few hundred feet above the tree line, until eventually disappearing.   Ruling out the flare theory, and assuming we had seen a helicopter equipped with searchlight, the darkness, or our angle of viewing causing the odd appearance, my employer leaves.  Three more fellow employees walk outside and as I'm filling them in, one points to what appears to be two, new, similar objects.  We watched for what I'd guess was around 15 minutes as they took a like path as that of the first object, but at various points seemed touch each other, fly in loose formation and be linked or connected(think one towing the other).  Again the constant orange color with varying stages of brightness.",
      "link": "http://www.nuforc.org/webreports/101/S101566.html",
      "state": "NC",
      "duration": "15-25"
    },
    {
      "_id": "64d005f478aba2ec5a3c03b5",
      "summary": "MUFON CONFIRMS ORB UFOS OVER WASHINGTON DC, DEC. 2012.",
      "city": "washington",
      "shape": "sphere",
      "date": "2012-12-20T00:00:00",
      "story": "MUFON CONFIRMS ORB UFOS OVER WASHINGTON DC, DEC. 2012 MUFON HAS ALREADY CONFIRMED THIS ANALYSIS BUT I AM WANTING TO GET THIS OUT TO AS MANY PARTIESAS I CANSO HERE IS LINK TO MY ANALYSIS WITH LINK TO ORIGIONAL VIDEO BELOW.  TRUELY AMAZING CRAZY STUFF!!    http://www.youtube.com/watch?v=o3QgBRqxzjE",
      "link": "http://www.nuforc.org/webreports/094/S94980.html",
      "state": "DC",
      "duration": "15:00"
    },
    {
      "_id": "64d005f478aba2ec5a3c061b",
      "summary": "An incredible sight of a saucer flying through the night sky with a reddish/orange vapor trail that dissappeared.",
      "city": "washington",
      "shape": "disk",
      "date": "2013-02-04T00:00:00",
      "story": "An incredible sight of a saucer flying through the night sky with a reddish/orange vapor trail that dissappeared My boyfriend and I were on our way home from visiting our parents who live in Belhaven, NC.  We live in Greenville, NC.  We were coming into Washington, NC when right above the tree-tops there was a flying object.  It was maybe 100-200ft up in the sky.  It was around 9:25PM and we watched it for a minute or less. It was flying from right to left.  It was something unbelievable.  At first we thought it was a plane but they have never and wouldn’t fly that low over the Washington area.  We live by an airport and could learly tell it wasn’t a plane.  It was cloudy tonight so if it was an airplane, we shouldn’t have been able to see it. It appeared to be silver in color and was more oval or the typical “UFO” shape.  It was flying incredible fast, faster than any airplane I have ever seen.  It had lights that could have been underneath of it but they looked more along the sides and on the middle of the craft.  The lights were different colors of white, yellow, and red.  They didn't have a synchronized pattern in their flashes either and they all flashed at different times.  It seemed to have a reddish/orange vapor trail following. When it got toward the 1 minute mark it just seemed to vaporize and it was gone.  We can only believe that it was a UFO and it was amazing.",
      "link": "http://www.nuforc.org/webreports/096/S96123.html",
      "state": "NC",
      "duration": "~1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c0711",
      "summary": "My Parents arrived home from at trip to the grocery store, and my mother noticed and bright light moving through the sky. As I exited m",
      "city": "washington",
      "shape": "triangle",
      "date": "2013-10-23T00:00:00",
      "story": "My Parents arrived home from at trip to the grocery store, and my mother noticed and bright light moving through the sky.   As I exited my our house to help them I also noticed 5 lights in the sky.  I then witnessed the back 4 lights combine the make to brighter lights.   I then saw the light form into a triangular formation.   Then I pulled out my smartphone to try to record the lights.   Then I meet my mother in the back yard and she witness the triangle and saw it disappear into the sky.",
      "link": "http://www.nuforc.org/webreports/103/S103355.html",
      "state": "PA",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c0987",
      "summary": "A clear bright line in the sky.  With a beginning and an end.",
      "city": "washington",
      "shape": "other",
      "date": "2014-01-10T00:00:00",
      "story": "A clear bright line in the sky.  With a beginning and an end. Clear sky background.  A straight horizontal line, very bright, with a beginning and an end. perfectly straight.  Not jagged like lightening. And then it was gone.  Was not from an airplane.   It was too bright and it was there and then the whole thing was gone.",
      "link": "http://www.nuforc.org/webreports/105/S105968.html",
      "state": "ME",
      "duration": "seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c0997",
      "summary": "Loud vibrating low hum.",
      "city": "washington",
      "shape": "unknown",
      "date": "2013-11-11T00:00:00",
      "story": "Loud vibrating low hum. We are located in downtown Washington, NC in the historic district - a block from the river. I am a USAF vet.  Worked as a crew chief on F-16 & F-15 fighter aircraft.  I know the sound of helicopters, Osprey aircraft & of course fighter jets. During this last week of October we had Osprey aircraft performing exercises one of those day during the afternoon perhaps 4-5 pm.  The sound we heard from within our house while watching TV was not US military. The sound startled us because of the low persistent humming.  We spent a good 5 to 10 minutes in the street trying to locate the origin of this hum/vibration.  I can not remember if it ended or we just went back inside. Sorry it is not too terribly exciting.  No visual confirmation of the event.  It was quite bizarre. I have lived here for twenty years.  The Osprey do have exercises here ever two months or so. This was not an Osprey. It left us a bit unsettled to say the least. ((ADDENDA (3X) FROM WITNESS)) 1)  My wife is saying it was around the 23rd of October. Her recall is always better than mine. The time she places the event is 9-10pm \"ish\" but no later than 11.  Hope this helps. cheers, 2)  I have found that I did tecord the event on my iPhone. :-) 3)  Just uploaded to youtube for you. http://youtu.be/a_ly7b7d2NA  ((END ADDENDA))",
      "link": "http://www.nuforc.org/webreports/103/S103788.html",
      "state": "NC",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c0bb4",
      "summary": "Convoy of pulsing ruby slippers",
      "city": "washington",
      "shape": "formation",
      "date": "2013-12-23T00:00:00",
      "story": "Convoy of pulsing ruby slippers I arrived at work early that night at a municipal facility on the western side of town.  Just as it was beginning to get dark I noticed some pulsing lights coming up from the direction south beyond Hawkins Creek within tree top level-(est. 600-700ft. away) from my slightly elevated position. I was already walking westerly and a short moment later it appeared that the formation of blinking lights, UFO's(12-15) were going to be slightly west of my location.  The HPS lights on the towers had just illuminated moments before and I'd only walked about 200 ft from the office building while passing under a light tower to get a better unobstructed view. They were in a loose single file formation, some slightly higher, lower, or farther and closer. They seemed very close to me without any sounds being noticed or heard.  Perspective wise they were maybe the size of a finger or thumbnail held out at arm's length. The illumintated craft were each pulsing unsynchronized, first two beats warm red colored light near the center bottom surface of the craft, then two beats of a rose color somewhat wider spread out further, then lastly two beats of a ruby red color illuminating the furthest across the bottom surface.  The light pattern would repeaton each craft again and again evenly about every 5-7 seconds to complete.  It wasn't entirely dark yet and I couldn't see anything on the topside.  It seemed that the larger ruby colored flashing beats best revealed the overall oval shape of the UFO. The UFO's were more visible to see farther away when approaching, because when I thought to start counting them, they were less visible and fading out fast at the front of the formation traveling away from me towards the northwest.  I thought maybe the event had ended when I turned around shortly before spotting 2-3 more of the same craft following the same flight path, spaced much farther apart, moving about the same speed, within about 20-30 seconds behind the main group.  The craft were not moving very fast and seemed very low and slow, maybe about 50-80 MPH, about 60 degrees above my horizon and less than a quarter of a mile away.  My location was about 500ft. above sea level.",
      "link": "http://www.nuforc.org/webreports/105/S105379.html",
      "state": "IN",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c0c7f",
      "summary": "8 orbs of light flew  directly over head in a formation before a synchronized deformation and dissapearance. Lone orb 5 min later.",
      "city": "washington",
      "shape": "formation",
      "date": "2014-02-27T00:00:00",
      "story": "8 orbs of light flew  directly over head in a formation before a synchronized deformation and dissapearance. Lone orb 5 min later Myself and 6 other people were on a 9th floor rooftop in Washington D.C.'s Dupont Circle neighborhood at roughly 10:30 PM.  Something directly above me caught my eye.  I looked up to see 8 orbs of light flying silently in formation about 2000 yards up.  The orbs looked to resemble what we know as a plane.  Four orbs in a straight line with two orbs going out to each side and angled toward the back of the formation at the midway point of the 4 in-line orbs.  It was immediately evident that this was not a plane however as the clouds that were in the back ground (much higher in the sky) were clearly visible in the space between the orbs.  The orbs of light traveled in this formation for roughly 15 seconds going south to north.  At the 15 second mark the formation went through a synchronized “deformation scramble” into an amorphous unidentifiable jumble (still retaining their individual properties just no longer in a geometric formation of any kind).  The mass of unorga! nized orbs accelerated not over the horizon but directly following our horizontal site line.  The lights then vanished completely at a height I can only describe as three fingers above the horizon (holding my hand out a foot in front of my face) and roughly 5 miles away. Five minutes later someone facing the south (I was facing north) said, “Look another one.”  I again looked immediately up to see a single orb of light, flying at the same altitude and in the same direction as the previous 8 orbs.  This one had a more defined haze of light surrounding it and was lighter/whiter in color.  At around the same distance as the deformation described in the previous paragraph, the single orb began to move laterally; from my view point no more than a 10-15 degree divergence from its northern flight path on either side.  Essentially it began to wiggle back and forth for 5 seconds as it continued its northern progression in the same direction as the previous 8.  The orb then disappeared in roughly the same spot as the ones prior.",
      "link": "http://www.nuforc.org/webreports/107/S107425.html",
      "state": "DC",
      "duration": "20 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c1587",
      "summary": "We witness a silent object traveling from south to north, at night,  with no conventional  aircraft type lighting.",
      "city": "washington",
      "shape": "unknown",
      "date": "2013-12-05T00:00:00",
      "story": "We witness a silent object traveling from south to north, at night,  with no conventional  aircraft type lighting. I experience aircraft and helicopters flying over my neighborhood daily.  These aircraft include personal Robinson type helicopters, USCG helicopters, C-130s, private jets, turbine powered propellor driven aircraft, A-10s Thunderbolts and single engine Cessna type aircraft.  The  corporate aircraft fly from east to west multiple time daily en route to Oakland County International Airport.  This airport is approximately 30 miles from my house.  The corporate aircraft are on their final approach to the airport, flying over my neighborhood. We had just pulled into our driveway and were getting out of our car when we saw what appeared to be a soft orange glowing object.  I could not make out any type of shape to the object.  Also, there were no strobe type blinking lights associated with this object.  The Object I and my mom witness was moving at the speed of a single engine aircraft from south to north at about 4,000 to 5,000 ft altitude.  The object \"did not\" make any sound.  I had my Iphone5 handy and snapped about 6 pictures of the object. Object location at time of the sighting.  s 42.738174 N , 83.04895799999997 W ((NUFORC Note:  We have amended the time above to reflect an evening sighting.  PD))",
      "link": "http://www.nuforc.org/webreports/105/S105084.html",
      "state": "MI",
      "duration": "45 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c1671",
      "summary": "3 red lights in a triangle formation heading North then disappeared, no clouds.",
      "city": "washington",
      "shape": "formation",
      "date": "2013-10-23T00:00:00",
      "story": "3 red lights in a triangle formation heading North then disappeared, no clouds. I just turned up the hill into my neighborhood and when I almost reached the top of the hill I noticed 3 unblinking lights in a triangle formation way up in the sky heading North I slowed down and tried to pull out my nice Sony camera to take a picture and when I looked back up 2 of the 3 lights were gone and then the 3rd disappeared.   The sky was very clear tonight with no cloud cover.",
      "link": "http://www.nuforc.org/webreports/103/S103356.html",
      "state": "PA",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c1d29",
      "summary": "Multiple light formation seen at 9pm Friday, June 20th, over the Potomac river in VA, from tallest hill in Washington, DC.",
      "city": "washington",
      "shape": "formation",
      "date": "2014-06-24T00:00:00",
      "story": "Multiple light formation seen at 9pm Friday, June 20th, over the Potomac river in VA, from tallest hill in Washington, DC. I live on the top of a big hill in DC that overlooks the Potomac river.  I was looking out my window towards the South East and over Virginia or the river, I saw a slow moving formation of lights.  Not unlike what I've seen of the \"Phoenix Lights.\"  I watched them for a little while 15-30 mins.  I took some photographs, which I will submit.   This view also encompasses the takeoff/landing path for Reagan National airport in Alexandria, VA, but I have been watching the planes come and go for a couple of years, and have never ever seen something like this.   The lights in the formation moved in inconsistent ways.  Some moving up and down some left (south) some right (north).  I went out to the street and could see them there as well.  I went in to get something to eat and when I returned they were gone.   Also to note, the lights were orange, not yellow or white.  I did see aircraft take off from the airport while the event was occurring and it appears the the lights were further off than the aircraft.",
      "link": "http://www.nuforc.org/webreports/110/S110454.html",
      "state": "DC",
      "duration": "30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c202d",
      "summary": "Orange light flew down from high to low altitude, grey squared shaped craft seen up close over my town",
      "city": "washington",
      "shape": "other",
      "date": "2014-06-13T00:00:00",
      "story": "Orange light flew down from high to low altitude, grey squared shaped craft seen up close over my town I'm a pizza driver, and this sighting occurred on a delivery!   Immediately upon pulling out of our store's parking lot, my attention was drawn to a bright orange light moving across the sky.  It was somewhat close to the Moon at first.  My eyes were glued to its position, because this was no plane or helicopter.  I could tell by its movement which was obviously free of any particular direction.   Then, after a few seconds, the light turned off as it swooped down at an incalculable speed. It flew directly over my car and I saw a grey, squared shaped craft with a dark circle on the bottom.  However, it was flying in the opposite direction from where I was driving, so I lost sight afterwords.  I have witnessed orange lights a few other times in this area recently, but this experience was the closest.  Most visually apparent an unknown craft has made itself to me.",
      "link": "http://www.nuforc.org/webreports/110/S110152.html",
      "state": "NC",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c211e",
      "summary": "5 \"Fire like\" lights seen slowly traveling northbound in the northern sky in a rectangular shape, but changed shape.",
      "city": "washington",
      "shape": "rectangle",
      "date": "2014-04-18T00:00:00",
      "story": "5 \"Fire like\" lights seen slowly traveling northbound in the northern sky in a rectangular shape, but changed shape. To whom it may concern,   On Thursday evening, at about 10:10 pm, on April 10, 2014, I was a witness to an Unidentified Flying Object.  I was in the front yard of my house and saw movement in the sky toward the north of my house.  I observed 5 glowing yellow lights (almost like a flame, but not flickering) in a rectangular like formation. I immediately ran into my house and told my wife and 2 daughters that were home to come outside to look at the lights.  We all went out our back door of the house and I pointed to the area of the lights.  They all saw the same thing I saw, but it looked as if the lights began traveling northbound slowly.  One of the 5 lights looked as if it merger into one of the other lights. There were no sounds coming from the lights or anywhere else-other than the sound of neighbors talking (the sound travels in my backyard at night). At one point, I saw what looked like flashing lights of a small aircraft (green and red flashing light) was traveling from the east to west in a path going toward the lights.  As the flashing lights reached the far right side of the lights, the flashing lights disappeared.  The flashing red & green aircraft lights didn't change direction, didn't turn- they just disappeared. My wife ran back into the house to grab a camera to see if it would show up in a picture, so she thought to quickly grab her iPad mini.  She took several pictures, of which a couple clearly showed the lights of the object. After about 4-5 minutes, the lights appeared to continue traveling in a northern direction, then disappeared.  They object didn't make any sounds, but the lights just disappeared within a few seconds. We've not contacted anyone,or,organization about what we saw, other than a few friends at church who thought we were crazy.  I even sent an email to a doctor friend of mine who is a novice astronomer. I am a retired police officer, former Air Force Sergeant, who has never before seen anything like what we saw than night.  While I do believe in UFO's, I've never before seen anything that I would consider \"Unidentified\".  No one in my family consumes alcohol or recreational drugs. Please let me know if you would like any additional information or have any questions. Sincerely,  XXXXX",
      "link": "http://www.nuforc.org/webreports/108/S108706.html",
      "state": "UT",
      "duration": "5-6 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c292f",
      "summary": "Black oddly shaped (like large tarpaulin) object moving directly south to north very quickly and high.",
      "city": "washington",
      "shape": "other",
      "date": "2014-11-21T00:00:00",
      "story": "Black oddly shaped (like large tarpaulin) object moving directly south to north very quickly and high. This morning around 9:10 AM, a very large object was crossing the sky at a high altitude, floating very quickly from south to north.   Object appeared as black and was shaped like a deflated hot air balloon.  I looked through binoculars, but still couldn't identify what the object was or how it was being propelled.   Winds were SSW 10 MPH around the Becket, MA, Berkshire County area.  I was wondering if anyone else saw this thing, other than my wife and I?",
      "link": "http://www.nuforc.org/webreports/115/S115397.html",
      "state": "MA",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c2bda",
      "summary": "Multiple orange lights in SWPA skies.",
      "city": "washington",
      "shape": "oval",
      "date": "2014-08-29T00:00:00",
      "story": "Multiple orange lights in SWPA skys On August 23, 2014, at approximately 9 pm in Washington, PA, my neighbor and I were walking our dogs.  Coming from the East and heading west over the sky we saw multiple bright orange lights in the sky.  They were quite a distance apart from one another but traveled in a mostly straight formation.  They did not make any sound.   They traveled rather slowly across the sky.  They did not blink but were just a solid orange. This must of taken about 15-20 minutes.   First we saw 6, then 4, then 8, they were in groups.  It was a very cloudy night so they did disappear behind clouds but sometimes it looked like they just disappeared without going behind clouds.   Thank you for letting us tell someone.",
      "link": "http://www.nuforc.org/webreports/112/S112756.html",
      "state": "PA",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c31c5",
      "summary": "Green, red light that hovered, moved, hovered and disappeared.",
      "city": "washington",
      "shape": "light",
      "date": "2014-08-01T00:00:00",
      "story": "Green, red light that hovered, moved, hovered and disappeared. Small object with two green lights and one red light.   Hovered for a few moments, moved a few feet sideways and continued hovering.  Proceeded to move up and down several times, hovered for a few more moments, then slowly rose out of sight. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/112/S112080.html",
      "state": "DC",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c3378",
      "summary": "Very low altitude, bright white light, much faster than a jet, yet no sound.",
      "city": "washington",
      "shape": "fireball",
      "date": "2015-04-03T00:00:00",
      "story": "Very low altitude, bright white light, much faster than a jet, yet no sound. Low flying round white light.  Too fast to be a plane.  Too close and bright to be a meteor.  Very high velocity.  No sound.",
      "link": "http://www.nuforc.org/webreports/118/S118134.html",
      "state": "NJ",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c38c9",
      "summary": "2 glowing orange crafts, in the shape of hang-gliders, passed across the sky.",
      "city": "washington",
      "shape": "other",
      "date": "2015-01-07T00:00:00",
      "story": "2 glowing orange crafts, in the shape of hang-gliders, passed across the sky. 2 glowing orange crafts, in the shape of very large hang-gliders, passed across the sky. First starting closer and larger and then disappeared after sheer distance away from me and clouds in the sky.  About a one minute delay in-between second sighting.    Second sighting took a slightly different path but ultimately also disappeared because of distance.",
      "link": "http://www.nuforc.org/webreports/116/S116440.html",
      "state": "DC",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c4115",
      "summary": "Blue light streaking across sky seen by 1 person in Washington, Vermont.",
      "city": "washington",
      "shape": "unknown",
      "date": "2015-05-08T00:00:00",
      "story": "Blue light streaking across sky seen by 1 person in Washington, Vermont I was watching TV and I happened to look outside of my living room window.  When I did a bright coral blue light streaked across the sky, but it was solid in the middle, and emitting light that reflected off of the clouds.  It lasted only a few seconds and I almost didn't believe it happened because it was so quick.  There was a cloud cover so it had so be relatively close to earth to be able to break the clouds.  And right before it broke the clouds, I could see the light through them.  The object almost looked like a square, and it had no trail.  I live in a rural area, so it disappeared behind a hill before I could take a picture.  I live in Vermont USA, Orange County.",
      "link": "http://www.nuforc.org/webreports/118/S118729.html",
      "state": "VT",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c45be",
      "summary": "Saw a green orb shoot straight down. Too low for a shooting star. Brilliant emerald color.",
      "city": "washington",
      "shape": "flash",
      "date": "2015-10-16T00:00:00",
      "story": "Saw a green orb shoot straight down.  Too low for a shooting star.  Brilliant emerald color. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/122/S122780.html",
      "state": "DC",
      "duration": "2 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c4c82",
      "summary": "Western sky.  Sunset.  Five lights that moved in downward direction.  They had short \"tails,\" but no contrails.  They disappeared.",
      "city": "washington",
      "shape": "fireball",
      "date": "2015-09-17T00:00:00",
      "story": "Western sky.  Sunset.  Five lights that moved in downward direction.  They had short \"tails,\" but no contrails.  They disappeared. Western sky. Sunset. Five lights that moved in downward direction.  They had short \"tails\" but no contrails.  They disappeared after five minutes.  One twinkled as if it was burning. ((NUFORC Note:  We wonder whether the objects might have been airliners in the western sky, which were reflecting the setting sun.  PD))",
      "link": "http://www.nuforc.org/webreports/122/S122043.html",
      "state": "PA",
      "duration": "Continues"
    },
    {
      "_id": "64d005f478aba2ec5a3c4c8e",
      "summary": "Amazing sight too see.",
      "city": "washington",
      "shape": "fireball",
      "date": "2015-08-27T00:00:00",
      "story": "Amazing sight too see. 8 amber colored balls flickering in a row across the sky the fading out. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/121/S121215.html",
      "state": "VT",
      "duration": "14 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c4ea7",
      "summary": "Saw 5 bright oranges circles in a horizontal line, each one faded away in progression.  I've never seen anything like it.",
      "city": "washington",
      "shape": "circle",
      "date": "",
      "story": "Saw 5 bright oranges circles in a horizontal line, each one faded away in progression.  I've never seen anything like it. I was driving home on a quiet, curvy road that had some tree cover.  A bright, orange circle up in the sky caught my attention.  It faded away quickly, then as I kept going I saw maybe 4 more orange circles like it, all in a horizontal line, each one faded out in progression, maybe I saw each for 1-2 seconds.  Very strange never seen anything like it.   When I got home I told my boyfriend, he said that he heard a loud noise, like a jet engine at the same time.   I am a 33 year old woman. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/125/S125369.html",
      "state": "VT",
      "duration": "5-10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c4f26",
      "summary": "I want to be clear on this event, I was on my way to N.H from Doswell Virginia, after staying the night in Kings dominion Best western.",
      "city": "washington",
      "shape": "flash",
      "date": "2016-03-18T00:00:00",
      "story": "I want to be clear on this event, I was on my way to N.H from Doswell, Virginia, after staying the night in Kings Dominion ((hotel name deleted)).  I was the passenger in a 2013 Toyota white corolla.   I had my wife make a hasty report as I was eating sushi in Epping, NH, because I didn't want it to go without being reported.   The driver was a grade school friend of mine 37 years ago, known him my whole life.   Going over a bridge on 295 there was two pulses of energy (Light) White flashes that was beyond anything ive ever seen. we both turned to eachother and said, \"What ((deleted)) was that?\"   I understand they're a lot of hoax reports, but mine can be corroborated with a motorcycle police officer that had pulled over a car maybe a half a mile later on the left hand side of 295 north.  These two light pulses were symmetrical in strength and time.  It was almost like a picture flash but blindingly intense.   Not sure if this was government or ufo, just wanted to file this, as I have never in my life been a part of anything like this.  Still creeps me out. ((NUFORC Note:  We spoke via telephone with the source of the report, and he seemed to us to be quite serious about the sighting.  PD))",
      "link": "http://www.nuforc.org/webreports/126/S126361.html",
      "state": "DC",
      "duration": "2 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c4f59",
      "summary": "I saw a bright light in the sky that was brighter then the north star so I filmed it and it started moving in every direction and expan",
      "city": "washington",
      "shape": "light",
      "date": "2016-03-04T00:00:00",
      "story": "I saw a bright light in the sky that was brighter then the north star, so I filmed it and it started moving in every direction and expanded then back to its original size then split into 2 then back to one again....very strange I emailed a UFO sightings specialist who is researching it. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/126/S126092.html",
      "state": "PA",
      "duration": "90 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c4f6f",
      "summary": "large boomerang floating across sky in wash.d.c.-observed with night vision goggles.",
      "city": "washington",
      "shape": "chevron",
      "date": "2016-03-18T00:00:00",
      "story": "large boomerang floating across sky in wash.d.c.-observed with night vision goggles the boomerang shaped object was very large and was composed of about 17 large white lights one in the center and the others around it making a boomerang shape.  i watched it slowly going across the sky. then another object something like a helicopter came towards it and was flying under it for a distance.  After the object had floated away, the helicopter type object went back to a stationary position in the night sky.  During this whole event there was no sound and possibly no sightings unless someone else was using night vision goggles the way i was because when i tried seeing the object with binoculars it was invisible i had to use my nvg to see it. the helicopter type object could be seen with binoculars but not the boomerang.",
      "link": "http://www.nuforc.org/webreports/126/S126394.html",
      "state": "DC",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c4fbc",
      "summary": "Back look like fire front look dark in color.",
      "city": "washington",
      "shape": "unknown",
      "date": "",
      "story": "Back look like fire front look dark in color. Me and my step dad was watching tv around 1:00 we had this really big window 8x 10 feet made out of small pieces 12x12 ??  We lived on a farm on a really tall hill,, the big widow turn all orange like fire!!  My step dad grab his shot gun , and went for the back door open the door I was right on his tail ,, what we saw was a round orange spot going away as it turn you could see there was something in front of the orange all I could til it was dark ,, but what got me was we had a lot of smaller hills looking West ,, it's was like it was on cruise control 30mph?  And 50 foot above the tree tops you know when you look at the upper  Tree line it goes up and down with the hills so it's like a up and down line ,,  that how it flew as it curve to the left and out of sight ,, ask him what was that he said he did not know ,, this was right before the Beatles come out ,, best date I can give ,,",
      "link": "http://www.nuforc.org/webreports/125/S125800.html",
      "state": "IN",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c5bbf",
      "summary": "Watching tv, I see a round object with a bright light coming from it. The object flew across the sky at about",
      "city": "washington",
      "shape": "circle",
      "date": "2016-04-15T00:00:00",
      "story": "Whiles siting on my couch watching tv, i see a round object with a bright light coming from it.  The object flew across the sky at about the same speed as a shooting star however it never faded out or changed velocity.  The light coming from it flared a little as if it was a fire.  Because of how fast it was moving I only managed a few gazing seconds before it moved out of sight.",
      "link": "http://www.nuforc.org/webreports/126/S126821.html",
      "state": "DC",
      "duration": "Few seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c5f99",
      "summary": "Bright unknown object hovered for 60 minutes.",
      "city": "washington",
      "shape": "light",
      "date": "2016-11-11T00:00:00",
      "story": "Bright unknown object hovered for 60 minutes. My wife and I observed a hovering lighted object for 1 hour over the north sky in Washington, PA.  It was bright and hovered in one position for 60 minutes.  Multiple aircraft circled and observed aircraft.  It disappeared suddenly.   I am an Emergency Physician and well trained observer and this persisted for over an hour and was in Pittsburgh international airspace and multiple aircraft circled the object.  Cellular service was disrupted during event.",
      "link": "http://www.nuforc.org/webreports/131/S131149.html",
      "state": "PA",
      "duration": "1 hour"
    },
    {
      "_id": "64d005f478aba2ec5a3c5fd6",
      "summary": "I have never reported a sighting before so please forgive missing details. I was walking home Sunday morning around 1100hrs in northwes",
      "city": "washington",
      "shape": "other",
      "date": "2016-10-11T00:00:00",
      "story": "I have never reported a sighting before so please forgive missing details.  I was walking home Sunday morning around 1100hrs in northwest Washington, DC.  I noticed a strange object hovering in the sky, about 30-40 feet up, across the street from me, maybe a total distance of 60-70 ft between myself and the object.  The object was unlike anything I’ve ever seen.  It was a worm-like shape and it hovered in the same position for roughly 3 minutes while I was able to take photos.   At first I thought it could have been an unusual entanglement of those narrow balloons used to make balloon animals, however, I don’t believe they could have floated in this position with helium.  The object moved only slightly, despite a breeze which would have greatly moved even an anchored balloon.  No wire, ribbon or any kind of string was present.  As I ran around the corner to try and get right underneath it, I could not find it.",
      "link": "http://www.nuforc.org/webreports/130/S130418.html",
      "state": "DC",
      "duration": "4 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c6472",
      "summary": "SAW A LARGE TRIANGULAR CRAFT AND OTHER SMALLER ROUND CRAFT IN THE SKY.  LIKELY NOT OF THIS EARTH.",
      "city": "washington",
      "shape": "triangle",
      "date": "2016-08-16T00:00:00",
      "story": "SAW A LARGE TRIANGULAR CRAFT AND OTHER SMALLER ROUND CRAFT IN THE SKY.  LIKELY NOT OF THIS EARTH was out walkin dog. looking north and west in the sky I saw a large craft with triangle shape lights on tips. smaller craft were hovering south of me.  movement was not that of air craft we know. not man made in its motion.  I COULD SEE FROM THE SIZE OF THE TRIANGULAR SHAPED CRAFT IT WAS HUGE.  MORE THAN SEVERAL FOOTBALL FIELDS IN LENGTH.  AS THIS CRAFT HOVERED CLOSER OVER HEAD THEN MOVED WESTWARD.  THEN NORTH.  THE OTHER SMALLER CRAFT WERE TOGETHER IN TWOS AND HOVERED IN THE SOUTH SKY BEFORE MOVING OUT INTO DEEP SPACE.",
      "link": "http://www.nuforc.org/webreports/129/S129130.html",
      "state": "NJ",
      "duration": "1 hour"
    },
    {
      "_id": "64d005f478aba2ec5a3c6471",
      "summary": "There are 3 lights in the DC sky that are stationary and forming a triangle.",
      "city": "washington",
      "shape": "triangle",
      "date": "2016-08-16T00:00:00",
      "story": "There are 3 lights in the DC sky that are stationary and forming a triangle. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/129/S129066.html",
      "state": "DC",
      "duration": "ongoing"
    },
    {
      "_id": "64d005f478aba2ec5a3c6616",
      "summary": "I spend alot of time outside at night. Tonight i saw what started as two bright lights and two small blue lights then its broke up into",
      "city": "washington",
      "shape": "unknown",
      "date": "2016-08-02T00:00:00",
      "story": "I spend alot of time outside at night.  Tonight i saw what started as two bright lights and two small blue lights then its broke up into a long stream of lights and a tail then vanished. last maybe 2-3 mins started at around 22:30.",
      "link": "http://www.nuforc.org/webreports/128/S128841.html",
      "state": "UT",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c68b9",
      "summary": "'Unidentified Ground Object' Spotted in Northwest, Washington, DC",
      "city": "washington",
      "shape": "unknown",
      "date": "2017-03-17T00:00:00",
      "story": "'Unidentified Ground Object' Spotted in Northwest, Washington, DC I was walking in my backyard towards my driveway when my cat, who was also in the backyard, suddenly froze staring at the base of a tree.  It then took a few steps backwards, turned around, and ran full speed to the door on the other side of the house (to be let back inside).  I looked around the tree to see what had frightened the cat, but there was nothing there, so I turned and took a few steps away, but decided to quickly look back one last time.  That's when I saw this object running from the tree to behind the trash barrels located near the end of the driveway.  It was about 12-15 ft. from me and in my direct line of sight on a bright, sunny day.  I was very startled, and decided to first let the cat back into the house.  A few minutes later I walked over to the trash barrels, but there was nothing there. The object appeared to 2 dimensional (like a geometrically shaped cardboard cutout), and it seemed able to camouflage itself (like a cuttlefish, or something I'd expect to be created in a DARPA lab).   The object’s legs appeared to be moving rapidly, but it’s movement was comparatively slow as if it wasn’t getting good traction.  The object was approximately 18 inches tall.  It was shaped like a small black sphere with a pie shaped cutout (similar to the outline of an astronaut’s helmet) over a black triangular shaped mid section, and a barely visible pair of legs below the mid section. I don't expect others to believe me, as I wouldn't believe such a story if it was told to me. Never-the-less, I’ve reported what I had seen, because I couldn't attribute it to being a shadow, glare, or another rational explanation, and perhaps others also spotted it. ((NUFORC Note:  We spoke via telephone with the witness, and he sounded to us to be sincere.  However, he provides only a first name, and a minimum of contact information.  We are uncertain as to the authenticity of the report.  PD)) ((NUFORC Note:  Source of report indicates that the date is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/133/S133145.html",
      "state": "DC",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c68dc",
      "summary": "((HOAX??))Headed due N then returned headed E about 2 mi and headed N then disappeared.  No audible engine noise.  ((anonymous report))",
      "city": "washington",
      "shape": "teardrop",
      "date": "2017-03-23T00:00:00",
      "story": "Headed due north, then returned headed east about 2 miles, and headed north, then disappeared.  No audible engine noise.  No flashing aircraft lights.   Right before it disappeared it headed north in unrealistic supersonic speed.   When it disappeared into the horizon above in the high atmosphere several points flashed. ((NUFORC Note:  Source of the report elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/133/S133189.html",
      "state": "LA",
      "duration": "20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c719f",
      "summary": "Far away silver circular object, observed moving across clear, morning sky.",
      "city": "washington",
      "shape": "circle",
      "date": "2017-07-23T00:00:00",
      "story": "Far away silver circular object observed moving across clear morning sky I was in a car driving when I observed the object.  The sky was completely clear and it was morning.  The small circular object first appeared to me as if it was a fixed object in the sky but upon further observation it was moving from right to left slowly at a far off distance.   My first impression was that it looked like a small moon--it was the same color as the moon in daylight.  But then I saw it glinted silver from the sun.   Again, it clearly pretty far away, so no other detail from the object could be seen (other than it appeared circular and was silver).   Although it was moving across the sky like a plane, it did not have a plane shape.  I obviously have seen many planes in the sky and this didn't look anything like that.   Also, there was no white trail or anything from the object to indicate it was a plane. It was bizarre.  I saw it for the entire time I was driving that direction on the road.   Once I made a turn, I couldn't look that way anymore.",
      "link": "http://www.nuforc.org/webreports/135/S135256.html",
      "state": "NC",
      "duration": "Unknown"
    },
    {
      "_id": "64d005f478aba2ec5a3c78b0",
      "summary": "Buzzing Lighted Craft.  ((anonymous report))",
      "city": "washington",
      "shape": "unknown",
      "date": "2017-12-21T00:00:00",
      "story": "Buzzing Lighted Craft Saw a flying object with red, green, and white lights flying low over D.C. towards the Potomac, then changed direction NW back into D.C.   The object made a strange buzzing noise, not the sound of a helicopter, which is why I paid close attention to it. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/137/S137906.html",
      "state": "DC",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c7b5b",
      "summary": "Said a whiteish lite around it.",
      "city": "washington",
      "shape": "oval",
      "date": "",
      "story": "Said a whiteish lite around it Fall of 52 best I can say, my mom & aunt came home.  Figure about midnite or so.  They both seemed excited & maybe scared.  They'd been out parting with a friend of theres. He was military, really don't think he was into anything with a high clearance.  He dropped them off, they came in and said they saw a flying saucer. They said it was landing in front of them on a city street in east section of d.c.. Mom said they watched it land, set for a moment, then took off.  Don't think they were abducted or anything like that, I was about 7 the.  Both my mom & aunt have passed away.   That's all I can remember. ((NUFORC Note:  Witness indicates that the date above is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/136/S136312.html",
      "state": "MD",
      "duration": "minets ?"
    },
    {
      "_id": "64d005f478aba2ec5a3c7eab",
      "summary": "Odd this is the second time it’s Happened!",
      "city": "washington",
      "shape": "disk",
      "date": "2018-05-15T00:00:00",
      "story": "Odd this is the second time it’s Happened! I was in bed sleeping I turned over on my back opened my eyes and I could see through the bed room celling, when I looked into sky I saw it flying over my apt blinding, lights flashing, I tried to yell or speak but I couldn’t do it as I was looking into the sky!  Soon it was gone; it lasted about 5 mins",
      "link": "http://www.nuforc.org/webreports/141/S141492.html",
      "state": "DC",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c847d",
      "summary": "((HOAX??))  I had the urge to buy Hersheys Kisses afterwards as I felt on a sugar low.  ((anonymous report))",
      "city": "washington",
      "shape": "rectangle",
      "date": "2018-09-27T00:00:00",
      "story": "I had the urge to buy Hersheys Kisses afterwards as I felt on a sugar low. I am a U.K. visitor to the U.S. on a family visit to Washington and on the way from their house to the airport, I saw something strage.   I then proceeded to witness a large rectangular glowing object appear at the side of the road.  It had some sort of strange inscriptions on it.  The colour was bright white, with red streaks across it.  It had long legs roughly 2m long touching the ground.   For some reason I couldn't avert my eyes, like it was advertising something great to me. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/143/S143226.html",
      "state": "DC",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c88b5",
      "summary": "Took a photo of the waxing moon June 16, 2018, and notice ufo in photo.",
      "city": "washington",
      "shape": "light",
      "date": "2018-06-21T00:00:00",
      "story": "Took a photo of the waxing moon June 16, 2018, and notice ufo in photo.",
      "link": "http://www.nuforc.org/webreports/141/S141866.html",
      "state": "DC",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3c94dd",
      "summary": "Triangle Craft With Spiraling Exhaust",
      "city": "washington",
      "shape": "triangle",
      "date": "2019-12-01T00:00:00",
      "story": "Triangle Craft With Spiraling Exhaust Today a meteor shower is currently going on and my friend and I happens to look up at the sky and see the craft.  It had three lights and it had a spiraling exhaust.",
      "link": "http://www.nuforc.org/webreports/150/S150619.html",
      "state": "MO",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c9613",
      "summary": "While standing on my deck this evening I noticed what looked to be a flock of 4 glowing birds. I quickly realized they weren't birds as",
      "city": "washington",
      "shape": "formation",
      "date": "2019-12-19T00:00:00",
      "story": "While standing on my deck this evening I noticed what looked to be a flock of 4 glowing birds. I quickly realized they weren't birds as they were too easily visible at this time of night. They appeared almost out of nowhere, were moving low-ish in the sky, fast and silent. Each of the craft looked independent of the others but moved at pace as if connected. They looked like birds that were well lit from below, but didn't move like birds and being dark; not enough light to light them up. They were a light reddish color and moved in a general north to south direction. They disappeared over my neighbors roof and I lost sight. I walked over to look south and didn't see them anymore. They may have banked east, or disappeared, at that point. At first, I thought it could be a meteor shower, but nothing looked aflame and it came in flat, not at a downward angle. They also surprised me being silent and appearing out of nowhere.",
      "link": "http://www.nuforc.org/webreports/151/S151378.html",
      "state": "PA",
      "duration": "3 - 5 seconds"
    }
  ]
}