{
  "city": "wichita",
  "fetch_timestamp": "2025-07-12T14:33:02.860475",
  "record_count": 96,
  "pages_fetched": 4,
  "api_calls": 5,
  "source": "ufo_aficionado_api",
  "records": [
    {
      "_id": "64d005f478aba2ec5a3b4b26",
      "summary": "MADAR Node 123",
      "city": "wichita",
      "shape": "",
      "date": "2019-07-05T00:00:00",
      "story": "MADAR Node 123",
      "link": "http://www.nuforc.org/webreports/147/S147263.html",
      "state": "KS",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3b4b63",
      "summary": "Took a photo of a ferris wheel and the moon at Wichita Ks. Reviewing the photo at home I noticed a dashed trail under the moon.",
      "city": "wichita",
      "shape": "",
      "date": "2019-06-20T00:00:00",
      "story": "Took a photo of a ferris wheel and the moon at Wichita, Ks.  Reviewing the photo at home I noticed a dashed trail under the moon.  What is this?  Where can I send this photo?",
      "link": "http://www.nuforc.org/webreports/146/S146721.html",
      "state": "KS",
      "duration": "125th second"
    },
    {
      "_id": "64d005f478aba2ec5a3b5059",
      "summary": "Saw a dot in the sky moving slowly with my brother. We watched it move from northwest to northeast. Thought it was a satellite until it",
      "city": "wichita",
      "shape": "unknown",
      "date": "2019-12-22T00:00:00",
      "story": "Saw a dot in the sky moving slowly with my brother. We watched it move from northwest to northeast. Thought it was a satellite until it started changing direction. We saw 2 flashes/sparks come off of/towards it. One red tinted one white tinted.",
      "link": "http://www.nuforc.org/webreports/151/S151800.html",
      "state": "KS",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b5217",
      "summary": "Glowing Green SKY MIR",
      "city": "wichita",
      "shape": "flash",
      "date": "2006-10-30T00:00:00",
      "story": "Glowing Green SKY MIR I was working second shift at a hospital, I live in the country, so we have a terrific veiw of the sky, I thought I heard something and suddenly the entire sky was glowing bright green, not just a part of the horizon but it was like daylight but bright green, I am not sure of the exact date but it was cold outside and I remember the MIR was supposed to come down soon, at first being the age I am I thought it was a nuclear bomb in the atmosphere, and after I calmed down I thought maybe the MIR fell sooner than planned. I called MCconnel AFB the guard I spoke to had seen it but had no idea what it was. I met someone at our local mall years later who also had seen it but had no information. I also called our local tv station and cosmosphere, very few people saw it and it didn't seem like a big deal to them. I emailed coast to coast but no response there either, For such a weird event with multiple witnesses there is very little documentation. Anyone in this area outside at that time had to see it. ((NUFORC Note:  Witness indicates that the date of the incident is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/052/S52106.html",
      "state": "KS",
      "duration": "1MINUTE"
    },
    {
      "_id": "64d005f478aba2ec5a3b541e",
      "summary": "Black triangular/stealth shaped craft, white lights on craft made V-shape, craft appeared to move slowly, hover.",
      "city": "wichita",
      "shape": "triangle",
      "date": "2008-06-12T00:00:00",
      "story": "Black triangular/stealth shaped craft, white lights on craft made V-shape, craft appeared to move slowly, hover. Around 10:00pm while driving north on 235, I noticed a triangular pattern of white lights behind me and to the right, somewhere south of the Zoo Exit and north of Kellog/54.  It was dark outside, but the craft appeared to have a stealth like/triangle appearance with several white lights silhoutting it's shape.  The craft moved slowly and appeared to hover and descend as I watched.  I tried to turn around and go back but the craft was gone by then.",
      "link": "http://www.nuforc.org/webreports/062/S62789.html",
      "state": "KS",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b583a",
      "summary": "UFO over Wichita Kansas, at around 18:00 hr on Saturday July 29th 2006",
      "city": "wichita",
      "shape": "oval",
      "date": "2006-10-30T00:00:00",
      "story": "UFO over Wichita Kansas, at around 18:00 hr on Saturday July 29th 2006 What we saw was a round shape, transmuting between a solid metallic to a light form, the light wasn’t steady. The best way to describe it would be like a shaking light that was in the middle of the round metallic shape. The object was crossing the sky at around 18:00 hr on a clear day with an approximate altitude of 6000 ft heading north at low speed. The object never stopped its trajectory but the speed wasn’t constant, it did change a couple of times.",
      "link": "http://www.nuforc.org/webreports/051/S51817.html",
      "state": "KS",
      "duration": "0:45"
    },
    {
      "_id": "64d005f478aba2ec5a3b6249",
      "summary": "Another report of the 3 flashing lights in the sky Halloween '96",
      "city": "wichita",
      "shape": "light",
      "date": "2007-06-12T00:00:00",
      "story": "Another report of the 3 flashing lights in the sky Halloween '96 I've seen another description of this event and just wanted to add my memory into it to confirm. The other entry has it dated 10/30/1996 however I was a young kid Trick-Or-Treating at the time and I'm nearly positive it was the night of Halloween 1996. As a large group of family were walking down the street trick-or-treating we spotted 3 stationary lights in the sky. The lights were seen through cloud cover so no actual object was seen, and I can't be sure if the lights belonged to one object or multiple objects. The 3 lights were flashing in sequence, however I can't remember in which direction. The other report states it was right to left, but I honestly can't remember that detail. The next day we heard on the news that many others had seen the lights and there was no explanation for them.",
      "link": "http://www.nuforc.org/webreports/056/S56798.html",
      "state": "KS",
      "duration": "~5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b6729",
      "summary": "After my evening run I was standing in my back yard and stretching. As I was stretching I noticed movement in the sky. At first I thoug",
      "city": "wichita",
      "shape": "diamond",
      "date": "2006-10-30T00:00:00",
      "story": "After my evening run I was standing in my back yard and stretching. As I was stretching I noticed movement in the sky. At first I thought that it was a bird catching the reflection off of the stadium lights from the nearby college. As I watched more intently I noticed lights on the bottom of the object that appeared to merge from one color to the next. The object was diamond shaped and moved rapidly in several directions. The movement was dramatically faster than anything that I have seen in my military experience recently in Operation Iraqi Freedom. The object was changing direction in a short period of time and then shot straight up in the air and disapeared. My wife was freeked out when I told her. It is now 21:23 so this happend just moments ago. I only wish that I had a camera.",
      "link": "http://www.nuforc.org/webreports/052/S52251.html",
      "state": "KS",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b6eba",
      "summary": "Power outages darken west Wichita and points west on the morning of January 8, 2008",
      "city": "wichita",
      "shape": "other",
      "date": "2008-01-21T00:00:00",
      "story": "Power outages darken west Wichita and points west on the morning of January 8, 2008 The Wichita Eagle - Power outages darken west Wichita and points west  More than 14,000 Westar customers lost electricity in Wichita on January 8, 2008. Goddard and other towns west of the city this morning because of what Westar officials are calling \"a transmission event\" at the utility's substation in west Wichita.  \"We don't know for sure exactly what happened,\" Westar spokeswoman Erin La Row said Tuesday morning. Reports of multiple transformers blowing at Westar's substation at 226 N. Hoover may not be accurate, La Row said. \"It's been described as a 'transmission event,' \" she said, though she could not provide more details yet. Widespread power outages were reported west of Ridge Road in Wichita, as well as in Goddard, Garden Plain, Cheney and Pretty Prairie, she said.  The outages are affecting homes, businesses and schools, officials say. At least four schools in USD 259 lost electricity and went to backup generators, district spokeswoman Susan Arensman said: Peterson Elementary, 9710 W. Central; Wilbur Middle School, 340 N. Tyler; McCollom Elementary, 1201 Waddington; and Levy Special Education Center, 400 N. Woodchuck.  \"We might have more schools\" lose electricity as the morning progresses, Arensman said. \"This thing is obviously changing as we go.\"  \"Pretty much all\" of the traffic lights in northwest Wichita are not working as a result of the outage, a Sedgwick County dispatch supervisor reported. But traffic appears to be flowing smoothly despite the outages, Patrol West Bureau Sgt. Guy Schroeder said. Police have been sent to high-traffic intersections, he said, but no problems have been reported.",
      "link": "http://www.nuforc.org/webreports/060/S60967.html",
      "state": "KS",
      "duration": "morning"
    },
    {
      "_id": "64d005f478aba2ec5a3b719d",
      "summary": "It was about 11:00 pm I was outside smoking a cigarette because I don’t smoke inside. I was talking to my spouse and I looked up becaus",
      "city": "wichita",
      "shape": "triangle",
      "date": "2007-11-28T00:00:00",
      "story": "It was about 11:00 pm I was outside smoking a cigarette because I don’t smoke inside. I was talking to my spouse and I looked up because I caught movement behind some rather large trees up in the sky. I do not think I would have been able to see it if the trees hadn’t broken up the shape of the object. It was like nothing I’ve ever seen before. In the movie Predator the predator creature uses some kind of stealth/cloaking technology to remain unseen, and this was very similar in the manner that it was very difficult to visually make out. I know it was not a plane because it was far to large for that, and there were very dim yet distinct lights that were just as difficult to make out on what appeared to be the outside edges of the object. The object was about the size of two football fields in width and one in length, and was shaped like a triangle. The object was rather difficult to discern, it was as though it was and was not there. The lights gave it a shape, but no distinct characteristics were evident. Because of the way it moved with the trees in my field of view in front of the object I was able to pinpoint its location and trajectory, after it passed over the trees I got a more distinct view in open clear sky. \t At first I thought it was a hallucination or something but when it reached the clear sky I got a good look at it and I knew it was there. Our planes move through the sky and against the pressure of the gases that make up our atmosphere, as a result  you can see some difficulty in how slow they move even though you know they are moving really freaking fast. This object appeared to move effortlessly, and smoothly-like there was no resistance- and I called out to my spouse- What the hell is that- and started running toward the street to get a better look at it due to it’s movement it was going toward a blind spot to- my at that time current position. My spouse did not have an opportunity to see what I was describing because as I ran toward it, it disappeared from my field of vision- strangely enough before it entered the area that would have been the blind-spot in my field of vision. ((NUFORC Note:  Witness indicates that the date of the incident is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/059/S59887.html",
      "state": "KS",
      "duration": "a couple minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b725a",
      "summary": "dream seemed so real upside down frying pan ufo in 1980s .",
      "city": "wichita",
      "shape": "other",
      "date": "2007-06-12T00:00:00",
      "story": "dream seemed so real upside down frying pan ufo in 1980s .  well i didnt exactly see a ufo in reality, but i had a dream that is really freaky. please read this i am concerned it is a true report that i need help on. well i dreamed that a ufo that looked like an upside down frying pan was flying aroud the straight of girbralter it put some thing into the mountian in the 1980s. then i moved to present year in my dream.people started to die from what ever the ufo put in the mountian. the craziest thing is  i have never seen the straight of girbralter when i looked up some images on the internet i seen the mountian that was in my dream. i futher researched this cause it was very disturbing. upon this futher research i found that a russian sailor spotted a upside down frying pan shaped ufo in 1984. this dream was so real and i dont know if i shoud start to warn people please help ((NUFORC Note:  Witness indicates that the date of the incident is approximate.  PD)) ((NUFORC Note:  Witness elects to remain totally anonymous;  provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/056/S56783.html",
      "state": "KS",
      "duration": "?"
    },
    {
      "_id": "64d005f478aba2ec5a3b7903",
      "summary": "3 pulsing , flashing lights in Ks",
      "city": "wichita",
      "shape": "teardrop",
      "date": "2006-07-16T00:00:00",
      "story": "3 pulsing , flashing lights in Ks My Friend and I were sitting on her deck late at night and we both saw at the same time, 3 flashes that seemed to pluse streak across the sky at about a 45 degree angle.  The flashes were blueish green and just blinked out of exsistence.  We thought \"how very X-Files.\" ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/051/S51085.html",
      "state": "KS",
      "duration": "5 sec"
    },
    {
      "_id": "64d005f478aba2ec5a3b8190",
      "summary": "Three orange lights",
      "city": "wichita",
      "shape": "triangle",
      "date": "2009-03-19T00:00:00",
      "story": "Three orange lights northwest of my house i saw 2 red/orange lights and just assumed it as an plane or helio but it was moving so slow i dont think it was either of those. As it moved eastward it passed sum cell phone towers and i could see it was triangle shaped. It slowed to a stop then went like like a bat out of hell south then i couldn't see it anymore",
      "link": "http://www.nuforc.org/webreports/068/S68408.html",
      "state": "KS",
      "duration": "1 hour"
    },
    {
      "_id": "64d005f478aba2ec5a3b89f1",
      "summary": "Boomarang shaped faint  and big and fast no sound.",
      "city": "wichita",
      "shape": "other",
      "date": "2009-12-12T00:00:00",
      "story": "Boomarang shaped faint  and big and fast no sound. We came home got out of the car and I looked up like I always do, I'm a ameture astronmer. It was dark and clear looking from zenith south about 20 degrees something that was faint and moving caught my eye. I got the rest of my family to look.What we saw was faint but had lights was big. Was boomarang shaped, Lights did not flash or change color. This moved south and was fast.",
      "link": "http://www.nuforc.org/webreports/072/S72780.html",
      "state": "KS",
      "duration": "20 sec."
    },
    {
      "_id": "64d005f478aba2ec5a3b8ad3",
      "summary": "triangle with green lights and black outer shell over wichita.",
      "city": "wichita",
      "shape": "triangle",
      "date": "2010-02-14T00:00:00",
      "story": "triangle with green lights and black outer shell over wichita. while driving to a rehersal, we took a different route then normal. in the corner of my eye i noticed that there where 3 green light so i looked over there. and in doing that i noticed a triangle aproximately 25ft all sides. while looking at the triangle i noticed that the outer part of the craftwas black and looked like it had little squares almost like on the space shuttle.after two or three minutes the triangle turned down  and took off leaving a trail of smoke behind it. while watching two warthogs went after it from mconnel air base.",
      "link": "http://www.nuforc.org/webreports/073/S73873.html",
      "state": "KS",
      "duration": "1-2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b8baf",
      "summary": "It was summer, I had my dauther who is now 17. I was at my father in law house looking trought the back door, wich has an open view so",
      "city": "wichita",
      "shape": "disk",
      "date": "2008-08-12T00:00:00",
      "story": "It was summer, I had my dauther who is now 17.  I was at my father in law house looking trought the back door, wich has an open view so I was watching the fireworks.  I was there like for 30 to 45 minutes and it was getting late so It was around 10:30 or 11:00 pm  My husband at the time was helping my dad in law fix a car my sister in law was with me she was litle at the time, when suddenly I was looking at this light going front then back front then back I thought that was weird then it will turn side ways and I could see lights really brigth lights diferent colors I remember blue,red,some sort of yellow, I dont remember seeing any green but when It will turn half way it look like a shape of a triangle ,made of the lights and then it started goin up and down up and down then side to side I was like hiptnotysed I dont know how long I stared And at some moments I thought that what ever it was It knew I was watching cause It started doing all the moves up then down side to side turn half way in a combination then suddenly just like a shoutting star It disapear in a second all I saw was a really fast line of colors and It was gone  But Im very curious and I desided to drive around there is a park near where I was Is call evergreen park and I put my dauther in the car seat in the car and got my douther in law I dont even tink I told my husband or anybody that I left with my little sister in law and I started driving I couldnt see anything and suddenly thei it appear around the park It was in a distance where I could see the lights really good and I wasn't scare I was but I was more curious It was doing the same moves turning the same way and my sister in law was watching too and suddenly it move And I could see it was just like it was park on top of a light polethen I drove on arkansas street to 29th north their is another little socker park but this time I was really scare It was floatting on top of the light pole and I drove closer real close it was like it was letting me seeit it turn and I loo! k at all the colors red,blue some sort of yellow and it was turning but only side to side and only half turns not all the way then it turn sideways and I could see the triangle made of lights the lights were making the shape then I was so closed to it I could see it really big with details I can still draw it it had like little windows around and on the buttom there was circles thats where the lights was coming from I remember a white light also and I was just there my sister in law too and suddenly I got so scare like never before and a feeling that they was mad because I was to close I was reapitting they are mad at me Im to close and the n I was tinking of my baby that thing was so close to me I could feel some sort of breeze air wind what ever you want to calle it the I starded driving really fast and I reallice I was driving around the park THEn I couldnt seeit any more then I realyse it was on top of my car thats wy I couldnt seeit then I drove awain around by this point I was Hysterical and my sister in law crying my baby crying just a mess then it went to the light pole again and just like that it desapear just like that and it felt so quiet I turn off the car cause I knew it was gone calm the kids down and drove home I keep on looking if anybody seen what I saw but nothing everythin look so normal no body notice that I had left the next day i put the news for anything but nothing I told several persons but they look at me like Im crazy but I know what I saw I never ask my sister in law never had if she remembers she had never ask me anything I dont think my dauther even she was only two months old nobody belived me only my mom because she had and encounter when she was little she says she remembers little skiny bright peopple one of them touch her head and she saw the saucer too with all the colors and that was in zacatecas mexico so thats all Im not lying why should I I dont wain anything but I know what I saw when I was 16",
      "link": "http://www.nuforc.org/webreports/065/S65061.html",
      "state": "KS",
      "duration": "MORE THAN AN HOUR"
    },
    {
      "_id": "64d005f478aba2ec5a3b9889",
      "summary": "bright orange, flickering, upside down teardrop shape, moving fast, no audible noise over s.w. Wichita, KS",
      "city": "wichita",
      "shape": "",
      "date": "2010-02-14T00:00:00",
      "story": "bright orange, flickering, upside down teardrop shape, moving fast, no audible noise over s.w. Wichita, KS I saw a bright orange object about 5 blocks to the south of me through the trees moving north.  At that time my 15 year old daughter came out and we both just stared at this object as it got clear of any trees and was directly above us.  It was shaped like an upside down teardrop.  It was dark orange on the top and faded into a softer shade of orange/yellow on the bottom, it also seemed to flicker.  It was moving at a fairly fast rate of speed, but there was no noise audible.  It was really weird, like nothing we have ever seen and we were both juat awestricken.  Very Strange!",
      "link": "http://www.nuforc.org/webreports/074/S74067.html",
      "state": "KS",
      "duration": "3-4 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b9d95",
      "summary": "Orange teardrop-shape craft",
      "city": "wichita",
      "shape": "teardrop",
      "date": "2010-06-10T00:00:00",
      "story": "Orange teardrop-shape craft My wife and I had just gotten home from a late walk in southwest Wichita, I was pointing out constellations to her when we both saw a craft approach from the south with no indicator lights like a airplane and no audible engine noise.  It was dark orange that faded to light orange, we first thought it might be a plane on fire but it kept a constant path and speed.  The craft did a 90 degree bank to the east and faded outside the city limits.  I was reluctant to report it until I saw the other report made.",
      "link": "http://www.nuforc.org/webreports/075/S75714.html",
      "state": "KS",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b9e50",
      "summary": "I photograph light balls and obj.s in sky every night lately.  ((NUFORC Note:  Probably celestial bodies, we suspect.  PD))",
      "city": "wichita",
      "shape": "other",
      "date": "2009-08-27T00:00:00",
      "story": "I photograph light balls and objects in sky every night and increasing lately. I have been taking pictures of sunsets every night and I keep finding that I have unexplained objects in the sky in my pictures.  I have hundreds now with red, blue, green, yellow, orange, grey, really all colors of light balls in then and in many different shapes. Some of them appear like an orb but they all seem to have a black hole in them. Some then are single, some grouped in 2 or more.  On some of the objects you can see a precise ring of lights.  There is no question looking at my pictures what I am getting in the sky every night.  Last night I started seeing them as the flash went off.  They were in my face and all around me.  They seem to come out in thunderstorms, like they like the weather. ((NUFORC Note:  Probably celestial bodies, we suspect.  PD))",
      "link": "http://www.nuforc.org/webreports/071/S71683.html",
      "state": "KS",
      "duration": "all night"
    },
    {
      "_id": "64d005f478aba2ec5a3ba43d",
      "summary": "Large object observed during the day over Wichita, KS.",
      "city": "wichita",
      "shape": "cigar",
      "date": "2009-08-28T00:00:00",
      "story": "Large object observed during the day over Wichita, KS. Father and I observed a very large cigar shaped object over Wichita, KS, while travelling to a local gun show.  Object appeared small to the naked eye but could make out depth in the object which leads me to believe the object was very large but very high in the sky, something similar to a battleship although did not observe any weapons.  The object remained in view for about 30 secs before we lost sight of it as we turned north.  When we stopped the object was not there anymore.",
      "link": "http://www.nuforc.org/webreports/071/S71896.html",
      "state": "KS",
      "duration": "30 secs"
    },
    {
      "_id": "64d005f478aba2ec5a3ba43c",
      "summary": "2 formations of 5 lights and 3 lights E and S of Wichita, KS same night within 10 min.",
      "city": "wichita",
      "shape": "formation",
      "date": "2009-08-28T00:00:00",
      "story": "2 formations of 5 lights and 3 lights E and S of Wichita, KS same night within 10 min. While traveling home about 30 min after sunset saw five lights appear E of Wichita, KS.  These objects were high enough above the horizon that I could see them but not high in the sky from my vantage point which leads me to believe these objects were a good distance away from where I observed them.  If an aircraft were to drop a flare right above you it would seem high in the sky, but if you were 10-20 miles away the flares would seem low on the horizon because of the distance which is how I could describe it.  These lights to me didn't seem like flares because they did not appeare one after the other. When they appeared it was almost like a formation of fighters that lit there after burners all at the same time only from the distance between the lights and myself it would not be redish white but more like a star.  These objects remained in the sky for about 3 min and then all disappeared like they appeared.   When I got home I noticed three lights in the same formation as the first formation only these light were due south of town.  They remained in the sky for only a minute and then disapeared as suddenly as they appeared. I am into weather and aviation.  I live and was raised in the air capital of the world and we have both an airport and military airbase here in wichita.   Being that my eyes are always in the sky I know aircraft lights and these were not that.  Dont want to say that they werent aircraft but then again have never observed a formation of redish white lights as bright as a flare like that in my life. ((NUFORC Note:  Witness indicates that date is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/071/S71900.html",
      "state": "KS",
      "duration": "10 min"
    },
    {
      "_id": "64d005f478aba2ec5a3baffa",
      "summary": "Green round ball flying through the sky",
      "city": "wichita",
      "shape": "oval",
      "date": "2011-03-10T00:00:00",
      "story": "Green round ball flying through the sky Well my wife and I were coming back from a funeral in New Mexico.  And I say it was close to between 8:30 to 9:00 p.m.  We were just outside of Oklahoma city, Oklahoma. My mom and uncle were in a car ahead of us and our phone battery had died, and we were running low on gas, so we didnt want to stop or pullover until we had stopped together to get gas. So I am looking out the passenger window and I see this bright green ball about 2 miles away, my guess it was about 200 feet of the ground,and I could not see any blinking or flashing lights, just this green ball moving quickly across the sky, it was moving pretty fast,  I watched it go from east to west, then it moved more to the southwest.  Then as fast as I saw the object it dissappeared, all this happened so fast I didnt tell my wife until she asked me what I was looking at, now I wished I had her pullover and look at it. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD)) ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/080/S80343.html",
      "state": "KS",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3baff9",
      "summary": "((HOAX??))  Green round ball flying through the sky",
      "city": "wichita",
      "shape": "oval",
      "date": "2011-03-10T00:00:00",
      "story": "Green round ball flying through the sky Well my wife and I were coming back from a funeral in New Mexico.  And I say it was close to between 8:30 to 9:00 p.m.  We were just outside of Oklahoma City, Oklahoma. My mom and uncle were in a car ahead of us and our phone battery had died, and we were running low on gas, so we didnt want to stop or pullover until we had stopped together to get gas. So I am looking out the passenger window and I see this bright green ball about 2 miles away, my guess it was about 200 feet of the ground,and I could not see any blinking or flashing lights, just this green ball moving quickly across the sky, it was moving pretty fast,  I watched it go from east to west, then it moved more to the southwest.  Then as fast as I saw the object it dissappeared, all this happened so fast I didnt tell my wife until she asked me what I was looking at, now I wished I had her pullover and look at it. ((NUFORC Note:  We wonder if this is a hoax.  Source elects to remain totally anonymous, and provides no contact information.  The source of the report indicates that the sighting occurred on December 19, 2011.  Date is flawed, so we have amended it above.  PD)) ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/080/S80342.html",
      "state": "KS",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bb02e",
      "summary": "10 sphere objects over wichita ks municiple airport",
      "city": "wichita",
      "shape": "sphere",
      "date": "2011-01-31T00:00:00",
      "story": "10 sphere objects over wichita ks municiple airport We wer fishing that morining, it was about 9:00 am . We were on a private pond just southeast of the WICHITA MUNICIPLE AIRPORT.  We wer facing the west wich is great view of the planes landing and taking off.I kept seeing these little white disc shaped objects.  I didnt pat much attention. when i looked up again, I could see these white disc objects again.   I asked the others guys that were with me if they could see what I was loooking at (as i was pointing to the sky) they said yes.  My buddy went to the truck to get his binoculars, we could all see the disc shaped objects in the sky.  It looked like they wer close to the planes landing and taking off.  Im sure the pilots could see and also the control tower.  There wer at least 10 objects in the sky at the end they seemed to look cigar shaped then they went in to the clouds.  They wer all moving at a slow then high rate of speed and not in any particular pattern.  Her in wichita kansas lately.  There seems to be some activity towards the airport in the sky at night.  The back of my house faces the airport great view of all aircraft and sky.",
      "link": "http://www.nuforc.org/webreports/079/S79821.html",
      "state": "KS",
      "duration": "20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bb1b6",
      "summary": "Quiet slow moving craft with red , blue and orange lights that dissapeared in the night sky",
      "city": "wichita",
      "shape": "diamond",
      "date": "2010-08-24T00:00:00",
      "story": "Quiet slow moving craft with red, blue and orange lights that dissapeared in the night sky It was difficult to really tell the shape as it had gone past when we saw it. It was moving west at a very slow speed for any type of craft except a plane approaching landing.  There were what appeared to be red, blue and orange lights toward the front that were glowing steadily.  After this thing went about a mile past us the lights went out and you could no longer see it.  About three minutes passed and there it was again going overhead to the west and again after a few minutes the lights went out again.  A second craft maybe?  Strangest thing I have ever seen on a clear night with a nearly full moon to boot.",
      "link": "http://www.nuforc.org/webreports/076/S76943.html",
      "state": "KS",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bb336",
      "summary": "My neighbors and I were on our way to work. As we were leaving our garages a huge light was seen by Scott, my next door neighbor. He ye",
      "city": "wichita",
      "shape": "egg",
      "date": "2011-04-03T00:00:00",
      "story": "My neighbors and I were on our way to work.  As we were leaving our garages a huge light was seen by Scott, my next door neighbor.  He yelled over to me, at first we thought it was a helicopter.   However, the light began pulsating and my neighbor yelled!  Many of us heard him and ran to where he was looking.  The light continued to move in an odd formation for several minutes.  It bounced up and down, no helicopter can manouver like this!",
      "link": "http://www.nuforc.org/webreports/080/S80707.html",
      "state": "KS",
      "duration": "20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bb6e1",
      "summary": "Cylinder shaped object  sighted above Wichita, KS",
      "city": "wichita",
      "shape": "cylinder",
      "date": "2011-01-05T00:00:00",
      "story": "Cylinder shaped object  sighted above Wichita, KS It was around five PM and my dad was taking me home from my sisters house. We were heading north and i was looking east towards some birds and train tracks.  Past the tracks where large grain elevators, i noticed a object above the grain elevator. I told my dad to turn to the right to see the object more closer.  The object was about 40 degrees from us and about 300 ft away.  Its shape was like a cylinder and was some what matalic looking. It started to move south as we got a better view.  I got the feelong it knew we saw it, we were moving parallel to the object.  My dad did not think it was a UFO. He told me its just a plane.  He decided to turn the truck back towards home and i looked back to see it one more time but the object was gone.",
      "link": "http://www.nuforc.org/webreports/079/S79495.html",
      "state": "KS",
      "duration": "about 3 min"
    },
    {
      "_id": "64d005f478aba2ec5a3bb6c1",
      "summary": "UFO sighting wichita kansas aug 13 2010 2 crafts amber color",
      "city": "wichita",
      "shape": "oval",
      "date": "2010-08-24T00:00:00",
      "story": "UFO sighting wichita kansas aug 13 2010 2 crafts amber color at 10pm i went outside to smoke a cigarette and saw two strange lights outside. one was an oval shape and the other was a weired looking triangular shape that had 1 long tail.  Both was a amber color similar to a candle light. the triangular one was on top towards the right of the oval.  they both hovered and it seemed like to be about maybe 5-10 miles away from where i was standing. first it both held its position for about 30 seconds then the triangular shape ufo started to diminish, it wasn't fast but very slow forming a second oval shape. that took about 20 secs, then the same triangular ufo that turned into a oval gotten smaller but didnt seem to more farther in distance.  it became a little spec of light and disappeared. keep in mind the lower oval shaped one was still there this whole time. ok it now gets better. then the oval shape one still hovered at the same position for about 3-5 minutes. then a light started to appear to the bottom left of the oval! shape and started to form a oval i think it was the second craft coming back. by then i was so amazed and a little freaked out. they both hovered for another 2-3 mins not moving or anything. then the lower left one started to fade. then the single oval shaped craft that never moved stood there another 2 mins then faded. that whole sighting lasted about 10 mins. it never changed color, just shape. i didnt hear any noise at all.. keep in mind the direction that i was looking at was towards McConnell air force, Cessna aircraft, and boeing. so it could have been a experimental plane but i know for sure a plane when i see one because i used to work in the aircraft industry. i truly believe i seen a UFO. i didnt have my phone on my at the time so i couldnt take any pictures.",
      "link": "http://www.nuforc.org/webreports/077/S77201.html",
      "state": "KS",
      "duration": "10 mins"
    },
    {
      "_id": "64d005f478aba2ec5a3bb869",
      "summary": "4 fireballs streak across WIchita Ks July 4th 2010",
      "city": "wichita",
      "shape": "fireball",
      "date": "2010-07-28T00:00:00",
      "story": "4 fireballs streak across WIchita Ks July 4th 2010 July 4, 2010 Wichita, KS.  It was July 4th and my wife and I wanted to watch the fireworks. It was getting dark, but it was still light. I got the ladder out so we could get on the roof and watch the neighbors shoot off fireworks. After my wife and I got on the roof, we both saw a fireball streak across the sky, from the south heading what looked to be due north.  There where clouds also that night. It was traveling at a very high rate of speed.  The fireball was bright orangish and was directly to the west of us. We could see it as it passed in and out of the low clouds, reminded me of the flame coming off a missle. But, I didn't think it was.  A few minutes later we saw another one.  Same type direction and so forth.  The Fourth one though, came out of the south and flew directly over head at which point I could no longer see it for the clouds. I had gotten a real good view of it. It was just a fire football shaped traveling very rapidly.  Jets fly over all the time but it was going at a much faster rate.  And it seemed to be heading North by Northwest.  It didnt leave trail of any sort and it wasn't any sort of fireworks.  I am in my 40's. I honestly dont know what it could be.  I am submitting this upon the request, of the UFO REPORTING AGENCY asked that anyone who saw anything to send in your report.  All four fireballs were flying low. The one I saw directly above me was about less than a thousand feet in the air. I had been wondering what it was we saw.  But hadn't heard anything until today, about it.   Hope this information is of some help.",
      "link": "http://www.nuforc.org/webreports/076/S76730.html",
      "state": "KS",
      "duration": "5 min."
    },
    {
      "_id": "64d005f478aba2ec5a3bbf08",
      "summary": "Saw a bright tear-like triangular shape in the sky that did not move for more than 30 minutes. ((NUFORC Note:  Jupiter?  PD))",
      "city": "wichita",
      "shape": "triangle",
      "date": "2011-12-12T00:00:00",
      "story": "Saw a bright tear-like triangular shape in the sky that did not move for more than 30 minutes Driving east on US Highway 96 between Hutchinson and Wichita, KS, when I observed a \"weird\" looking star.  It was brighter than most stars and with the sky being overcast, for one to shine so brightly it caught my attention.  It was north of the highway.   After seeing this \"star\" I looked in other directions and noticed two others (one further east and one south).  These \"stars\" did not appear to be moving. Looking further, I observed it looked like a tear in the dark sky letting light seep through in a triangular shape.  As I was driving, the two others disappeared from my line of site, but the one to the north stayed stationary.  The star remained in site until I arrived at my home. Then I cam inside and looked for a website to report it on. I was listening to the radio and talking on my cell phone all of the way and had no interference. I had not been drinking or using illegal substances and am not overly tired.  The feelings I experienced were facination at first and then after realizing it was something unknown, I kinda got that X-File like paranoia.  I made sure I stayed with traffic and drove through popuplated areas all the way home. This is my very first reporting. ((NUFORC Note:  Jupiter?  PD))",
      "link": "http://www.nuforc.org/webreports/085/S85045.html",
      "state": "KS",
      "duration": "30+ min."
    },
    {
      "_id": "64d005f478aba2ec5a3bbfa7",
      "summary": "Dim slow moving ball of light suddenly very bright white turning 90° and shooting straight up.",
      "city": "wichita",
      "shape": "light",
      "date": "2011-10-10T00:00:00",
      "story": "Dim slow moving ball of light suddenly very bright white turning 90° and shooting straight up. A dim ball of light appeared in the blue sky.  I thought it was a shooting star.  Was moving relatively slow.  It was traveling southwest.  It suddenly got really bright white, picked up speed and shot upward in a 90° direction out of sight. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/083/S83751.html",
      "state": "KS",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bc4d3",
      "summary": "Red light dropping balls of light.",
      "city": "wichita",
      "shape": "light",
      "date": "2012-01-12T00:00:00",
      "story": "Red light dropping balls of light. On Jan. 5,  2012, at around 10:30pm, I saw a red object in the horizon (S.E.).  It was the size of a star but I could tell it was  move toward me so I watch it and as it drew closer, it began to drop things that appeared to be burning.  The falling objects fell and then disappeared.  Then, the object itself disappeared.   I went in the house and told my kids what I had seen.  Then, I went back out to see if I could see it again.  I didn't see it, but I did see another one exactly like it coming from the same direction and following the same path.   So I went in and got my coat and told the kids, \"Here comes another one\"!  My daughter came out and watch it with me.  This one came much closer, almost directly over my house and was dropping balls of light 5 or 6 times.  Then, suddenly, it seemed to separate into several small objects and disappeared.  I would say the siting last approximately 15 min.   I called 911 and the police came out and said someone else had also seen it.   I don't know what it was, but I know it wasn't a plane of helicopter.  It didn't blink or make any noise that I could hear.",
      "link": "http://www.nuforc.org/webreports/086/S86327.html",
      "state": "KS",
      "duration": "15 min."
    },
    {
      "_id": "64d005f478aba2ec5a3bce7e",
      "summary": "Looking east about 3 miles over the airforce base i watched a small sphere make small sudden movements then shoot out to the southeast.",
      "city": "wichita",
      "shape": "sphere",
      "date": "2011-05-29T00:00:00",
      "story": "Looking east about 3 miles over the airforce base i watched a small sphere make small sudden movements then shoot out to the southeast. I work odd hours so it is not uncommon for me to go outside and have a smoke at 2 or 3 in the morning. I usually look up at the stars and unwind before bed.   Last night about 2am, i was looking east from about the 3800 block of south hydraulic street.  I saw a light in the sky. the only way i can describe it is the light was different from a star.  I have a decent knowledge of astronomy and aerospace. (my family were engineers/ Navy/ chemists etc...  So I know the difference between the emission of light from stars and reflection of LEO satellites.   This light looked nothing like either.  It was radiating its own light source.  I studied  it for about 10 minutes and noticed it was oscillating slightly and making very small, rapid movements. Trying to keep an eye on the object and grab the camera from the desk right inside the door.  I took 3 pictures zoomed out all the way. cant make anything out except a small light dot.  The next 3 I took were zoomed in all the way.  I used a 4 year old Canon EasyShare 10Mp digital camera. It pulsed amber light a few times and shot off toward mulvane/Udal area. My wife was NOT amused I woke her this late to tell her what I saw ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/081/S81417.html",
      "state": "KS",
      "duration": "30+ minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bd88d",
      "summary": "My wife and I were driving to a dinner event when she saw them in the North West Sky for about 30 sec.  They were not moving, just sitt",
      "city": "wichita",
      "shape": "cylinder",
      "date": "2012-09-24T00:00:00",
      "story": "My wife and I were driving to a dinner event when she saw them in the North West Sky for about 30 sec.  They were not moving, just sitt ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/092/S92593.html",
      "state": "KS",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bdea8",
      "summary": "Five blinking lights in diamond shape moving from one side of sky to the other.",
      "city": "wichita",
      "shape": "light",
      "date": "2012-05-13T00:00:00",
      "story": "Five blinking lights in diamond shape moving from one side of sky to the other. It is night time so I couldn't really see the shape but it had five blinking lights  two red and two white and one blue in the middle I am guessing it was diamond shaped considering on how the lights were blinking. It was too high and moved too fast to be a helicopter or airplane.  It started from one side of the sky and moved to the other side within 3 minutes I am guessing.  I even had my mother come outside to look at it also and she agrees that it couldn't possibly be and airplane or helicopter either.",
      "link": "http://www.nuforc.org/webreports/088/S88425.html",
      "state": "KS",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3be732",
      "summary": "Bright strange green/blue spark emitting object seen over Wichita Ks",
      "city": "wichita",
      "shape": "light",
      "date": "2012-06-08T00:00:00",
      "story": "Bright strange green/blue spark emitting object seen over Wichita Ks Was on break looked up as I was heading in just in time to see a bright green/blue pulsating light with a trail of bright orange sparks trailing as it moved at an unusual angle/speed toward the ground moving east to west. object disappeared into in coming storm clouds.   Absolutely silent",
      "link": "http://www.nuforc.org/webreports/089/S89387.html",
      "state": "KS",
      "duration": "few seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3beac3",
      "summary": "About 25 bright red lights west of Wichita",
      "city": "wichita",
      "shape": "formation",
      "date": "2012-02-03T00:00:00",
      "story": "About 25 bright red lights west of Wichita Wichita, KS. I stepped out of my house about 8:30pm.   I looked west and saw about 25 bright red lights far off in the sky.  The looked like very bright red stars.   I thought they might be planes or helicopters but there was too many flying too close together.   I noticed that a few of them dimmed till they were not visible so I knew they were not planes since planes do not turn their lights off.   I went inside to get my girlfriend and came out a few minutes later.  There was about 15 lights left by then.   She had no idea what the lights could be.  They were all gradually heading south, some moving faster than others.  I looked down my street and saw several neighbors standing outside all staring at these lights.   After about 15 minutes, it dawned on my to try a picture with my phone.  There was about 4 or 5 lights left by then.   These lights do appear in the picture, though one still can't make out what they are.   I do not understand why this didn't make the local news that night.  I saw a lot of people staring at these lights on my street alone.  There must have been hundreds of people who saw these. ((NUFORC Note:  It didn't make the news, I suspect, because probably none of the witnesses reported it to the news.  PD))",
      "link": "http://www.nuforc.org/webreports/086/S86841.html",
      "state": "KS",
      "duration": "20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3beb8e",
      "summary": "First saw object that have seen on two previous occassions in the past week. It was a bright light that appeared high in the sky.",
      "city": "wichita",
      "shape": "light",
      "date": "2013-09-09T00:00:00",
      "story": "First saw object that have seen on two previous occasions in the past week.  It was a bright light that appeared high in the sky.  Then as it began to move it grew dimmer then vanished after a few seconds.   This night it was even less time but then another light appeared where the first had appeared.  Instead of moving to the east as all the previous ones had this one moved to the north and stayed visible for much longer.   Seriously is anyone else seeing these.  Several in the past few weeks. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/102/S102046.html",
      "state": "KS",
      "duration": "2-3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bf110",
      "summary": "Moving across the sky .. Orange sphere .. running totally silent",
      "city": "wichita",
      "shape": "sphere",
      "date": "2013-07-03T00:00:00",
      "story": "Moving across the sky .. Orange sphere .. running totally silent 2013-06-02 .. South East Wichita Kansas .. 10:30 PM  witness 1: ..  witness 2 and I saw UFO june 2 at 10:30 PM Southeast flying northwest.  I zoomed in with my phone but lost the vid.  Orange (robby thought purplish) pulsating sphere.  In my zoom, I saw it break into a lot of pieces and then come back together.  Lasted about 30 seconds.  The freaky clincher was that it was completely silent!  witness 2: .. witness 1 and I were sitting at the fire pit Sunday night facing south @ approx 10:30 PM .. the second I saw it approaching from behind the trees .. I immediately knew this was something different .. I looked at ((female name deleted)) and said:  \"stand up\".. as it emerged from behind the tree .. it was now in plain sight .. a VERY BRIGHT AND GLOWING redish/orange/purple-ish tint .. a completely round and spherical object . . . as if you held out a penny between your thumb and finger as far as you could and moved it across the sky .. it was moving approx 120 mph like a small plane preparing to land .. moving in a straight line (as a satellite would) but low and slow . . . this WAS NOT an airplane or mechanical craft .. it was hard to tell just how far away it was .. but to me .. it looked close enough to be able to hear if it was something mechanical .. it had no beacon lights .. it had no wing-span and it made absolutely NO sound AT ALL . . . the wind speed was no ! more than 1 mph . . . we watched it for about 25-30 seconds as it approached from the South East and traveled to the North West until it disappeared behind our house and tree line . . .((female name deleted)) watched it in her camera phone (zoomed in) and said for about 2 seconds .. it seemed to separate into smaller pieces as in fireworks (she mentioned fireworks) and then it gathered itself back together . . . the weather was cool/still/very clear and vivid stars . . . something messed up with the phone and ((female name deleted)) was notable to save the video . . . DRATT !!! ..  http://dadmansabode.dailyforum.net/viewtopic.php?p=1685#p1685",
      "link": "http://www.nuforc.org/webreports/098/S98433.html",
      "state": "KS",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bf10f",
      "summary": "Orange pulsating sphere over Wichita, KS.",
      "city": "wichita",
      "shape": "sphere",
      "date": "2013-07-03T00:00:00",
      "story": "Orange pulsating sphere over Wichita, Ks. Orange pulsating sphere flew across the sky silently.  Flew southeast to northwest.  Too close to be satellite.  Broke up into pieces then reformed into sphere.  Disapeared behind tree line.",
      "link": "http://www.nuforc.org/webreports/098/S98348.html",
      "state": "KS",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3bf2e9",
      "summary": "((HOAX??  PROFANITY))  Four bright white horizontal lights turned into a triangle with a red and irane light.",
      "city": "wichita",
      "shape": "triangle",
      "date": "2013-08-30T00:00:00",
      "story": "Four bright white horizontal lights turned into a triangle with a red and irane light Ok so I'm driving home I turn off of Tyler and as I'm driving I see four bright ass lights like stadium lights and they really close to the ground.  And I start slowing down I'm already freaking cause I know that's not normal!  There were no flashing lights like a plane or helicopter just four stadium type lights.  And I'm slowing down the far right light starts moving down and that whole thing forms into a ducking triangle.  (This thing has not moved either) and it starts moving south really slow like I was now trying to catch up to it.  Then all of a sudden it's a triangle with a red light and orange light and it started spinning or rotating really slowly and just cruises south!  It looked like it had wide beams pointing away from it (there were three of those) and the beams weren't bright at all just dim.  And I ducking lost it I went down a dead end road.  Just cruising south really slow.  It turned into a triangle in front of my eyes I watched it! I was shaking I was so freaked out!!!! ((NUFORC Note:  We are not convinced this report is intended as a serious account.  PD))",
      "link": "http://www.nuforc.org/webreports/101/S101108.html",
      "state": "KS",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3bf542",
      "summary": "Object with big bright white lights, and smaller, red, white, and blue lights hovering in the sky.",
      "city": "wichita",
      "shape": "disk",
      "date": "2013-09-30T00:00:00",
      "story": "Object with big bright white lights, and smaller, red, white, and blue lights hovering in the sky. I keep seeing something big, and bright hovering in the sky, and it's been driving me crazy not knowing what it is! Can you or someone please give me and I'm sure there's more people too, but get us an explanation or answers?  I don't know about other people, but I really would like to know what it is!  I have been seeing this object now for about 2 months now. I've noticed that it's usually there about the same time of the day.  I'm thinking that it's usually there about when the sun is setting or more around 8pm and is up there between 30 minutes to an hour. One night I had got my digital camera out to try to take picture's of it, but then right as I was about to take a picture my camera had died on me. I have took some other pictures, but for some reason I couldn't seem to get the flashing colored lights and it just looks like some bright light in the sky.  I was hoping that maybe I could see it a lot better and get some picture's. Then if it turned out to be something that I needed to report, like an alien space craft then I would. Or if it just happened to be something explainable like some type of air craft that was from here on earth, then I would just let it go and not really say anything.  Well right before my camera had died on me, I had saw some red, white, and blue, flashing lights on the object. The flashing lights looked like they were going back and fourth from side to side. I think that was the only color's that I have seen on it flashing.  The part that sucks though is that I didn't get a chance to see anything else. I had only got to see those flashing lights when my camera was zoomed in, but not from the naked eye. When you look at it normally all you can see is a bright light or lights.  I think that if you just kinda glance at it, it only looks like it's one big bright white light, but if you look at it a little longer or try harder to look at it, it looks more like several bright white lights. It's not until you use something else to try to look at it closer that you can tell it has other flashing colored lights.  Every time I see the object that is hovering in the sky it kinda looks like it is the same shape as a flying disk, but then again I can get a chance to see it very close to confirm it. I really hope that someone from this company will try to investigate these sitings that I've been seeing, and get us some answers! Thank you for your time.",
      "link": "http://www.nuforc.org/webreports/102/S102475.html",
      "state": "KS",
      "duration": "30-60 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bf6f3",
      "summary": "Boomer rang Objects!",
      "city": "wichita",
      "shape": "other",
      "date": "2013-06-02T00:00:00",
      "story": "Boomer rang Objects! Saw two boomerrang object fling over the top of me and the only sound made was a swish Sound.  The first one was already pass me, I thought it was a flock of geese then about three mins later the second one right over the top of me.   If I had to guess the size you could put four of the Air Force refuelers side by side and that's how wide it was.  It was translucent so when it went over the stars it would blur them out of focus then back into focus.  I didn't report this because I didn't know if anyone would believe me.  But it was real to me!   P.S they both were traveling north, no turning or anything the only way I know this is because I was using military night vision googles to see them. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD)) ((NUFORC Note:  Witness indicates that the date is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/098/S98193.html",
      "state": "KS",
      "duration": "35 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bf87f",
      "summary": "Red lights over wichtia 12/29/2012.",
      "city": "wichita",
      "shape": "light",
      "date": "2013-02-04T00:00:00",
      "story": "red lights over wichtia 12/29/2012 5 red lights in the sky to the north west of south wichita, ks. red lights appeared in a triangle formation. they where stationary for 20 seconds and then one light dropped off and could no longer be seen.  The other four lights moved into a half circle formation and then side by side in pairs.  Light disappeared into the night sky to north northwest. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/095/S95586.html",
      "state": "KS",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c000f",
      "summary": "Triangular shaped light formation.",
      "city": "wichita",
      "shape": "triangle",
      "date": "2013-07-22T00:00:00",
      "story": "Triangular shaped light formation My neighbor and I were fishing with my six year old son off the Lincoln Street bridge, along the Arkansas River, when my child looks up and says 'Hey look mom!  What's that?'   My neighbor and I look up and see a large triangular shaped formation of white pulsating lights hovering high above downtown Wichita.  About the time that we both were saying 'What the heck IS that?' it seemed to move a bit to the east.  Then its lights smeared as though it were moving very fast and then it simply vanished.  Strangest thing I have ever seen!",
      "link": "http://www.nuforc.org/webreports/100/S100291.html",
      "state": "KS",
      "duration": "45 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c001a",
      "summary": "It was 5 fiery red balls of light shaped in a triangle. They slowly came on amd was very bright. Lasted around 5 seconds.",
      "city": "wichita",
      "shape": "triangle",
      "date": "2013-07-22T00:00:00",
      "story": "It was 5 fiery red balls of light shaped in a triangle.  They slowly came on amd was very bright.  Lasted around 5 seconds.",
      "link": "http://www.nuforc.org/webreports/100/S100261.html",
      "state": "KS",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c0bae",
      "summary": "Massive fleet of amber green spheres flying in odd formation over Wichita, Kansas.",
      "city": "wichita",
      "shape": "circle",
      "date": "2013-12-23T00:00:00",
      "story": "Massive fleet of amber green spheres flying in odd formation over Wichita, Kansas Well i do not remember the exact year but it was about 1985-1987 in the summer.  Me my brother and two cousins were outside in my aunts broken car.  We were just sitting and talking for about a hour.  We all decided to go inside when my brother who is actually five years older than me pointed to the sky and said \"Ya'll look, UFO's!!\".   It was a semi-cloudy night but what we saw traveling into the clouds (sort of speak) was what looked like a fleet of spherical UFO's.  This fleet of space craft flew in complete unison in some very odd pattern (kind of like the formation of Canadian geese, but having 90 degree formations of all sorts).  We thought that we were being invaded by aliens as they flew across the sky at a slow motion with out a sound.  The spherical objects had a amber glow at the bottom. We watched what seemed to be over a 150 craft fly across the sky for about 20 minutes.   I was young then but i know that there had to be many people of Wichita, , that saw this sight, without a doubt. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/105/S105513.html",
      "state": "KS",
      "duration": "25 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c0eeb",
      "summary": "Bright white lights moving around south west Wichita just above cloud cover.",
      "city": "wichita",
      "shape": "light",
      "date": "2014-01-24T00:00:00",
      "story": "Bright white lights moving around south west Wichita just above cloud cover. My wife saw bright white lights moving around in the sky over south west Wichita after getting home shortly after midnight.  I went out to see for myself after she told me what was going on and sure enough I saw them to.  It was unmistakeable. As i'm filing this report at 1:30 am there is still one bright light hovering around over 235 and west st.  It's just above the cloud cover but is so bright it remains visible even when clouds pass under it.  We live by Mid Continent so i see planes take off and land all the time at night so I'm positive these are not any kind of aircraft I have seen before.  They moved around and stopped regularly.  Looked like bright white stars but it became obvious that these were not stars when they started to move.  There were no planes in the sky at all at the time I witnessed these lights.  I have always been a skeptic but this was easily convincing.",
      "link": "http://www.nuforc.org/webreports/106/S106428.html",
      "state": "KS",
      "duration": "90 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c11c8",
      "summary": "On the night of Nov. 30 and Dec. 1 at 4:30 in the morning I woke up and had to use the restroom. I am 70 years old so at my age I canno",
      "city": "wichita",
      "shape": "rectangle",
      "date": "2013-12-12T00:00:00",
      "story": "On the night of Nov. 30 and Dec. 1 at 4:30 in the morning I woke up and had to use the restroom.  I am 70 years old so at my age I cannot sleep through the night. I went to the stool room of the bathroom and while there I looked out the window and saw an object that was not familiar to me.  It was an object that was about the size of our refuse container.  It was about four feet high and four feet wide.  It was black in color.  It was sitting on my neighbor’s driveway in the sidewalk portion in the drive.  The direction from me to the object was north/northeast.  It had a white light on the side near the top – the size of it was one inch by five inches.  It pulsed every two seconds but did not go completely out during the low side of the light.  The object was about 80 -100 feet from my position.  The unusual thing about the object was there were no definitive edges.  The house, driveway, lawn and street looked as normal.  The black object looked as if it shimmered slightly.  It was black but not a dark solid black with lighter streaks going through it horizontally though they were faint.  The only other thing that was not normal was that my ne! ighbor had installed Christmas lights on the lawn next to the driveway.  The lights were not on at that time. I went back to the window two more times – the second time I went back to the bedroom then back to the window.  The third time I went into the bathroom and then back to the window.  This was a Saturday night and we had stayed home -- I did not have an alcoholic drink that night nor have I ever in my life used any kind of recreational drugs. The amount of time I observed the object was about five minutes.  After this I went back to bed and told my wife about it the next morning.  At that time it did not concern me but the next night I was a bit “spooked” by it though nothing else was sighted. The next afternoon my wife and I went across the street to my neighbor’s driveway to see there were any kind of marks that might have been left on the concrete there was nothing  About thirty years ago I noticed a white light that followed me and didn’t have any idea what it was.  This white light followed me for about sixty miles while driving in central Kansas.  This black object was so much closer and seemed so much more real.",
      "link": "http://www.nuforc.org/webreports/105/S105124.html",
      "state": "KS",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c120b",
      "summary": "Very fast, high altitude light traveling from the west to the east.",
      "city": "wichita",
      "shape": "light",
      "date": "2013-12-02T00:00:00",
      "story": "Very fast, high altitude light traveling from the west to the east. Tuesday morning, Nov. 26, 2013, at approximately 06:15 central standard time, I was waiting for the van to warm up.  I observed a light to the south, at a very high altitude moving across the morning sky from west to east.  I would estimate the altitude at somewhere around 90,000 to 100,000 feet and possibly following interstate 40 over Oklahoma City, Okla.  I would estimate the speed to be around Mach 20.  It took approximately 120 seconds for the object to traverse from the west to the east. The object traversed across the sky faster than the space stations, which I have watched from 11,000 feet in the San Christie Mountains at Philmont Scout Ranch.  But a whole lot slower than a streaking meteorite, with no contrail visible.   It appeared to me as if the sun was reflecting off the bottom of an aircraft.  Although there were no white or red strobe lights that was visible.  I feel that this could have been the experimental aircraft, Falcon HTV-2.  I am not sure what it was, but it was fast.",
      "link": "http://www.nuforc.org/webreports/104/S104823.html",
      "state": "KS",
      "duration": "~2 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c1ce6",
      "summary": "A circular, well lit craft accelerated and disappeared.",
      "city": "wichita",
      "shape": "circle",
      "date": "2014-06-13T00:00:00",
      "story": "A circular, well lit craft accelerated and disappeared. I was looking to the east at about 20 degrees up from the horizon when I saw a circular craft that was well lit up traveling to the north.  It was close to the flight path of planes that were taking off at McConnell Air Force Base.  The object was about three miles north of the base.  The object made no sound as it accelerated to the north and then vanished.",
      "link": "http://www.nuforc.org/webreports/110/S110019.html",
      "state": "KS",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c1cf4",
      "summary": "Silver \"pool noodle\" high in the daytime sky, moving slowly and turning as if powered.  Disappeared quickly.",
      "city": "wichita",
      "shape": "cylinder",
      "date": "2014-07-11T00:00:00",
      "story": "Silver \"pool noodle\" high in the daytime sky, moving slowly and turning as if powered.  Disappeared quickly. While driving to a Wendy's at lunch, object was seen overhead.  Silver cylinder, too high to be tethered. Similar proportions to a pool noodle.  Seemed to be flying, not floating.   From the Wendy's drive through looking back to the North the object could still be seen, moving slowly and turning and/or rotating.  After ordering the object was no longer visible.",
      "link": "http://www.nuforc.org/webreports/111/S111357.html",
      "state": "KS",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c1ddb",
      "summary": "1/2 mile straight east of McConnel AFB Wichita. Round SILENT solid dark, round, red object moved straight north from straight south no",
      "city": "wichita",
      "shape": "light",
      "date": "2014-07-05T00:00:00",
      "story": "1/2 mile straight east of McConnel AFB Wichita.  Round SILENT solid dark, round, red object moved straight north from straight south  no variations in direction.  Wind was 20 mph out of southeast any firework debris such as Chinese lantern would have moved SE.  Altitude about 15000 feet.   Object size was about the size of a dime.  Cleared view in 2 minutes.  AFB only has KC135 tankers and no fighters.  Speed hard to estimate.   AFB had no comments.   I am retired Boeing and I know aircraft.  This was NOT fireworks, space station or satellite.",
      "link": "http://www.nuforc.org/webreports/111/S111049.html",
      "state": "KS",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c205e",
      "summary": "Three bright lights moving like a snake across the sky.",
      "city": "wichita",
      "shape": "formation",
      "date": "2014-06-13T00:00:00",
      "story": "three bright lights moving like a snake across the sky. I am a pilot living in a suburb of Wichita.  My home has a view of both the aircraft on arrival to the Air Force Base as well as Jabarra airport.  I am used to seeing planes at night.  What I saw I cannot explain as an aircraft.  I saw three bright, green and red lights evenly spaced move from a standstill west to east across the horizon.   When they moved however it was as if they followed a sinusoidal wave like a snake moving through the sky.  The sine wave was slow but the movement of the three lights as a group was very fast and with no sound.   The lights disappeared from my view behind a house, presumably. ((NUFORC Note:  Witness elects to remain totally anonymous; provides little contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/110/S110174.html",
      "state": "KS",
      "duration": "20 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c2299",
      "summary": "Stationary cylinder object lights up sky and rockets out of sight.",
      "city": "wichita",
      "shape": "cylinder",
      "date": "2014-04-18T00:00:00",
      "story": "Stationary cylinder object lights up sky and rockets out of sight. The cylinder object came into view below the \"Blood Moon.\"   It stayed stationary for about a solid minute, then started to move in circles, the circles got bigger and bigger.   The object began to glow a aqua blue color and finally rocketed directly up.  The farther it went the brighter it got.   Finally it disappeared.",
      "link": "http://www.nuforc.org/webreports/108/S108658.html",
      "state": "KS",
      "duration": "2 1/2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c2536",
      "summary": "Meteor type object that made a 180 degree change in direction at amazing speed.",
      "city": "wichita",
      "shape": "light",
      "date": "2014-11-06T00:00:00",
      "story": "Meteor type object that made a 180 degree change in direction at amazing speed. My fiancé and I were sitting in the back yard facing West near Kellogg and Ridge Rd enjoying the evening and a fire I had lit in our fire pit.  We were layer back in zero gravity chairs watching the fire and looking up towards the sky.  I noticed what seemed to be a falling star and got her attention to look up at it.  As it moved from the North kind of in a South-West Direction it got brighter as a normal meteor would when it breaches the earths atmosphere.  It was moving at an incredible rate of speed as most meteors do.  Out of nowhere, the object did a complete 180 degree turn and started heading in a due North direction.  When I saw this I yelled at my fiancé who was also watching it.  I was excited and started explaining that meteors don't just change direction.  I don't think she quite grasped how important and significant this was.  I continued to watch it and it bobbled in the sky (like a line on a heart monitor would blip downward) but still mainta! ined the same speed.  I lost it behind a tree and never regained sight of it again.  I work as a supervisor in the aircraft industry and have even worked on military aircraft.  This was not a plane.  I am not saying it is alien in origin, but nothing I have ever seen moves that fast and changes direction as quickly as this did.  If I had to venture a guess I would say it is possible it is some sort of military project not yet brought to light, but honestly I am dumb-founded by it.  I told my lifelong friends, and they just kind of snickered.  I am not the type of person who would make up stories.  I know what I saw.  Until last night I never really payed to much interest in these sorts of things, but I would love to find an answer as to what it was.  I will continue to watch the sky at night. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/114/S114604.html",
      "state": "KS",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c251c",
      "summary": "Low in sky, rectangle craft, grey, red lights on back, 2 small wings underneath, sounded like a plane taking off.",
      "city": "wichita",
      "shape": "rectangle",
      "date": "2014-11-06T00:00:00",
      "story": "Low in sky, rectangle craft, grey, red lights on back, 2 small wings underneath, sounded like a plane taking off. Walking up to my house when what sounded at first like a low plane but when I turned around it was really low in the sky shaped like a rectangle with no wings on the side but 2 underneath it with almost like red car lights on the back.  Grey color.  Flying over the house going north.   I ran back to the driveway to get a better look and instead of flying up like a plane would taking off it went down instead behind the roof no longer in view. ((NUFORC Note:  We assume an evening sighting, and have changed the time, to reflect that suspicion.  Witness elects to remain totally anonymous, and provides no contact information, so we are unable to contact her.  PD))",
      "link": "http://www.nuforc.org/webreports/114/S114567.html",
      "state": "KS",
      "duration": "Flew Over"
    },
    {
      "_id": "64d005f478aba2ec5a3c268b",
      "summary": "Bright rainbow colored flashing star that moved east.",
      "city": "wichita",
      "shape": "light",
      "date": "2014-11-06T00:00:00",
      "story": "Bright rainbow colored flashing star that moved east. Bright multi colored light in east sky.  Watched from numerous positions as it flash green, yellow, blue, orange,pink, cobalt blue. Looked like it was at very high altutude heading east slowly.  Thought star or satellite/space station.  But the colors and position ruled that out.  Viewed from 2:00am cst, To 2:38am  10/26/14",
      "link": "http://www.nuforc.org/webreports/114/S114775.html",
      "state": "KS",
      "duration": "35 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c2953",
      "summary": "Hi, I was heading to school Friday morning about 6:00 am 9 19 2014. Well just as I got on k96 heading east I seen a bright light way ou",
      "city": "wichita",
      "shape": "triangle",
      "date": "2014-09-25T00:00:00",
      "story": "Hi, I was heading to school Friday morning about 6:00 am 9 19 2014.   Well just as I got on k96 heading east I seen a bright light way out by the moon.  At first I thought it was maybe saturn but then I said no that's way to brite. Just one bright sol I don't light.  As I'm driving  about 2 or 3 min later I think we'll maybe it's a light from Jabara airpirt.  Not thinking 3 min ago I thought It was a planet.  About the time I hot rock rd.i know think it's a helicopter because it's flying so slow and so low.  Still not thinking I thought it was a planet few min ago. As I go to get off on webb rd.  It almost right in front of me.  I catch about a 3 second good look at it and by the time I got to the bottom of webb.  It was so low was so low I couldn't see it anymore.  It looked like something out of star trek. It was like a double decker triangle something.  And very very very large.  Has to be the craziest thing I have ever seen.will never forget what it looked like. So!  I have a friend who works for Jabara airport and he said he would talk to the guys who watch the radar and see if they know maybe whst it was.  He got told ..don't ask...I'm like really.  I wish they would stop being so secretive about things were not blind.  If anyone can help answer what I seen Friday morning please reply to this.",
      "link": "http://www.nuforc.org/webreports/113/S113806.html",
      "state": "KS",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3c313e",
      "summary": "Low rumbling, like hot air balloon pulling the gas handle.",
      "city": "wichita",
      "shape": "unknown",
      "date": "2014-08-08T00:00:00",
      "story": "Low rumbling, like hot air balloon pulling the gas handle. Low rumbling sound; sounded like hot air balloon above my neighborhood",
      "link": "http://www.nuforc.org/webreports/112/S112257.html",
      "state": "KS",
      "duration": "3-5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c3a50",
      "summary": "Long silver and blue black craft.",
      "city": "wichita",
      "shape": "cigar",
      "date": "2015-07-31T00:00:00",
      "story": "long silver and blue black craft I was outside having a late bbq.  My father and I was facing southeast towards McConnell air force base just standing and talking when about 300 yards away and about 150 feet above the tree tops appeared a long cylinder craft appeared ,there was no sound,only static charge around us.it had an aqua blue upright sort of disk at the tail,and a solid black dot in front it was so bright that it lit up the tops of the trees benath the craft.it appeared ,moved southwest for about 1500 feet and then disappeared into the black disk. ((NUFORC Note:  Witness indicates that the date of the event is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/120/S120758.html",
      "state": "KS",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c435c",
      "summary": "Bright white orb maintaining position to the north west position of waxing moon in daytime (November 7, 2015)",
      "city": "wichita",
      "shape": "changing",
      "date": "2015-11-19T00:00:00",
      "story": "Bright white orb maintaining position to the north west position of waxing moon in daytime (November 7, 2015) Bright white orb maintaining position to the north west position of waxing moon. Around 11:45 AM I am contacted by friend who is over 900 nautical miles away to go look outside at the waxing moon.  I went to the back yard (north side of house) and found the moon and then saw it.  A bright white orb that was stationary, moving in progression with the moon. It appeared big enough to see clearly with 6 x 25 Bushnell binoculars and easy to see with the naked eye since I was standing in the shade of the two story house. The weather was not a factor and there was no clouds and the sky was bright blue. There was no sound or anything emitting from the object. I then proceeded to get my 50 X zoom digital camera out and took still photos from 12:08 through 12:40 PM. The photos are taken at normal focal length and then full zoom, with date/time stamps.  Also without any filtering (polarized or UV).  In fact it could not be seen with the filtering on the camera, only without.  There is no video.  The photos show in one frame two separate orbs of light separated by three widths of the moon, but not detectable with the naked eye. I also had time to set up my Meade refactor telescope and have a very detailed look at the orb.  It changed shape many times going from an elliptical to flat white shape with white light emitting from it. While I was getting the telescope setup my wife also observed it with the binoculars and later looking through the telescope as I took photos. There were no aircraft in the area at low or high altitude.  No contrails. Very similar to other sightings seen since 2009 in the daytime.",
      "link": "http://www.nuforc.org/webreports/124/S124059.html",
      "state": "KS",
      "duration": "2 hours"
    },
    {
      "_id": "64d005f478aba2ec5a3c4446",
      "summary": "2 flashing objects shooting  or flashing lights at each other and two more meeting them and flashing amd then leaving",
      "city": "wichita",
      "shape": "other",
      "date": "2015-11-19T00:00:00",
      "story": "2 flashing objects shooting  or flashing lights at each other and two more meeting them and flashing amd then leaving 2 different flashing red blue white light objects are straight across from each other flashing lights or shooting something and then 2 more come down on both objects from above and flash a light and then the original objects.move up some and as soon as they get to where they stop the ones that flew down shoot off with.   A streak of light and then they proceed to flash each other again and then the same thing happens they come down again has happened about 6 times one is much bigger and brighter mainly blue and white.lights at the same time the moon is in an alignment with 4 other huge white lights in guessing stars or planets obviously.   The other 2 are still flashing at each other as I'm typing this",
      "link": "http://www.nuforc.org/webreports/123/S123836.html",
      "state": "KS",
      "duration": "30 minutes +"
    },
    {
      "_id": "64d005f478aba2ec5a3c4530",
      "summary": "While driving home, I saw 3 cars that were in front of me on a 2 lane road swerve as if to avoid hitting something on the railroad trac",
      "city": "wichita",
      "shape": "cigar",
      "date": "2015-11-19T00:00:00",
      "story": "While driving home, I saw 3 cars that were in front of me on a 2 lane road swerve as if to avoid hitting something on the railroad tracks.   When I got to where they were when they swerved, I saw nothing in the road, but I saw overhead a craft that had what looked like it had white landing lights, but it was too enormous to be a plane.  All I saw was the silhouette of it against a darkening sunset sky. I saw no tail features or wings.  It was just a dark and smooth cigar-shaped craft.   To add to it, there were 3 Cessna chaser-planes tracking and following the craft which was moving very slow.  The Cessna planes which were behind it were flying very unusually low.   The unidentified craft was flying from the South going North as if following the railroad tracks where I noticed it.  The area of town I saw this, 55th St south between Broadway and Seneca, is not a usual commercial flight zone.  McConnell AFB is approximately 5-7 miles from the location I saw this.   When I got home just 5 minutes after I witnessed this, my girlfriend said \"The weirdest thing happened!  The whole house shook just right before you got home and the lights flickered.\"  That's when I told her what I saw and figured it happened at the same time I witnessed the craft.   We live less than a quarter mile as the crow flies from the railroad tracks cross 55th street where the craft was witnessed.",
      "link": "http://www.nuforc.org/webreports/124/S124017.html",
      "state": "KS",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c484e",
      "summary": "I was on my porch looking to the north at the stars. Low just above my roof line I saw a fast moving, dim set of lights moving east to",
      "city": "wichita",
      "shape": "triangle",
      "date": "2015-11-19T00:00:00",
      "story": "I was on my porch looking to the north at the stars.  Low just above my roof line I saw a fast moving, dim set of lights moving east to west.   At first I thought it was just a plane.  As I am in the flight path of McConnell afb, Jabara Airport, and the Beech Aircraft factory.  Yet this made no sound.   What got me was the triangle did a complete rotation counter clock wise yet never changed direction.  Then disappeared behind a house moving west.  I have been around aircraft my whole life.   Living in Wichita, you see planes everyday.  I've never seen anything like this EVER!  The lights on the object were not bright.  (Dimmer than most visible stars)  No strobes or anything.  Never in my life would I have ever thought I would see something like this.",
      "link": "http://www.nuforc.org/webreports/124/S124185.html",
      "state": "KS",
      "duration": "5-8 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c491b",
      "summary": "Very bright white/bluish light, weaves left and right, moves a tad and stops, then repeats.",
      "city": "wichita",
      "shape": "light",
      "date": "2015-10-29T00:00:00",
      "story": "Very bright white/bluish light, weaves left and right, moves a tad and stops, then repeats. Last night, I opened my window, and looked up and saw this very bright light. It would flicker brightly for a few seconds and then dim down a bit.  When it stopped flickering, it would move about a cm or two (if you were to hold out a ruler in front of you) to the left and right, as if it were weaving back and forth. After that it would move about 6 cm to the right and then stay stationary again for a few mins, and it would repeat this motion until it moved far enough away to where it wasn't see-able anymore.  The light i saw was between a bright white and a very very light blue.  And in the area i saw it in the sky, i also realized the litter dipper constellation was viewable near it.",
      "link": "http://www.nuforc.org/webreports/123/S123140.html",
      "state": "KS",
      "duration": "45 minutes +"
    },
    {
      "_id": "64d005f478aba2ec5a3c4b50",
      "summary": "The light moved in a straight line, as it moved it got brighter then dimmer until it disappeared",
      "city": "wichita",
      "shape": "",
      "date": "2015-09-29T00:00:00",
      "story": "The light moved in a straight line, as it moved it got brighter then dimmer until it disappeared I was looking at the sky while the blood moon eclipse was happening and I saw two stars next to each other.  Then, as I kept watching them, one of the stars started to move in a straight line at a pretty fast pace.   It got brighter as it moved for about 2 seconds, then it started getting dimmer and dimmer, until it disappeared.",
      "link": "http://www.nuforc.org/webreports/122/S122320.html",
      "state": "KS",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c5074",
      "summary": "I noticed an object that had emerald green lights over Kellogg and it was going W and stopped and started going E.",
      "city": "wichita",
      "shape": "other",
      "date": "2016-02-26T00:00:00",
      "story": "Going to my car and noticed an object that had emerald green lights over Kellogg and it was going west and stopped and started going east.  It moved pretty fast and seemed to be a little higher  in the sky as it got further east and then hovered appearing to be over the Rock road area. It made no sound.   A co-worker said she thought they were over the base waiting to land, but it wasn't that far away and was virtually silent.  It had some kind of geometric form because the lights were obviously on each connecting point.",
      "link": "http://www.nuforc.org/webreports/125/S125940.html",
      "state": "",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c508a",
      "summary": "One light became four",
      "city": "wichita",
      "shape": "changing",
      "date": "2016-02-19T00:00:00",
      "story": "One light became four February 13, 2016, in Wichita, Kansas.  About 5:30 am, I was taking my dogs out to potty.  I looked up and saw what I thought must be a satellite moving fast from East to West across the sky.  As it got straight overhead, I noticed that it seemed to be flashing white and red and knew it wasn't a satellite.   After another moment, the light separated and spread to four lights in a rectangular formation.  There was no sound and the speed and direction never changed.",
      "link": "http://www.nuforc.org/webreports/125/S125818.html",
      "state": "KS",
      "duration": "A few seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c5384",
      "summary": "We all looked and saw an airplane leaving a contrail lit up by the rising sun.",
      "city": "wichita",
      "shape": "circle",
      "date": "2016-01-14T00:00:00",
      "story": "At 7:45 am, my dad and I were leaving our house to take my children to school. One of them points up to the sky and says &quot;Hey! Coo At 7:45 am, my dad and I were leaving our house to take my children to school. One of them points up to the sky and says \"Hey! Cool! Look at that plane!\"  We all looked and saw an airplane leaving a contrail lit up by the rising sun.  It was amazingly defined, you could see both lines in the contrail.  Then as my dad was driving after we pulled out of our drive, I kept watching this contrail and noticed a disturbance in part of it and pointed it out to him and that's when we both saw an orb-like white thing next to the contrail.  The disturbance I can only describe as it looked like it was almost swirling!  The orb was too big to be a star. From my perspective it looked like it was right by the contrail.  It moved in a figure 8. I noticed it looked as if one side of the contrail was straight as normal while the other made a curvy wwww-shaped line the whole length of it.  All of a sudden, the contrail started dissipating! Almost instantaneously! It was then the orb thing made a 90 degree turn and shot off so fast I lost sight of it.",
      "link": "http://www.nuforc.org/webreports/125/S125230.html",
      "state": "KS",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c54b5",
      "summary": "Two fast moving lights in the night sky.",
      "city": "wichita",
      "shape": "light",
      "date": "2015-12-17T00:00:00",
      "story": "two fast moving lights in the night sky Briefly saw two lights while looking from my yard in west Wichita, very rapidly moving eastward in what appeared to be a coordinated, curving, no-equidistant formation.  Much faster than known aircraft and did not fit things like meteors or laser pointers.  The two lights left my field of view when they passed a local tree line.  The sighting was only for a couple of seconds.   I am a professional pilot and was a little fatigued at the time.  However, if it was only a fatigue-induced hallucination, it is odd the lights vanished at the tree line.   I really do not know what I saw, but wanted to share.",
      "link": "http://www.nuforc.org/webreports/124/S124716.html",
      "state": "KS",
      "duration": "2 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c58a9",
      "summary": "Bright white star like with alternating red and green light in center.  ((NUFORC Note:  \"Twinkling\" stars??  PD))",
      "city": "wichita",
      "shape": "diamond",
      "date": "2016-06-10T00:00:00",
      "story": "Bright white star like with alternating red and green light in center. My husband and I are in the Kellogg and Hillside area.  We went to let our dog out and sit and smoke a cigarette.   My husband was looking at a large elm tree, when he noticed straight south and to the east 3 bright stars and then all of a sudden to the straight west a star, like a Christmas ornament, or 4 points like a diamond shaped, bright light moving, but super slow.  It then had red and green lights that would alternate slowly.   He said “what is that!  Look at that!”  I looked in the direction and saw it also.  It would move so slowly that you had to get a fix by another focal point.   The lights would change color from red to green in the center of the object.  It would literally hover in place for several minutes and then slowly move to the west of the 3 bright stars.  We could not figure what could hover for several minutes at a time.   We tried to take pictures with our cell phone, you can see when it looks like a regular star, and then changes from red to green, but it is so far it came out much smaller than what we saw.  We came in to see if any other reports had been made. ((NUFORC Note:  \"Twinkling\" stars??  PD))",
      "link": "http://www.nuforc.org/webreports/127/S127797.html",
      "state": "KS",
      "duration": "continuing"
    },
    {
      "_id": "64d005f478aba2ec5a3c5a21",
      "summary": "The object zipped across the sky.",
      "city": "wichita",
      "shape": "unknown",
      "date": "2016-05-10T00:00:00",
      "story": "The object zipped across the sky. Small star like in size that looked like a shooting star at first moving from West to East.  We were watching the night sky and seeing the speed of shooting stars thinking this was one too. Initially spotted by one of us then seen by both.  The object moved as fast as a shooting star but once overhead began to move right then back left several times.  It moved so fast across the sky and altitude higher than airplanes that were flying by.  It was amazing.  Zigzagging, then fading away.  No sound or trail.  It looked like a star moving across the sky.",
      "link": "http://www.nuforc.org/webreports/127/S127258.html",
      "state": "KS",
      "duration": "15 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c5cb8",
      "summary": "Circle lights in diamond formation, heading east then dispersing North, East and South.  Late evening. ((anonymous report))",
      "city": "wichita",
      "shape": "oval",
      "date": "2016-12-05T00:00:00",
      "story": "Circle lights in diamond formation, heading east then dispersing North, East and South. Late evening. It was early spring 1994, we were outside listening to music from the car stereo.  The stereo started to static which was odd because we were listening to CD.  As I got in the car to figure it out, I felt like I had to get out of the car to look up.  It was weird as we all looked up and see 5 lights right above us moving east in a diamond formation.  Then they turned up at a 90 degree, well over the speed of a fighter jet, no sound.  As they rose, 2 on the left side took off left (North), middle one went straight up, 2 on right went right (South).  They all disappeared so quickly.  CD static stopped and we all looked up, then looked at each other and ran inside. A few of us talked about, but none of us have spoken of this since then. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/131/S131201.html",
      "state": "KS",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c5d83",
      "summary": "My father and I are in my van with my children. He is driving and I'm the passenger seat. We are going north on Broadway (Aka Old Route",
      "city": "wichita",
      "shape": "light",
      "date": "2016-12-05T00:00:00",
      "story": "My father and I are in my van with my children.  He is driving and I'm the passenger seat.  We are going north on Broadway (Aka Old Route 81) in south Wichita, KS.  My dad points to the northeastern sky and asks, \"Hey, is that a star?\"  Since the sun has already broken over the horizon and the sky is blue, I figured it was a plane far off in the distance with the sun glinting off it and told him that.  I then continue to watch it for a few seconds and I see it drop in the sky and streak off at a 90 degree angle to the west then flash with a bright ball of white light out of sight!   This isn't the first time I have seen something like this in Wichita",
      "link": "http://www.nuforc.org/webreports/131/S131258.html",
      "state": "KS",
      "duration": "20 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c6042",
      "summary": "A white orb appeared in the sky, stationary for a bit, then disappeared.",
      "city": "wichita",
      "shape": "sphere",
      "date": "2016-09-22T00:00:00",
      "story": "A white orb appeared in the sky, stationary for a bit, then disappeared. There was a white orb in the sky towards the south and east in Wichita, KS.  The orb seemed to not move, and stayed in the same position for a while.   There is also photo proof by multiple witnesses, including a news reporter camera. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/130/S130042.html",
      "state": "KS",
      "duration": "30 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c6723",
      "summary": "There was a flashing light that was to fast and bright to be a star and it was moving around at different speeds.",
      "city": "wichita",
      "shape": "flash",
      "date": "2017-04-20T00:00:00",
      "story": "There was a flashing light that was to fast and bright to be a star and it was moving around at different speeds. My dad was smoking and he called me outside and said hurry.  When I went outside, he showed me this flashing light in sky and it was flashing to much and bright to be a star and we focused in it and it was moving around fast and slow.",
      "link": "http://www.nuforc.org/webreports/133/S133588.html",
      "state": "KS",
      "duration": "10 minutes (so far)"
    },
    {
      "_id": "64d005f478aba2ec5a3c6849",
      "summary": "I was driving and spotted 3 objects slowly moving across the sky. They were not drones. They were to big to be drones. They flew in a c",
      "city": "wichita",
      "shape": "disk",
      "date": "2017-04-13T00:00:00",
      "story": "I was driving and spotted 3 objects slowly moving across the sky.  They were not drones.  They were to big to be drones.  They flew in a coordinated line.  They were brown.  They didn't make a noise, and they were not planes.  These looked completely different from anything I've ever seen. ((NUFORC Note:  Source of the report elects to remain totally anonymous; provides little contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/133/S133516.html",
      "state": "KS",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c6a7d",
      "summary": "Orange balls of light in the sky.  ((anonymous report))",
      "city": "wichita",
      "shape": "circle",
      "date": "2017-02-17T00:00:00",
      "story": "Orange balls of light in the sky My wife and I were on the back porch and to the east a little higher than the horizon, (above rooftops of homes) a light just showed up, very bright orange in color, would stay in one place for about 30–45 sec or so, then would just vanish, we saw somewhere around 8-9 of them.  All within about 5 min or so.  None of them were that close, all to the east but miles between each other.  One of them showed up and moved horizontally towards the NW and went behind some roof tops, I went to the front yard to see if I could still see it but could not.  Another white one showed up much higher in the sky and dropped downward in a speed comparable to a jet and then lost a lot of glow and vanished as well, no tail end to any of them.  Just round balls of light. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/132/S132638.html",
      "state": "KS",
      "duration": "1 minute each"
    },
    {
      "_id": "64d005f478aba2ec5a3c6a8a",
      "summary": "2 objects that look like stars moving erratically and stopping abruptly.  ((anonymous report))",
      "city": "wichita",
      "shape": "other",
      "date": "2017-02-17T00:00:00",
      "story": "2 objects that look like stars moving erratically and stopping abruptly. Friday night, Sunday night and Monday morning saw a moving object way above Orion’s Belt.  It moved erratically and came to abrupt stops.  I watched it for a long time. Tonight there are 2 moving objects moving erratically.  One is to the far left of Orion’s Belt and is very bright; the other under Orion’s Belt and is dimmer.  Each object looks like a star but both move in the same erratic manner. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/132/S132639.html",
      "state": "KS",
      "duration": "indefinitely"
    },
    {
      "_id": "64d005f478aba2ec5a3c6a9d",
      "summary": "A brown round shape falling straight down from the sky.",
      "city": "wichita",
      "shape": "other",
      "date": "2017-02-17T00:00:00",
      "story": "A brown round shape falling straight down from the sky.  Fell straight down with a white  vapor trail behind it.  I was driving and lost view of it. ((NUFORC Note:  Source of report indicates that the date is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/132/S132655.html",
      "state": "KS",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c7537",
      "summary": "Baffling Green Orb In the Skies Of Wichita Kansas",
      "city": "wichita",
      "shape": "light",
      "date": "2017-04-28T00:00:00",
      "story": "Baffling Green Orb In the Skies Of Wichita Kansas On Halloween night (31 OCT 16), at approximately 17:03, while trick or treating with my son, my wife, and myself witnessed a green object flying in the sky in the city of Wichita, Kansas.   Initially I thought this was a joke, a balloon, or drone, but the more I looked at it, I realized I was looking at an event I still cannot explain.  I am ex-military, aviation, meteorology, and astronomy are hobbies of mine.  I posses a science degree, and this was an exceptionally bizarre sighting.   Light appeared to be in the shape of an Asian paper lantern, but cropped at the top and bottom, was lime green and was internally lit.  Object was completely silent, and due to overcast, could not  have been more than 500 feet in altitude maximum.   Object was lit in a manner that I have never seen, it was not a LED, or filament bulb.  No light rays extended from the object.   Object did not deviate in altitude and flew very level, and crossed from South to North, where it became obscured by trees in my line of sight.   I asked my son who was in a slightly differing position, where it went, he said it continued in a straight line for a about another second, and curved upward at an accelerated rate of speed and disappeared in the cloud cover.   Again, I cannot explain what I saw, and can honestly state that this was not a drone, or weather related phenomena, and I have never seen a light source of this type.",
      "link": "http://www.nuforc.org/webreports/133/S133857.html",
      "state": "KS",
      "duration": "1 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c7b34",
      "summary": "Not a shooting star or an airplane.",
      "city": "wichita",
      "shape": "light",
      "date": "2017-10-19T00:00:00",
      "story": "Not a shooting star or an airplane. My son and I were in the car driving to his bus stop.  We saw what appeared to be a shooting star moving diagonally.  Which was strange, because it was slower than other shooting stars I had seen previously, and moving in a diagonal fashion.  Then it stopped, and just hovered, so I thought maybe it was an airplane... but it didn't move closer, it just stayed right there on the horizon.  I wanted to watch it longer, but we had to move on.  I kept looking back to see if it had moved, but it was still there on the horizon.  Once we parked, I looked again, and it was gone.  All I know, is that it was not a shooting star - maybe it was a satellite, but it most definitely was not an airplane.",
      "link": "http://www.nuforc.org/webreports/136/S136720.html",
      "state": "KS",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c7e52",
      "summary": "Two bright perfect circle orbs operating perpendicular to each other with exact movement, direction, and speed.",
      "city": "wichita",
      "shape": "circle",
      "date": "2018-05-31T00:00:00",
      "story": "Two bright perfect circle orbs operating perpendicular to each other with exact movement, direction, and speed. On May 29, 2018, I got up this morning as usual about 6am, for quiet time, and happened to look at the security camera.  At first I noticed a perfect little circle orb hovering around the lens, which after a while it moved up and a second circle came up, moving in the exact same format.  Thinking it was possible a reflection of the first circle, upon further observation, I realized these were two different orbs moving back and forth in perfect alignment, without changing direction.  It was as if a reflective object was moving the orbs in unison. I opened the front door and walked toward where the camera indicated the objects were. However, they disappeared off screen.",
      "link": "http://www.nuforc.org/webreports/141/S141669.html",
      "state": "KS",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c7ff3",
      "summary": "I do not know the exact date this event took place. It is currently April 4, 2018. It happened a couple of years ago but I still rememb",
      "city": "wichita",
      "shape": "other",
      "date": "2018-04-05T00:00:00",
      "story": "I do not know the exact date this event took place.  It is currently April 4, 2018.  It happened a couple of years ago, but I still remember what happened.  I am 16 years old now.   It happened when I was around the age of 13.  I’m not exactly sure how old I was.   Me my dad and my little brother had heard there was going to be a meteor shower on this particular night.  So we set are alarms for around 1:00 am in the morning because the people on the news had said that 1:00am was when we could see the most meteors.   At the time we lived in a semi-rural area.  We lived in a cul-de-sac of about 12 house down a straight street, and houses spread out around us.  Behind our house was a field and to the right of this field was a baseball field and beside the baseball field a school with a playground.  Of course at 1:00 am no one was around and we lived in an already quiet neighborhood during the day so at night it was eerily quiet.  We had a lot of big trees in our yard but the baseball field was completely open so we decided it would be the perfect place to gaze up at the night sky.  We took some blankets out to the baseball field and laid them down on the dewy grass.  We laid down and looked up at the sky.  The stars were out and the moon was bright.  It was a clear night.  We laid out for about 20 minutes and we saw a lot of what looked like shooting stars which were meteors, of course.  Then I noticed something high up in the sky.  It looked like nothing I had seen before.  It was in the shape of an L.  It was large compared to the stars around it.  It looked like it had windows or lights down the base of the L.  It was still too almost like it was hovering.   I immediately told my dad and brother to look at it.  It was obviously some kind of flying object.  They both brushed and laughed it off.  My dad couldn’t tell me what it was.  He didn’t know what it was.  So we just kind of ignored it.   About 20 more minutes went by and we decided to go inside.  I looked up at the sky again to check back in on the mysterious object a! nd it wa s gone.  I had not even noticed it had left.  My dad and brother still say it was nothing but I know it wasn’t.   I have no explanation for the unexplained, but I do know that what we saw that night should not just be brushed off; it should be explored. ((NUFORC Note:  Witness indicates that the date of the event is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/139/S139356.html",
      "state": "KS",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c821d",
      "summary": "I was driving with my 3 kids when we seen 4 bright red lights flying in the sky. They were in a triangular shape at first and then chan",
      "city": "wichita",
      "shape": "formation",
      "date": "2018-01-18T00:00:00",
      "story": "I was driving with my 3 kids when we seen 4 bright red lights flying in the sky.  They were in a triangular shape at first and then changed shape.  One of the lights seemed to change color.",
      "link": "http://www.nuforc.org/webreports/138/S138376.html",
      "state": "KS",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c89a0",
      "summary": "Driving home with dinner and look over the tree line.  Looked like 10-15000 feet moving real fast.  ((anonymous report))",
      "city": "wichita",
      "shape": "triangle",
      "date": "2019-09-06T00:00:00",
      "story": "Driving home with dinner and look over the tree line.  Looked like 10-15,000 feet moving real fast.  At first I thought it was fighter jet going sideways but it suddenly accelerated at speeds I had never seen.  Gray triangle shape with no sign of exhaust.  If it’s a new fighter jet, it’s incredible.. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/148/S148470.html",
      "state": "KS",
      "duration": "3 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c8a10",
      "summary": "MADAR Node 123",
      "city": "wichita",
      "shape": "",
      "date": "2019-09-06T00:00:00",
      "story": "MADAR Node 123",
      "link": "http://www.nuforc.org/webreports/148/S148544.html",
      "state": "KS",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3c8b33",
      "summary": "Hidden by clouds.",
      "city": "wichita",
      "shape": "rectangle",
      "date": "2019-03-14T00:00:00",
      "story": "Hidden by clouds I was driving home from my paper route and witnessed a rectangular craft come out of the clouds briefly, then return back into the clouds.  This object was black with white lights on each end.",
      "link": "http://www.nuforc.org/webreports/145/S145032.html",
      "state": "KS",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c8dc9",
      "summary": "Triangular object glides over car while driving outside of town.",
      "city": "wichita",
      "shape": "triangle",
      "date": "2019-01-11T00:00:00",
      "story": "Triangular object glides over car while driving outside of town. On January 3, 2019, at approximately 9:30pm, our 11 month old son was fussy, so I took him out for a car ride.  I suspected that it might take a while to get him to go to sleep and since it was a nice night, I decided to head north out of town. We live in N.E. Wichita just outside of Bel Aire.  I drove North on Oliver to 53rd St. N.  I then turned East on 53rd to Greenwich.  At Greenwich I turned South until 45th St. At 45th St I then proceeded back to the West.  At some point, as I was approaching Rock Rd. (on 45th St.), I noticed a rather large and bright light ahead of me on the horizon.  The light looked white or a white/yellow.  I thought at first it might be a light on the water tower or a radio tower in the distance.  As I continued West on 45th I realized that the water tower and its lights were not in line with this light (which seemed to be stationary).  I passed the water tower and proceeded West on 45th St and could now see the radio tower in the distance an it’s lights. The tower was North of the light in question.  The light at this time had begun to dim and didn’t seem as bright.  It was however in the same position (or so it seemed) as it was when I first noticed it (1.5 miles ago).   As I approached Oliver (sti! ll on 45th St.) the light seemed to be getting lower, as it was now becoming obstructed by trees.  At this time, my best guess was that the light was a mile or two in front of me.  As I approached Hydraulic (still on 45th St.), I stopped for a train which was crossing the road.  I believe there were 2 cars in front of me.  While waiting for the train (2 minutes) the light did not move.  If it did it may have moved toward me.  Just before the train finished passing, the light began to move toward me and to the North.   As I approached the intersection of 45th & Hydraulic I could now see 3 lights in the shape of a triangle. It crossed Hydraulic at approximately 1/4 of a mile to the North of 45th St. The front light (front as in relation to its travel E-NE) was blue in color.  The two rear lights were white or slightly whitish-yellow.  I also noticed that the lights did not blink or flash, as I expected to see a helicopter or some type of plane.  When the object passed over Hydraulic, I e! stimate that it may have been at an altitude of about 1,000 ft.  As it passed over Hydraulic I turned North to try an follow it as it was moving rather slow.  As I traveled further North on Hydraulic I started to lose sight of it out the passenger side of our van.  I approached 53rd St and turned East where I could see it ahead of me.  It seemed to begin moving at a faster rate of speed.  By the time I approached Oliver it was well off in the distance.  I would estimate that it was 10 miles away by that time. I debated whether or not to post this report for fear of some kind of misidentification on my part but after watching the air traffic in the night sky the following days I became more sure about the differences in this object and that of other aircraft.  Most aircraft I’ve seen have some kind of red light, this had none.  The altitude at which the object in question was also odd.  The aircraft I see here are in a landing pattern or take off at that altitude and this object did not fit the typical flight pattern of other aircraft from the surrounding airports.  The main difference was the 3 solid lights beneath the object.  They did not flash or blink. There was also no beacon light on this object.  I believe that at the close proximity in which I was to the object I would have seen a beacon light, however the 3 lights beneath the object were the only ones I could see.  At 45th & Hydraulic (my closest position to the object) it was moving very slow.  I also rolled the windows down a! t that point and could not hear the propellers of a plane or helicopter. Also, I do believe the vehicle stopped in front of me while waiting for the train took notice of it and tried to follow it as well.  The car turned North on Hydraulic then East on 53rd, then South on Oliver back to 45th where it then turned West again on 45th.  The drivers behavior seemed to be very distracted as if they were watching the objects flight. I hope this might encourage others in the Wichita area to consider sharing their sightings as well.",
      "link": "http://www.nuforc.org/webreports/144/S144368.html",
      "state": "KS",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c9178",
      "summary": "looked like a plane flying when a red light moved in different directions and disappeared",
      "city": "wichita",
      "shape": "unknown",
      "date": "2019-12-01T00:00:00",
      "story": "looked like a plane flying when a red light moved in different directions and disappeared Appeared to be a plane heading north with white and red marker lights. All the sudden it started moving erratically. It made sudden moves left, right, weird circles then dropped out of site.  It then reappeared approaching MAFB from the north and made a sudden turn to the left and disappeared. In all the years of telescope observing,  I never saw anything like this.",
      "link": "http://www.nuforc.org/webreports/149/S149531.html",
      "state": "KS",
      "duration": "4 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c9301",
      "summary": "MADAR Node 123",
      "city": "wichita",
      "shape": "",
      "date": "2019-12-01T00:00:00",
      "story": "MADAR Node 123",
      "link": "http://www.nuforc.org/webreports/150/S150302.html",
      "state": "KS",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3c9384",
      "summary": "MADAR Node  123",
      "city": "wichita",
      "shape": "",
      "date": "2019-12-01T00:00:00",
      "story": "MADAR Node  123",
      "link": "http://www.nuforc.org/webreports/150/S150587.html",
      "state": "KS",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3c94d1",
      "summary": "MADAR Node 123",
      "city": "wichita",
      "shape": "",
      "date": "2019-12-19T00:00:00",
      "story": "MADAR Node 123",
      "link": "http://www.nuforc.org/webreports/151/S151401.html",
      "state": "KS",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3c952f",
      "summary": "I was driving on 400 freeway in Wichita Kansas then some lights caught my attention. At first I thought it was a plane but the lights w",
      "city": "wichita",
      "shape": "flash",
      "date": "2019-12-01T00:00:00",
      "story": "I was driving on 400 freeway in Wichita Kansas then some lights caught my attention. At first I thought it was a plane but the lights were too bright. Then within five seconds the lights disappears.",
      "link": "http://www.nuforc.org/webreports/150/S150885.html",
      "state": "KS",
      "duration": "5seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c98cb",
      "summary": "object manuvering in a lightning storm",
      "city": "wichita",
      "shape": "sphere",
      "date": "2019-10-04T00:00:00",
      "story": "object manuvering in a lightning storm i was out taking video of excessive lightning activity..cloud to cloud....looked at the video later and saw an object come into the picture..it did a hard turn....went the oposite way and then turned again and disappeared..maybe six seconds total out of a 32 second video..there also apears to be another earlier in the video but not as noticable.  i can email the video if requested.",
      "link": "http://www.nuforc.org/webreports/149/S149218.html",
      "state": "KS",
      "duration": "32 seconds"
    }
  ]
}