{
  "city": "worcester",
  "fetch_timestamp": "2025-07-12T14:36:49.162028",
  "record_count": 43,
  "pages_fetched": 2,
  "api_calls": 3,
  "source": "ufo_aficionado_api",
  "records": [
    {
      "_id": "64d005f478aba2ec5a3b4df9",
      "summary": "Copied report:  An adult female reports that she and an adult friend witnessed a \"jelly fish\"-shaped object pass overhead.",
      "city": "worcester",
      "shape": "",
      "date": "2019-05-09T00:00:00",
      "story": "To Whom It May Concern:  A friend and I on the meteorite night of dec. 2017 Saw what looked like a Royal Blue jelly Fish (Without the insides) Move Very Slow Over us.  Opening and closing as it moved.  It was transparent.  This took place in Worcester, Mass.  It was not a Meteorite.  This was 11:10 pm.  Has Anyone ever seen seen anything like this?  We were so stunned we couldn't even think to take a picture.  (Aaah)! He Swears it was his Mother As An Angel, as were just talking about her when it Happened. What is this Blue Star, Could it be some type of Gas?   Not Owning a Computer makes it hard for me.  Hope to Hear from you.   Thank you! ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/146/S146007.html",
      "state": "MA",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3b531e",
      "summary": "LED Nav Lights and an Ultra bright Strobe",
      "city": "worcester",
      "shape": "changing",
      "date": "2008-06-12T00:00:00",
      "story": "LED Nav Lights and an Ultra bright Strobe This would make it the fourth time in two different time zones, to of seen the exact same thing. It's a decent sized ball of lights, when focused in on it appears to be crosshair's.  A bright white cross with four particular points that have strobe type lights that you can see from afar.  With the naked eye you can see what appears to be Nav lights (red and green) with an ultra bright strobe and white lights.  I am fairly familar with aircrafts (prior service and living near an airport my whole live).  You can see aircraft fly below and around it, its distincly differeent then an outline of a plane at night. I have tape of the objects from my old house in Madison, WI.  I filmed it for hours focusing in and out and it appears to move slightly yet reappear in the same location the next night.  I just would like to know if there is anything out there that'd fit this description.",
      "link": "http://www.nuforc.org/webreports/063/S63329.html",
      "state": "MA",
      "duration": "Hours"
    },
    {
      "_id": "64d005f478aba2ec5a3b5a58",
      "summary": "a stationery, very bright  silver circular object about  500 feet in air, 60 to 70 feet across then vanished.",
      "city": "worcester",
      "shape": "circle",
      "date": "2008-03-04T00:00:00",
      "story": "a stationery, very bright  silver circular object about  500 feet in air, 60 to 70 feet across then vanished. As I was driving in Auburn Ma. On Hwy. 20 heading east, I took notice off to the left in the Worcester aria sky about what looked like 500 feet in the air I saw a disk shape object that looked to be about 60 or 70 feet across. It was like a bright pie-pan shape and it seemed to be turning. It looked like a pie-pan in the sun and someone were turning it from right to left very fast. It was bright silver in color. As the sun shined on it, it looked really bright.  I looked it for about  10 or 15 seconds and I was about to pull my car off the road to observe it more when it was like someone turned off the light. It just vanished out of sight.  As I drove down the road I would look for it and for the next mile or so it never re-appeared.  When I got home, I turned on the local T.V. station expecting some news on this event but not so. Later that evening I turned on the radio and no news about this.  I thought for sure someone else had to see this because it was right in the air above a crowded city, but nobody reported it that I know about. ((NUFORC Note:  Witness indicates that the date of the event is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/060/S60493.html",
      "state": "MA",
      "duration": "15 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b601d",
      "summary": "7:00 pm Dec. 10 2007  I am weather forecaster meteorologist with two decades plus of experience observing. I work for a radio station i",
      "city": "worcester",
      "shape": "sphere",
      "date": "2008-03-04T00:00:00",
      "story": "7:00 pm Dec. 10 2007  I am weather forecaster meteorologist with two decades plus of experience observing. I work for a radio station in northern Vermont and what I saw I will describe--it not that big a deal really.  There is a comet forgotten the name to lazy to look it up but a comet or fuzz ball like or bigger than the 7 sisters that I saw in the eastern sky. This fuzz ball was moving over so slowly but in odd directions to the rotation of the earth not making any sense.  A friend of mine alerted me to it and said hey go outside and check out the comet. I did and went out several times only to find that it had moved to odd positions and in weird trajectories that a comet would not normally follow.  My only conclusion is that it was man made perhaps a urinal dump that caught the sunlight similar to when you can the ISS or other satellites at night but then why would it move into the different positions over the course of the next hour and half.  It is the erratic nature of the movement. The sighting  took place this evening in mostly clear skies with good clarity on a cold winter night with temperatures in the 20s. ((NUFORC Note:  Missile venting fuel in space.  PD))",
      "link": "http://www.nuforc.org/webreports/060/S60272.html",
      "state": "VT",
      "duration": "1:15"
    },
    {
      "_id": "64d005f478aba2ec5a3b6e28",
      "summary": "a green fireball that moved quickly down and up and then across the sky before it disappeared.",
      "city": "worcester",
      "shape": "fireball",
      "date": "2007-02-01T00:00:00",
      "story": "a green fireball that moved quickly down and up and then across the sky before it disappeared. At about 10:15pm on January 2, 2007, i was driving home from work and in the clear northern sky i noticed a bright green fireball.  It was directly above a church and in the vacinity of Worcester Regional Airport.   When i saw it, it shot down diagonally to the right, then back up towards the right, and then shot straight across to the right and then disappeared.  It looked similar to a firework, but moved unlike any firework i have ever seen, and there was only one, so i ruled out any idea of a firework.   I also thought it may have been a shooting star, but this looked to be a little smaller than what the sun looks like, and again, it moved in ways i have never seen or heard a shooting star move like.",
      "link": "http://www.nuforc.org/webreports/054/S54384.html",
      "state": "MA",
      "duration": "10 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b7a1f",
      "summary": "Diamond shape object slowly flying over Worcester skies and then disappearing",
      "city": "worcester",
      "shape": "diamond",
      "date": "2007-04-27T00:00:00",
      "story": "Diamond shape object slowly flying over Worcester skies and then disappearing At approx. 1:30 pm on April 22nd 2007 I saw a diamond shaped chrome looking object slowly moving over  the clear skies near Interstate 190 south in the greendale area in Worcester, Massachusetts. I kept a close eye on the object as it hovered for a moment.  It changed color from chrome to a dark grey and as it changed color it disappeared from the sky. The sky was clear and my son also witnessed the event.",
      "link": "http://www.nuforc.org/webreports/056/S56336.html",
      "state": "MA",
      "duration": "about 1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3b8a91",
      "summary": "Large green streak viewed across sky.",
      "city": "worcester",
      "shape": "other",
      "date": "2009-01-10T00:00:00",
      "story": "Large green streak viewed across sky. I was waking my dog before bed when I looked up there was a large green streak moving across the sky. I thought it may be a shooting star but it was moving to fast and it was green. After I watched it for about two seconds it disappeared behind the tree line and I didn’t see it again. ((NUFORC Note:  Witness elects to remain totally anonymous;  provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/066/S66866.html",
      "state": "MA",
      "duration": "2 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3b9375",
      "summary": "Saw a bunch of lights bunched together, they were all different colors and blinking.",
      "city": "worcester",
      "shape": "other",
      "date": "2009-08-27T00:00:00",
      "story": "Saw a bunch of lights bunched together, they were all different colors and blinking. I was sitting in my living room with my husband, who is a chef.  We were drinking wine and talking when I suddenly got an urge to look out side.  I looked into southern sky and low and behold there was something there.  It was like a mass of lights all bunched together.  I couldn't tell the shape of the craft, and the lights were all different colors and blinking.  I looked, couldn't figure out what it was, and sat back down.  Then I got up a couple minutes later and looked again and it was still just sitting there.  I didn't tell any one except my dad, my husband hates talking about that stuff.  I would say that it was above the tree line a lot, but I can't tell how high that is.",
      "link": "http://www.nuforc.org/webreports/071/S71731.html",
      "state": "VT",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3b9c0f",
      "summary": "it was trying to distracted me?",
      "city": "worcester",
      "shape": "changing",
      "date": "2010-04-13T00:00:00",
      "story": "it was trying to distracted me? well i was skateboarding home at like 11:00 or 11:30 and my legs got tierd i stop for a quick minute like 5 minutes and when i turn around to keep going home i seen a big ball in the air it turn formation from a ball to a like shape of a jelley fish shape the it turned into a shpe of a pingpong raket then it went to one coner of the sky like if it new i was looking at it and it tryed to like make me get confused but i keeped fallowing it adn a couple minutes later it stoped and it was shanging color from blue purple then it like disapireed i was like were did it go but then it came back but it was on the other coner and then it was going from side to side till it like went in to like this hole in he sky there was like a hole in the sky like if it was a portal into a nother univers igot scared becouse the hole was still there but when i looked away i looked back and the hole was gone but when i looked on the part were the hole was there was like a message in ! this wired language like it was made out of pitures ((NUFORC Note:  Witness indicates that date is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/074/S74848.html",
      "state": "MA",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3b9d00",
      "summary": "Very bright white spherical object flew over Worcester",
      "city": "worcester",
      "shape": "sphere",
      "date": "2009-08-27T00:00:00",
      "story": "Very bright white spherical object flew over Worcester We were out in the back yard (near the top of Plantation St) having a late night snack when around 11:15PM (may have been 10:15), we saw a very bright spherical object moving northeast.  There were no blinking lights on the object.  It was larger and brighter than all other objects in the sky.  The object moved fairly quickly through the sky and there was no trail like a \"shooting star\" would leave.  There were a few airplanes in the sky (common occurence here) and it was not an airplane.  The object was far enough away that we would have heard no sound even if it was making one.  We did not get any images of the object.  There were trees in the way that shortened the duration of the sighting.",
      "link": "http://www.nuforc.org/webreports/071/S71666.html",
      "state": "MA",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3b9fa2",
      "summary": "i was sitting outside when i saw 5 cigar craft ....",
      "city": "worcester",
      "shape": "cigar",
      "date": "2010-05-12T00:00:00",
      "story": "i was sitting outside when i saw 5 cigar craft .... i was sitting outside when i saw 5 cigar craft moving west to east going left to right simaltainiusly it looked like they were servaying the land below they had no wings and made no sound at first i thought it was aa small plane but it had no wings i dont know what it was or where it came from ((NUFORC Note:  Witness indicates that date of sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/075/S75364.html",
      "state": "MA",
      "duration": "15-20 min"
    },
    {
      "_id": "64d005f478aba2ec5a3bbc61",
      "summary": "Silent craft overhead",
      "city": "worcester",
      "shape": "egg",
      "date": "2011-10-10T00:00:00",
      "story": "Silent craft overhead On 8-10-2011 I was in a fast food restraunt eating my meal when I observed an object approximatly two miles away.  At first I thought it was a stray balloon floating because it appeared as a dark circular object. The object approached on a course from the south west heading to the north east, eventually going straight above my vehicle.  As it approached I noticed that it did not act as a balloon would, like dancing in wind currents or rotating on it's axis.  This object stayed on a steady course and did not vary it's speed, alitude or direction.  There was a breeze at the time that I figured to be appx. five m.p.h going from the west to the east, that I thought would make a balloon go off course.  When the object was about 200 yrds. from me, it was traveling about 20 m.p.h \" about the speed of a ten speed bike \" The altitude is hard to determine, but I would say that it about twenty stories high.  The object resembled a loaf of bread with a more rounded top and flatter bottom.  The color was of a dark bronze, almost charcoal with copper tints.  The rear of the craft had a concave circle that appeared like a crator but did not display any kind of propulsion system like a jet exhaust and it remained the same color as the rest of the craft.  The object passed by and had no noise at all.  When it continued behind me, it approached apartment buildings that were 200 yards away from me that are twelve stories high and the object seemed th be about twice the height of the buildings.  The object seemed to be the same size as the outside decks on the apartments, that i estimate to be about twelve to twenty feet. Making the craft to be about the size of a large s.u.v.",
      "link": "http://www.nuforc.org/webreports/083/S83404.html",
      "state": "MA",
      "duration": "five minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bbcae",
      "summary": "I was in the parking lot of a fast food restaurant and noticed an object approximately  two miles away traveling from south west to nor",
      "city": "worcester",
      "shape": "other",
      "date": "2011-10-10T00:00:00",
      "story": "I was in the parking lot of a fast food restaurant and noticed an object approximately  two miles away traveling from south west to north east.  It first appeared as a black dot in the sky, so I thought it was a stray balloon floating.  As the object got closer I realized that it did not move as a balloon would, It did not vary its course or altitude, or move left or right,  The object remained stationary in flight with no rotation of it’s body,   A balloon would tend to rotate, dance, and move with the wind.  There was a slight breeze of  about five m.p.h. in the opposite direction the object was heading at the time. As the object approached and passed directly overhead I estimate the speed it was traveling at about fifteen or twenty m.p.h. or about the same speed that someone on a ten speed bike would be moving at. When the object passed overhead It was absolutely silent.  I would describe it as being shaped like a loaf of bread.  The color was a very dark bron! ze, almost charcoal color with a metallic copper base. As the object passed overhead and went behind me, I noticed that  it had a  circular indent in the rear of the craft that resembled a crator. About two hundred yards behind me was an apartment complex. When the object flew over it,  The object was about two times the height of the apartment complex.  That would equal 24 stories.  Based on the size of the outside deck of the apartment, the craft was  the size of a full size truck.",
      "link": "http://www.nuforc.org/webreports/083/S83349.html",
      "state": "MA",
      "duration": "10:00 min."
    },
    {
      "_id": "64d005f478aba2ec5a3bc179",
      "summary": "2 UFO's with dim lights and moving with no sound.",
      "city": "worcester",
      "shape": "unknown",
      "date": "2011-12-12T00:00:00",
      "story": "2 UFO's with dim lights and moving with no sound. At approximately 5:45pm above Holmes Field in Worcester MA I noticed what looked like several very dim lights moving north.  There was definitely a structure there but i could not make anything out.   As I continued to stare in the same location in shock, another one came, on the same north path.  It did not make any noise at all.  As a matter of fact, unless you were staring in the location that I was it would definitely have been missed.  Hopefully someone sees the same thing.",
      "link": "http://www.nuforc.org/webreports/085/S85307.html",
      "state": "MA",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bd843",
      "summary": "Big extremely bright white light hovering in sky",
      "city": "worcester",
      "shape": "unknown",
      "date": "2012-10-30T00:00:00",
      "story": "big extremely bright white light hovering in sky My and a friend were standing outside around 1am looking at the stars.  We noticed a big extremely  bright white light hovering in the sky it didn't move for a few seconds then all of a sudden it shot down very fast and just was gone.",
      "link": "http://www.nuforc.org/webreports/093/S93468.html",
      "state": "MA",
      "duration": "4 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bdc9f",
      "summary": "Fireballs seen above Route 290 near Holy Cross College",
      "city": "worcester",
      "shape": "fireball",
      "date": "2012-09-24T00:00:00",
      "story": "Fireballs seen above Route 290 near Holy Cross College Driving towards Auburn, MA on Route 290 near Holy Cross.  Two fireballs above the road. Orange, blue, red.  Hovering.",
      "link": "http://www.nuforc.org/webreports/092/S92814.html",
      "state": "MA",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bde5b",
      "summary": "25+ GLOWING DOTTS IN WORCESTER MA",
      "city": "worcester",
      "shape": "circle",
      "date": "2012-08-19T00:00:00",
      "story": "25+ GLOWING DOTTS IN WORCESTER MA 25+ ORANGE GLOWING LIGHTS MOVING EAST TO WEST THEN TURNING NORTH THAN DESPAIRED ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/091/S91703.html",
      "state": "MA",
      "duration": ""
    },
    {
      "_id": "64d005f478aba2ec5a3bf169",
      "summary": "8 Circular Objects with Orange Lights Shine Down on Worcester, Massachusetts.",
      "city": "worcester",
      "shape": "circle",
      "date": "2013-05-15T00:00:00",
      "story": "8 Circular Objects with Orange Lights Shine Down on Worcester, Massachusetts On March 30, 2013 at around 1:00AM, I ran outside after hearing my children screaming. They were pointing up at the sky, and when I looked up at the sky I noticed 4 circular objects beaming orange lights off of them.  They were close enough to appear large to us. As they hovered away, they got smaller until they disappeared.  Another one then showed up and disappeared. Just then, 3 more showed up in the sky, making them 8 total. They were all coming from and going towards the same direction. The last three that showed up in the sky formed a triangle, to only then disappear before our eyes.",
      "link": "http://www.nuforc.org/webreports/096/S96830.html",
      "state": "MA",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bfbcc",
      "summary": "White metallic egg shaped object spotted in Worcester Ma.",
      "city": "worcester",
      "shape": "egg",
      "date": "2013-07-03T00:00:00",
      "story": "white metallic egg shaped object spotted in Worcester Ma. While driving down Interstate 290 into Worcester from the mass pike, my friend and I witnessed a white metallic egg shaped craft in the sky.  I spotted it first, he was driving.  I thought it was a blimp at first but it was moving about 2 times faster than the car.   We watched it for about 2 minutes.   It went behind a high rise building, than another, then it disappeared without a trace.   No clouds in the sky, no smoke and no sound. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/098/S98835.html",
      "state": "MA",
      "duration": "~2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c04f9",
      "summary": "UFO floating still, then speeding off incredibly fast.",
      "city": "worcester",
      "shape": "rectangle",
      "date": "2012-12-20T00:00:00",
      "story": "UFO floating still, then speeding off incredibly fast I was leaving a convenience store, randomly looked up in the sky, and saw a long rectangled thing, with 3 white lights on the bottom.  it was about as high as helicopters fly.  It was there in place for about 3 seconds, then it took off, about 5X faster than a plane. As it took off, all 3 lights turned off as well.",
      "link": "http://www.nuforc.org/webreports/095/S95034.html",
      "state": "MA",
      "duration": "5 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c082c",
      "summary": "My son and I saw a very bright light swoop down, hover and then go straight up and disappear.",
      "city": "worcester",
      "shape": "other",
      "date": "2014-03-18T00:00:00",
      "story": "My son and I saw a very bright light swoop down, hover and then go straight up and disappear. My son and i were driving down a road talking and we stopped talking because we both saw a bright light in front of us in the sky that came from behind us and swooped down, hovered for a second or two and then took off straight up into the sky and disappeared very, very fast.  It had a strange shape, a not oval or egg but kind of like a round cornered box, shorter on the top.  My son held onto my arm and said. do not speak a word of this.  And i haven't since.  I can't believe it happened.",
      "link": "http://www.nuforc.org/webreports/107/S107758.html",
      "state": "MA",
      "duration": "15 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c106c",
      "summary": "Bright stationary object in s/sw night sky.  ((NUFORC Note:  Sighting of the planet, Venus.  PD))",
      "city": "worcester",
      "shape": "triangle",
      "date": "2013-12-02T00:00:00",
      "story": "Bright stationary object in s/sw night sky My neighbor called to have me look at something in the sky that he,son and his wife had been watching for about 20 minutes.  He said it had not moved much the entire time.  I, my wife, and daughter went outside to look at the object.   In the south/southwest sky was a very bright, stationary object.  I watched for about 5 minutes but it was very cold out.  During that time, it did not move.   I checked from my front hall about five minutes later and it was still there.  Checked again about 5 minutes later but it had moved right (west) and then about 5 or ten minutes later it appeared to have been heading (down) south and then it was gone.  The brightness was never dimmed.  I saw no shape to it, just very bright.  Neighbors thought it had a peak on the top (triangular).   We could see starts faintly as well as other aircrast in the sky.  ((NUFORC Note:  Sighting of the planet, Venus.  PD))",
      "link": "http://www.nuforc.org/webreports/104/S104749.html",
      "state": "MA",
      "duration": "20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c1aee",
      "summary": "Four bizarre orange lights in the southern sky over Worcester, MA just after midnight.",
      "city": "worcester",
      "shape": "unknown",
      "date": "2014-07-26T00:00:00",
      "story": "Four bizarre orange lights in the southern sky over Worcester, MA just after midnight. At 12:05am on Tuesday, July 22, 2014, I was driving south on Belleview Street, when I spotted a large, round, orange light in the sky to my left…which works out to south-southeast.  Best guess is it was about 20 degrees over the tree line.  I first thought it was a star, but soon figured it to be too large.  Then I thought an airplane or helicopter, but still would have been too large for those kinds of lights.  It also appeared to be moving in a left-right-left pattern over a short distance, relative to the object.  If you google Belleview street, Worcester, MA, the little green arrow that pinpoints the road on the map is precisely where I was positioned at the first sighting. As I approached the intersection of Belleview and Chandler Streets, I spotted certainly three, and possibly four more orange lights sitting dead south in the sky, not apparently moving.  One was slightly lower than the first one I spotted, perhaps at 15 degrees over the tree line.  The other two I am certain of were considerably higher in the sky, one at 75-80 degrees and shading toward the southeast, the other at about 45 degrees, directly below the highest one. There were no other unusual objects near these, and they did not show any distinct pattern or shine light on anything near to them.  My car window was down, and I heard no sounds to possibly indicate their proximity to my position. I was near my home, so I gathered my head, and sped to grab a good camera.  By the time I got back, about ten minutes later, there was no sign of these objects in any direction. One side observation:  on my arrival to my driveway before getting my camera, I looked to the sky to see if they could be seen from my house, but in the general direction of where I saw them, all I could see was a vague pinkish glow behind the shadowed profile of trees and other houses.  Couldn’t see any stars in any direction, so I thought it might be clouds obscuring the night sky.  When I returned home, disappointed and without pictures of anything, at about 12:30 am the glow behind the silhouetted houses and trees was gone, and there were a good many visible stars in every direction. I hope someone else reports this so I know I am not nuts.",
      "link": "http://www.nuforc.org/webreports/111/S111779.html",
      "state": "MA",
      "duration": "~2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c1cd5",
      "summary": "4 solid red circular lights silently hovering and slowly moving eastward in a line formation.",
      "city": "worcester",
      "shape": "formation",
      "date": "2014-06-04T00:00:00",
      "story": "4 solid red circular lights silently hovering and slowly moving eastward in a line formation While driving home, we all saw 4 silently hovering and moving slowly eastward red solid lights in a line formation.  Three of them were in a row while the fourth lagged a little below and to the left.   One  vehicle occupant attempted to take a photo, but it came out poorly since the car was in motion. We lost sight as We turned on a street, trees were in the way. The lights were solid red, silent, and no strobes.",
      "link": "http://www.nuforc.org/webreports/109/S109731.html",
      "state": "MA",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c2560",
      "summary": "I was driving in my car on Rt 290 heading East, passing through Worcester, Ma when I noticed there were 3-4 oval light orbs moving in t",
      "city": "worcester",
      "shape": "light",
      "date": "2014-11-06T00:00:00",
      "story": "I was driving in my car on Rt 290 heading East, passing through Worcester, MA, when I noticed there were 3-4 oval light orbs moving in the sky like juggling balls.  A thin cloud partially obscured them and their lights emitted beams like the Paramount Pictures motion logo. There was no place to pull over on the highway and I didn't want to get into an accident craning my neck and peering upward while driving so I did look only for a a few seconds.  The lights kept doing the same thing for about 3-5 minutes.  I decided to get off the highway, stop the car and look at it but after I passed Worcester it was gone. I have no idea what that was!",
      "link": "http://www.nuforc.org/webreports/114/S114983.html",
      "state": "MA",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c2632",
      "summary": "At 8:00 pm while traveling eastbound on I 290 just before exit 19-20 we observed 3 red/yellow lights that looked also like fire moving",
      "city": "worcester",
      "shape": "triangle",
      "date": "2014-11-06T00:00:00",
      "story": "At 8:00 pm while traveling eastbound on I 290 just before exit 19-20 we observed 3 red/yellow lights that looked also like fire moving slow from west to east.  The lights where in a triangle shaped pattern it looked like the lights where about 100 yards apart and about 150 yards above the highway.",
      "link": "http://www.nuforc.org/webreports/114/S114736.html",
      "state": "MA",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c262d",
      "summary": "Diamond shape objects with yellowish orange lights.",
      "city": "worcester",
      "shape": "diamond",
      "date": "2014-11-06T00:00:00",
      "story": "Diamond shape objects with yellowish orange lights My Boyfriend and I were shopping near the Greendale area and on our way out of the store I looked up in the sky because there was a light show in Worcester. I noticed ffour diamond shape object with yellowish orange lights in the sky. At first my boyfriend thought it was a group of helicopters but then we realized that they were not moving and didn't have the normal flashing lights that helicopters have.  By the time my boyfriend was driving to get on 290 west I looked up toward the Holden are and noticed another of the same object in the sky.  When we were on the highway we looked looked again and there were just two left above Worcester and the one above the town of Holden had disappeared. We have never witnessed anything like this in our lives.  We know what we saw and regardless of what some of our friends think that either it was part of the light show, it was not.  The light show was moving white light but these were actual objects and the color was far fr! om white. It was an amazing experience that we would never forget. I just regret that I didn't  take a video so I can show those who doubt what we saw.",
      "link": "http://www.nuforc.org/webreports/114/S114706.html",
      "state": "MA",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c2a4a",
      "summary": "Orange Amber lights Big Dipper shape.",
      "city": "worcester",
      "shape": "unknown",
      "date": "2014-10-03T00:00:00",
      "story": "Orange Amber lights Big Dipper shape At approximately 11:30PM, I was driving in my car towards home.  As I was driving I noticed that there were many stars in the sky and some were in the shape of The Big Dipper.  Some of these, what I thought were stars became brighter than the other surrounding stars.   As I was now driving my car under these stars, I looked up through my cars skylight.  Overhead I saw these lights become more orangey in color and more square than round.   They appeared to be above tree level.  As I was driving, I looked up and they were overhead for a while until I drove in another direction. I've never experienced this before. It was unusual and I was shaken up by this. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/114/S114060.html",
      "state": "MA",
      "duration": "2 min"
    },
    {
      "_id": "64d005f478aba2ec5a3c2b08",
      "summary": "Bright white cylinder.  June St., Chandler intersection.",
      "city": "worcester",
      "shape": "cylinder",
      "date": "2014-11-21T00:00:00",
      "story": "Bright white cylinder.   June st Chandler intersection Bright white cylinder shaped object glowing in sky.  It was in a  \"north to south\" position  \"upright\"  \"lengthwise\"  not  sideways.  It was in one location not moving.  I was driving on June St crossing Chandler St. heading towards May St intersection. I wanted to  get closer to take a picture and it disappeared. ((NUFORC Note:  Witness indicates that the date of the event is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/115/S115482.html",
      "state": "MA",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c31bc",
      "summary": "Small buzzing boomerang/triangle distinct quiet buzz.",
      "city": "worcester",
      "shape": "triangle",
      "date": "2014-08-01T00:00:00",
      "story": "Small buzzing boomerang/triangle distinct quiet buzz. I heard a buzzing sound out of an open window.  Seems pretty normal being 2 miles from worcester airport.  I happend to go outside for a smoke and heard a quiet buzz getting closer and closer.  The idle sound got very quiet as this boomerang object passed over my house.   The sky still had pink in it from sundown so I had a visuaul straight over my house about 300 ft up.  Had one solid bright white light and green flashers on each wing.   The object was plane-like, except extra long in the front but wings toward back of this object.  Looked between a boomerang and a triangle.   It continued to swoop toward a landing near airport but turned and looped around and over my house another 4 times.  It was not a plane because it hummed or buzzed like a dirtbike..  I've now seen the bright green flashers and bright solid light in the entire valley randomly since last winter. Has a distinct hum/buzz sound. Are these drones?",
      "link": "http://www.nuforc.org/webreports/112/S112049.html",
      "state": "MA",
      "duration": "20 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c39fc",
      "summary": "White ball moving at extreme speed.",
      "city": "worcester",
      "shape": "light",
      "date": "2014-12-12T00:00:00",
      "story": "White ball moving at extreme speed I couldn't sleep yesterday night after a long night in a wedding, and at about 3:05AM, while I was looking into the sky from my bed where I have a window facing the sky, I saw a very bright white ball about the size of a gulf ball in the sky appearing suddenly from no where and zooming extremely fast and the disappearing within probably not more than 200 milliseconds.  This was very strange and i never seen anything like it.  it did not have any trace behind it.   I usually see many air planes from the same windows every night and the speed of the planes are no where near the speed of the white ball that i saw.  The planes usually take 1 to 1.5 minutes to travel between the start and end of my windows and the white ball took within 200 ms time.  I thought i was sleepy but i was fully awake and was very strange event. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/115/S115877.html",
      "state": "MA",
      "duration": "200 milliseconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c3be1",
      "summary": "Red lights in V-formation; disappear in same spot in sky; no sound.",
      "city": "worcester",
      "shape": "circle",
      "date": "2015-07-06T00:00:00",
      "story": "Red lights in V-formation; disappear in same spot in sky; no sound. Saw five orange/red lights moving slowly in a V-formation.  No sound, lower than most planes would fly.   Disappeared one after another at exactly the same point in sky. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/120/S120045.html",
      "state": "MA",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c404f",
      "summary": "2 bright orange fireballs glowing in sky in Worcester, MA.",
      "city": "worcester",
      "shape": "fireball",
      "date": "2015-05-08T00:00:00",
      "story": "2 bright orange fireballs glowing in sky in Worcester, MA A few years ago, in August, 2012, on Pleasant St. in Worcester, Massachusetts.  2 bright orange balls in the sky.  Looked like they were giant fire balls, glowing bright orange like a flames. One object was ahead of the other one and slowly making distance, when out of no where the one trailing behind sped up quicker than a bullet and caught up to the one ahead.  Then they started traveling at the same speed til out of distance.  They were close enough to ground where there would of been sound if they were aircraft, yet there was absolutely no sound. Complete silence. I know for a fact that my phone had full battery, but as soon as I pulled out my phone to record the objects my phone died and I couldn't.  Objects seemed to cause a small type of electrical interference as my phone stopped working but my car turned on. Also, when they were passing by, for the whole 5 minutes they were in sight swarms of birds were flying and making much noise and multiple dogs were barking.  Difficult to believe but it was like a scene straight out of a movie. Lasted about 5 minutes until they were completely out of sight in the distance. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/118/S118818.html",
      "state": "MA",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c4803",
      "summary": "Two fireball streaks across the sky.  ((NUFORC Note:  Objects appear to be contrails behind nearby trees.  PD))",
      "city": "worcester",
      "shape": "fireball",
      "date": "2015-11-20T00:00:00",
      "story": "Two fireball streaks across the sky. Was first seen on 290.  At first it was like a fireball shooting across the sky in a downwards position by the time I reached rt 9.  In cherry valley I observed a second following coming up along side of it.  White streaks but the front of the streaks were pointed and reddish in color while the tail ends were white and not leaving a very long streak.",
      "link": "http://www.nuforc.org/webreports/124/S124201.html",
      "state": "MA",
      "duration": "6 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c4920",
      "summary": "Shooting star.",
      "city": "worcester",
      "shape": "unknown",
      "date": "2015-11-06T00:00:00",
      "story": "It was definitely a shooting star, but I thought this could possibly help in other investigations probably or to explain what we saw over 290.  It was 100% a shooting star.",
      "link": "http://www.nuforc.org/webreports/123/S123408.html",
      "state": "MA",
      "duration": "Few seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c4c66",
      "summary": "((NUFORC Note:  No information provided by source of report.  PD))",
      "city": "worcester",
      "shape": "fireball",
      "date": "2015-09-17T00:00:00",
      "story": "((NUFORC Note:  No information provided by source of report.  PD)) ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/122/S122022.html",
      "state": "MA",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c4de2",
      "summary": "Two balls of orange light.",
      "city": "worcester",
      "shape": "unknown",
      "date": "2015-08-13T00:00:00",
      "story": "Two balls of orange light. Two orbs of light appeared in the sky. Very bright, very large orange orbs. They slowly rose further over the ground.   At first, I thought they were just lanterns but their behavior said otherwise.  They would come together and fly apart, swirling around in a pattern that was identical to each other.  Eventually they stopped spinning at the exact same time, completely still.  There was no sound.   The lights disappeared after a few minutes.  Never seen anything like this.  I'm a very rational scientific person, and although my first assumption was a couple of Chinese lanterns, there is no way lanterns would behave like this. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/120/S120984.html",
      "state": "MA",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c4e93",
      "summary": "Pretty big ball of light which was very bright descending very rapidly towards the ground and then suddenly dissappeared completely.",
      "city": "worcester",
      "shape": "light",
      "date": "2015-08-13T00:00:00",
      "story": "Pretty big ball of light which was very bright descending very rapidly towards the ground and then suddenly disappeared completely I am constantly standing outside on my porch here in Worcester, MA just below the airport at different times of the night/evening watching the skies for any unusual activity. Tonight, (8/12/2015), I was stepping out onto my porch, (I live on a third floor), at various times of the evening looking up at the sky and watching for anything unusual. At approximately 9:15 p.m. or so I stepped out onto my porch again.  As soon as I stepped out and closed my screen door I looked over towards my left which would be North East I believe and saw one pretty big ball of light which seemed to be a very bright orange color descending at a phenomenal speed from North East to North West.  The light was very noticeable/visible and seemed to be very close, (not much higher than the trees that surround the area where I live), and heading down towards the ground.   All of a sudden the light just disappeared completely.  There was no sound at all during this except for a few cars driving by my house. I could not have been the only person in this area to see this as the object was very visible in the sky. I have seen shooting stars before but it has been three years or so since I’ve seen one.  To the best of my memory shooting stars are much, much higher in the sky and are also very different in color from the object I saw tonight, and certainly not as visible.   The object I saw moved so fast and disappeared so quickly that it was over and gone in a matter of seconds. I don’t know what the object was that I saw tonight but I was very excited, and a little in a little bit of fear. I ran into my apartment to tell my older brother who was spending the night and also my wife who was in bed. I have been looking up and watching the sky for many years and have never seen much more than a few shooting stars until tonight.",
      "link": "http://www.nuforc.org/webreports/121/S121084.html",
      "state": "MA",
      "duration": "~10-15 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c5ad2",
      "summary": "Day time morphing ufo.  From one object to 5 objects !!",
      "city": "worcester",
      "shape": "changing",
      "date": "2016-04-22T00:00:00",
      "story": "Day time morphing ufo.  From one object to 5 objects!! On February 29th, 2016, at 5:28pm, from North East U.S.A, my wife and I were outside.  My wife then saw something strange flying from a distance.  I quickly grabbed my Samsung galaxy Note 3 and began recording.  It was difficult to see at first until it got closer and we noticed it was changing shapes and went from one object to at one point up to 5 distinct objects flying together morphing and so on.  I thought at one point it was a helicopter carrying something, then realized it wasn't.   Then a totally red helicopter appeared from nowhere which is in itself unusual for us, we have never seen a red helicopter in our city, ever.  The helicopter appeared to be hovering above us watching this U.F.O!  When I finally uploaded the video and took a closer look WOW ! I paused the video at different intervals and captured those as images and the zoomed in closer, and unbelievable.  We seen many different symbols within what appeared to be like an invisible bubble around each of the objects many of the symbols were crosses.  One in particular when it was three objects each had a different symbol, a cross, what appeared to be an image of a d.n.a strand, ie. double helix, and the third looks like a person kneeling down on their knees praying.   I will send original video, along with a couple of the different images we get out of these ufos. It was truly amazing.  My wife was a real sceptic until this happened on the anniversary of her grandmother's birthday, leap year day.  I have seen and witnessed many other wordly things my entire life, but this was great because I had a witness and video to back it up.  Please let me know if or what you think.  I believe we are witnessing some incredible things at this time.",
      "link": "http://www.nuforc.org/webreports/126/S126970.html",
      "state": "MA",
      "duration": "2:02"
    },
    {
      "_id": "64d005f478aba2ec5a3c6ef6",
      "summary": "Chevron-shaped object with orange lights covering its underside.",
      "city": "worcester",
      "shape": "chevron",
      "date": "2017-09-05T00:00:00",
      "story": "Chevron-shaped object with orange lights covering its underside. I saw a chevron-shaped object in the sky, about the height I might expect to see a small plane.  The object had orange hued lights that covered it.   I would guess there were perhaps fifteen or so.  It moved slowly, perhaps at the rate a small plane might be going.  It was crossing the sky going east or perhaps south east and was a mile or so from the Worcester airport.   I was with another person who also saw it.   It went behind the trees and when we drove farther to get a clear view again, we could no longer see it.",
      "link": "http://www.nuforc.org/webreports/135/S135996.html",
      "state": "MA",
      "duration": "2 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c703a",
      "summary": "Line of 5 or 6 lights traveling east to west worcester, MA",
      "city": "worcester",
      "shape": "light",
      "date": "2017-08-04T00:00:00",
      "story": "line of 5 or 6 lights traveling east to west worcester, MA string of 5 or 6 lights observed traveling from east to west over Burncoat area in Worcester MA. looked similar to Chinese lanterns  - however, they did not flicker and they ascended in uniform fashion with fairly rapid speed until they disappeared entirely.  could have been lanterns - however, I have seen Chinese lanterns numerous times and have never seen them behave in such fashion. Strange",
      "link": "http://www.nuforc.org/webreports/135/S135466.html",
      "state": "MA",
      "duration": "3 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c8317",
      "summary": "Wobbling orange disc, vanished as if responding directly to me pointing at it, very strange. 2 witnesses, including myself.",
      "city": "worcester",
      "shape": "disk",
      "date": "2018-10-12T00:00:00",
      "story": "Wobbling orange disc, vanished as if responding directly to me pointing at it, very strange. 2 witnesses, including myself. I was smoking a cigarette on my fourth-story apartment balcony, and I looked up and out over Coab Reservoir.  As I looked upwards toward the sky, I noticed a wobbling disk was roughly 500 yards away. I had an eerie feeling that it was observing me.  I called my girlfriend over from the kitchen/living room next to me. I pointed to the saucer, and she saw it too for about 3 seconds, and it disappeared before both of our eyes.  We are both certain that there was not even a silhouette against the night sky, the lights weren’t shut off, it simply disappeared completely.  It seemed to begin cloaking immediately as I pointed to it, as if responding to the confirmation of my awareness.  To describe it, it was a defined saucer shape which wobbled quite a lot, almost as if teetering on a small center of gravity.   It had maybe seven visible yet dim orange lights around the outermost lip, and they were evenly spaced.  It has been about a year since this happened, and I felt th! at the undeniable and strange encounter was worth reporting, later rather than never. ((NUFORC Note:  Source of report indicates that the date of the sighting is approximate.  PD))",
      "link": "http://www.nuforc.org/webreports/143/S143440.html",
      "state": "MA",
      "duration": "20 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c8613",
      "summary": "MADAR Node 01",
      "city": "worcester",
      "shape": "",
      "date": "2018-08-22T00:00:00",
      "story": "MADAR Node 01",
      "link": "http://www.nuforc.org/webreports/142/S142801.html",
      "state": "MA",
      "duration": ""
    }
  ]
}