{
  "city": "yonkers",
  "fetch_timestamp": "2025-07-12T14:36:24.265604",
  "record_count": 12,
  "pages_fetched": 0,
  "api_calls": 1,
  "source": "ufo_aficionado_api",
  "records": [
    {
      "_id": "64d005f478aba2ec5a3b8436",
      "summary": "Silent football field of lights that could be seen for miles",
      "city": "yonkers",
      "shape": "rectangle",
      "date": "2009-01-10T00:00:00",
      "story": "Silent football field of lights that could be seen for miles Driving south on the Hutchinson River Parkway, from Connecticut, I noticed a light in the sky.  It didn't appear to be moving so I kept watching it.  My sister was driving and my mom was in the back seat.  I did not say anything at first because I just figured it was a plane.   As we approached the access to the Cross County Parkway, I finally asked my sister to look through the trees to see if she could see something.  We rounded the bend and it was right above us. We pulled off to the side of the road and got out.  As we did this, about 6 other card pulled off behind us.  We all got out of our cars and watched this object.  It seemed to be as large as 2 football fields.  It was not moving and there was no sound.  I believe the lights were white. We all watched about 5 minutes until it began to leave.  It went north, some people tried to follow in their cars.   I went home, called the radio station, and they said they had about 80 calls so far.  The official report the next day said that it was light aircraft, flying in formation.  My mother, my sister, and myself had never really believed in UFO'S, but we know what we saw. ((NUFORC Note:  Date in original report was flawed.  We have assigned an arbitrary date in 2008.  PD))",
      "link": "http://www.nuforc.org/webreports/066/S66656.html",
      "state": "NY",
      "duration": "10min"
    },
    {
      "_id": "64d005f478aba2ec5a3bad1a",
      "summary": "silvery circular object suspended high in the sky",
      "city": "yonkers",
      "shape": "sphere",
      "date": "2010-11-21T00:00:00",
      "story": "silvery circular object suspended high in the sky I noticed a shiny silvery object very high in the sky at about a north/east position.  At first I thought it was an air craft but then a plane flew by and the object was sitting still at a high altitude.  Motionless. I thought maybe a weather baloon or possably the suns reflection of a planet.  But then it just shot up in a flash?  thats it!",
      "link": "http://www.nuforc.org/webreports/078/S78498.html",
      "state": "NY",
      "duration": "15 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bbe11",
      "summary": "Moving light with no sound or blinking/pulsating.",
      "city": "yonkers",
      "shape": "light",
      "date": "2011-10-10T00:00:00",
      "story": "Moving light with no sound or blinking/pulsating. I was home and decided to look out my living room window like usual, and look at the night sky like i do every night. I looked out the window and glanced at the night sky before i started looking at stars and i saw a few stars and a very bright one, i glance at the other side of the sky then look back to the other side to realize the bright star moved from its position a bit so i started looking at it and i saw it was moving. I called my mom over to see it and she saw it as well. What i thought the object was a plane or a helicopter.  The object was as bright as a bright star but a little brighter.  I noticed it didnt have red/green lights or blinking lights like aircraft should have.  I know it wasnt an airplane because im very very interested in airplanes and kknow alot about them of how they look during the day and night and how they sound.  The object was moving in a straight direction (Moving from West to East). I opened the window to hear nothing coming from it.  Then i said in my head \" UFO?  Alien life?  Government Test?\". What i felt was anxiousness to know what it was that was just a moving light with no sound. What i did during the sighting was just stand at the window with my mom and watch it till i couldnt see it anymore because of my buildings shape. so the building got in my way to view it longer. After the sighting i went online to search if anyone else saw this before or even when i saw it. A tweet on twitter said \"there was a strange light in the sky tonight, not a star but not a helicopter, had no sound just slow moving ball of fire.\" Angle of elevation: 75-80 degrees above me Elevatio: About 400-500",
      "link": "http://www.nuforc.org/webreports/083/S83616.html",
      "state": "NY",
      "duration": "20 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3bbf60",
      "summary": "This wasn't anything I have ever seened before.",
      "city": "yonkers",
      "shape": "diamond",
      "date": "2011-12-12T00:00:00",
      "story": "This wasn't anything I have ever seened before. Me & my family witnessed seeing a UFO Last night.  There was a steady light, the colors on the craft  Constantly changed.  The craft was up very high in the sky.  The craft first stopped..then continued moving in a back and fourth then in circular motion.   When I saw this, I immediately got My IPod & recorded it.  In the video I took of this action the craft had disappeared.   This, wasn't anything I have ever saw before.",
      "link": "http://www.nuforc.org/webreports/085/S85101.html",
      "state": "NY",
      "duration": "10 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bc93d",
      "summary": "Blinking lights in the sky not moving then disappearing and re-appearing.",
      "city": "yonkers",
      "shape": "light",
      "date": "2011-08-21T00:00:00",
      "story": "Blinking lights in the sky not moving then disappearing and re-appearing. i saw two blinking lights that did not move when they appeared, then they faded and disappeared. they would then reappear again a few minutes later.  this went on for about an hour.",
      "link": "http://www.nuforc.org/webreports/083/S83111.html",
      "state": "NY",
      "duration": "1 hour"
    },
    {
      "_id": "64d005f478aba2ec5a3bf148",
      "summary": "Single white light dimming and brightening while stationary",
      "city": "yonkers",
      "shape": "light",
      "date": "2013-05-15T00:00:00",
      "story": "Single white light dimming and brightening while stationary A single white/yellow light descending onto the horizon line.  Once stationary it began to dim and brighten consistently until fading away completely.  Event lasted about 5 minutes. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/096/S96836.html",
      "state": "NY",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3bf149",
      "summary": "Bright pulsating white light on the horizon in the East",
      "city": "yonkers",
      "shape": "light",
      "date": "2013-05-15T00:00:00",
      "story": "Bright pulsating white light on the horizon in the East I was driving home near the Sprain Brook Parkway in New York and saw a bright white/yellow light in the sky that resembled a star.  The light started to rapidly descend towards the horizon line and then became stationary. I pulled over on the side of the road and started to record it with my phone camera.  The light started to slowly pulsate from bright to dim, this lasted for about 5 minutes.  The light then faded away completely and did not come back. The light was towards the East.",
      "link": "http://www.nuforc.org/webreports/096/S96901.html",
      "state": "NY",
      "duration": "5 minutes"
    },
    {
      "_id": "64d005f478aba2ec5a3c342a",
      "summary": "There was a sudden ball of light that glowed green and blue at incredible speeds across the sky for about 2 seconds and disappeared.",
      "city": "yonkers",
      "shape": "unknown",
      "date": "2015-04-03T00:00:00",
      "story": "There was a sudden ball of light that glowed green and blue at incredible speeds across the sky for about 2 seconds and disappeared. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "link": "http://www.nuforc.org/webreports/118/S118162.html",
      "state": "NY",
      "duration": "1-3 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c4872",
      "summary": "Blue orb in sky over Yonkers, NY.",
      "city": "yonkers",
      "shape": "light",
      "date": "2015-10-29T00:00:00",
      "story": "Blue orb in sky over Yonkers I was driving north on Bronxville Road in Yonkers, NY 10708 heading in the direction of Kimball Ave.  As I passed the stop sign at Blair St I noticed a bright blue orb in the sky in front of the clouds and above the treeline as I pulled away.  I stopped and I pulled to the side before stop sign at Dewitt Ave and watched as the light suddenly shifted very fast down in the pattern of a Chevron and disappeared behind the treeline.  I witnessed about 45 seconds before I lost sight.  Was not a reflection of something like a spotlight or laser pointer and appeared to be generating the blue light.  Also moved and maneuvered like nothing man has ever made.",
      "link": "http://www.nuforc.org/webreports/123/S123122.html",
      "state": "NY",
      "duration": "30 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c5151",
      "summary": "White star-like, comet-like object with white trail.",
      "city": "yonkers",
      "shape": "light",
      "date": "2016-02-19T00:00:00",
      "story": "White star-like comet--like object with white trail. Looked like a comet descending out of cloud ceiling very bright star -like and white. Size of dime at arms length away.  Initially descending at approx 40 to 45 degrees east to west.  Large round white ball with thick white tapering trail at least 6 times the length of the object.  After 6 seconds object made a turn toward north and bright lights seen like an aircraft.  But it suddenly disappeared while I watched! object, trail and all!  Comet?",
      "link": "http://www.nuforc.org/webreports/125/S125908.html",
      "state": "NY",
      "duration": "9 seconds"
    },
    {
      "_id": "64d005f478aba2ec5a3c6429",
      "summary": "Bright orange circle broad daylight.  ((anonymous report))",
      "city": "yonkers",
      "shape": "circle",
      "date": "2016-08-16T00:00:00",
      "story": "Bright orange circle broad daylight.",
      "link": "http://www.nuforc.org/webreports/129/S129085.html",
      "state": "NY",
      "duration": "1 minute"
    },
    {
      "_id": "64d005f478aba2ec5a3c7c3a",
      "summary": "I was sitting on my back porch listening to music at around 10pm EST. It was such a clear night that, when I looked directly up to the",
      "city": "yonkers",
      "shape": "other",
      "date": "2017-09-28T00:00:00",
      "story": "I was sitting on my back porch listening to music at around 10pm EST.  It was such a clear night that, when I looked directly up to the sky, I could see a few stars.  I saw this one star that was brighter than the others directly above me that was slightly north of the other four stars next to it. Approximately five minutes went by and I looked up again.  That is when I saw a green light.  It was the size of a dot and only slightly larger than the bright star I was looking at just a few minutes before.  It appeared to be very high in altitude in the night sky.  It was to the left of the bright star that was slightly north of the other stars in the sky. This green dot was flashing.  The green color was as vivid in color as a traffic light. The flash was one flash per second.  Again, this was directly over where I was sitting. I went inside to call my neighbor in order to get a second witness, but she was not home.  I came back outside thinking the object had gone away, but it was still there.  It then moved to the right slightly blocking the bright star. The green flashing dot all of a sudden changed to a red flashing dot. Same tempo of flashes and red color as vivid as a stop light.  For approximately one minute it flashed red and then slowly drifted east all the while flashing.  It moved east until the tall oak trees in my yard blocked my vision of  the object in the sky.",
      "link": "http://www.nuforc.org/webreports/136/S136320.html",
      "state": "NY",
      "duration": "8-10 minutes"
    }
  ]
}